{"word": "great", "english": "That was a great performance at the concert.", "thai": "นั่นเป็นการแสดงที่ยอดเยี่ยมในคอนเสิร์ต"}
{"word": "performance", "english": "Her performance in the play earned a standing ovation.", "thai": "การแสดงของเธอในละครได้รับการปรบมือยืน"}
{"word": "play", "english": "The kids love to play soccer after school.", "thai": "เด็กๆ ชอบเล่นฟุตบอลหลังเลิกเรียน"}
{"word": "soccer", "english": "Soccer matches always bring the community together.", "thai": "การแข่งขันฟุตบอลมักจะรวมชุมชนเข้าด้วยกัน"}
{"word": "community", "english": "The community center hosts a weekly book club.", "thai": "ศูนย์ชุมชนจัดชุมนุมหนังสือทุกสัปดาห์"}
{"word": "book", "english": "I just finished reading an amazing book.", "thai": "ฉันเพิ่งอ่านหนังสือที่น่าทึ่งจบ"}
{"word": "amazing", "english": "The view from the mountain was absolutely amazing.", "thai": "วิวจากภูเขานั้นยอดเยี่ยมมาก"}
{"word": "view", "english": "The hotel room had a stunning ocean view.", "thai": "ห้องพักในโรงแรมมีวิวทะเลที่สวยงาม"}
{"word": "ocean", "english": "We spent the day swimming in the ocean.", "thai": "เราใช้เวลาทั้งวันว่ายน้ำในมหาสมุทร"}
{"word": "swimming", "english": "Swimming lessons helped her overcome her fear of water.", "thai": "บทเรียนว่ายน้ำช่วยให้เธอเอาชนะความกลัวน้ำ"}
{"word": "fear", "english": "His fear of heights kept him off the rollercoaster.", "thai": "ความกลัวความสูงของเขาทำให้เขาไม่ขึ้นรถไฟเหาะ"}
{"word": "heights", "english": "Climbing to great heights requires courage.", "thai": "การปีนขึ้นไปยังที่สูงต้องใช้ความกล้า"}
{"word": "courage", "english": "She showed immense courage during the crisis.", "thai": "เธอแสดงความกล้าอย่างมากในช่วงวิกฤต"}
{"word": "crisis", "english": "The team worked together to resolve the crisis.", "thai": "ทีมทำงานร่วมกันเพื่อแก้ไขวิกฤต"}
{"word": "team", "english": "Our team won the championship last year.", "thai": "ทีมของเราชนะการแข่งขันเมื่อปีที่แล้ว"}
{"word": "championship", "english": "The championship game was intense and thrilling.", "thai": "เกมชิงแชมป์นั้นเข้มข้นและน่าตื่นเต้น"}
{"word": "game", "english": "Board games are perfect for family nights.", "thai": "เกมกระดานเหมาะสำหรับคืนครอบครัว"}
{"word": "family", "english": "Family gatherings always feel so warm and cozy.", "thai": "การรวมตัวของครอบครัวรู้สึกอบอุ่นและสบายใจเสมอ"}
{"word": "warm", "english": "A warm cup of coffee starts my day right.", "thai": "กาแฟร้อนๆ หนึ่งถ้วยทำให้วันของฉันเริ่มต้นได้ดี"}
{"word": "coffee", "english": "This coffee shop has the best lattes in town.", "thai": "ร้านกาแฟนี้มีลาเต้ที่ดีที่สุดในเมือง"}
{"word": "shop", "english": "I need to shop for new running shoes.", "thai": "ฉันต้องซื้อรองเท้าวิ่งคู่ใหม่"}
{"word": "shoes", "english": "Those shoes look stylish but comfortable.", "thai": "รองเท้าคู่นั้นดูมีสไตล์แต่สบาย"}
{"word": "stylish", "english": "Her stylish outfit turned heads at the party.", "thai": "ชุดที่มีสไตล์ของเธอทำให้คนหันมองในงานปาร์ตี้"}
{"word": "party", "english": "The party last night was an absolute blast.", "thai": "ปาร์ตี้เมื่อคืนนี้สนุกสุดเหวี่ยง"}
{"word": "blast", "english": "We had a blast watching fireworks on the beach.", "thai": "เราสนุกมากที่ได้ดูดอกไม้ไฟบนชายหาด"}
{"word": "fireworks", "english": "Fireworks lit up the sky during the festival.", "thai": "ดอกไม้ไฟสว่างไสวบนท้องฟ้าในช่วงเทศกาล"}
{"word": "festival", "english": "The music festival attracted thousands of fans.", "thai": "เทศกาลดนตรีดึงดูดแฟนๆ นับพัน"}
{"word": "music", "english": "Music always lifts my spirits after a long day.", "thai": "ดนตรีช่วยยกจิตใจของฉันหลังจากวันที่ยาวนาน"}
{"word": "spirits", "english": "Her cheerful spirits brightened the whole room.", "thai": "จิตใจที่ร่าเริงของเธอทำให้ทั้งห้องสว่างขึ้น"}
{"word": "room", "english": "This room needs more natural light.", "thai": "ห้องนี้ต้องการแสงธรรมชาติมากกว่านี้"}
{"word": "light", "english": "The light from the lamp was soft and warm.", "thai": "แสงจากโคมไฟนั้นนุ่มนวลและอบอุ่น"}
{"word": "lamp", "english": "That vintage lamp adds charm to the living room.", "thai": "โคมไฟวินเทจนั้นเพิ่มเสน่ห์ให้กับห้องนั่งเล่น"}
{"word": "charm", "english": "Her charm won over everyone she met.", "thai": "เสน่ห์ของเธอทำให้ทุกคนที่พบหลงรัก"}
{"word": "everyone", "english": "Everyone agreed the plan was a good idea.", "thai": "ทุกคนเห็นด้วยว่าแผนนั้นเป็นความคิดที่ดี"}
{"word": "plan", "english": "We need a solid plan for the project.", "thai": "เราต้องการแผนที่มั่นคงสำหรับโปรเจกต์"}
{"word": "project", "english": "The science project took weeks to complete.", "thai": "โปรเจกต์วิทยาศาสตร์ใช้เวลาหลายสัปดาห์กว่าจะเสร็จ"}
{"word": "science", "english": "Science experiments can be so much fun.", "thai": "การทดลองวิทยาศาสตร์สนุกมาก"}
{"word": "fun", "english": "Hiking in the forest is always fun.", "thai": "การเดินป่าในป่าสนุกเสมอ"}
{"word": "forest", "english": "The forest trail was peaceful and scenic.", "thai": "เส้นทางในป่าสงบและมีทิวทัศน์สวยงาม"}
{"word": "trail", "english": "We followed the trail to a hidden waterfall.", "thai": "เราเดินตามเส้นทางไปยังน้ำตกที่ซ่อนอยู่"}
{"word": "waterfall", "english": "The waterfall was breathtaking in the morning mist.", "thai": "น้ำตกนั้นสวยงามน่าทึ่งในหมอกยามเช้า"}
{"word": "morning", "english": "Morning jogs help me clear my mind.", "thai": "การวิ่งตอนเช้าช่วยให้ฉันปลอดโปร่ง"}
{"word": "mind", "english": "Keep an open mind when trying new foods.", "thai": "จงเปิดใจเมื่อลองอาหารใหม่ๆ"}
{"word": "foods", "english": "Thai foods are packed with bold flavors.", "thai": "อาหารไทยเต็มไปด้วยรสชาติที่เข้มข้น"}
{"word": "flavors", "english": "The ice cream came in exotic flavors.", "thai": "ไอศกรีมมีรสชาติแปลกใหม่"}
{"word": "ice", "english": "Ice skating is my favorite winter activity.", "thai": "การเล่นสเก็ตน้ำแข็งเป็นกิจกรรมฤดูหนาวที่ฉันชอบ"}
{"word": "winter", "english": "Winter in the mountains is absolutely magical.", "thai": "ฤดูหนาวในภูเขานั้นมหัศจรรย์มาก"}
{"word": "mountains", "english": "The mountains offer incredible hiking opportunities.", "thai": "ภูเขาให้โอกาสในการเดินป่าที่ยอดเยี่ยม"}
{"word": "hiking", "english": "Hiking with friends is always an adventure.", "thai": "การเดินป่ากับเพื่อนๆ เป็นการผจญภัยเสมอ"}
{"word": "adventure", "english": "We’re planning an adventure to a remote island.", "thai": "เรากำลังวางแผนการผจญภัยไปยังเกาะห่างไกล"}
{"word": "island", "english": "The island had pristine beaches and clear waters.", "thai": "เกาะนั้นมีชายหาดที่บริสุทธิ์และน้ำใส"}
{"word": "beaches", "english": "Beaches are perfect for relaxing weekends.", "thai": "ชายหาดเหมาะสำหรับการพักผ่อนในวันหยุดสุดสัปดาห์"}
{"word": "weekends", "english": "Weekends are for catching up with friends.", "thai": "วันหยุดสุดสัปดาห์คือเวลาสำหรับพบปะเพื่อนฝูง"}
{"word": "friends", "english": "My friends always make me laugh out loud.", "thai": "เพื่อนของฉันทำให้ฉันหัวเราะดังๆ เสมอ"}
{"word": "laugh", "english": "Her joke made the whole room laugh.", "thai": "มุกตลกของเธอทำให้ทั้งห้องหัวเราะ"}
{"word": "joke", "english": "Telling a good joke requires perfect timing.", "thai": "การเล่ามุกตลกที่ดีต้องมีจังหวะที่สมบูรณ์แบบ"}
{"word": "timing", "english": "Timing is critical when baking a cake.", "thai": "จังหวะเวลาเป็นสิ่งสำคัญเมื่ออบเค้ก"}
{"word": "cake", "english": "This chocolate cake is rich and delicious.", "thai": "เค้กช็อกโกแลตนี้เข้มข้นและอร่อย"}
{"word": "chocolate", "english": "I can’t resist chocolate on a stressful day.", "thai": "ฉันต้านทานช็อกโกแลตไม่ได้ในวันที่เครียด"}
{"word": "stressful", "english": "A stressful week calls for a good movie.", "thai": "สัปดาห์ที่เครียดต้องดูหนังดีๆ"}
{"word": "movie", "english": "That movie had an unexpected plot twist.", "thai": "หนังเรื่องนั้นมีจุดหักมุมที่ไม่คาดคิด"}
{"word": "plot", "english": "The novel’s plot kept me up all night.", "thai": "โครงเรื่องของนิยายทำให้ฉันนอนไม่หลับทั้งคืน"}
{"word": "night", "english": "Night drives with music are so relaxing.", "thai": "การขับรถตอนกลางคืนพร้อมดนตรีผ่อนคลายมาก"}
{"word": "drives", "english": "Long drives through the countryside are refreshing.", "thai": "การขับรถระยะไกลผ่านชนบททำให้รู้สึกสดชื่น"}
{"word": "countryside", "english": "The countryside is perfect for a quiet retreat.", "thai": "ชนบทเหมาะสำหรับการพักผ่อนเงียบๆ"}
{"word": "quiet", "english": "I love the quiet moments before sunrise.", "thai": "ฉันรักช่วงเวลาที่เงียบสงบก่อนพระอาทิตย์ขึ้น"}
{"word": "sunrise", "english": "Watching the sunrise is a beautiful experience.", "thai": "การดูพระอาทิตย์ขึ้นเป็นประสบการณ์ที่สวยงาม"}
{"word": "beautiful", "english": "Her artwork is strikingly beautiful.", "thai": "ผลงานศิลปะของเธอสวยงามสะดุดตา"}
{"word": "artwork", "english": "The gallery displayed stunning modern artwork.", "thai": "แกลเลอรี่จัดแสดงผลงานศิลปะสมัยใหม่ที่น่าทึ่ง"}
{"word": "gallery", "english": "The art gallery hosted a local artist’s exhibition.", "thai": "แกลเลอรี่ศิลปะจัดนิทรรศการของศิลปินท้องถิ่น"}
{"word": "artist", "english": "The artist painted with vibrant colors.", "thai": "ศิลปินวาดภาพด้วยสีสันสดใส"}
{"word": "colors", "english": "Bright colors make the room feel lively.", "thai": "สีสันสดใสทำให้ห้องรู้สึกมีชีวิตชีวา"}
{"word": "lively", "english": "The lively atmosphere at the market was contagious.", "thai": "บรรยากาศที่มีชีวิตชีวาที่ตลาดนั้นติดต่อกันได้"}
{"word": "market", "english": "The farmers’ market sells fresh produce.", "thai": "ตลาดเกษตรกรขายผลผลิตสดใหม่"}
{"word": "fresh", "english": "Fresh herbs make any dish taste better.", "thai": "สมุนไพรสดทำให้อาหารจานไหนก็อร่อยขึ้น"}
{"word": "dish", "english": "This dish is a family recipe passed down.", "thai": "จานนี้เป็นสูตรอาหารครอบครัวที่สืบทอดมา"}
{"word": "recipe", "english": "I found a recipe for homemade pasta online.", "thai": "ฉันพบสูตรพาสต้าโฮมเมดทางออนไลน์"}
{"word": "online", "english": "Shopping online is so convenient these days.", "thai": "การช็อปปิ้งออนไลน์สะดวกมากในทุกวันนี้"}
{"word": "convenient", "english": "The new app is incredibly convenient for travelers.", "thai": "แอปใหม่นี้สะดวกอย่างไม่น่าเชื่อสำหรับนักเดินทาง"}
{"word": "travelers", "english": "Travelers shared stories around the campfire.", "thai": "นักเดินทางแบ่งปันเรื่องราวรอบกองไฟ"}
{"word": "stories", "english": "Her stories always captivate the audience.", "thai": "เรื่องราวของเธอมักจะดึงดูดผู้ฟัง"}
{"word": "audience", "english": "The audience cheered loudly for the band.", "thai": "ผู้ชมส่งเสียงเชียร์ดังๆ ให้กับวงดนตรี"}
{"word": "band", "english": "The band played their new single live.", "thai": "วงดนตรีเล่นซิงเกิ้ลใหม่ของพวกเขาสด"}
{"word": "single", "english": "Being single gives me time to focus.", "thai": "การเป็นโสดทำให้ฉันมีเวลามุ่งเน้น"}
{"word": "focus", "english": "I need to focus on finishing this task.", "thai": "ฉันต้องโฟกัสกับการทำภารกิจนี้ให้เสร็จ"}
{"word": "task", "english": "This task requires a lot of patience.", "thai": "ภารกิจนี้ต้องการความอดทนอย่างมาก"}
{"word": "patience", "english": "Patience is key when learning a new skill.", "thai": "ความอดทนเป็นกุญแจสำคัญเมื่อเรียนรู้ทักษะใหม่"}
{"word": "skill", "english": "Her cooking skill impresses everyone at dinner.", "thai": "ทักษะการทำอาหารของเธอทำให้ทุกคนในงานเลี้ยงประทับใจ"}
{"word": "dinner", "english": "Dinner with family is my favorite tradition.", "thai": "อาหารเย็นกับครอบครัวเป็นประเพณีที่ฉันชอบ"}
{"word": "tradition", "english": "This festival is a cherished local tradition.", "thai": "เทศกาลนี้เป็นประเพณีท้องถิ่นที่หวงแหน"}
{"word": "local", "english": "The local café has the best pastries.", "thai": "ร้านกาแฟท้องถิ่นมีขนมอบที่ดีที่สุด"}
{"word": "pastries", "english": "Freshly baked pastries smell absolutely divine.", "thai": "ขนมอบที่เพิ่งอบใหม่มีกลิ่นหอมสุดยอด"}
{"word": "smell", "english": "The smell of rain is so refreshing.", "thai": "กลิ่นของฝนนั้นสดชื่นมาก"}
{"word": "rain", "english": "Rain canceled our picnic plans today.", "thai": "ฝนทำให้แผนปิกนิกของเราวันนี้ถูกยกเลิก"}
{"word": "picnic", "english": "A picnic by the lake sounds perfect.", "thai": "การปิกนิกข้างทะเลสาบฟังดูสมบูรณ์แบบ"}
{"word": "lake", "english": "The lake was calm and crystal clear.", "thai": "ทะเลสาบนั้นสงบและใสราวคริสตัล"}
{"word": "calm", "english": "The calm atmosphere helped me relax.", "thai": "บรรยากาศที่สงบช่วยให้ฉันผ่อนคลาย"}
{"word": "relax", "english": "I love to relax with a good book.", "thai": "ฉันชอบผ่อนคลายด้วยการอ่านหนังสือดีๆ"}
{"word": "book", "english": "This book tells an incredible story.", "thai": "หนังสือเล่มนี้เล่าเรื่องราวที่น่าทึ่ง"}
{"word": "story", "english": "Her life story inspired everyone around her.", "thai": "เรื่องราวชีวิตของเธอสร้างแรงบันดาลใจให้ทุกคนรอบตัว"}
{"word": "inspired", "english": "The speech inspired us to take action.", "thai": "คำปราศรัยนั้นกระตุ้นให้เราลงมือทำ"}
{"word": "action", "english": "Taking action now can change your future.", "thai": "การลงมือทำตอนนี้สามารถเปลี่ยนอนาคตของคุณได้"}
{"word": "future", "english": "The future looks bright for renewable energy.", "thai": "อนาคตดูสดใสสำหรับพลังงานหมุนเวียน"}
{"word": "energy", "english": "She has so much energy during workouts.", "thai": "เธอมีพลังงานมากมายระหว่างออกกำลังกาย"}
{"word": "workouts", "english": "Daily workouts keep me feeling strong.", "thai": "การออกกำลังกายทุกวันทำให้ฉันรู้สึกแข็งแรง"}
{"word": "strong", "english": "A strong coffee is my morning ritual.", "thai": "กาแฟเข้มๆ คือพิธีกรรมยามเช้าของฉัน"}
{"word": "coffee", "english": "This coffee shop has a cozy vibe.", "thai": "ร้านกาแฟนี้มีบรรยากาศที่อบอุ่น"}
{"word": "cozy", "english": "The cozy cabin was perfect for winter.", "thai": "กระท่อมที่อบอุ่นนั้นเหมาะสำหรับฤดูหนาว"}
{"word": "winter", "english": "Winter sports are thrilling to watch.", "thai": "กีฬาฤดูหนาวนั้นน่าตื่นเต้นเมื่อได้ดู"}
{"word": "sports", "english": "Sports events bring the community together.", "thai": "งานกีฬารวมชุมชนเข้าด้วยกัน"}
{"word": "community", "english": "The community garden is blooming beautifully.", "thai": "สวนชุมชนกำลังเบ่งบานอย่างสวยงาม"}
{"word": "garden", "english": "Tending the garden is my weekend hobby.", "thai": "การดูแลสวนเป็นงานอดิเรกสุดสัปดาห์ของฉัน"}
{"word": "hobby", "english": "Photography is a hobby I truly enjoy.", "thai": "การถ่ายภาพเป็นงานอดิเรกที่ฉันชอบจริงๆ"}
{"word": "photography", "english": "Photography captures moments that last forever.", "thai": "การถ่ายภาพจับภาพช่วงเวลาที่คงอยู่ตลอดไป"}
{"word": "moments", "english": "Cherish the small moments with loved ones.", "thai": "จงหวงแหนช่วงเวลเล็กๆ กับคนที่รัก"}
{"word": "loved", "english": "My loved ones always support my dreams.", "thai": "คนที่ฉันรักมักจะสนับสนุนความฝันของฉัน"}
{"word": "dreams", "english": "Her dreams of traveling the world came true.", "thai": "ความฝันของเธอในการเดินทางรอบโลกเป็นจริง"}
{"word": "traveling", "english": "Traveling by train is so scenic.", "thai": "การเดินทางโดยรถไฟนั้นมีทิวทัศน์สวยงาม"}
{"word": "train", "english": "The train ride was smooth and relaxing.", "thai": "การนั่งรถไฟนั้นราบรื่นและผ่อนคลาย"}
{"word": "relaxing", "english": "A relaxing evening includes soft music.", "thai": "ค่ำคืนที่ผ่อนคลายรวมถึงดนตรีเบาๆ"}
{"word": "music", "english": "Live music makes any event special.", "thai": "ดนตรีสดทำให้ทุกงานพิเศษ"}
{"word": "event", "english": "The charity event raised a lot of money.", "thai": "งานการกุศลระดมทุนได้มากมาย"}
{"word": "money", "english": "Saving money for a trip is exciting.", "thai": "การเก็บเงินเพื่อการเดินทางนั้นน่าตื่นเต้น"}
{"word": "trip", "english": "Our road trip was full of adventures.", "thai": "การเดินทางโดยรถยนต์ของเราเต็มไปด้วยการผจญภัย"}
{"word": "adventures", "english": "Adventures in the mountains are unforgettable.", "thai": "การผจญภัยในภูเขานั้นน่าจดจำ"}
{"word": "mountains", "english": "The mountains were covered in fresh snow.", "thai": "ภูเขาคลุมไปด้วยหิมะใหม่"}
{"word": "snow", "english": "Playing in the snow is so much fun.", "thai": "การเล่นในหิมะนั้นสนุกมาก"}
{"word": "fun", "english": "Board games are always fun with friends.", "thai": "เกมกระดานสนุกเสมอเมื่อเล่นกับเพื่อน"}
{"word": "friends", "english": "My friends threw me a surprise party.", "thai": "เพื่อนๆ ของฉันจัดงานเลี้ยงเซอร์ไพรส์ให้ฉัน"}
{"word": "party", "english": "The party had amazing food and drinks.", "thai": "งานเลี้ยงมีอาหารและเครื่องดื่มที่น่าทึ่ง"}
{"word": "food", "english": "Spicy food is my absolute favorite.", "thai": "อาหารเผ็ดเป็นสิ่งที่ฉันชอบที่สุด"}
{"word": "favorite", "english": "This is my favorite spot for sunsets.", "thai": "นี่คือจุดโปรดของฉันสำหรับชมพระอาทิตย์ตก"}
{"word": "sunsets", "english": "Sunsets at the beach are pure magic.", "thai": "พระอาทิตย์ตกที่ชายหาดนั้นมหัศจรรย์"}
{"word": "beach", "english": "Building sandcastles on the beach is relaxing.", "thai": "การสร้างปราสาททรายบนชายหาดนั้นผ่อนคลาย"}
{"word": "sandcastles", "english": "Kids love making sandcastles during summer.", "thai": "เด็กๆ ชอบสร้างปราสาททรายในช่วงฤดูร้อน"}
{"word": "summer", "english": "Summer vacations are perfect for exploring.", "thai": "วันหยุดฤดูร้อนเหมาะสำหรับการสำรวจ"}
{"word": "exploring", "english": "Exploring new cities is always exciting.", "thai": "การสำรวจเมืองใหม่ๆ นั้นน่าตื่นเต้นเสมอ"}
{"word": "cities", "english": "Big cities have vibrant nightlife scenes.", "thai": "เมืองใหญ่มีฉากชีวิตยามค่ำคืนที่คึกคัก"}
{"word": "nightlife", "english": "The nightlife here is full of energy.", "thai": "ชีวิตยามค่ำคืนที่นี่เต็มไปด้วยพลัง"}
{"word": "energy", "english": "Her positive energy lights up the room.", "thai": "พลังบวกของเธอทำให้ห้องสว่างไสว"}
{"word": "room", "english": "This room needs a fresh coat of paint.", "thai": "ห้องนี้ต้องการทาสีใหม่"}
{"word": "paint", "english": "I love to paint landscapes in my free time.", "thai": "ฉันชอบวาดภาพทิวทัศน์ในเวลาว่าง"}
{"word": "landscapes", "english": "The landscapes in this region are breathtaking.", "thai": "ทิวทัศน์ในภูมิภาคนี้สวยงามน่าทึ่ง"}
{"word": "region", "english": "This region is known for its wines.", "thai": "ภูมิภาคนี้ขึ้นชื่อเรื่องไวน์"}
{"word": "wines", "english": "Tasting wines at the vineyard was delightful.", "thai": "การชิมไวน์ที่ไร่องุ่นนั้นน่ารื่นรมย์"}
{"word": "vineyard", "english": "The vineyard tour included a picnic lunch.", "thai": "ทัวร์ไร่องุ่นรวมอาหารกลางวันแบบปิกนิก"}
{"word": "picnic", "english": "A picnic in the park sounds lovely.", "thai": "การปิกนิกในสวนสาธารณะฟังดูน่ารัก"}
{"word": "park", "english": "The park is full of blooming flowers.", "thai": "สวนสาธารณะเต็มไปด้วยดอกไม้ที่กำลังบาน"}
{"word": "flowers", "english": "She received a bouquet of flowers yesterday.", "thai": "เธอได้รับช่อดอกไม้เมื่อวานนี้"}
{"word": "bouquet", "english": "The bouquet added elegance to the table.", "thai": "ช่อดอกไม้เพิ่มความสง่างามให้กับโต๊ะ"}
{"word": "table", "english": "We gathered around the table for dinner.", "thai": "เรารวมตัวกันรอบโต๊ะเพื่อทานอาหารเย็น"}
{"word": "dinner", "english": "Dinner at the new restaurant was fantastic.", "thai": "อาหารเย็นที่ร้านอาหารใหม่นั้นยอดเยี่ยม"}
{"word": "restaurant", "english": "This restaurant serves authentic Thai cuisine.", "thai": "ร้านอาหารนี้เสิร์ฟอาหารไทยแท้"}
{"word": "cuisine", "english": "Italian cuisine is loved all over the world.", "thai": "อาหารอิตาเลียนเป็นที่รักทั่วโลก"}
{"word": "world", "english": "Traveling the world opens your mind.", "thai": "การเดินทางรอบโลกเปิดใจคุณ"}
{"word": "mind", "english": "A clear mind helps solve tough problems.", "thai": "จิตใจที่ปลอดโปร่งช่วยแก้ปัญหายากๆ"}
{"word": "problems", "english": "Teamwork makes solving problems much easier.", "thai": "การทำงานเป็นทีมทำให้การแก้ปัญหาง่ายขึ้น"}
{"word": "teamwork", "english": "Teamwork led to a successful project.", "thai": "การทำงานเป็นทีมนำไปสู่โปรเจกต์ที่สำเร็จ"}
{"word": "project", "english": "The project deadline is next week.", "thai": "กำหนดส่งโปรเจกต์คือสัปดาห์หน้า"}
{"word": "deadline", "english": "Meeting the deadline required extra effort.", "thai": "การทำตามกำหนดเวลาต้องใช้ความพยายามเพิ่ม"}
{"word": "effort", "english": "Her effort in class earned top grades.", "thai": "ความพยายามของเธอในชั้นเรียนทำให้ได้คะแนนสูงสุด"}
{"word": "class", "english": "The yoga class was both fun and challenging.", "thai": "ชั้นเรียนโยคะทั้งสนุกและท้าทาย"}
{"word": "fun", "english": "Playing board games is always fun.", "thai": "การเล่นเกมกระดานสนุกเสมอ"}
{"word": "games", "english": "Video games keep me entertained for hours.", "thai": "วิดีโอเกมทำให้ฉันเพลิดเพลินได้นานหลายชั่วโมง"}
{"word": "entertained", "english": "The comedian entertained the crowd all night.", "thai": "นักแสดงตลกสร้างความบันเทิงให้ฝูงชนทั้งคืน"}
{"word": "crowd", "english": "The crowd cheered at the concert’s finale.", "thai": "ฝูงชนส่งเสียงเชียร์ในตอนจบของคอนเสิร์ต"}
{"word": "concert", "english": "The concert featured an amazing band.", "thai": "คอนเสิร์ตนี้มีวงดนตรีที่น่าทึ่ง"}
{"word": "band", "english": "The band practiced for weeks before performing.", "thai": "วงดนตรีฝึกซ้อมเป็นสัปดาห์ก่อนการแสดง"}
{"word": "performing", "english": "Performing on stage feels exhilarating.", "thai": "การแสดงบนเวทีรู้สึกตื่นเต้น"}
{"word": "stage", "english": "The play’s stage design was stunning.", "thai": "การออกแบบเวทีของละครนั้นน่าทึ่ง"}
{"word": "design", "english": "Her dress design won the fashion award.", "thai": "การออกแบบชุดของเธอชนะรางวัลแฟชั่น"}
{"word": "fashion", "english": "Fashion trends change every season.", "thai": "เทรนด์แฟชั่นเปลี่ยนทุกฤดูกาล"}
{"word": "season", "english": "This season’s weather has been unpredictable.", "thai": "สภาพอากาศของฤดูกาลนี้คาดเดาไม่ได้"}
{"word": "weather", "english": "The weather forecast predicts sunny days.", "thai": "พยากรณ์อากาศคาดการณ์ว่าวันจะมีแดด"}
{"word": "sunny", "english": "A sunny afternoon is perfect for hiking.", "thai": "บ่ายที่มีแดดเหมาะสำหรับการเดินป่า"}
{"word": "hiking", "english": "Hiking trails offer stunning views.", "thai": "เส้นทางเดินป่ามีวิวที่สวยงาม"}
{"word": "views", "english": "The rooftop bar has incredible city views.", "thai": "บาร์บนดาดฟ้ามีวิวเมืองที่น่าทึ่ง"}
{"word": "city", "english": "City life is fast-paced and exciting.", "thai": "ชีวิตในเมืองนั้นรวดเร็วและน่าตื่นเต้น"}
{"word": "exciting", "english": "The new thriller movie is really exciting.", "thai": "ภาพยนตร์ระทึกขวัญเรื่องใหม่น่าตื่นเต้นมาก"}
{"word": "movie", "english": "Watching a movie at home feels cozy.", "thai": "การดูหนังที่บ้านรู้สึกอบอุ่น"}
{"word": "home", "english": "Home cooking always tastes the best.", "thai": "อาหารที่ทำที่บ้านอร่อยที่สุดเสมอ"}
{"word": "cooking", "english": "Cooking with fresh ingredients is rewarding.", "thai": "การทำอาหารด้วยวัตถุดิบสดใหม่นั้นคุ้มค่า"}
{"word": "ingredients", "english": "The recipe calls for organic ingredients.", "thai": "สูตรอาหารนี้ต้องการวัตถุดิบออร์แกนิก"}
{"word": "recipe", "english": "I found a great recipe for soup online.", "thai": "ฉันพบสูตรซุปที่ยอดเยี่ยมทางออนไลน์"}
{"word": "soup", "english": "Hot soup warms you up on cold days.", "thai": "ซุปร้อนๆ ทำให้คุณอบอุ่นในวันที่หนาว"}
{"word": "cold", "english": "The cold breeze made me shiver.", "thai": "ลมหนาวทำให้ฉันสั่น"}
{"word": "breeze", "english": "A gentle breeze cooled the summer evening.", "thai": "สายลมอ่อนๆ ทำให้เย็นสบายในค่ำคืนฤดูร้อน"}
{"word": "evening", "english": "Evening walks are my favorite way to unwind.", "thai": "การเดินเล่นตอนเย็นเป็นวิธีผ่อนคลายที่ฉันชอบ"}
{"word": "walks", "english": "Long walks help clear my mind.", "thai": "การเดินระยะไกลช่วยให้จิตใจฉันปลอดโปร่ง"}
{"word": "mind", "english": "Meditation calms the mind and soul.", "thai": "การนั่งสมาธิทำให้จิตใจและวิญญาณสงบ"}
{"word": "soul", "english": "Music speaks to my soul every time.", "thai": "ดนตรีพูดกับจิตวิญญาณของฉันทุกครั้ง"}
{"word": "time", "english": "Time flies when you’re having fun.", "thai": "เวลาผ่านไปเร็วเมื่อคุณสนุก"}
{"word": "fun", "english": "The carnival was full of fun rides.", "thai": "งานคาร์นิวัลเต็มไปด้วยเครื่องเล่นที่สนุก"}
{"word": "rides", "english": "Amusement park rides always thrill me.", "thai": "เครื่องเล่นในสวนสนุกทำให้ฉันตื่นเต้นเสมอ"}
{"word": "park", "english": "The park is a great place for picnics.", "thai": "สวนสาธารณะเป็นสถานที่ที่ยอดเยี่ยมสำหรับปิกนิก"}
