{"word": "great", "english": "That was a great performance at the concert.", "thai": "นั่นเป็นการแสดงที่ยอดเยี่ยมในคอนเสิร์ต"}
{"word": "performance", "english": "Her performance in the play earned a standing ovation.", "thai": "การแสดงของเธอในละครได้รับการปรบมือยืน"}
{"word": "play", "english": "The kids love to play soccer after school.", "thai": "เด็กๆ ชอบเล่นฟุตบอลหลังเลิกเรียน"}
{"word": "soccer", "english": "Soccer matches always bring the community together.", "thai": "การแข่งขันฟุตบอลมักจะรวมชุมชนเข้าด้วยกัน"}
{"word": "community", "english": "The community center hosts a weekly book club.", "thai": "ศูนย์ชุมชนจัดชุมนุมหนังสือทุกสัปดาห์"}
{"word": "book", "english": "I just finished reading an amazing book.", "thai": "ฉันเพิ่งอ่านหนังสือที่น่าทึ่งจบ"}
{"word": "amazing", "english": "The view from the mountain was absolutely amazing.", "thai": "วิวจากภูเขานั้นยอดเยี่ยมมาก"}
{"word": "view", "english": "The hotel room had a stunning ocean view.", "thai": "ห้องพักในโรงแรมมีวิวทะเลที่สวยงาม"}
{"word": "ocean", "english": "We spent the day swimming in the ocean.", "thai": "เราใช้เวลาทั้งวันว่ายน้ำในมหาสมุทร"}
{"word": "swimming", "english": "Swimming lessons helped her overcome her fear of water.", "thai": "บทเรียนว่ายน้ำช่วยให้เธอเอาชนะความกลัวน้ำ"}
{"word": "fear", "english": "His fear of heights kept him off the rollercoaster.", "thai": "ความกลัวความสูงของเขาทำให้เขาไม่ขึ้นรถไฟเหาะ"}
{"word": "heights", "english": "Climbing to great heights requires courage.", "thai": "การปีนขึ้นไปยังที่สูงต้องใช้ความกล้า"}
{"word": "courage", "english": "She showed immense courage during the crisis.", "thai": "เธอแสดงความกล้าอย่างมากในช่วงวิกฤต"}
{"word": "crisis", "english": "The team worked together to resolve the crisis.", "thai": "ทีมทำงานร่วมกันเพื่อแก้ไขวิกฤต"}
{"word": "team", "english": "Our team won the championship last year.", "thai": "ทีมของเราชนะการแข่งขันเมื่อปีที่แล้ว"}
{"word": "championship", "english": "The championship game was intense and thrilling.", "thai": "เกมชิงแชมป์นั้นเข้มข้นและน่าตื่นเต้น"}
{"word": "game", "english": "Board games are perfect for family nights.", "thai": "เกมกระดานเหมาะสำหรับคืนครอบครัว"}
{"word": "family", "english": "Family gatherings always feel so warm and cozy.", "thai": "การรวมตัวของครอบครัวรู้สึกอบอุ่นและสบายใจเสมอ"}
{"word": "warm", "english": "A warm cup of coffee starts my day right.", "thai": "กาแฟร้อนๆ หนึ่งถ้วยทำให้วันของฉันเริ่มต้นได้ดี"}
{"word": "coffee", "english": "This coffee shop has the best lattes in town.", "thai": "ร้านกาแฟนี้มีลาเต้ที่ดีที่สุดในเมือง"}
{"word": "shop", "english": "I need to shop for new running shoes.", "thai": "ฉันต้องซื้อรองเท้าวิ่งคู่ใหม่"}
{"word": "shoes", "english": "Those shoes look stylish but comfortable.", "thai": "รองเท้าคู่นั้นดูมีสไตล์แต่สบาย"}
{"word": "stylish", "english": "Her stylish outfit turned heads at the party.", "thai": "ชุดที่มีสไตล์ของเธอทำให้คนหันมองในงานปาร์ตี้"}
{"word": "party", "english": "The party last night was an absolute blast.", "thai": "ปาร์ตี้เมื่อคืนนี้สนุกสุดเหวี่ยง"}
{"word": "blast", "english": "We had a blast watching fireworks on the beach.", "thai": "เราสนุกมากที่ได้ดูดอกไม้ไฟบนชายหาด"}
{"word": "fireworks", "english": "Fireworks lit up the sky during the festival.", "thai": "ดอกไม้ไฟสว่างไสวบนท้องฟ้าในช่วงเทศกาล"}
{"word": "festival", "english": "The music festival attracted thousands of fans.", "thai": "เทศกาลดนตรีดึงดูดแฟนๆ นับพัน"}
{"word": "music", "english": "Music always lifts my spirits after a long day.", "thai": "ดนตรีช่วยยกจิตใจของฉันหลังจากวันที่ยาวนาน"}
{"word": "spirits", "english": "Her cheerful spirits brightened the whole room.", "thai": "จิตใจที่ร่าเริงของเธอทำให้ทั้งห้องสว่างขึ้น"}
{"word": "room", "english": "This room needs more natural light.", "thai": "ห้องนี้ต้องการแสงธรรมชาติมากกว่านี้"}
{"word": "light", "english": "The light from the lamp was soft and warm.", "thai": "แสงจากโคมไฟนั้นนุ่มนวลและอบอุ่น"}
{"word": "lamp", "english": "That vintage lamp adds charm to the living room.", "thai": "โคมไฟวินเทจนั้นเพิ่มเสน่ห์ให้กับห้องนั่งเล่น"}
{"word": "charm", "english": "Her charm won over everyone she met.", "thai": "เสน่ห์ของเธอทำให้ทุกคนที่พบหลงรัก"}
{"word": "everyone", "english": "Everyone agreed the plan was a good idea.", "thai": "ทุกคนเห็นด้วยว่าแผนนั้นเป็นความคิดที่ดี"}
{"word": "plan", "english": "We need a solid plan for the project.", "thai": "เราต้องการแผนที่มั่นคงสำหรับโปรเจกต์"}
{"word": "project", "english": "The science project took weeks to complete.", "thai": "โปรเจกต์วิทยาศาสตร์ใช้เวลาหลายสัปดาห์กว่าจะเสร็จ"}
{"word": "science", "english": "Science experiments can be so much fun.", "thai": "การทดลองวิทยาศาสตร์สนุกมาก"}
{"word": "fun", "english": "Hiking in the forest is always fun.", "thai": "การเดินป่าในป่าสนุกเสมอ"}
{"word": "forest", "english": "The forest trail was peaceful and scenic.", "thai": "เส้นทางในป่าสงบและมีทิวทัศน์สวยงาม"}
{"word": "trail", "english": "We followed the trail to a hidden waterfall.", "thai": "เราเดินตามเส้นทางไปยังน้ำตกที่ซ่อนอยู่"}
{"word": "waterfall", "english": "The waterfall was breathtaking in the morning mist.", "thai": "น้ำตกนั้นสวยงามน่าทึ่งในหมอกยามเช้า"}
{"word": "morning", "english": "Morning jogs help me clear my mind.", "thai": "การวิ่งตอนเช้าช่วยให้ฉันปลอดโปร่ง"}
{"word": "mind", "english": "Keep an open mind when trying new foods.", "thai": "จงเปิดใจเมื่อลองอาหารใหม่ๆ"}
{"word": "foods", "english": "Thai foods are packed with bold flavors.", "thai": "อาหารไทยเต็มไปด้วยรสชาติที่เข้มข้น"}
{"word": "flavors", "english": "The ice cream came in exotic flavors.", "thai": "ไอศกรีมมีรสชาติแปลกใหม่"}
{"word": "ice", "english": "Ice skating is my favorite winter activity.", "thai": "การเล่นสเก็ตน้ำแข็งเป็นกิจกรรมฤดูหนาวที่ฉันชอบ"}
{"word": "winter", "english": "Winter in the mountains is absolutely magical.", "thai": "ฤดูหนาวในภูเขานั้นมหัศจรรย์มาก"}
{"word": "mountains", "english": "The mountains offer incredible hiking opportunities.", "thai": "ภูเขาให้โอกาสในการเดินป่าที่ยอดเยี่ยม"}
{"word": "hiking", "english": "Hiking with friends is always an adventure.", "thai": "การเดินป่ากับเพื่อนๆ เป็นการผจญภัยเสมอ"}
{"word": "adventure", "english": "We’re planning an adventure to a remote island.", "thai": "เรากำลังวางแผนการผจญภัยไปยังเกาะห่างไกล"}
{"word": "island", "english": "The island had pristine beaches and clear waters.", "thai": "เกาะนั้นมีชายหาดที่บริสุทธิ์และน้ำใส"}
{"word": "beaches", "english": "Beaches are perfect for relaxing weekends.", "thai": "ชายหาดเหมาะสำหรับการพักผ่อนในวันหยุดสุดสัปดาห์"}
{"word": "weekends", "english": "Weekends are for catching up with friends.", "thai": "วันหยุดสุดสัปดาห์คือเวลาสำหรับพบปะเพื่อนฝูง"}
{"word": "friends", "english": "My friends always make me laugh out loud.", "thai": "เพื่อนของฉันทำให้ฉันหัวเราะดังๆ เสมอ"}
{"word": "laugh", "english": "Her joke made the whole room laugh.", "thai": "มุกตลกของเธอทำให้ทั้งห้องหัวเราะ"}
{"word": "joke", "english": "Telling a good joke requires perfect timing.", "thai": "การเล่ามุกตลกที่ดีต้องมีจังหวะที่สมบูรณ์แบบ"}
{"word": "timing", "english": "Timing is critical when baking a cake.", "thai": "จังหวะเวลาเป็นสิ่งสำคัญเมื่ออบเค้ก"}
{"word": "cake", "english": "This chocolate cake is rich and delicious.", "thai": "เค้กช็อกโกแลตนี้เข้มข้นและอร่อย"}
{"word": "chocolate", "english": "I can’t resist chocolate on a stressful day.", "thai": "ฉันต้านทานช็อกโกแลตไม่ได้ในวันที่เครียด"}
{"word": "stressful", "english": "A stressful week calls for a good movie.", "thai": "สัปดาห์ที่เครียดต้องดูหนังดีๆ"}
{"word": "movie", "english": "That movie had an unexpected plot twist.", "thai": "หนังเรื่องนั้นมีจุดหักมุมที่ไม่คาดคิด"}
{"word": "plot", "english": "The novel’s plot kept me up all night.", "thai": "โครงเรื่องของนิยายทำให้ฉันนอนไม่หลับทั้งคืน"}
{"word": "night", "english": "Night drives with music are so relaxing.", "thai": "การขับรถตอนกลางคืนพร้อมดนตรีผ่อนคลายมาก"}
{"word": "drives", "english": "Long drives through the countryside are refreshing.", "thai": "การขับรถระยะไกลผ่านชนบททำให้รู้สึกสดชื่น"}
{"word": "countryside", "english": "The countryside is perfect for a quiet retreat.", "thai": "ชนบทเหมาะสำหรับการพักผ่อนเงียบๆ"}
{"word": "quiet", "english": "I love the quiet moments before sunrise.", "thai": "ฉันรักช่วงเวลาที่เงียบสงบก่อนพระอาทิตย์ขึ้น"}
{"word": "sunrise", "english": "Watching the sunrise is a beautiful experience.", "thai": "การดูพระอาทิตย์ขึ้นเป็นประสบการณ์ที่สวยงาม"}
{"word": "beautiful", "english": "Her artwork is strikingly beautiful.", "thai": "ผลงานศิลปะของเธอสวยงามสะดุดตา"}
{"word": "artwork", "english": "The gallery displayed stunning modern artwork.", "thai": "แกลเลอรี่จัดแสดงผลงานศิลปะสมัยใหม่ที่น่าทึ่ง"}
{"word": "gallery", "english": "The art gallery hosted a local artist’s exhibition.", "thai": "แกลเลอรี่ศิลปะจัดนิทรรศการของศิลปินท้องถิ่น"}
{"word": "artist", "english": "The artist painted with vibrant colors.", "thai": "ศิลปินวาดภาพด้วยสีสันสดใส"}
{"word": "colors", "english": "Bright colors make the room feel lively.", "thai": "สีสันสดใสทำให้ห้องรู้สึกมีชีวิตชีวา"}
{"word": "lively", "english": "The lively atmosphere at the market was contagious.", "thai": "บรรยากาศที่มีชีวิตชีวาที่ตลาดนั้นติดต่อกันได้"}
{"word": "market", "english": "The farmers’ market sells fresh produce.", "thai": "ตลาดเกษตรกรขายผลผลิตสดใหม่"}
{"word": "fresh", "english": "Fresh herbs make any dish taste better.", "thai": "สมุนไพรสดทำให้อาหารจานไหนก็อร่อยขึ้น"}
{"word": "dish", "english": "This dish is a family recipe passed down.", "thai": "จานนี้เป็นสูตรอาหารครอบครัวที่สืบทอดมา"}
{"word": "recipe", "english": "I found a recipe for homemade pasta online.", "thai": "ฉันพบสูตรพาสต้าโฮมเมดทางออนไลน์"}
{"word": "online", "english": "Shopping online is so convenient these days.", "thai": "การช็อปปิ้งออนไลน์สะดวกมากในทุกวันนี้"}
{"word": "convenient", "english": "The new app is incredibly convenient for travelers.", "thai": "แอปใหม่นี้สะดวกอย่างไม่น่าเชื่อสำหรับนักเดินทาง"}
{"word": "travelers", "english": "Travelers shared stories around the campfire.", "thai": "นักเดินทางแบ่งปันเรื่องราวรอบกองไฟ"}
{"word": "stories", "english": "Her stories always captivate the audience.", "thai": "เรื่องราวของเธอมักจะดึงดูดผู้ฟัง"}
{"word": "audience", "english": "The audience cheered loudly for the band.", "thai": "ผู้ชมส่งเสียงเชียร์ดังๆ ให้กับวงดนตรี"}
{"word": "band", "english": "The band played their new single live.", "thai": "วงดนตรีเล่นซิงเกิ้ลใหม่ของพวกเขาสด"}
{"word": "single", "english": "Being single gives me time to focus.", "thai": "การเป็นโสดทำให้ฉันมีเวลามุ่งเน้น"}
{"word": "focus", "english": "I need to focus on finishing this task.", "thai": "ฉันต้องโฟกัสกับการทำภารกิจนี้ให้เสร็จ"}
{"word": "task", "english": "This task requires a lot of patience.", "thai": "ภารกิจนี้ต้องการความอดทนอย่างมาก"}
{"word": "patience", "english": "Patience is key when learning a new skill.", "thai": "ความอดทนเป็นกุญแจสำคัญเมื่อเรียนรู้ทักษะใหม่"}
{"word": "skill", "english": "Her cooking skill impresses everyone at dinner.", "thai": "ทักษะการทำอาหารของเธอทำให้ทุกคนในงานเลี้ยงประทับใจ"}
{"word": "dinner", "english": "Dinner with family is my favorite tradition.", "thai": "อาหารเย็นกับครอบครัวเป็นประเพณีที่ฉันชอบ"}
{"word": "tradition", "english": "This festival is a cherished local tradition.", "thai": "เทศกาลนี้เป็นประเพณีท้องถิ่นที่หวงแหน"}
{"word": "local", "english": "The local café has the best pastries.", "thai": "ร้านกาแฟท้องถิ่นมีขนมอบที่ดีที่สุด"}
{"word": "pastries", "english": "Freshly baked pastries smell absolutely divine.", "thai": "ขนมอบที่เพิ่งอบใหม่มีกลิ่นหอมสุดยอด"}
{"word": "smell", "english": "The smell of rain is so refreshing.", "thai": "กลิ่นของฝนนั้นสดชื่นมาก"}
{"word": "rain", "english": "Rain canceled our picnic plans today.", "thai": "ฝนทำให้แผนปิกนิกของเราวันนี้ถูกยกเลิก"}
{"word": "picnic", "english": "A picnic by the lake sounds perfect.", "thai": "การปิกนิกข้างทะเลสาบฟังดูสมบูรณ์แบบ"}
{"word": "lake", "english": "The lake was calm and crystal clear.", "thai": "ทะเลสาบนั้นสงบและใสราวคริสตัล"}
{"word": "calm", "english": "The calm atmosphere helped me relax.", "thai": "บรรยากาศที่สงบช่วยให้ฉันผ่อนคลาย"}
{"word": "relax", "english": "I love to relax with a good book.", "thai": "ฉันชอบผ่อนคลายด้วยการอ่านหนังสือดีๆ"}
{"word": "book", "english": "This book tells an incredible story.", "thai": "หนังสือเล่มนี้เล่าเรื่องราวที่น่าทึ่ง"}
{"word": "story", "english": "Her life story inspired everyone around her.", "thai": "เรื่องราวชีวิตของเธอสร้างแรงบันดาลใจให้ทุกคนรอบตัว"}
{"word": "inspired", "english": "The speech inspired us to take action.", "thai": "คำปราศรัยนั้นกระตุ้นให้เราลงมือทำ"}
{"word": "action", "english": "Taking action now can change your future.", "thai": "การลงมือทำตอนนี้สามารถเปลี่ยนอนาคตของคุณได้"}
{"word": "future", "english": "The future looks bright for renewable energy.", "thai": "อนาคตดูสดใสสำหรับพลังงานหมุนเวียน"}
{"word": "energy", "english": "She has so much energy during workouts.", "thai": "เธอมีพลังงานมากมายระหว่างออกกำลังกาย"}
{"word": "workouts", "english": "Daily workouts keep me feeling strong.", "thai": "การออกกำลังกายทุกวันทำให้ฉันรู้สึกแข็งแรง"}
{"word": "strong", "english": "A strong coffee is my morning ritual.", "thai": "กาแฟเข้มๆ คือพิธีกรรมยามเช้าของฉัน"}
{"word": "coffee", "english": "This coffee shop has a cozy vibe.", "thai": "ร้านกาแฟนี้มีบรรยากาศที่อบอุ่น"}
{"word": "cozy", "english": "The cozy cabin was perfect for winter.", "thai": "กระท่อมที่อบอุ่นนั้นเหมาะสำหรับฤดูหนาว"}
{"word": "winter", "english": "Winter sports are thrilling to watch.", "thai": "กีฬาฤดูหนาวนั้นน่าตื่นเต้นเมื่อได้ดู"}
{"word": "sports", "english": "Sports events bring the community together.", "thai": "งานกีฬารวมชุมชนเข้าด้วยกัน"}
{"word": "community", "english": "The community garden is blooming beautifully.", "thai": "สวนชุมชนกำลังเบ่งบานอย่างสวยงาม"}
{"word": "garden", "english": "Tending the garden is my weekend hobby.", "thai": "การดูแลสวนเป็นงานอดิเรกสุดสัปดาห์ของฉัน"}
{"word": "hobby", "english": "Photography is a hobby I truly enjoy.", "thai": "การถ่ายภาพเป็นงานอดิเรกที่ฉันชอบจริงๆ"}
{"word": "photography", "english": "Photography captures moments that last forever.", "thai": "การถ่ายภาพจับภาพช่วงเวลาที่คงอยู่ตลอดไป"}
{"word": "moments", "english": "Cherish the small moments with loved ones.", "thai": "จงหวงแหนช่วงเวลเล็กๆ กับคนที่รัก"}
{"word": "loved", "english": "My loved ones always support my dreams.", "thai": "คนที่ฉันรักมักจะสนับสนุนความฝันของฉัน"}
{"word": "dreams", "english": "Her dreams of traveling the world came true.", "thai": "ความฝันของเธอในการเดินทางรอบโลกเป็นจริง"}
{"word": "traveling", "english": "Traveling by train is so scenic.", "thai": "การเดินทางโดยรถไฟนั้นมีทิวทัศน์สวยงาม"}
{"word": "train", "english": "The train ride was smooth and relaxing.", "thai": "การนั่งรถไฟนั้นราบรื่นและผ่อนคลาย"}
{"word": "relaxing", "english": "A relaxing evening includes soft music.", "thai": "ค่ำคืนที่ผ่อนคลายรวมถึงดนตรีเบาๆ"}
{"word": "music", "english": "Live music makes any event special.", "thai": "ดนตรีสดทำให้ทุกงานพิเศษ"}
{"word": "event", "english": "The charity event raised a lot of money.", "thai": "งานการกุศลระดมทุนได้มากมาย"}
{"word": "money", "english": "Saving money for a trip is exciting.", "thai": "การเก็บเงินเพื่อการเดินทางนั้นน่าตื่นเต้น"}
{"word": "trip", "english": "Our road trip was full of adventures.", "thai": "การเดินทางโดยรถยนต์ของเราเต็มไปด้วยการผจญภัย"}
{"word": "adventures", "english": "Adventures in the mountains are unforgettable.", "thai": "การผจญภัยในภูเขานั้นน่าจดจำ"}
{"word": "mountains", "english": "The mountains were covered in fresh snow.", "thai": "ภูเขาคลุมไปด้วยหิมะใหม่"}
{"word": "snow", "english": "Playing in the snow is so much fun.", "thai": "การเล่นในหิมะนั้นสนุกมาก"}
{"word": "fun", "english": "Board games are always fun with friends.", "thai": "เกมกระดานสนุกเสมอเมื่อเล่นกับเพื่อน"}
{"word": "friends", "english": "My friends threw me a surprise party.", "thai": "เพื่อนๆ ของฉันจัดงานเลี้ยงเซอร์ไพรส์ให้ฉัน"}
{"word": "party", "english": "The party had amazing food and drinks.", "thai": "งานเลี้ยงมีอาหารและเครื่องดื่มที่น่าทึ่ง"}
{"word": "food", "english": "Spicy food is my absolute favorite.", "thai": "อาหารเผ็ดเป็นสิ่งที่ฉันชอบที่สุด"}
{"word": "favorite", "english": "This is my favorite spot for sunsets.", "thai": "นี่คือจุดโปรดของฉันสำหรับชมพระอาทิตย์ตก"}
{"word": "sunsets", "english": "Sunsets at the beach are pure magic.", "thai": "พระอาทิตย์ตกที่ชายหาดนั้นมหัศจรรย์"}
{"word": "beach", "english": "Building sandcastles on the beach is relaxing.", "thai": "การสร้างปราสาททรายบนชายหาดนั้นผ่อนคลาย"}
{"word": "sandcastles", "english": "Kids love making sandcastles during summer.", "thai": "เด็กๆ ชอบสร้างปราสาททรายในช่วงฤดูร้อน"}
{"word": "summer", "english": "Summer vacations are perfect for exploring.", "thai": "วันหยุดฤดูร้อนเหมาะสำหรับการสำรวจ"}
{"word": "exploring", "english": "Exploring new cities is always exciting.", "thai": "การสำรวจเมืองใหม่ๆ นั้นน่าตื่นเต้นเสมอ"}
{"word": "cities", "english": "Big cities have vibrant nightlife scenes.", "thai": "เมืองใหญ่มีฉากชีวิตยามค่ำคืนที่คึกคัก"}
{"word": "nightlife", "english": "The nightlife here is full of energy.", "thai": "ชีวิตยามค่ำคืนที่นี่เต็มไปด้วยพลัง"}
{"word": "energy", "english": "Her positive energy lights up the room.", "thai": "พลังบวกของเธอทำให้ห้องสว่างไสว"}
{"word": "room", "english": "This room needs a fresh coat of paint.", "thai": "ห้องนี้ต้องการทาสีใหม่"}
{"word": "paint", "english": "I love to paint landscapes in my free time.", "thai": "ฉันชอบวาดภาพทิวทัศน์ในเวลาว่าง"}
{"word": "landscapes", "english": "The landscapes in this region are breathtaking.", "thai": "ทิวทัศน์ในภูมิภาคนี้สวยงามน่าทึ่ง"}
{"word": "region", "english": "This region is known for its wines.", "thai": "ภูมิภาคนี้ขึ้นชื่อเรื่องไวน์"}
{"word": "wines", "english": "Tasting wines at the vineyard was delightful.", "thai": "การชิมไวน์ที่ไร่องุ่นนั้นน่ารื่นรมย์"}
{"word": "vineyard", "english": "The vineyard tour included a picnic lunch.", "thai": "ทัวร์ไร่องุ่นรวมอาหารกลางวันแบบปิกนิก"}
{"word": "picnic", "english": "A picnic in the park sounds lovely.", "thai": "การปิกนิกในสวนสาธารณะฟังดูน่ารัก"}
{"word": "park", "english": "The park is full of blooming flowers.", "thai": "สวนสาธารณะเต็มไปด้วยดอกไม้ที่กำลังบาน"}
{"word": "flowers", "english": "She received a bouquet of flowers yesterday.", "thai": "เธอได้รับช่อดอกไม้เมื่อวานนี้"}
{"word": "bouquet", "english": "The bouquet added elegance to the table.", "thai": "ช่อดอกไม้เพิ่มความสง่างามให้กับโต๊ะ"}
{"word": "table", "english": "We gathered around the table for dinner.", "thai": "เรารวมตัวกันรอบโต๊ะเพื่อทานอาหารเย็น"}
{"word": "dinner", "english": "Dinner at the new restaurant was fantastic.", "thai": "อาหารเย็นที่ร้านอาหารใหม่นั้นยอดเยี่ยม"}
{"word": "restaurant", "english": "This restaurant serves authentic Thai cuisine.", "thai": "ร้านอาหารนี้เสิร์ฟอาหารไทยแท้"}
{"word": "cuisine", "english": "Italian cuisine is loved all over the world.", "thai": "อาหารอิตาเลียนเป็นที่รักทั่วโลก"}
{"word": "world", "english": "Traveling the world opens your mind.", "thai": "การเดินทางรอบโลกเปิดใจคุณ"}
{"word": "mind", "english": "A clear mind helps solve tough problems.", "thai": "จิตใจที่ปลอดโปร่งช่วยแก้ปัญหายากๆ"}
{"word": "problems", "english": "Teamwork makes solving problems much easier.", "thai": "การทำงานเป็นทีมทำให้การแก้ปัญหาง่ายขึ้น"}
{"word": "teamwork", "english": "Teamwork led to a successful project.", "thai": "การทำงานเป็นทีมนำไปสู่โปรเจกต์ที่สำเร็จ"}
{"word": "project", "english": "The project deadline is next week.", "thai": "กำหนดส่งโปรเจกต์คือสัปดาห์หน้า"}
{"word": "deadline", "english": "Meeting the deadline required extra effort.", "thai": "การทำตามกำหนดเวลาต้องใช้ความพยายามเพิ่ม"}
{"word": "effort", "english": "Her effort in class earned top grades.", "thai": "ความพยายามของเธอในชั้นเรียนทำให้ได้คะแนนสูงสุด"}
{"word": "class", "english": "The yoga class was both fun and challenging.", "thai": "ชั้นเรียนโยคะทั้งสนุกและท้าทาย"}
{"word": "fun", "english": "Playing board games is always fun.", "thai": "การเล่นเกมกระดานสนุกเสมอ"}
{"word": "games", "english": "Video games keep me entertained for hours.", "thai": "วิดีโอเกมทำให้ฉันเพลิดเพลินได้นานหลายชั่วโมง"}
{"word": "entertained", "english": "The comedian entertained the crowd all night.", "thai": "นักแสดงตลกสร้างความบันเทิงให้ฝูงชนทั้งคืน"}
{"word": "crowd", "english": "The crowd cheered at the concert’s finale.", "thai": "ฝูงชนส่งเสียงเชียร์ในตอนจบของคอนเสิร์ต"}
{"word": "concert", "english": "The concert featured an amazing band.", "thai": "คอนเสิร์ตนี้มีวงดนตรีที่น่าทึ่ง"}
{"word": "band", "english": "The band practiced for weeks before performing.", "thai": "วงดนตรีฝึกซ้อมเป็นสัปดาห์ก่อนการแสดง"}
{"word": "performing", "english": "Performing on stage feels exhilarating.", "thai": "การแสดงบนเวทีรู้สึกตื่นเต้น"}
{"word": "stage", "english": "The play’s stage design was stunning.", "thai": "การออกแบบเวทีของละครนั้นน่าทึ่ง"}
{"word": "design", "english": "Her dress design won the fashion award.", "thai": "การออกแบบชุดของเธอชนะรางวัลแฟชั่น"}
{"word": "fashion", "english": "Fashion trends change every season.", "thai": "เทรนด์แฟชั่นเปลี่ยนทุกฤดูกาล"}
{"word": "season", "english": "This season’s weather has been unpredictable.", "thai": "สภาพอากาศของฤดูกาลนี้คาดเดาไม่ได้"}
{"word": "weather", "english": "The weather forecast predicts sunny days.", "thai": "พยากรณ์อากาศคาดการณ์ว่าวันจะมีแดด"}
{"word": "sunny", "english": "A sunny afternoon is perfect for hiking.", "thai": "บ่ายที่มีแดดเหมาะสำหรับการเดินป่า"}
{"word": "hiking", "english": "Hiking trails offer stunning views.", "thai": "เส้นทางเดินป่ามีวิวที่สวยงาม"}
{"word": "views", "english": "The rooftop bar has incredible city views.", "thai": "บาร์บนดาดฟ้ามีวิวเมืองที่น่าทึ่ง"}
{"word": "city", "english": "City life is fast-paced and exciting.", "thai": "ชีวิตในเมืองนั้นรวดเร็วและน่าตื่นเต้น"}
{"word": "exciting", "english": "The new thriller movie is really exciting.", "thai": "ภาพยนตร์ระทึกขวัญเรื่องใหม่น่าตื่นเต้นมาก"}
{"word": "movie", "english": "Watching a movie at home feels cozy.", "thai": "การดูหนังที่บ้านรู้สึกอบอุ่น"}
{"word": "home", "english": "Home cooking always tastes the best.", "thai": "อาหารที่ทำที่บ้านอร่อยที่สุดเสมอ"}
{"word": "cooking", "english": "Cooking with fresh ingredients is rewarding.", "thai": "การทำอาหารด้วยวัตถุดิบสดใหม่นั้นคุ้มค่า"}
{"word": "ingredients", "english": "The recipe calls for organic ingredients.", "thai": "สูตรอาหารนี้ต้องการวัตถุดิบออร์แกนิก"}
{"word": "recipe", "english": "I found a great recipe for soup online.", "thai": "ฉันพบสูตรซุปที่ยอดเยี่ยมทางออนไลน์"}
{"word": "soup", "english": "Hot soup warms you up on cold days.", "thai": "ซุปร้อนๆ ทำให้คุณอบอุ่นในวันที่หนาว"}
{"word": "cold", "english": "The cold breeze made me shiver.", "thai": "ลมหนาวทำให้ฉันสั่น"}
{"word": "breeze", "english": "A gentle breeze cooled the summer evening.", "thai": "สายลมอ่อนๆ ทำให้เย็นสบายในค่ำคืนฤดูร้อน"}
{"word": "evening", "english": "Evening walks are my favorite way to unwind.", "thai": "การเดินเล่นตอนเย็นเป็นวิธีผ่อนคลายที่ฉันชอบ"}
{"word": "walks", "english": "Long walks help clear my mind.", "thai": "การเดินระยะไกลช่วยให้จิตใจฉันปลอดโปร่ง"}
{"word": "mind", "english": "Meditation calms the mind and soul.", "thai": "การนั่งสมาธิทำให้จิตใจและวิญญาณสงบ"}
{"word": "soul", "english": "Music speaks to my soul every time.", "thai": "ดนตรีพูดกับจิตวิญญาณของฉันทุกครั้ง"}
{"word": "time", "english": "Time flies when you’re having fun.", "thai": "เวลาผ่านไปเร็วเมื่อคุณสนุก"}
{"word": "fun", "english": "The carnival was full of fun rides.", "thai": "งานคาร์นิวัลเต็มไปด้วยเครื่องเล่นที่สนุก"}
{"word": "rides", "english": "Amusement park rides always thrill me.", "thai": "เครื่องเล่นในสวนสนุกทำให้ฉันตื่นเต้นเสมอ"}
{"word": "park", "english": "The park is a great place for picnics.", "thai": "สวนสาธารณะเป็นสถานที่ที่ยอดเยี่ยมสำหรับปิกนิก"}
{"word": "place", "english": "This place has amazing coffee.", "thai": "สถานที่นี้มีกาแฟที่ยอดเยี่ยม"}
{"word": "coffee", "english": "I drink coffee every morning.", "thai": "ฉันดื่มกาแฟทุกเช้า"}
{"word": "morning", "english": "The morning breeze feels refreshing.", "thai": "สายลมยามเช้าสดชื่น"}
{"word": "breeze", "english": "A cool breeze swept through the valley.", "thai": "สายลมเย็นพัดผ่านหุบเขา"}
{"word": "valley", "english": "The valley blooms with wildflowers.", "thai": "หุบเขาเต็มไปด้วยดอกไม้ป่า"}
{"word": "wildflowers", "english": "She picked wildflowers for her mom.", "thai": "เธอเก็บดอกไม้ป่าให้แม่"}
{"word": "mom", "english": "My mom makes the best soup.", "thai": "แม่ของฉันทำซุปได้อร่อยที่สุด"}
{"word": "soup", "english": "This soup needs more salt.", "thai": "ซุปนี้ต้องการเกลือเพิ่ม"}
{"word": "salt", "english": "Salt enhances the flavor of food.", "thai": "เกลือช่วยเพิ่มรสชาติของอาหาร"}
{"word": "flavor", "english": "The flavor of this curry is intense.", "thai": "รสชาติของแกงนี้เข้มข้น"}
{"word": "curry", "english": "I love spicy curry on weekends.", "thai": "ฉันชอบแกงเผ็ดในวันหยุด"}
{"word": "weekends", "english": "Weekends are perfect for hiking.", "thai": "วันหยุดสุดสัปดาห์เหมาะสำหรับการเดินป่า"}
{"word": "hiking", "english": "Hiking up the mountain was tough.", "thai": "การเดินป่าขึ้นภูเขานั้นยากลำบาก"}
{"word": "mountain", "english": "The mountain view is breathtaking.", "thai": "วิวภูเขาน่าทึ่ง"}
{"word": "view", "english": "This hotel has a stunning view.", "thai": "โรงแรมนี้มีวิวที่สวยงาม"}
{"word": "hotel", "english": "The hotel staff was very friendly.", "thai": "พนักงานโรงแรมเป็นมิตรมาก"}
{"word": "staff", "english": "Our staff works hard every day.", "thai": "พนักงานของเราทำงานหนักทุกวัน"}
{"word": "works", "english": "She works at a tech startup.", "thai": "เธอทำงานที่บริษัทสตาร์ทอัพด้านเทคโนโลยี"}
{"word": "tech", "english": "Tech gadgets are so expensive now.", "thai": "อุปกรณ์เทคโนโลยีตอนนี้แพงมาก"}
{"word": "gadgets", "english": "These gadgets make life easier.", "thai": "อุปกรณ์เหล่านี้ทำให้ชีวิตง่ายขึ้น"}
{"word": "life", "english": "Life in the city is fast-paced.", "thai": "ชีวิตในเมืองเร็วและวุ่นวาย"}
{"word": "city", "english": "The city lights shine brightly at night.", "thai": "แสงไฟในเมืองสว่างไสวในตอนกลางคืน"}
{"word": "lights", "english": "The lights flickered during the storm.", "thai": "ไฟกระพริบระหว่างพายุ"}
{"word": "storm", "english": "That storm caused a lot of damage.", "thai": "พายุนั้นก่อให้เกิดความเสียหายมาก"}
{"word": "damage", "english": "The flood damage was severe.", "thai": "ความเสียหายจากน้ำท่วมรุนแรง"}
{"word": "flood", "english": "The flood swept away the bridge.", "thai": "น้ำท่วมพัดสะพานไป"}
{"word": "bridge", "english": "The old bridge needs repairs.", "thai": "สะพานเก่าต้องการการซ่อมแซม"}
{"word": "repairs", "english": "Car repairs cost me a fortune.", "thai": "การซ่อมรถยนต์ทำให้ฉันเสียเงินเยอะ"}
{"word": "car", "english": "My car broke down yesterday.", "thai": "รถของฉันเสียเมื่อวานนี้"}
{"word": "yesterday", "english": "Yesterday was such a hectic day.", "thai": "เมื่อวานเป็นวันที่วุ่นวายมาก"}
{"word": "hectic", "english": "Her schedule is always hectic.", "thai": "ตารางของเธอวุ่นวายเสมอ"}
{"word": "schedule", "english": "My schedule is packed this week.", "thai": "ตารางของฉันแน่นมากในสัปดาห์นี้"}
{"word": "week", "english": "This week flew by so fast.", "thai": "สัปดาห์นี้ผ่านไปเร็วมาก"}
{"word": "fast", "english": "He runs really fast in races.", "thai": "เขาวิ่งเร็วมากในการแข่งขัน"}
{"word": "races", "english": "The races were thrilling to watch.", "thai": "การแข่งขันนั้นน่าตื่นเต้นในการรับชม"}
{"word": "watch", "english": "I watch movies every Friday night.", "thai": "ฉันดูหนังทุกคืนวันศุกร์"}
{"word": "movies", "english": "Movies with subtitles are easier to follow.", "thai": "ภาพยนตร์ที่มีคำบรรยายง่ายต่อการติดตาม"}
{"word": "subtitles", "english": "Subtitles help me understand foreign films.", "thai": "คำบรรยายช่วยให้ฉันเข้าใจภาพยนตร์ต่างประเทศ"}
{"word": "films", "english": "Indie films often have unique stories.", "thai": "ภาพยนตร์อินดี้มักมีเรื่องราวที่ไม่เหมือนใคร"}
{"word": "stories", "english": "Her stories always captivate the audience.", "thai": "เรื่องราวของเธอมักดึงดูดผู้ฟัง"}
{"word": "audience", "english": "The audience cheered loudly at the concert.", "thai": "ผู้ชมส่งเสียงเชียร์ดังลั่นในคอนเสิร์ต"}
{"word": "concert", "english": "The concert tickets sold out quickly.", "thai": "ตั๋วคอนเสิร์ตขายหมดอย่างรวดเร็ว"}
{"word": "tickets", "english": "I lost my tickets to the game.", "thai": "ฉันทำตั๋วเข้าชมเกมหาย"}
{"word": "game", "english": "That game was a total nail-biter.", "thai": "เกมนั้นตื่นเต้นสุดๆ"}
{"word": "nail-biter", "english": "The movie was a real nail-biter.", "thai": "ภาพยนตร์นั้นตื่นเต้นจนลุ้นตัวโก่ง"}
{"word": "movie", "english": "This movie has an unexpected twist.", "thai": "ภาพยนตร์นี้มีพล็อตที่คาดไม่ถึง"}
{"word": "twist", "english": "The plot twist shocked everyone.", "thai": "พล็อตที่พลิกผันทำให้ทุกคนตกใจ"}
{"word": "everyone", "english": "Everyone loves a good party.", "thai": "ทุกคนรักงานปาร์ตี้ดีๆ"}
{"word": "party", "english": "The party lasted until midnight.", "thai": "งานปาร์ตี้ยาวนานจนถึงเที่ยงคืน"}
{"word": "midnight", "english": "I stayed up past midnight studying.", "thai": "ฉันอ่านหนังสือจนเลยเที่ยงคืน"}
{"word": "studying", "english": "Studying abroad was life-changing.", "thai": "การเรียนต่อต่างประเทศเปลี่ยนชีวิต"}
{"word": "abroad", "english": "Traveling abroad opens your mind.", "thai": "การเดินทางไปต่างประเทศเปิดโลกทัศน์"}
{"word": "mind", "english": "Her mind is always full of ideas.", "thai": "ใจของเธอเต็มไปด้วยไอเดีย"}
{"word": "ideas", "english": "New ideas spark creativity.", "thai": "ไอเดียใหม่จุดประกายความคิดสร้างสรรค์"}
{"word": "creativity", "english": "Creativity drives innovation in art.", "thai": "ความคิดสร้างสรรค์ขับเคลื่อนนวัตกรรมในศิลปะ"}
{"word": "art", "english": "This art gallery is inspiring.", "thai": "แกลเลอรี่ศิลปะนี้สร้างแรงบันดาลใจ"}
{"word": "gallery", "english": "The gallery showcased local talent.", "thai": "แกลเลอรี่แสดงผลงานของศิลปินท้องถิ่น"}
{"word": "talent", "english": "Her talent for singing is incredible.", "thai": "พรสวรรค์ในการร้องเพลงของเธอน่าทึ่ง"}
{"word": "singing", "english": "Singing karaoke is so much fun.", "thai": "การร้องคาราโอเกะสนุกมาก"}
{"word": "fun", "english": "This game is so much fun.", "thai": "เกมนี้สนุกมาก"}
{"word": "game", "english": "Board games bring families together.", "thai": "เกมกระดานทำให้ครอบครัวใกล้ชิดกัน"}
{"word": "families", "english": "Families gather for holiday dinners.", "thai": "ครอบครัวรวมตัวกันในงานเลี้ยงวันหยุด"}
{"word": "holiday", "english": "The holiday season is so festive.", "thai": "ช่วงวันหยุดเต็มไปด้วยความรื่นเริง"}
{"word": "festive", "english": "The festive decorations look amazing.", "thai": "การตกแต่งที่รื่นเริงดูน่าทึ่ง"}
{"word": "decorations", "english": "Decorations made the room feel cozy.", "thai": "การตกแต่งทำให้ห้องรู้สึกอบอุ่น"}
{"word": "cozy", "english": "This cozy café is my favorite.", "thai": "ร้านกาแฟแสนอบอุ่นนี้เป็นที่โปรดของฉัน"}
{"word": "café", "english": "The café serves delicious pastries.", "thai": "ร้านกาแฟนี้เสิร์ฟขนมอบอร่อย"}
{"word": "pastries", "english": "Fresh pastries sell out quickly.", "thai": "ขนมอบสดใหม่ขายหมดอย่างรวดเร็ว"}
{"word": "fresh", "english": "Fresh fruit is so refreshing.", "thai": "ผลไม้สดชื่นใจมาก"}
{"word": "fruit", "english": "I love fruit smoothies in summer.", "thai": "ฉันชอบสมูทตี้ผลไม้ในหน้าร้อน"}
{"word": "summer", "english": "Summer vacations are the best.", "thai": "วันหยุดหน้าร้อนดีที่สุด"}
{"word": "vacations", "english": "Vacations help you recharge.", "thai": "วันหยุดช่วยให้คุณเติมพลัง"}
{"word": "recharge", "english": "I need to recharge my phone.", "thai": "ฉันต้องชาร์จโทรศัพท์"}
{"word": "phone", "english": "My phone battery dies too fast.", "thai": "แบตเตอรี่โทรศัพท์ของฉันหมดเร็วเกินไป"}
{"word": "battery", "english": "The battery in my car died.", "thai": "แบตเตอรี่ในรถของฉันหมด"}
{"word": "car", "english": "Renting a car is super convenient.", "thai": "การเช่ารถสะดวกมาก"}
{"word": "convenient", "english": "Online shopping is so convenient.", "thai": "การช็อปปิ้งออนไลน์สะดวกมาก"}
{"word": "shopping", "english": "Shopping for clothes is my hobby.", "thai": "การซื้อเสื้อผ้าเป็นงานอดิเรกของฉัน"}
{"word": "clothes", "english": "These clothes need to be ironed.", "thai": "เสื้อผ้าเหล่านี้ต้องรีด"}
{"word": "ironed", "english": "I ironed my shirt for the meeting.", "thai": "ฉันรีดเสื้อสำหรับการประชุม"}
{"word": "meeting", "english": "The meeting ran longer than expected.", "thai": "การประชุมยาวนานกว่าที่คาด"}
{"word": "expected", "english": "The results were better than expected.", "thai": "ผลลัพธ์ดีกว่าที่คาดไว้"}
{"word": "results", "english": "The test results came back positive.", "thai": "ผลการทดสอบออกมาเป็นบวก"}
{"word": "test", "english": "I’m nervous about the driving test.", "thai": "ฉันกังวลเกี่ยวกับการสอบใบขับขี่"}
{"word": "driving", "english": "Driving at night can be tricky.", "thai": "การขับรถตอนกลางคืนอาจยุ่งยาก"}
{"word": "night", "english": "The night sky was full of stars.", "thai": "ท้องฟ้ายามค่ำคืนเต็มไปด้วยดวงดาว"}
{"word": "stars", "english": "Stars inspire me to dream big.", "thai": "ดวงดาวกระตุ้นให้ฉันฝันใหญ่"}
{"word": "dream", "english": "My dream is to travel the world.", "thai": "ความฝันของฉันคือการเดินทางรอบโลก"}
{"word": "travel", "english": "Travel broadens your perspective.", "thai": "การเดินทางขยายมุมมองของคุณ"}
{"word": "perspective", "english": "Her perspective on life is unique.", "thai": "มุมมองต่อชีวิตของเธอไม่เหมือนใคร"}
{"word": "unique", "english": "This unique design stands out.", "thai": "การออกแบบที่ไม่เหมือนใครนี้โดดเด่น"}
{"word": "design", "english": "The design of this app is sleek.", "thai": "การออกแบบแอปนี้ดูทันสมัย"}
{"word": "app", "english": "This app tracks your daily steps.", "thai": "แอปนี้ติดตามจำนวนก้าวรายวันของคุณ"}
{"word": "steps", "english": "Climbing these steps is exhausting.", "thai": "การปีนบันไดเหล่านี้เหนื่อยมาก"}
{"word": "exhausting", "english": "Work can be exhausting sometimes.", "thai": "งานบางครั้งทำให้เหนื่อยล้า"}
{"word": "work", "english": "Teamwork makes the dream work.", "thai": "การทำงานเป็นทีมทำให้ความฝันเป็นจริง"}
{"word": "teamwork", "english": "Teamwork is key to success.", "thai": "การทำงานเป็นทีมคือกุญแจสู่ความสำเร็จ"}
{"word": "key", "english": "The key to happiness is gratitude.", "thai": "กุญแจสู่ความสุขคือความกตัญญู"}
{"word": "happiness", "english": "Her happiness brightens the room.", "thai": "ความสุขของเธอทำให้ห้องสว่างไสว"}
{"word": "room", "english": "This room needs better lighting.", "thai": "ห้องนี้ต้องการแสงสว่างที่ดีกว่านี้"}
{"word": "lighting", "english": "The lighting at the event was magical.", "thai": "แสงไฟในงานนั้นดูมีมนต์ขลัง"}
{"word": "event", "english": "The charity event raised a lot of money.", "thai": "งานการกุศลระดมทุนได้เยอะมาก"}
{"word": "money", "english": "Saving money takes a lot of discipline.", "thai": "การเก็บเงินต้องใช้ระเบียบวินัยมาก"}
{"word": "discipline", "english": "Discipline helps you achieve your goals.", "thai": "ระเบียบวินัยช่วยให้คุณบรรลุเป้าหมาย"}
{"word": "goals", "english": "Setting clear goals drives success.", "thai": "การตั้งเป้าหมายที่ชัดเจนนำไปสู่ความสำเร็จ"}
{"word": "success", "english": "Her success inspires everyone around her.", "thai": "ความสำเร็จของเธอสร้างแรงบันดาลใจให้ทุกคนรอบตัว"}
{"word": "inspires", "english": "Great art inspires deep emotions.", "thai": "ศิลปะที่ยอดเยี่ยมสร้างแรงบันดาลใจให้เกิดอารมณ์ลึกซึ้ง"}
{"word": "emotions", "english": "Expressing emotions can be tough sometimes.", "thai": "การแสดงอารมณ์บางครั้งอาจเป็นเรื่องยาก"}
{"word": "tough", "english": "This puzzle is really tough to solve.", "thai": "ปริศนานี้แก้ยากมาก"}
{"word": "puzzle", "english": "I love solving a good puzzle.", "thai": "ฉันชอบแก้ปริศนาดีๆ"}
{"word": "love", "english": "Love makes the world go round.", "thai": "ความรักทำให้โลกหมุนไป"}
{"word": "world", "english": "Traveling the world is my dream.", "thai": "การเดินทางรอบโลกคือความฝันของฉัน"}
{"word": "dream", "english": "Last night’s dream was so vivid.", "thai": "ความฝันเมื่อคืนนี้ชัดเจนมาก"}
{"word": "vivid", "english": "The vivid colors of the sunset amazed me.", "thai": "สีสันที่สดใสของพระอาทิตย์ตกทำให้ฉันทึ่ง"}
{"word": "sunset", "english": "Watching the sunset is so relaxing.", "thai": "การดูพระอาทิตย์ตกผ่อนคลายมาก"}
{"word": "relaxing", "english": "A relaxing bath helps me unwind.", "thai": "การอาบน้ำผ่อนคลายช่วยให้ฉันคลายเครียด"}
{"word": "bath", "english": "The bath was filled with bubbles.", "thai": "อ่างอาบน้ำเต็มไปด้วยฟอง"}
{"word": "bubbles", "english": "Kids love blowing bubbles outside.", "thai": "เด็กๆ ชอบเป่าฟองสบู่นอกบ้าน"}
{"word": "kids", "english": "The kids are playing in the backyard.", "thai": "เด็กๆ กำลังเล่นอยู่ในสวนหลังบ้าน"}
{"word": "backyard", "english": "Our backyard barbecue was a hit.", "thai": "งานปาร์ตี้บาร์บีคิวในสวนหลังบ้านประสบความสำเร็จ"}
{"word": "barbecue", "english": "The barbecue sauce is super tangy.", "thai": "ซอสบาร์บีคิวมีรสเปรี้ยวจัด"}
{"word": "sauce", "english": "This pasta sauce tastes homemade.", "thai": "ซอสพาสต้านี้รสชาติเหมือนทำเองที่บ้าน"}
{"word": "pasta", "english": "I’m craving pasta for dinner tonight.", "thai": "ฉันอยากกินพาสต้าสำหรับมื้อเย็นคืนนี้"}
{"word": "dinner", "english": "Dinner with friends is always fun.", "thai": "มื้อเย็นกับเพื่อนๆ สนุกเสมอ"}
{"word": "friends", "english": "My friends always make me laugh.", "thai": "เพื่อนของฉันทำให้ฉันหัวเราะได้เสมอ"}
{"word": "laugh", "english": "His joke made everyone laugh out loud.", "thai": "มุกของเขาทำให้ทุกคนหัวเราะดังลั่น"}
{"word": "joke", "english": "Telling a good joke takes skill.", "thai": "การเล่ามุกตลกที่ดีต้องใช้ทักษะ"}
{"word": "skill", "english": "Her cooking skill is unmatched.", "thai": "ทักษะการทำอาหารของเธอไม่มีใครเทียบได้"}
{"word": "cooking", "english": "Cooking together is a bonding experience.", "thai": "การทำอาหารด้วยกันเป็นประสบการณ์ที่สร้างความผูกพัน"}
{"word": "bonding", "english": "Family bonding strengthens relationships.", "thai": "การสร้างความผูกพันในครอบครัวช่วยเสริมความสัมพันธ์"}
{"word": "relationships", "english": "Healthy relationships require trust.", "thai": "ความสัมพันธ์ที่ดีต้องอาศัยความไว้วางใจ"}
{"word": "trust", "english": "Trust is earned through honesty.", "thai": "ความไว้วางใจเกิดจากความซื่อสัตย์"}
{"word": "honesty", "english": "Honesty is the best approach always.", "thai": "ความซื่อสัตย์เป็นวิธีที่ดีที่สุดเสมอ"}
{"word": "approach", "english": "Her approach to problem-solving is creative.", "thai": "วิธีการแก้ปัญหาของเธอมีความคิดสร้างสรรค์"}
{"word": "creative", "english": "Creative projects spark so much joy.", "thai": "โปรเจกต์สร้างสรรค์จุดประกายความสุขมากมาย"}
{"word": "joy", "english": "The joy of music lifts my spirits.", "thai": "ความสุขจากดนตรีช่วยยกระดับจิตใจของฉัน"}
{"word": "music", "english": "Live music makes every night special.", "thai": "ดนตรีสดทำให้ทุกคืนพิเศษ"}
{"word": "night", "english": "The night market was bustling with energy.", "thai": "ตลาดกลางคืนคึกคักไปด้วยพลัง"}
{"word": "market", "english": "The market sells fresh produce daily.", "thai": "ตลาดขายผักผลไม้สดทุกวัน"}
{"word": "produce", "english": "Local produce tastes so much better.", "thai": "ผลผลิตท้องถิ่นรสชาติดีกว่ามาก"}
{"word": "tastes", "english": "This wine tastes absolutely divine.", "thai": "ไวน์นี้รสชาติยอดเยี่ยมมาก"}
{"word": "wine", "english": "A glass of wine pairs well with dinner.", "thai": "ไวน์หนึ่งแก้วเข้ากันดีกับมื้อเย็น"}
{"word": "glass", "english": "The glass shattered on the floor.", "thai": "แก้วแตกกระจายบนพื้น"}
{"word": "floor", "english": "The wooden floor needs polishing.", "thai": "พื้นไม้ต้องขัดเงา"}
{"word": "wooden", "english": "The wooden table looks rustic.", "thai": "โต๊ะไม้ดูมีสไตล์แบบชนบท"}
{"word": "table", "english": "We gathered around the table for lunch.", "thai": "เรารวมตัวกันรอบโต๊ะเพื่อกินมื้อเที่ยง"}
{"word": "lunch", "english": "Lunch at the café was delicious.", "thai": "มื้อเที่ยงที่ร้านกาแฟอร่อยมาก"}
{"word": "café", "english": "The café has the best espresso.", "thai": "ร้านกาแฟนี้มีเอสเพรสโซที่ดีที่สุด"}
{"word": "espresso", "english": "I need an espresso to stay awake.", "thai": "ฉันต้องการเอสเพรสโซเพื่อให้ตื่นตัว"}
{"word": "awake", "english": "Staying awake during meetings is tough.", "thai": "การตื่นตัวระหว่างการประชุมนั้นยาก"}
{"word": "meetings", "english": "Meetings can drag on too long.", "thai": "การประชุมอาจยืดเยื้อนานเกินไป"}
{"word": "long", "english": "The long hike was worth the view.", "thai": "การเดินป่านานคุ้มค่ากับวิว"}
{"word": "hike", "english": "A morning hike energizes me.", "thai": "การเดินป่าในตอนเช้าทำให้ฉันมีพลัง"}
{"word": "energizes", "english": "Exercise energizes my whole day.", "thai": "การออกกำลังกายทำให้ฉันมีพลังทั้งวัน"}
{"word": "exercise", "english": "Daily exercise keeps me healthy.", "thai": "การออกกำลังกายทุกวันทำให้ฉันแข็งแรง"}
{"word": "healthy", "english": "Eating healthy feels so rewarding.", "thai": "การกินอาหารเพื่อสุขภาพรู้สึกคุ้มค่ามาก"}
{"word": "eating", "english": "Eating spicy food is my favorite.", "thai": "การกินอาหารเผ็ดเป็นสิ่งที่ฉันชอบ"}
{"word": "spicy", "english": "Spicy tacos are a weekend treat.", "thai": "ทาโก้เผ็ดเป็นของว่างสุดสัปดาห์"}
{"word": "weekend", "english": "The weekend forecast looks sunny.", "thai": "พยากรณ์อากาศสุดสัปดาห์ดูเหมือนจะมีแดด"}
{"word": "sunny", "english": "A sunny day lifts everyone’s mood.", "thai": "วันที่แดดออกยกระดับอารมณ์ของทุกคน"}
{"word": "mood", "english": "Her cheerful mood is contagious.", "thai": "อารมณ์ร่าเริงของเธอติดต่อกันได้"}
{"word": "cheerful", "english": "The cheerful vibe made the party fun.", "thai": "บรรยากาศร่าเริงทำให้งานปาร์ตี้สนุก"}
{"word": "party", "english": "Throwing a party takes lots of planning.", "thai": "การจัดปาร์ตี้ต้องวางแผนเยอะ"}
{"word": "planning", "english": "Planning a trip is half the fun.", "thai": "การวางแผนทริปคือความสนุกครึ่งหนึ่ง"}
{"word": "trip", "english": "The road trip was unforgettable.", "thai": "ทริปถนนนั้นน่าจดจำ"}
{"word": "road", "english": "The road ahead looks bumpy.", "thai": "ถนนข้างหน้าดูขรุขระ"}
{"word": "bumpy", "english": "The bumpy flight made me nervous.", "thai": "เที่ยวบินที่สั่นสะเทือนทำให้ฉันกังวล"}
{"word": "flight", "english": "My flight got delayed by hours.", "thai": "เที่ยวบินของฉันล่าช้าไปหลายชั่วโมง"}
{"word": "delayed", "english": "The delayed train annoyed everyone.", "thai": "รถไฟที่ล่าช้าทำให้ทุกคนหงุดหงิด"}
{"word": "train", "english": "The train ride was super scenic.", "thai": "การนั่งรถไฟนั้นมีวิวสวยงามมาก"}
{"word": "scenic", "english": "The scenic route takes longer but it’s worth it.", "thai": "เส้นทางที่มีวิวสวยใช้เวลานานกว่าแต่คุ้มค่า"}
{"word": "route", "english": "This route avoids heavy traffic.", "thai": "เส้นทางนี้หลีกเลี่ยงการจราจรหนาแน่น"}
{"word": "traffic", "english": "Traffic jams drive me crazy.", "thai": "รถติดทำให้ฉันหงุดหงิด"}
{"word": "crazy", "english": "That crazy stunt went viral online.", "thai": "การแสดงผาดโผนสุดบ้าคลั่งนั้นกลายเป็นไวรัลออนไลน์"}
{"word": "online", "english": "Shopping online saves so much time.", "thai": "การช็อปปิ้งออนไลน์ช่วยประหยัดเวลาได้มาก"}
{"word": "time", "english": "Time flies when you’re having fun.", "thai": "เวลาผ่านไปเร็วเมื่อคุณสนุก"}
{"word": "fun", "english": "Playing board games is so fun.", "thai": "การเล่นเกมกระดานสนุกมาก"}
{"word": "games", "english": "Video games keep me entertained for hours.", "thai": "วิดีโอเกมทำให้ฉันเพลิดเพลินได้นานหลายชั่วโมง"}
{"word": "entertained", "english": "The show entertained the whole crowd.", "thai": "การแสดงนั้นสร้างความบันเทิงให้กับฝูงชนทั้งหมด"}
{"word": "crowd", "english": "The crowd cheered at the goal.", "thai": "ฝูงชนส่งเสียงเชียร์เมื่อยิงประตู"}
{"word": "goal", "english": "Scoring a goal felt amazing.", "thai": "การยิงประตูรู้สึกยอดเยี่ยม"}
{"word": "felt", "english": "The soft blanket felt so cozy.", "thai": "ผ้าห่มนุ่มๆ รู้สึกอบอุ่นมาก"}
{"word": "cozy", "english": "The cozy cabin was perfect for winter.", "thai": "กระท่อมแสนอบอุ่นเหมาะสำหรับหน้าหนาว"}
{"word": "winter", "english": "Winter sports are thrilling to watch.", "thai": "กีฬาฤดูหนาวน่าตื่นเต้นในการรับชม"}
{"word": "sports", "english": "Playing sports builds teamwork skills.", "thai": "การเล่นกีฬาสร้างทักษะการทำงานเป็นทีม"}
{"word": "skills", "english": "Her language skills are impressive.", "thai": "ทักษะด้านภาษาของเธอน่าประทับใจ"}
{"word": "language", "english": "Learning a new language opens doors.", "thai": "การเรียนภาษาใหม่เปิดประตูสู่โอกาส"}
{"word": "doors", "english": "The glass doors need cleaning.", "thai": "ประตูแก้วต้องทำความสะอาด"}
{"word": "cleaning", "english": "Cleaning the house takes all day.", "thai": "การทำความสะอาดบ้านใช้เวลาทั้งวัน"}
{"word": "house", "english": "Our house has a big backyard.", "thai": "บ้านของเรามีสวนหลังบ้านใหญ่"}
{"word": "big", "english": "That big dog is so friendly.", "thai": "สุนัขตัวใหญ่ตัวนั้นเป็นมิตรมาก"}
{"word": "dog", "english": "My dog loves chasing squirrels.", "thai": "สุนัขของฉันชอบวิ่งไล่กระรอก"}
{"word": "chasing", "english": "Chasing dreams takes courage.", "thai": "การไล่ตามความฝันต้องใช้ความกล้า"}
{"word": "courage", "english": "Her courage in tough times inspires me.", "thai": "ความกล้าของเธอในช่วงเวลายากลำบากสร้างแรงบันดาลใจให้ฉัน"}
{"word": "times", "english": "These times call for bold decisions.", "thai": "ช่วงเวลานี้เรียกร้องการตัดสินใจที่กล้าหาญ"}
{"word": "decisions", "english": "Making tough decisions builds character.", "thai": "การตัดสินใจที่ยากลำบากสร้างบุคลิก"}
{"word": "character", "english": "Her strong character shines in crises.", "thai": "บุคลิกที่เข้มแข็งของเธอโดดเด่นในวิกฤต"}
{"word": "crises", "english": "Crises often reveal true leadership.", "thai": "วิกฤตมักเผยให้เห็นผู้นำที่แท้จริง"}
{"word": "leadership", "english": "Great leadership inspires team confidence.", "thai": "ผู้นำที่ยอดเยี่ยมสร้างความมั่นใจให้ทีม"}
{"word": "confidence", "english": "Confidence is key in public speaking.", "thai": "ความมั่นใจเป็นกุญแจในการพูดในที่สาธารณะ"}
{"word": "speaking", "english": "Speaking clearly improves communication.", "thai": "การพูดอย่างชัดเจนช่วยปรับปรุงการสื่อสาร"}
{"word": "communication", "english": "Good communication prevents misunderstandings.", "thai": "การสื่อสารที่ดีป้องกันความเข้าใจผิด"}
{"word": "misunderstandings", "english": "Misunderstandings can ruin friendships.", "thai": "ความเข้าใจผิดอาจทำลายมิตรภาพ"}
{"word": "friendships", "english": "Long-lasting friendships are built on trust.", "thai": "มิตรภาพที่ยาวนานสร้างบนความไว้วางใจ"}
{"word": "trust", "english": "Trust grows when promises are kept.", "thai": "ความไว้วางใจเพิ่มขึ้นเมื่อรักษาคำสัญญา"}
{"word": "promises", "english": "Keeping promises shows true integrity.", "thai": "การรักษาคำสัญญาแสดงถึงความซื่อสัตย์"}
{"word": "integrity", "english": "Integrity matters in every profession.", "thai": "ความซื่อสัตย์สำคัญในทุกอาชีพ"}
{"word": "profession", "english": "Choosing a profession is a big step.", "thai": "การเลือกอาชีพเป็นก้าวใหญ่"}
{"word": "step", "english": "Every step forward counts in progress.", "thai": "ทุกก้าวไปข้างหน้ามีความหมายต่อความก้าวหน้า"}
{"word": "progress", "english": "Progress in technology changes lives.", "thai": "ความก้าวหน้าในเทคโนโลยีเปลี่ยนชีวิต"}
{"word": "technology", "english": "Technology makes remote work easier.", "thai": "เทคโนโลยีทำให้การทำงานระยะไกลง่ายขึ้น"}
{"word": "work", "english": "Hard work pays off eventually.", "thai": "การทำงานหนักให้ผลตอบแทนในที่สุด"}
{"word": "pays", "english": "This job pays really well.", "thai": "งานนี้ให้ค่าตอบแทนดีมาก"}
{"word": "job", "english": "Finding a dream job takes effort.", "thai": "การหางานในฝันต้องใช้ความพยายาม"}
{"word": "effort", "english": "Her effort in class impressed the teacher.", "thai": "ความพยายามในชั้นเรียนของเธอสร้างความประทับใจให้ครู"}
{"word": "teacher", "english": "The teacher explains concepts so clearly.", "thai": "ครูอธิบายแนวคิดได้ชัดเจนมาก"}
{"word": "concepts", "english": "Complex concepts need simple explanations.", "thai": "แนวคิดที่ซับซ้อนต้องการคำอธิบายที่ง่าย"}
{"word": "explanations", "english": "Her explanations always make sense.", "thai": "คำอธิบายของเธอเข้าใจได้เสมอ"}
{"word": "sense", "english": "A good sense of humor is attractive.", "thai": "อารมณ์ขันที่ดีมีเสน่ห์"}
{"word": "humor", "english": "His humor lights up the room.", "thai": "อารมณ์ขันของเขาทำให้ห้องสว่างไสว"}
{"word": "room", "english": "The room was decorated with balloons.", "thai": "ห้องถูกตกแต่งด้วยลูกโป่ง"}
{"word": "balloons", "english": "Balloons floated high above the festival.", "thai": "ลูกโป่งลอยสูงเหนืองานเทศกาล"}
{"word": "festival", "english": "The music festival was a blast.", "thai": "งานเทศกาลดนตรีสนุกสุดเหวี่ยง"}
{"word": "music", "english": "Live music creates unforgettable memories.", "thai": "ดนตรีสดสร้างความทรงจำที่ลืมไม่ลง"}
{"word": "memories", "english": "Old memories flood back when I visit home.", "thai": "ความทรงจำเก่าๆ ท่วมท้นเมื่อฉันกลับบ้าน"}
{"word": "home", "english": "Home cooking always feels comforting.", "thai": "อาหารทำเองที่บ้านรู้สึกอบอุ่นเสมอ"}
{"word": "cooking", "english": "Cooking spicy dishes is my passion.", "thai": "การทำอาหารเผ็ดเป็นความหลงใหลของฉัน"}
{"word": "passion", "english": "Her passion for art is inspiring.", "thai": "ความหลงใหลในศิลปะของเธอสร้างแรงบันดาลใจ"}
{"word": "art", "english": "Street art adds color to the city.", "thai": "ศิลปะบนท้องถนนเพิ่มสีสันให้เมือง"}
{"word": "city", "english": "The city skyline looks stunning at night.", "thai": "เส้นขอบฟ้าของเมืองดูน่าทึ่งในตอนกลางคืน"}
{"word": "night", "english": "Night hikes are thrilling but spooky.", "thai": "การเดินป่ากลางคืนน่าตื่นเต้นแต่ก็น่ากลัว"}
{"word": "hikes", "english": "Hikes in the mountains refresh my soul.", "thai": "การเดินป่าในภูเขาทำให้จิตใจฉันสดชื่น"}
{"word": "soul", "english": "Music speaks to my soul every time.", "thai": "ดนตรีพูดกับจิตใจของฉันทุกครั้ง"}
{"word": "time", "english": "Time management is a crucial skill.", "thai": "การจัดการเวลาคือทักษะที่สำคัญ"}
{"word": "skill", "english": "Her negotiation skill sealed the deal.", "thai": "ทักษะการเจรจาของเธอทำให้ข้อตกลงสำเร็จ"}
{"word": "deal", "english": "That deal saved me a fortune.", "thai": "ข้อตกลงนั้นช่วยฉันประหยัดเงินได้เยอะ"}
{"word": "fortune", "english": "A fortune teller predicted my future.", "thai": "หมอดูทำนายอนาคตของฉัน"}
{"word": "future", "english": "The future looks bright for her.", "thai": "อนาคตของเธอดูสดใส"}
{"word": "bright", "english": "Bright ideas spark innovation.", "thai": "ไอเดียที่สดใสจุดประกายนวัตกรรม"}
{"word": "ideas", "english": "Sharing ideas fuels collaboration.", "thai": "การแบ่งปันไอเดียส่งเสริมการทำงานร่วมกัน"}
{"word": "collaboration", "english": "Collaboration makes projects more fun.", "thai": "การทำงานร่วมกันทำให้โปรเจกต์สนุกยิ่งขึ้น"}
{"word": "projects", "english": "Creative projects keep me busy.", "thai": "โปรเจกต์สร้างสรรค์ทำให้ฉันยุ่ง"}
{"word": "busy", "english": "A busy day flies by quickly.", "thai": "วันที่วุ่นวายผ่านไปอย่างรวดเร็ว"}
{"word": "day", "english": "A sunny day boosts my mood.", "thai": "วันที่แดดออกช่วยเพิ่มอารมณ์ดีของฉัน"}
{"word": "mood", "english": "Her mood swings are unpredictable.", "thai": "อารมณ์ที่แปรปรวนของเธอคาดเดาไม่ได้"}
{"word": "unpredictable", "english": "The weather here is so unpredictable.", "thai": "สภาพอากาศที่นี่คาดเดาไม่ได้เลย"}
{"word": "weather", "english": "Bad weather canceled our picnic.", "thai": "สภาพอากาศแย่ทำให้ยกเลิกปิกนิกของเรา"}
{"word": "picnic", "english": "A picnic by the lake sounds perfect.", "thai": "การปิกนิกข้างทะเลสาบฟังดูสมบูรณ์แบบ"}
{"word": "lake", "english": "The lake sparkles under the sunlight.", "thai": "ทะเลสาบระยิบระยับใต้แสงแดด"}
{"word": "sunlight", "english": "Sunlight streams through the window.", "thai": "แสงแดดส่องผ่านหน้าต่าง"}
{"word": "window", "english": "The window offers a great view.", "thai": "หน้าต่างให้วิวที่สวยงาม"}
{"word": "view", "english": "The mountain view takes my breath away.", "thai": "วิวภูเขาทำให้ฉันตื่นตะลึง"}
{"word": "mountain", "english": "Climbing a mountain is a huge challenge.", "thai": "การปีนเขาคือความท้าทายครั้งใหญ่"}
{"word": "challenge", "english": "I love a good challenge at work.", "thai": "ฉันชอบความท้าทายดีๆ ที่ทำงาน"}
{"word": "work", "english": "Teamwork makes the dream work.", "thai": "การทำงานเป็นทีมทำให้ความฝันเป็นจริง"}
{"word": "dream", "english": "My dream vacation is in Hawaii.", "thai": "วันหยุดในฝันของฉันคือที่ฮาวาย"}
{"word": "vacation", "english": "A beach vacation sounds so relaxing.", "thai": "วันหยุดที่ชายหาดฟังดูผ่อนคลายมาก"}
{"word": "beach", "english": "The beach was crowded with tourists.", "thai": "ชายหาดเต็มไปด้วยนักท่องเที่ยว"}
{"word": "tourists", "english": "Tourists love exploring local markets.", "thai": "นักท่องเที่ยวชอบสำรวจตลาดท้องถิ่น"}
{"word": "markets", "english": "Farmers’ markets sell fresh veggies.", "thai": "ตลาดเกษตรกรขายผักสด"}
{"word": "veggies", "english": "Veggies are essential for a healthy diet.", "thai": "ผักจำเป็นสำหรับอาหารเพื่อสุขภาพ"}
{"word": "diet", "english": "A balanced diet improves energy.", "thai": "อาหารที่สมดุลช่วยเพิ่มพลังงาน"}
{"word": "energy", "english": "Her energy lights up any party.", "thai": "พลังของเธอทำให้งานปาร์ตี้มีชีวิตชีวา"}
{"word": "party", "english": "The costume party was a hit.", "thai": "งานปาร์ตี้แต่งตัวประสบความสำเร็จ"}
{"word": "costume", "english": "Her costume won first prize.", "thai": "ชุดของเธอชนะรางวัลที่หนึ่ง"}
{"word": "prize", "english": "Winning a prize feels so rewarding.", "thai": "การชนะรางวัลรู้สึกคุ้มค่ามาก"}
{"word": "rewarding", "english": "Volunteering is a rewarding experience.", "thai": "การเป็นอาสาสมัครเป็นประสบการณ์ที่คุ้มค่า"}
{"word": "experience", "english": "Traveling is an eye-opening experience.", "thai": "การเดินทางเป็นประสบการณ์ที่เปิดโลก"}
{"word": "traveling", "english": "Traveling abroad requires careful planning.", "thai": "การเดินทางไปต่างประเทศต้องวางแผนอย่างรอบคอบ"}
{"word": "planning", "english": "Planning meals saves time and money.", "thai": "การวางแผนมื้ออาหารช่วยประหยัดเวลาและเงิน"}
{"word": "meals", "english": "Family meals strengthen our bond.", "thai": "มื้ออาหารครอบครัวช่วยกระชับความสัมพันธ์"}
{"word": "bond", "english": "Our bond grew stronger over time.", "thai": "ความผูกพันของเราแข็งแกร่งขึ้นตามเวลา"}
{"word": "time", "english": "Spending time outdoors is refreshing.", "thai": "การใช้เวลานอกบ้านสดชื่นมาก"}
{"word": "outdoors", "english": "Camping outdoors is my favorite hobby.", "thai": "การตั้งแคมป์นอกบ้านคืองานอดิเรกที่ฉันชอบ"}
{"word": "hobby", "english": "Photography is a relaxing hobby.", "thai": "การถ่ายภาพคืองานอดิเรกที่ผ่อนคลาย"}
{"word": "photography", "english": "Photography captures life’s best moments.", "thai": "การถ่ายภาพจับภาพช่วงเวลาที่ดีที่สุดของชีวิต"}
{"word": "moments", "english": "Cherish the moments with loved ones.", "thai": "จงทะนุถนอมช่วงเวลากับคนที่คุณรัก"}
{"word": "loved", "english": "My loved ones make life special.", "thai": "คนที่ฉันรักทำให้ชีวิตพิเศษ"}
{"word": "life", "english": "Life throws unexpected curveballs sometimes.", "thai": "ชีวิตบางครั้งก็มีเรื่องไม่คาดคิด"}
{"word": "curveballs", "english": "Curveballs keep you on your toes.", "thai": "เรื่องไม่คาดคิดทำให้คุณต้องตื่นตัว"}
{"word": "toes", "english": "Dancing on my toes feels freeing.", "thai": "การเต้นด้วยปลายเท้ารู้สึกเป็นอิสระ"}
{"word": "dancing", "english": "Dancing to upbeat music lifts my spirits.", "thai": "การเต้นตามจังหวะเพลงสนุกๆ ยกระดับจิตใจของฉัน"}
{"word": "music", "english": "Jazz music sets a chill vibe.", "thai": "ดนตรีแจ๊สสร้างบรรยากาศผ่อนคลาย"}
{"word": "vibe", "english": "The cozy vibe here is perfect.", "thai": "บรรยากาศอบอุ่นที่นี่สมบูรณ์แบบ"}
{"word": "cozy", "english": "A cozy blanket warms me up.", "thai": "ผ้าห่มแสนอบอุ่นทำให้ฉันอบอุ่น"}
{"word": "blanket", "english": "The blanket was soft and fluffy.", "thai": "ผ้าห่มนุ่มและฟูมาก"}
{"word": "soft", "english": "Her soft voice calmed the room.", "thai": "น้ำเสียงนุ่มนวลของเธอทำให้ห้องสงบ"}
{"word": "voice", "english": "His voice echoed through the hall.", "thai": "น้ำเสียงของเขาดังก้องไปทั่วห้องโถง"}
{"word": "hall", "english": "The concert hall was packed tonight.", "thai": "ห้องคอนเสิร์ตแน่นไปด้วยผู้คนคืนนี้"}
{"word": "concert", "english": "The concert blew my mind.", "thai": "คอนเสิร์ตทำให้ฉันตื่นเต้นสุดๆ"}
{"word": "mind", "english": "An open mind embraces new ideas.", "thai": "ใจที่เปิดกว้างยอมรับไอเดียใหม่ๆ"}
{"word": "ideas", "english": "Fresh ideas spark great conversations.", "thai": "ไอเดียใหม่ๆ จุดประกายการสนทนาที่ยอดเยี่ยม"}
{"word": "conversations", "english": "Deep conversations build stronger connections.", "thai": "การสนทนาที่ลึกซึ้งสร้างความสัมพันธ์ที่แข็งแกร่งขึ้น"}
{"word": "connections", "english": "Connections with colleagues boost teamwork.", "thai": "ความสัมพันธ์กับเพื่อนร่วมงานส่งเสริมการทำงานเป็นทีม"}
{"word": "teamwork", "english": "Teamwork makes challenging projects easier.", "thai": "การทำงานเป็นทีมทำให้โปรเจกต์ที่ท้าทายง่ายขึ้น"}
{"word": "projects", "english": "Creative projects fuel my passion.", "thai": "โปรเจกต์สร้างสรรค์จุดไฟให้ความหลงใหลของฉัน"}
{"word": "passion", "english": "Her passion for cooking is contagious.", "thai": "ความหลงใหลในการทำอาหารของเธอติดต่อกันได้"}
{"word": "cooking", "english": "Cooking dinner tonight feels like a chore.", "thai": "การทำอาหารเย็นคืนนี้รู้สึกเหมือนงานหนัก"}
{"word": "dinner", "english": "Dinner with family is always special.", "thai": "มื้อเย็นกับครอบครัวพิเศษเสมอ"}
{"word": "family", "english": "Family vacations create lasting memories.", "thai": "วันหยุดกับครอบครัวสร้างความทรงจำที่ยาวนาน"}
{"word": "memories", "english": "Old memories flood back during reunions.", "thai": "ความทรงจำเก่าๆ ท่วมท้นในงานรวมตัว"}
{"word": "reunions", "english": "High school reunions can be awkward.", "thai": "งานรวมรุ่นมัธยมอาจรู้สึกอึดอัด"}
{"word": "school", "english": "School taught me more than just academics.", "thai": "โรงเรียนสอนฉันมากกว่าแค่เรื่องวิชาการ"}
{"word": "academics", "english": "Academics are important, but so is creativity.", "thai": "วิชาการสำคัญ แต่ความคิดสร้างสรรค์ก็เช่นกัน"}
{"word": "creativity", "english": "Creativity shines in art classes.", "thai": "ความคิดสร้างสรรค์เปล่งประกายในชั้นเรียนศิลปะ"}
{"word": "art", "english": "Art galleries inspire my imagination.", "thai": "แกลเลอรี่ศิลปะกระตุ้นจินตนาการของฉัน"}
{"word": "imagination", "english": "A vivid imagination fuels great stories.", "thai": "จินตนาการที่สดใสสร้างเรื่องราวที่ยอดเยี่ยม"}
{"word": "stories", "english": "Bedtime stories calm my kids down.", "thai": "นิทานก่อนนอนช่วยให้ลูกๆ ของฉันสงบ"}
{"word": "kids", "english": "Kids love playing in the park.", "thai": "เด็กๆ ชอบเล่นในสวนสาธารณะ"}
{"word": "park", "english": "The park is perfect for morning jogs.", "thai": "สวนสาธารณะเหมาะสำหรับการวิ่งตอนเช้า"}
{"word": "morning", "english": "Morning coffee kicks off my day.", "thai": "กาแฟตอนเช้าช่วยเริ่มวันของฉัน"}
{"word": "coffee", "english": "This coffee shop has the best brew.", "thai": "ร้านกาแฟนี้มีกาแฟที่ดีที่สุด"}
{"word": "shop", "english": "I shop for groceries every weekend.", "thai": "ฉันซื้อของชำทุกสุดสัปดาห์"}
{"word": "weekend", "english": "The weekend forecast looks rainy.", "thai": "พยากรณ์อากาศสุดสัปดาห์ดูเหมือนฝนจะตก"}
{"word": "rainy", "english": "Rainy days are perfect for reading.", "thai": "วันที่ฝนตกเหมาะสำหรับการอ่านหนังสือ"}
{"word": "reading", "english": "Reading novels expands my perspective.", "thai": "การอ่านนิยายขยายมุมมองของฉัน"}
{"word": "perspective", "english": "Her unique perspective solves problems.", "thai": "มุมมองที่ไม่เหมือนใครของเธอช่วยแก้ปัญหา"}
{"word": "problems", "english": "Math problems can be such a headache.", "thai": "โจทย์คณิตศาสตร์อาจทำให้ปวดหัว"}
{"word": "headache", "english": "This headache is driving me nuts.", "thai": "อาการปวดหัวนี้ทำให้ฉันหงุดหงิด"}
{"word": "nuts", "english": "Going nuts over a game is fun.", "thai": "การตื่นเต้นกับเกมนั้นสนุกมาก"}
{"word": "game", "english": "The board game kept us entertained.", "thai": "เกมกระดานทำให้เราเพลิดเพลิน"}
{"word": "entertained", "english": "The comedian entertained the whole crowd.", "thai": "นักแสดงตลกทำให้ฝูงชนทั้งหมดเพลิดเพลิน"}
{"word": "crowd", "english": "The crowd cheered at the concert.", "thai": "ฝูงชนส่งเสียงเชียร์ในคอนเสิร์ต"}
{"word": "concert", "english": "That concert was absolutely epic.", "thai": "คอนเสิร์ตนั้นยอดเยี่ยมสุดๆ"}
{"word": "epic", "english": "The epic movie kept me glued.", "thai": "ภาพยนตร์สุดยิ่งใหญ่ทำให้ฉันติดหนึบ"}
{"word": "movie", "english": "Watching a movie is my Friday ritual.", "thai": "การดูหนังเป็นพิธีกรรมวันศุกร์ของฉัน"}
{"word": "Friday", "english": "Friday nights call for pizza.", "thai": "คืนวันศุกร์ต้องกินพิซซ่า"}
{"word": "pizza", "english": "This pizza has the perfect crust.", "thai": "พิซซ่านี้มีแป้งที่สมบูรณ์แบบ"}
{"word": "crust", "english": "The crust on this bread is crispy.", "thai": "เปลือกขนมปังนี้กรอบมาก"}
{"word": "bread", "english": "Fresh bread smells so inviting.", "thai": "ขนมปังสดมีกลิ่นหอมชวนลิ้มลอง"}
{"word": "smells", "english": "The kitchen smells like warm cookies.", "thai": "ครัวมีกลิ่นเหมือนคุกกี้อบอุ่น"}
{"word": "cookies", "english": "Baking cookies is a holiday tradition.", "thai": "การอบคุกกี้เป็นประเพณีวันหยุด"}
{"word": "holiday", "english": "Holiday decorations brighten the house.", "thai": "การตกแต่งวันหยุดทำให้บ้านสว่างไสว"}
{"word": "house", "english": "Our house needs a new paint job.", "thai": "บ้านของเราต้องการทาสีใหม่"}
{"word": "paint", "english": "I love to paint landscapes outdoors.", "thai": "ฉันชอบวาดภาพทิวทัศน์นอกบ้าน"}
{"word": "landscapes", "english": "The landscapes here are breathtaking.", "thai": "ทิวทัศน์ที่นี่น่าทึ่ง"}
{"word": "breathtaking", "english": "The view from the cliff is breathtaking.", "thai": "วิวจากหน้าผาน่าทึ่งมาก"}
{"word": "view", "english": "This hotel room has an amazing view.", "thai": "ห้องโรงแรมนี้มีวิวที่สวยงาม"}
{"word": "hotel", "english": "The hotel staff was incredibly helpful.", "thai": "พนักงานโรงแรมช่วยเหลือดีมาก"}
{"word": "staff", "english": "Our staff meeting ran pretty smoothly.", "thai": "การประชุมพนักงานของเราดำเนินไปอย่างราบรื่น"}
{"word": "meeting", "english": "The meeting agenda was packed tight.", "thai": "วาระการประชุมแน่นมาก"}
{"word": "agenda", "english": "Her agenda is always so organized.", "thai": "วาระของเธอเป็นระเบียบเสมอ"}
{"word": "organized", "english": "An organized desk boosts productivity.", "thai": "โต๊ะที่เป็นระเบียบช่วยเพิ่มผลผลิต"}
{"word": "productivity", "english": "Productivity apps streamline my workflow.", "thai": "แอปเพิ่มผลผลิตช่วยให้งานของฉันลื่นไหล"}
{"word": "workflow", "english": "A smooth workflow saves so much time.", "thai": "ขั้นตอนการทำงานที่ราบรื่นช่วยประหยัดเวลา"}
{"word": "time", "english": "Time flies when I’m with friends.", "thai": "เวลาผ่านไปเร็วเมื่ออยู่กับเพื่อน"}
{"word": "friends", "english": "Friends make every moment better.", "thai": "เพื่อนทำให้ทุกช่วงเวลาดีขึ้น"}
{"word": "moment", "english": "This moment calls for a toast.", "thai": "ช่วงเวลานี้ต้องยกแก้วฉลอง"}
{"word": "toast", "english": "I burned the toast this morning.", "thai": "ฉันเผาขนมปังปิ้งเช้านี้"}
{"word": "burned", "english": "The campfire burned brightly all night.", "thai": "กองไฟแคมป์สว่างไสวตลอดคืน"}
{"word": "campfire", "english": "We sang songs around the campfire.", "thai": "เราร้องเพลงรอบกองไฟ"}
{"word": "songs", "english": "Her favorite songs are so uplifting.", "thai": "เพลงโปรดของเธอยกระดับจิตใจมาก"}
{"word": "uplifting", "english": "Uplifting quotes motivate me daily.", "thai": "คำคมที่ยกระดับจิตใจกระตุ้นฉันทุกวัน"}
{"word": "quotes", "english": "Inspirational quotes decorate my journal.", "thai": "คำคมสร้างแรงบันดาลใจประดับสมุดบันทึกของฉัน"}
{"word": "journal", "english": "Keeping a journal helps me reflect.", "thai": "การเขียนสมุดบันทึกช่วยให้ฉันสะท้อนตัวเอง"}
{"word": "reflect", "english": "I reflect on my goals every month.", "thai": "ฉันทบทวนเป้าหมายของตัวเองทุกเดือน"}
{"word": "goals", "english": "Setting realistic goals drives success.", "thai": "การตั้งเป้าหมายที่เป็นจริงนำไปสู่ความสำเร็จ"}
{"word": "success", "english": "Success feels sweeter after hard work.", "thai": "ความสำเร็จรู้สึกหวานยิ่งขึ้นหลังจากทำงานหนัก"}
{"word": "work", "english": "Work-life balance is tough to maintain.", "thai": "การรักษาสมดุลระหว่างงานและชีวิตส่วนตัวนั้นยาก"}
{"word": "balance", "english": "Yoga helps me find inner balance.", "thai": "โยคะช่วยให้ฉันพบสมดุลภายใน"}
{"word": "yoga", "english": "Morning yoga sessions energize me.", "thai": "การฝึกโยคะตอนเช้าทำให้ฉันมีพลัง"}
{"word": "sessions", "english": "Study sessions improve my grades.", "thai": "การเรียนกลุ่มช่วยพัฒนาคะแนนของฉัน"}
{"word": "grades", "english": "Good grades open doors to opportunities.", "thai": "คะแนนดีเปิดประตูสู่โอกาส"}
{"word": "opportunities", "english": "New opportunities excite me every time.", "thai": "โอกาสใหม่ทำให้ฉันตื่นเต้นทุกครั้ง"}
{"word": "excite", "english": "Thrillers always excite my imagination.", "thai": "หนังระทึกขวัญกระตุ้นจินตนาการของฉันเสมอ"}
{"word": "imagination", "english": "A wild imagination creates epic adventures.", "thai": "จินตนาการที่โลดโผนสร้างการผจญภัยสุดยิ่งใหญ่"}
{"word": "adventures", "english": "Outdoor adventures recharge my spirit.", "thai": "การผจญภัยกลางแจ้งเติมพลังให้จิตใจของฉัน"}
{"word": "spirit", "english": "Her free spirit inspires everyone.", "thai": "จิตวิญญาณอิสระของเธอสร้างแรงบันดาลใจให้ทุกคน"}
{"word": "inspires", "english": "Great leadership inspires bold actions.", "thai": "ผู้นำที่ยอดเยี่ยมสร้างแรงบันดาลใจให้เกิดการกระทำที่กล้าหาญ"}
{"word": "actions", "english": "Small actions lead to big changes.", "thai": "การกระทำเล็กๆ นำไปสู่การเปลี่ยนแปลงใหญ่"}
{"word": "changes", "english": "Changes in routine keep life fresh.", "thai": "การเปลี่ยนแปลงในกิจวัตรทำให้ชีวิตสดชื่น"}
{"word": "routine", "english": "My morning routine sets the tone.", "thai": "กิจวัตรตอนเช้าของฉันกำหนดอารมณ์วัน"}
{"word": "tone", "english": "Her sarcastic tone made me laugh.", "thai": "น้ำเสียงประชดของเธอทำให้ฉันหัวเราะ"}
{"word": "laugh", "english": "A good laugh relieves my stress.", "thai": "การหัวเราะที่ดีช่วยลดความเครียดของฉัน"}
{"word": "stress", "english": "Work stress can be overwhelming sometimes.", "thai": "ความเครียดจากงานบางครั้งอาจหนักหน่วง"}
{"word": "overwhelming", "english": "The support was overwhelming but welcome.", "thai": "การสนับสนุนนั้นล้นหลามแต่ก็น่ายินดี"}
{"word": "support", "english": "Friends’ support gets me through tough times.", "thai": "การสนับสนุนจากเพื่อนช่วยให้ฉันผ่านช่วงเวลาที่ยากลำบาก"}
{"word": "times", "english": "Tough times build stronger character.", "thai": "ช่วงเวลาที่ยากลำบากสร้างบุคลิกที่แข็งแกร่งขึ้น"}
{"word": "character", "english": "Her quirky character charms everyone.", "thai": "บุคลิกแปลกๆ ของเธอดึงดูดทุกคน"}
{"word": "charms", "english": "This necklace charms me with its simplicity.", "thai": "สร้อยคอนี้ดึงดูดฉันด้วยความเรียบง่าย"}
{"word": "simplicity", "english": "Simplicity in design feels so elegant.", "thai": "ความเรียบง่ายในการออกแบบรู้สึกสง่างามมาก"}
{"word": "design", "english": "The app’s design is super user-friendly.", "thai": "การออกแบบแอปนี้ใช้งานง่ายมาก"}
{"word": "app", "english": "This app tracks my daily steps.", "thai": "แอปนี้ติดตามจำนวนก้าวรายวันของฉัน"}
{"word": "steps", "english": "Climbing these steps is a workout.", "thai": "การปีนบันไดเหล่านี้เหมือนออกกำลังกาย"}
{"word": "workout", "english": "A good workout boosts my mood.", "thai": "การออกกำลังกายที่ดีช่วยยกระดับอารมณ์ของฉัน"}
{"word": "mood", "english": "Her cheerful mood lights up the party.", "thai": "อารมณ์ร่าเริงของเธอทำให้งานปาร์ตี้มีชีวิตชีวา"}
{"word": "party", "english": "The dance party was totally lit.", "thai": "งานปาร์ตี้เต้นรำมันส์สุดๆ"}
{"word": "dance", "english": "The dance class was super fun.", "thai": "ชั้นเรียนเต้นรำสนุกมาก"}
{"word": "class", "english": "This cooking class taught me new recipes.", "thai": "ชั้นเรียนทำอาหารนี้สอนสูตรใหม่ให้ฉัน"}
{"word": "recipes", "english": "Her recipes always taste amazing.", "thai": "สูตรอาหารของเธออร่อยเสมอ"}
{"word": "taste", "english": "This soup has a unique taste.", "thai": "ซุปนี้มีรสชาติที่ไม่เหมือนใคร"}
{"word": "soup", "english": "Hot soup warms me up in winter.", "thai": "ซุปร้อนทำให้ฉันอบอุ่นในหน้าหนาว"}
{"word": "winter", "english": "Winter hikes are crisp and refreshing.", "thai": "การเดินป่าในหน้าหนาวสดชื่นและเย็นสบาย"}
{"word": "hikes", "english": "Long hikes test my endurance.", "thai": "การเดินป่าที่ยาวนานทดสอบความอดทนของฉัน"}
{"word": "endurance", "english": "Building endurance takes consistent effort.", "thai": "การสร้างความอดทนต้องใช้ความพยายามอย่างต่อเนื่อง"}
{"word": "effort", "english": "Her effort at work earned a promotion.", "thai": "ความพยายามในการทำงานของเธอทำให้ได้เลื่อนตำแหน่ง"}
{"word": "work", "english": "Work meetings can be so draining.", "thai": "การประชุมงานอาจทำให้เหนื่อยล้า"}
{"word": "meetings", "english": "Meetings with clients require preparation.", "thai": "การประชุมกับลูกค้าต้องมีการเตรียมตัว"}
{"word": "preparation", "english": "Good preparation leads to great performances.", "thai": "การเตรียมตัวที่ดีนำไปสู่การแสดงที่ยอดเยี่ยม"}
{"word": "performances", "english": "Theater performances always captivate me.", "thai": "การแสดงละครเวทีดึงดูดใจฉันเสมอ"}
{"word": "theater", "english": "The theater was packed for the premiere.", "thai": "โรงละครแน่นไปด้วยผู้คนในรอบปฐมทัศน์"}
{"word": "premiere", "english": "The movie premiere was a huge event.", "thai": "รอบปฐมทัศน์ภาพยนตร์เป็นงานใหญ่"}
{"word": "event", "english": "This charity event raised thousands.", "thai": "งานการกุศลนี้ระดมทุนได้หลายพัน"}
{"word": "charity", "english": "Supporting charity feels so rewarding.", "thai": "การสนับสนุนการกุศลรู้สึกคุ้มค่ามาก"}
{"word": "rewarding", "english": "Teaching kids is incredibly rewarding.", "thai": "การสอนเด็กๆ คุ้มค่าอย่างไม่น่าเชื่อ"}
{"word": "kids", "english": "Kids love splashing in the pool.", "thai": "เด็กๆ ชอบเล่นน้ำในสระ"}
{"word": "pool", "english": "The pool party was a blast.", "thai": "งานปาร์ตี้ที่สระว่ายน้ำสนุกสุดๆ"}
{"word": "party", "english": "Her birthday party had great music.", "thai": "งานวันเกิดของเธอมีดนตรีที่ยอดเยี่ยม"}
{"word": "music", "english": "Live music makes any night special.", "thai": "ดนตรีสดทำให้ทุกคืนพิเศษ"}
{"word": "night", "english": "The night sky was full of stars.", "thai": "ท้องฟ้ายามค่ำคืนเต็มไปด้วยดวงดาว"}
{"word": "stars", "english": "Stars inspire dreams of adventure.", "thai": "ดวงดาวกระตุ้นความฝันถึงการผจญภัย"}
{"word": "adventure", "english": "An adventure in the jungle sounds thrilling.", "thai": "การผจญภัยในป่าดงดิบฟังดูน่าตื่นเต้น"}
{"word": "jungle", "english": "The jungle trek was tough but fun.", "thai": "การเดินป่าในป่าดงดิบนั้นยากแต่สนุก"}
{"word": "trek", "english": "A mountain trek tests your limits.", "thai": "การเดินป่าบนภูเขาทดสอบขีดจำกัดของคุณ"}
{"word": "mountain", "english": "The mountain view was absolutely stunning.", "thai": "วิวภูเขาน่าทึ่งมาก"}
{"word": "view", "english": "This balcony has an incredible view.", "thai": "ระเบียงนี้มีวิวที่น่าทึ่ง"}
{"word": "balcony", "english": "The balcony is perfect for morning coffee.", "thai": "ระเบียงเหมาะสำหรับดื่มกาแฟตอนเช้า"}
{"word": "coffee", "english": "Strong coffee keeps me awake.", "thai": "กาแฟเข้มข้นทำให้ฉันตื่นตัว"}
{"word": "awake", "english": "Staying awake during lectures is hard.", "thai": "การตื่นตัวระหว่างการบรรยายนั้นยาก"}
{"word": "lectures", "english": "Her lectures are always so engaging.", "thai": "การบรรยายของเธอน่าสนใจเสมอ"}
{"word": "engaging", "english": "An engaging story hooks the reader.", "thai": "เรื่องราวที่น่าสนใจดึงดูดผู้อ่าน"}
{"word": "story", "english": "Her life story inspired the crowd.", "thai": "เรื่องราวชีวิตของเธอสร้างแรงบันดาลใจให้ฝูงชน"}
{"word": "crowd", "english": "The crowd cheered at the game.", "thai": "ฝูงชนส่งเสียงเชียร์ในเกม"}
{"word": "game", "english": "This soccer game is getting intense.", "thai": "เกมฟุตบอลนี้กำลังเข้มข้น"}
{"word": "intense", "english": "Intense workouts leave me exhausted.", "thai": "การออกกำลังกายหนักทำให้ฉันเหนื่อยล้า"}
{"word": "workouts", "english": "Morning workouts boost my energy.", "thai": "การออกกำลังกายตอนเช้าช่วยเพิ่มพลังงานของฉัน"}
{"word": "energy", "english": "Her boundless energy lights up the room.", "thai": "พลังอันไร้ขอบเขตของเธอทำให้ห้องสว่างไสว"}
{"word": "room", "english": "This room needs a fresh coat of paint.", "thai": "ห้องนี้ต้องการทาสีใหม่"}
{"word": "paint", "english": "I love to paint with bold colors.", "thai": "ฉันชอบวาดภาพด้วยสีสันจัดจ้าน"}
{"word": "colors", "english": "Bright colors make the festival vibrant.", "thai": "สีสันสดใสทำให้เทศกาลมีชีวิตชีวา"}
{"word": "festival", "english": "The food festival was a huge hit.", "thai": "งานเทศกาลอาหารประสบความสำเร็จอย่างมาก"}
{"word": "food", "english": "Spicy food always excites my taste buds.", "thai": "อาหารเผ็ดกระตุ้นต่อมรับรสของฉันเสมอ"}
{"word": "taste", "english": "Her taste in music is eclectic.", "thai": "รสนิยมด้านดนตรีของเธอหลากหลาย"}
{"word": "music", "english": "Jazz music sets a chill vibe.", "thai": "ดนตรีแจ๊สสร้างบรรยากาศผ่อนคลาย"}
{"word": "vibe", "english": "The beach vibe is so relaxing.", "thai": "บรรยากาศชายหาดผ่อนคลายมาก"}
{"word": "beach", "english": "The beach sunset was pure magic.", "thai": "พระอาทิตย์ตกที่ชายหาดเหมือนเวทมนตร์"}
{"word": "sunset", "english": "Watching the sunset calms my mind.", "thai": "การดูพระอาทิตย์ตกทำให้จิตใจฉันสงบ"}
{"word": "mind", "english": "An open mind embraces new ideas.", "thai": "ใจที่เปิดกว้างยอมรับไอเดียใหม่ๆ"}
{"word": "ideas", "english": "Her ideas always spark creativity.", "thai": "ไอเดียของเธอจุดประกายความคิดสร้างสรรค์เสมอ"}
{"word": "creativity", "english": "Creativity fuels innovation in tech.", "thai": "ความคิดสร้างสรรค์ขับเคลื่อนนวัตกรรมในเทคโนโลยี"}
{"word": "tech", "english": "Tech gadgets are my guilty pleasure.", "thai": "อุปกรณ์เทคโนโลยีคือความสุขเล็กๆ ของฉัน"}
{"word": "gadgets", "english": "New gadgets make life more convenient.", "thai": "อุปกรณ์ใหม่ๆ ทำให้ชีวิตสะดวกยิ่งขึ้น"}
{"word": "life", "english": "Life in the city never slows down.", "thai": "ชีวิตในเมืองไม่เคยช้าลง"}
{"word": "city", "english": "The city lights shine so brightly.", "thai": "แสงไฟในเมืองสว่างไสวมาก"}
{"word": "lights", "english": "Christmas lights make everything festive.", "thai": "ไฟคริสต์มาสทำให้ทุกอย่างดูรื่นเริง"}
{"word": "festive", "english": "The festive season brings everyone together.", "thai": "ช่วงเทศกาลทำให้ทุกคนรวมตัวกัน"}
{"word": "season", "english": "This season’s fashion trends are bold.", "thai": "เทรนด์แฟชันฤดูกาลนี้จัดจ้าน"}
{"word": "fashion", "english": "Fashion shows inspire my wardrobe choices.", "thai": "แฟชันโชว์สร้างแรงบันดาลใจให้การเลือกเสื้อผ้าของฉัน"}
{"word": "wardrobe", "english": "My wardrobe needs a serious update.", "thai": "ตู้เสื้อผ้าของฉันต้องการการอัปเดตครั้งใหญ่"}
{"word": "update", "english": "I need to update my phone software.", "thai": "ฉันต้องอัปเดตซอฟต์แวร์โทรศัพท์"}
{"word": "phone", "english": "My phone battery drains too fast.", "thai": "แบตเตอรี่โทรศัพท์ของฉันหมดเร็วเกินไป"}
{"word": "battery", "english": "The car battery died this morning.", "thai": "แบตเตอรี่รถยนต์เสียเช้านี้"}
{"word": "car", "english": "Renting a car makes travel easier.", "thai": "การเช่ารถทำให้การเดินทางง่ายขึ้น"}
{"word": "travel", "english": "Travel broadens your perspective on life.", "thai": "การเดินทางขยายมุมมองต่อชีวิตของคุณ"}
{"word": "perspective", "english": "Her perspective on issues is refreshing.", "thai": "มุมมองของเธอต่อประเด็นต่างๆ สดชื่น"}
{"word": "issues", "english": "Global issues need collective solutions.", "thai": "ประเด็นระดับโลกต้องการการแก้ไขร่วมกัน"}
{"word": "solutions", "english": "Creative solutions solve complex problems.", "thai": "โซลูชันสร้างสรรค์แก้ปัญหาที่ซับซ้อน"}
{"word": "problems", "english": "Tech problems frustrate me every time.", "thai": "ปัญหาเทคโนโลยีทำให้ฉันหงุดหงิดทุกครั้ง"}
{"word": "frustrate", "english": "Delays always frustrate the team.", "thai": "ความล่าช้ามักทำให้ทีมหงุดหงิด"}
{"word": "team", "english": "Our team nailed the presentation.", "thai": "ทีมของเราทำพรีเซนเทชันได้ยอดเยี่ยม"}
{"word": "presentation", "english": "The presentation impressed the clients.", "thai": "พรีเซนเทชันสร้างความประทับใจให้ลูกค้า"}
{"word": "clients", "english": "Clients expect top-notch service.", "thai": "ลูกค้าคาดหวังการบริการชั้นยอด"}
{"word": "service", "english": "Customer service here is outstanding.", "thai": "การบริการลูกค้าที่นี่โดดเด่น"}
{"word": "outstanding", "english": "Her work ethic is truly outstanding.", "thai": "จรรยาบรรณในการทำงานของเธอโดดเด่นจริงๆ"}
{"word": "ethic", "english": "A strong work ethic drives success.", "thai": "จรรยาบรรณในการทำงานที่แข็งแกร่งนำไปสู่ความสำเร็จ"}
{"word": "success", "english": "Success feels better when shared.", "thai": "ความสำเร็จรู้สึกดีขึ้นเมื่อแบ่งปัน"}
{"word": "shared", "english": "Shared experiences strengthen friendships.", "thai": "ประสบการณ์ที่แบ่งปันกันช่วยกระชับมิตรภาพ"}
{"word": "friendships", "english": "Long-distance friendships need extra effort.", "thai": "มิตรภาพทางไกลต้องการความพยายามพิเศษ"}
{"word": "effort", "english": "Her effort in volunteering is inspiring.", "thai": "ความพยายามในการเป็นอาสาสมัครของเธอสร้างแรงบันดาลใจ"}
{"word": "volunteering", "english": "Volunteering at the shelter feels fulfilling.", "thai": "การเป็นอาสาที่ศูนย์พักพิงรู้สึกเติมเต็ม"}
{"word": "shelter", "english": "The animal shelter needs more donations.", "thai": "ศูนย์พักพิงสัตว์ต้องการการบริจาคเพิ่ม"}
{"word": "donations", "english": "Donations help fund community projects.", "thai": "การบริจาคช่วยสนับสนุนโปรเจกต์ชุมชน"}
{"word": "community", "english": "The community garden brings people together.", "thai": "สวนชุมชนทำให้ผู้คนรวมตัวกัน"}
{"word": "garden", "english": "My garden is blooming with flowers.", "thai": "สวนของฉันเต็มไปด้วยดอกไม้ที่บานสะพรั่ง"}
{"word": "flowers", "english": "Fresh flowers brighten any space.", "thai": "ดemainflowersอกไม้สดทำให้ทุกพื้นที่สว่างไสว"}
{"word": "space", "english": "This cozy space feels like home.", "thai": "พื้นที่แสนอบอุ่นนี้รู้สึกเหมือนบ้าน"}
{"word": "home", "english": "Home renovations are so stressful.", "thai": "การปรับปรุงบ้านเครียดมาก"}
{"word": "renovations", "english": "Renovations transformed the old building.", "thai": "การปรับปรุงเปลี่ยนอาคารเก่าให้ทันสมัย"}
{"word": "building", "english": "The new building has modern amenities.", "thai": "อาคารใหม่มีสิ่งอำนวยความสะดวกทันสมัย"}
{"word": "amenities", "english": "Hotel amenities make stays more comfortable.", "thai": "สิ่งอำนวยความสะดวกของโรงแรมทำให้การพักผ่อนสบายยิ่งขึ้น"}
{"word": "comfortable", "english": "This chair is so comfortable.", "thai": "เก้าอี้ตัวนี้สบายมาก"}
{"word": "chair", "english": "The chair creaked under his weight.", "thai": "เก้าอี้ส่งเสียงดังเอี๊ยดภายใต้น้ำหนักของเขา"}
{"word": "weight", "english": "Lifting weights builds muscle strength.", "thai": "การยกน้ำหนักสร้างความแข็งแรงของกล้ามเนื้อ"}
{"word": "strength", "english": "Her inner strength inspires us all.", "thai": "ความแข็งแกร่งภายในของเธอสร้างแรงบันดาลใจให้เราทุกคน"}
{"word": "inspires", "english": "Great art inspires deep emotions.", "thai": "ศิลปะที่ยอดเยี่ยมสร้างแรงบันดาลใจให้เกิดอารมณ์ลึกซึ้ง"}
{"word": "art", "english": "Street art adds vibrancy to neighborhoods.", "thai": "ศิลปะบนท้องถนนเพิ่มความมีชีวิตชีวาให้กับย่าน"}
{"word": "neighborhoods", "english": "Quiet neighborhoods are perfect for relaxing.", "thai": "ย่านที่เงียบสงบเหมาะสำหรับการพักผ่อน"}
{"word": "relaxing", "english": "A relaxing evening includes good music.", "thai": "ค่ำคืนที่ผ่อนคลายรวมถึงดนตรีดีๆ"}
{"word": "music", "english": "Live music energizes the crowd.", "thai": "ดนตรีสดทำให้ฝูงชนมีพลัง"}
{"word": "crowd", "english": "The crowd roared at the touchdown.", "thai": "ฝูงชนส่งเสียงคำรามเมื่อทำทัชดาวน์"}
{"word": "touchdown", "english": "Scoring a touchdown felt so thrilling.", "thai": "การทำทัชดาวน์รู้สึกตื่นเต้นมาก"}
{"word": "thrilling", "english": "That rollercoaster ride was absolutely thrilling.", "thai": "การนั่งรถไฟเหาะนั้นตื่นเต้นสุดๆ"}
{"word": "ride", "english": "A bike ride clears my mind.", "thai": "การปั่นจักรยานทำให้จิตใจฉันปลอดโปร่ง"}
{"word": "mind", "english": "Her sharp mind solves puzzles fast.", "thai": "จิตใจที่เฉียบแหลมของเธอแก้ปริศนาได้เร็ว"}
{"word": "puzzles", "english": "Jigsaw puzzles are my weekend hobby.", "thai": "ปริศนาจิ๊กซอว์คืองานอดิเรกสุดสัปดาห์ของฉัน"}
{"word": "hobby", "english": "Photography is a hobby I cherish.", "thai": "การถ่ายภาพคืองานอดิเรกที่ฉันหวงแหน"}
{"word": "photography", "english": "Photography captures moments that last forever.", "thai": "การถ่ายภาพจับภาพช่วงเวลาที่คงอยู่ตลอดไป"}
{"word": "moments", "english": "Special moments deserve to be celebrated.", "thai": "ช่วงเวลาพิเศษสมควรได้รับการเฉลิมฉลอง"}
{"word": "celebrated", "english": "We celebrated her promotion with champagne.", "thai": "เราเฉลิมฉลองการเลื่อนตำแหน่งของเธอด้วยแชมเปญ"}
{"word": "champagne", "english": "Champagne toasts make parties festive.", "thai": "การดื่มแชมเปญทำให้งานปาร์ตี้รื่นเริง"}
{"word": "parties", "english": "House parties are always a blast.", "thai": "งานปาร์ตี้ที่บ้านสนุกสุดเหวี่ยงเสมอ"}
{"word": "house", "english": "Our house smells like fresh cookies.", "thai": "บ้านของเรามีกลิ่นเหมือนคุกกี้สดใหม่"}
{"word": "cookies", "english": "Baking cookies is my stress reliever.", "thai": "การอบคุกกี้คือวิธีคลายเครียดของฉัน"}
{"word": "stress", "english": "Work stress can really pile up.", "thai": "ความเครียดจากงานสามารถสะสมได้มาก"}
{"word": "work", "english": "Teamwork makes big projects manageable.", "thai": "การทำงานเป็นทีมทำให้โปรเจกต์ใหญ่จัดการได้ง่าย"}
{"word": "projects", "english": "Creative projects spark my imagination.", "thai": "โปรเจกต์สร้างสรรค์จุดประกายจินตนาการของฉัน"}
{"word": "imagination", "english": "A wild imagination fuels great stories.", "thai": "จินตนาการที่โลดโผนสร้างเรื่องราวที่ยอดเยี่ยม"}
{"word": "stories", "english": "Ghost stories scare me every time.", "thai": "เรื่องผีทำให้ฉันกลัวทุกครั้ง"}
{"word": "scare", "english": "Loud noises scare my dog.", "thai": "เสียงดังทำให้สุนัขของฉันกลัว"}
{"word": "dog", "english": "My dog loves chasing squirrels.", "thai": "สุนัขของฉันชอบวิ่งไล่กระรอก"}
{"word": "chasing", "english": "Chasing dreams takes real courage.", "thai": "การไล่ตามความฝันต้องใช้ความกล้าจริงๆ"}
{"word": "courage", "english": "Her courage during tough times inspires me.", "thai": "ความกล้าของเธอในช่วงเวลาที่ยากลำบากสร้างแรงบันดาลใจให้ฉัน"}
{"word": "times", "english": "Good times with friends are priceless.", "thai": "ช่วงเวลาดีๆ กับเพื่อนไม่มีค่า"}
{"word": "friends", "english": "Friends make road trips unforgettable.", "thai": "เพื่อนทำให้ทริปถนนน่าจดจำ"}
{"word": "trips", "english": "Camping trips recharge my soul.", "thai": "ทริปแคมป์ปิ้งเติมพลังให้จิตใจของฉัน"}
{"word": "soul", "english": "Music speaks to my soul always.", "thai": "ดนตรีพูดกับจิตใจของฉันเสมอ"}
{"word": "music", "english": "Jazz music creates a chill vibe.", "thai": "ดนตรีแจ๊สสร้างบรรยากาศผ่อนคลาย"}
{"word": "vibe", "english": "The cozy vibe here is perfect.", "thai": "บรรยากาศอบอุ่นที่นี่สมบูรณ์แบบ"}
{"word": "cozy", "english": "A cozy blanket warms the night.", "thai": "ผ้าห่มแสนอบอุ่นทำให้คืนนี้อบอุ่น"}
{"word": "night", "english": "The night market buzzes with energy.", "thai": "ตลาดกลางคืนคึกคักไปด้วยพลัง"}
{"word": "market", "english": "The farmer’s market sells fresh produce.", "thai": "ตลาดเกษตรกรขายผักผลไม้สด"}
{"word": "produce", "english": "Fresh produce makes meals delicious.", "thai": "ผลผลิตสดใหม่ทำให้มื้ออาหารอร่อย"}
{"word": "meals", "english": "Family meals strengthen our bond.", "thai": "มื้ออาหารครอบครัวช่วยกระชับความสัมพันธ์"}
{"word": "bond", "english": "Our bond grew through shared adventures.", "thai": "ความผูกพันของเราเติบโตผ่านการผจญภัยร่วมกัน"}
{"word": "adventures", "english": "Outdoor adventures keep me grounded.", "thai": "การผจญภัยกลางแจ้งทำให้ฉันรู้สึกมั่นคง"}
{"word": "grounded", "english": "Staying grounded helps me focus.", "thai": "การมั่นคงช่วยให้ฉันมีสมาธิ"}
{"word": "focus", "english": "Focus is key during tight deadlines.", "thai": "สมาธิคือกุญแจในช่วงเดดไลน์ที่กระชั้นชิด"}
{"word": "deadlines", "english": "Meeting deadlines boosts my confidence.", "thai": "การทำตามเดดไลน์ช่วยเพิ่มความมั่นใจของฉัน"}
{"word": "confidence", "english": "Her confidence shines in every speech.", "thai": "ความมั่นใจของเธอเปล่งประกายในทุกการพูด"}
{"word": "speech", "english": "His speech moved the entire audience.", "thai": "คำปราศรัยของเขาทำให้ผู้ฟังทั้งหมดประทับใจ"}
{"word": "audience", "english": "The audience clapped for the performance.", "thai": "ผู้ชมปรบมือให้กับการแสดง"}
{"word": "performance", "english": "Her dance performance was breathtaking.", "thai": "การแสดงเต้นรำของเธอน่าทึ่ง"}
{"word": "dance", "english": "Dance lessons improve my rhythm.", "thai": "บทเรียนเต้นรำช่วยพัฒนาจังหวะของฉัน"}
{"word": "rhythm", "english": "The song’s rhythm gets me moving.", "thai": "จังหวะของเพลงทำให้ฉันอยากขยับ"}
{"word": "song", "english": "This song always lifts my mood.", "thai": "เพลงนี้ยกระดับอารมณ์ของฉันเสมอ"}
{"word": "mood", "english": "A good mood makes work enjoyable.", "thai": "อารมณ์ดีทำให้งานสนุก"}
{"word": "work", "english": "Hard work pays off in time.", "thai": "การทำงานหนักให้ผลตอบแทนเมื่อเวลาผ่านไป"}
{"word": "time", "english": "Spending time outdoors feels refreshing.", "thai": "การใช้เวลานอกบ้านรู้สึกสดชื่น"}
{"word": "outdoors", "english": "Hiking outdoors clears my head.", "thai": "การเดินป่านอกบ้านทำให้หัวฉันโล่ง"}
{"word": "head", "english": "A clear head solves problems faster.", "thai": "หัวที่โล่งแก้ปัญหาได้เร็วขึ้น"}
{"word": "problems", "english": "Math problems challenge my brain.", "thai": "โจทย์คณิตศาสตร์ท้าทายสมองของฉัน"}
{"word": "brain", "english": "Puzzles keep my brain sharp.", "thai": "ปริศนาช่วยให้สมองของฉันเฉียบแหลม"}
{"word": "sharp", "english": "A sharp knife cuts veggies easily.", "thai": "มีดคมตัดผักได้ง่าย"}
{"word": "veggies", "english": "Fresh veggies make salads pop.", "thai": "ผักสดทำให้สลัดดูโดดเด่น"}
{"word": "salads", "english": "Salads are my go-to healthy meal.", "thai": "สลัดคือมื้ออาหารเพื่อสุขภาพที่ฉันเลือก"}
{"word": "healthy", "english": "A healthy lifestyle boosts energy.", "thai": "วิถีชีวิตเพื่อสุขภาพช่วยเพิ่มพลังงาน"}
{"word": "energy", "english": "Her energy lights up any room.", "thai": "พลังของเธอทำให้ทุกห้องสว่างไสว"}
{"word": "room", "english": "This room needs better lighting.", "thai": "ห้องนี้ต้องการแสงสว่างที่ดีกว่านี้"}
{"word": "lighting", "english": "Soft lighting creates a cozy atmosphere.", "thai": "แสงสว่างนุ่มนวลสร้างบรรยากาศอบอุ่น"}
{"word": "atmosphere", "english": "The restaurant’s atmosphere feels so inviting.", "thai": "บรรยากาศของร้านอาหารรู้สึกชวนเชิญ"}
{"word": "restaurant", "english": "This restaurant serves amazing pasta.", "thai": "ร้านอาหารนี้เสิร์ฟพาสต้าที่ยอดเยี่ยม"}
{"word": "pasta", "english": "Pasta with marinara is my favorite.", "thai": "พาสต้าซอสมารินาราคือของโปรดของฉัน"}
{"word": "favorite", "english": "My favorite book is a thriller.", "thai": "หนังสือเล่มโปรดของฉันเป็นแนวระทึกขวัญ"}
{"word": "book", "english": "Reading a book calms my nerves.", "thai": "การอ่านหนังสือช่วยให้ฉันสงบ"}
{"word": "nerves", "english": "Public speaking jangles my nerves.", "thai": "การพูดในที่สาธารณะทำให้ฉันตื่นเต้น"}
{"word": "speaking", "english": "Speaking confidently wins people over.", "thai": "การพูดอย่างมั่นใจดึงดูดผู้คน"}
{"word": "people", "english": "People love a good underdog story.", "thai": "ผู้คนรักเรื่องราวของผู้ที่เริ่มจากศูนย์"}
{"word": "story", "english": "Her life story inspires everyone.", "thai": "เรื่องราวชีวิตของเธอสร้างแรงบันดาลใจให้ทุกคน"}
{"word": "inspires", "english": "Great leadership inspires bold moves.", "thai": "ผู้นำที่ยอดเยี่ยมสร้างแรงบันดาลใจให้เกิดการเคลื่อนไหวที่กล้าหาญ"}
{"word": "leadership", "english": "Strong leadership drives team success.", "thai": "ผู้นำที่แข็งแกร่งขับเคลื่อนความสำเร็จของทีม"}
{"word": "success", "english": "Success tastes sweeter after hard work.", "thai": "ความสำเร็จรู้สึกหวานยิ่งขึ้นหลังจากทำงานหนัก"}
{"word": "work", "english": "Creative work fuels my passion.", "thai": "งานสร้างสรรค์จุดไฟให้ความหลงใหลของฉัน"}
{"word": "passion", "english": "Her passion for art is contagious.", "thai": "ความหลงใหลในศิลปะของเธอติดต่อกันได้"}
{"word": "art", "english": "Abstract art sparks deep thoughts.", "thai": "ศิลปะนามธรรมจุดประกายความคิดลึกซึ้ง"}
{"word": "thoughts", "english": "My thoughts wander during long drives.", "thai": "ความคิดของฉันล่องลอยระหว่างการขับรถนานๆ"}
{"word": "drives", "english": "Sunday drives relax me completely.", "thai": "การขับรถวันอาทิตย์ทำให้ฉันผ่อนคลายเต็มที่"}
{"word": "relax", "english": "A hot bath helps me relax.", "thai": "การอาบน้ำร้อนช่วยให้ฉันผ่อนคลาย"}
{"word": "bath", "english": "The bath was filled with bubbles.", "thai": "อ่างอาบน้ำเต็มไปด้วยฟอง"}
{"word": "bubbles", "english": "Blowing bubbles is fun for kids.", "thai": "การเป่าฟองสบู่สนุกสำหรับเด็กๆ"}
{"word": "kids", "english": "Kids playing outside bring joy.", "thai": "เด็กๆ ที่เล่นนอกบ้านนำความสุขมาให้"}
{"word": "joy", "english": "Her laugh spreads joy everywhere.", "thai": "เสียงหัวเราะของเธอแพร่กระจายความสุขไปทุกที่"}
{"word": "laugh", "english": "A good laugh lifts my spirits.", "thai": "การหัวเราะที่ดีช่วยยกระดับจิตใจของฉัน"}
{"word": "spirits", "english": "High spirits make parties unforgettable.", "thai": "อารมณ์ดีทำให้งานปาร์ตี้ไม่รู้ลืม"}
{"word": "parties", "english": "Costume parties are always a hit.", "thai": "งานปาร์ตี้แต่งตัวประสบความสำเร็จเสมอ"}
{"word": "costume", "english": "Her costume stole the show.", "thai": "ชุดของเธอเด่นสะดุดตาในงาน"}
{"word": "show", "english": "The talent show was pure entertainment.", "thai": "การแสดงความสามารถเป็นความบันเทิงล้วนๆ"}
{"word": "entertainment", "english": "Streaming movies is my favorite entertainment.", "thai": "การสตรีมภาพยนตร์คือความบันเทิงที่ฉันชอบ"}
{"word": "movies", "english": "Movies with twists keep me hooked.", "thai": "ภาพยนตร์ที่มีพล็อตหักมุมทำให้ฉันติดหนึบ"}
{"word": "twists", "english": "Plot twists make stories exciting.", "thai": "พล็อตหักมุมทำให้เรื่องราวน่าตื่นเต้น"}
{"word": "stories", "english": "Bedtime stories soothe my kids.", "thai": "นิทานก่อนนอนช่วยปลอบเด็กๆ ของฉัน"}
{"word": "kids", "english": "Kids love exploring new playgrounds.", "thai": "เด็กๆ ชอบสำรวจสนามเด็กเล่นใหม่ๆ"}
{"word": "playgrounds", "english": "Playgrounds are full of happy screams.", "thai": "สนามเด็กเล่นเต็มไปด้วยเสียงกรี๊ดแห่งความสุข"}
{"word": "happy", "english": "A happy heart makes life brighter.", "thai": "หัวใจที่มีความสุขทำให้ชีวิตสว่างไสว"}
{"word": "heart", "english": "Her kind heart touches everyone.", "thai": "หัวใจที่เมตตาของเธอทำให้ทุกคนประทับใจ"}
{"word": "everyone", "english": "Everyone loves a good barbecue.", "thai": "ทุกคนรักการปิ้งย่างดีๆ"}
{"word": "barbecue", "english": "The barbecue sauce was tangy and sweet.", "thai": "ซอสบาร์บีคิวมีรสเปรี้ยวหวาน"}
{"word": "sauce", "english": "This sauce makes pasta irresistible.", "thai": "ซอสนี้ทำให้พาสต้าเย้ายวนใจ"}
{"word": "pasta", "english": "I’m craving pasta for dinner tonight.", "thai": "ฉันอยากกินพาสต้าสำหรับมื้อเย็นคืนนี้"}
{"word": "dinner", "english": "Dinner parties bring friends closer.", "thai": "งานเลี้ยงอาหารค่ำทำให้เพื่อนสนิทกันมากขึ้น"}
{"word": "friends", "english": "Friends sharing stories create lasting memories.", "thai": "เพื่อนที่แบ่งปันเรื่องราวสร้างความทรงจำที่ยาวนาน"}
{"word": "memories", "english": "Childhood memories flood back at reunions.", "thai": "ความทรงจำวัยเด็กท่วมท้นในงานรวมตัว"}
{"word": "reunions", "english": "Family reunions are full of laughter.", "thai": "งานรวมญาติเต็มไปด้วยเสียงหัวเราะ"}
{"word": "laughter", "english": "Laughter is the best stress reliever.", "thai": "เสียงหัวเราะคือตัวคลายเครียดที่ดีที่สุด"}
{"word": "stress", "english": "Work stress can mess with sleep.", "thai": "ความเครียดจากงานอาจรบกวนการนอน"}
{"word": "sleep", "english": "Good sleep boosts my mood daily.", "thai": "การนอนหลับดีช่วยยกระดับอารมณ์ของฉันทุกวัน"}
{"word": "mood", "english": "A sunny mood brightens any day.", "thai": "อารมณ์ที่สดใสทำให้ทุกวันสว่างไสว"}
{"word": "day", "english": "A rainy day calls for cozy blankets.", "thai": "วันที่ฝนตกต้องใช้ผ้าห่มแสนอบอุ่น"}
{"word": "blankets", "english": "Blankets and hot cocoa make winter perfect.", "thai": "ผ้าห่มและโกโก้ร้อนทำให้หน้าหนาวสมบูรณ์แบบ"}
{"word": "winter", "english": "Winter sports get my adrenaline pumping.", "thai": "กีฬาฤดูหนาวทำให้อะดรีนาลีนของฉันสูบฉีด"}
{"word": "sports", "english": "Watching sports unites the whole family.", "thai": "การดูกีฬาทำให้ครอบครัวรวมตัวกัน"}
{"word": "family", "english": "Family vacations are always an adventure.", "thai": "วันหยุดกับครอบครัวคือการผจญภัยเสมอ"}
{"word": "adventure", "english": "An adventure in the mountains feels epic.", "thai": "การผจญภัยในภูเขารู้สึกยิ่งใหญ่"}
{"word": "mountains", "english": "The mountains look stunning at sunrise.", "thai": "ภูเขาดูสวยงามตอนพระอาทิตย์ขึ้น"}
{"word": "sunrise", "english": "Watching the sunrise inspires my day.", "thai": "การดูพระอาทิตย์ขึ้นสร้างแรงบันดาลใจให้วันของฉัน"}
{"word": "inspires", "english": "Her courage inspires bold decisions.", "thai": "ความกล้าของเธอสร้างแรงบันดาลใจให้การตัดสินใจที่กล้าหาญ"}
{"word": "decisions", "english": "Tough decisions shape our future.", "thai": "การตัดสินใจที่ยากลำบากกำหนดอนาคตของเรา"}
{"word": "future", "english": "The future holds endless possibilities.", "thai": "อนาคตเต็มไปด้วยความเป็นไปได้ไม่รู้จบ"}
{"word": "possibilities", "english": "New possibilities excite my creativity.", "thai": "ความเป็นไปได้ใหม่ๆ กระตุ้นความคิดสร้างสรรค์ของฉัน"}
{"word": "creativity", "english": "Creativity flows when I’m relaxed.", "thai": "ความคิดสร้างสรรค์ไหลลื่นเมื่อฉันผ่อนคลาย"}
{"word": "relaxed", "english": "A relaxed vibe makes weekends perfect.", "thai": "บรรยากาศผ่อนคลายทำให้สุดสัปดาห์สมบูรณ์แบบ"}
{"word": "weekends", "english": "Weekends are for binge-watching shows.", "thai": "สุดสัปดาห์คือเวลาดูซีรีส์แบบมาราธอน"}
{"word": "shows", "english": "Reality shows are my guilty pleasure.", "thai": "รายการเรียลลิตี้คือความสุขเล็กๆ ของฉัน"}
{"word": "pleasure", "english": "Cooking brings me so much pleasure.", "thai": "การทำอาหารทำให้ฉันมีความสุขมาก"}
{"word": "cooking", "english": "Cooking spicy dishes is my forte.", "thai": "การทำอาหารเผ็ดคือจุดเด่นของฉัน"}
{"word": "dishes", "english": "New dishes at the restaurant impressed me.", "thai": "เมนูใหม่ที่ร้านอาหารทำให้ฉันประทับใจ"}
{"word": "restaurant", "english": "The restaurant’s ambiance is so inviting.", "thai": "บรรยากาศของร้านอาหารชวนเชิญมาก"}
{"word": "ambiance", "english": "Candlelit ambiance sets a romantic mood.", "thai": "บรรยากาศแสงเทียนสร้างอารมณ์โรแมนติก"}
{"word": "mood", "english": "Her cheerful mood lifts everyone’s spirits.", "thai": "อารมณ์ร่าเริงของเธอยกระดับจิตใจของทุกคน"}
{"word": "spirits", "english": "High spirits make parties unforgettable.", "thai": "จิตใจที่เบิกบานทำให้งานปาร์ตี้ไม่รู้ลืม"}
{"word": "parties", "english": "Beach parties are the summer vibe.", "thai": "งานปาร์ตี้ชายหาดคือบรรยากาศหน้าร้อน"}
{"word": "summer", "english": "Summer nights call for stargazing.", "thai": "คืนหน้าร้อนเหมาะสำหรับการดูดาว"}
{"word": "stargazing", "english": "Stargazing feels magical with friends.", "thai": "การดูดาวรู้สึกมหัศจรรย์เมื่ออยู่กับเพื่อน"}
{"word": "friends", "english": "Friends make every trip more fun.", "thai": "เพื่อนทำให้ทุกทริปสนุกยิ่งขึ้น"}
{"word": "trip", "english": "A road trip sparks spontaneous adventures.", "thai": "ทริปถนนจุดประกายการผจญภัยที่ไม่คาดคิด"}
{"word": "adventures", "english": "Outdoor adventures recharge my energy.", "thai": "การผจญภัยกลางแจ้งเติมพลังให้ฉัน"}
{"word": "energy", "english": "Her boundless energy inspires the team.", "thai": "พลังอันไร้ขอบเขตของเธอสร้างแรงบันดาลใจให้ทีม"}
{"word": "team", "english": "The team nailed the project deadline.", "thai": "ทีมจัดการเดดไลน์โปรเจกต์ได้เยี่ยม"}
{"word": "project", "english": "This project demands creative solutions.", "thai": "โปรเจกต์นี้ต้องการโซลูชันที่สร้างสรรค์"}
{"word": "solutions", "english": "Smart solutions save time and effort.", "thai": "โซลูชันที่ชาญฉลาดช่วยประหยัดเวลาและความพยายาม"}
{"word": "time", "english": "Time flies when I’m painting.", "thai": "เวลาผ่านไปเร็วเมื่อฉันวาดภาพ"}
{"word": "painting", "english": "Painting landscapes calms my soul.", "thai": "การวาดภาพทิวทัศน์ทำให้จิตใจฉันสงบ"}
{"word": "soul", "english": "Music feeds my soul every day.", "thai": "ดนตรีหล่อเลี้ยงจิตใจของฉันทุกวัน"}
{"word": "music", "english": "Live music electrifies the crowd.", "thai": "ดนตรีสดทำให้ฝูงชนตื่นเต้น"}
{"word": "crowd", "english": "The crowd cheered at the festival.", "thai": "ฝูงชนส่งเสียงเชียร์ในงานเทศกาล"}
{"word": "festival", "english": "The food festival was a flavor explosion.", "thai": "งานเทศกาลอาหารเต็มไปด้วยรสชาติที่หลากหลาย"}
{"word": "food", "english": "Street food always hits the spot.", "thai": "อาหารข้างทางถูกใจทุกครั้ง"}
{"word": "spot", "english": "This picnic spot is absolutely perfect.", "thai": "จุดปิกนิกนี้สมบูรณ์แบบมาก"}
{"word": "picnic", "english": "A picnic by the lake sounds dreamy.", "thai": "การปิกนิกข้างทะเลสาบฟังดูเหมือนฝัน"}
{"word": "lake", "english": "The lake sparkles under the moonlight.", "thai": "ทะเลสาบระยิบระยับใต้แสงจันทร์"}
{"word": "moonlight", "english": "Moonlight walks are so romantic.", "thai": "การเดินเล่นใต้แสงจันทร์โรแมนติกมาก"}
{"word": "walks", "english": "Morning walks boost my productivity.", "thai": "การเดินตอนเช้าช่วยเพิ่มผลผลิตของฉัน"}
{"word": "productivity", "english": "Productivity hacks make work easier.", "thai": "เทคนิคเพิ่มผลผลิตทำให้งานง่ายขึ้น"}
{"word": "work", "english": "Hard work shapes a bright future.", "thai": "การทำงานหนักกำหนดอนาคตที่สดใส"}
{"word": "future", "english": "Future plans keep me motivated.", "thai": "แผนการในอนาคตทำให้ฉันมีแรงจูงใจ"}
{"word": "motivated", "english": "Staying motivated during challenges is tough.", "thai": "การรักษาแรงจูงใจในช่วงท้าทายนั้นยาก"}
{"word": "challenges", "english": "Challenges push me to grow stronger.", "thai": "ความท้าทายผลักดันให้ฉันเติบโตแข็งแกร่งขึ้น"}
{"word": "grow", "english": "Plants grow faster with good care.", "thai": "พืชเติบโตเร็วขึ้นด้วยการดูแลที่ดี"}
{"word": "care", "english": "Self-care improves my mental health.", "thai": "การดูแลตัวเองช่วยพัฒนาสุขภาพจิตของฉัน"}
{"word": "health", "english": "Good health is worth more than gold.", "thai": "สุขภาพดีมีค่ามากกว่าทอง"}
{"word": "gold", "english": "Gold jewelry sparkles at fancy events.", "thai": "เครื่องประดับทองระยิบระยับในงานหรู"}
{"word": "events", "english": "Charity events bring communities together.", "thai": "งานการกุศลทำให้ชุมชนรวมตัวกัน"}
{"word": "communities", "english": "Strong communities support each other.", "thai": "ชุมชนที่แข็งแกร่งสนับสนุนกันและกัน"}
{"word": "support", "english": "Her support during tough times meant everything.", "thai": "การสนับสนุนของเธอในช่วงเวลาที่ยากลำบากมีความหมายมาก"}
{"word": "times", "english": "Quiet times help me reflect deeply.", "thai": "ช่วงเวลาเงียบสงบช่วยให้ฉันไตร่ตรองอย่างลึกซึ้ง"}
{"word": "reflect", "english": "I reflect on my goals monthly.", "thai": "ฉันทบทวนเป้าหมายของตัวเองทุกเดือน"}
{"word": "goals", "english": "Clear goals drive my daily actions.", "thai": "เป้าหมายที่ชัดเจนขับเคลื่อนการกระทำประจำวันของฉัน"}
{"word": "actions", "english": "Small actions lead to big changes.", "thai": "การกระทำเล็กๆ นำไปสู่การเปลี่ยนแปลงใหญ่"}
{"word": "changes", "english": "Seasonal changes affect my mood.", "thai": "การเปลี่ยนแปลงตามฤดูกาลส่งผลต่ออารมณ์ของฉัน"}
{"word": "mood", "english": "A cheerful mood makes work fun.", "thai": "อารมณ์ร่าเริงทำให้งานสนุก"}
{"word": "work", "english": "Creative work sparks my imagination.", "thai": "งานสร้างสรรค์จุดประกายจินตนาการของฉัน"}
{"word": "imagination", "english": "Her imagination creates vivid stories.", "thai": "จินตนาการของเธอสร้างเรื่องราวที่ชัดเจน"}
{"word": "stories", "english": "Love stories always tug at heartstrings.", "thai": "เรื่องราวความรักมักกระตุกหัวใจ"}
{"word": "heartstrings", "english": "This song pulls at my heartstrings.", "thai": "เพลงนี้กระตุ้นอารมณ์ในใจฉัน"}
{"word": "song", "english": "A catchy song stays in my head.", "thai": "เพลงติดหูอยู่ในหัวฉันตลอด"}
{"word": "head", "english": "Clearing my head with yoga helps.", "thai": "การทำให้หัวโล่งด้วยโยคะช่วยได้"}
{"word": "yoga", "english": "Yoga sessions calm my busy mind.", "thai": "การฝึกโยคะช่วยให้จิตใจที่วุ่นวายของฉันสงบ"}
{"word": "mind", "english": "An open mind welcomes new ideas.", "thai": "ใจที่เปิดกว้างต้อนรับไอเดียใหม่ๆ"}
{"word": "ideas", "english": "Fresh ideas fuel team brainstorming.", "thai": "ไอเดียใหม่ๆ ขับเคลื่อนการระดมสมองของทีม"}
{"word": "team", "english": "Our team thrives on collaboration.", "thai": "ทีมของเราเติบโตด้วยการทำงานร่วมกัน"}
{"word": "collaboration", "english": "Collaboration makes projects more fun.", "thai": "การทำงานร่วมกันทำให้โปรเจกต์สนุกยิ่งขึ้น"}
{"word": "projects", "english": "Art projects unleash my creativity.", "thai": "โปรเจกต์ศิลปะปลดปล่อยความคิดสร้างสรรค์ของฉัน"}
{"word": "creativity", "english": "Creativity transforms boring spaces.", "thai": "ความคิดสร้างสรรค์เปลี่ยนพื้นที่ที่น่าเบื่อ"}
{"word": "spaces", "english": "Green spaces inspire outdoor activities.", "thai": "พื้นที่สีเขียวสร้างแรงบันดาลใจให้ทำกิจกรรมกลางแจ้ง"}
{"word": "activities", "english": "Fun activities keep kids engaged.", "thai": "กิจกรรมสนุกๆ ทำให้เด็กๆ มีส่วนร่วม"}
{"word": "kids", "english": "Kids love splashing in puddles.", "thai": "เด็กๆ ชอบเล่นน้ำในแอ่งน้ำ"}
{"word": "puddles", "english": "Puddles form after heavy rain.", "thai": "แอ่งน้ำเกิดขึ้นหลังฝนตกหนัก"}
{"word": "rain", "english": "Rain makes the garden bloom.", "thai": "ฝนทำให้สวนเบ่งบาน"}
{"word": "garden", "english": "My garden is my peaceful retreat.", "thai": "สวนของฉันคือที่หลบภัยอันเงียบสงบ"}
{"word": "peaceful", "english": "A peaceful morning sets the tone.", "thai": "เช้าที่เงียบสงบกำหนดอารมณ์วัน"}
{"word": "morning", "english": "Morning jogs energize my body.", "thai": "การวิ่งตอนเช้าทำให้ร่างกายของฉันมีพลัง"}
{"word": "body", "english": "Exercise strengthens my body daily.", "thai": "การออกกำลังกายทำให้ร่างกายของฉันแข็งแรงทุกวัน"}
{"word": "exercise", "english": "Daily exercise boosts my confidence.", "thai": "การออกกำลังกายทุกวันช่วยเพิ่มความมั่นใจของฉัน"}
{"word": "confidence", "english": "Confidence shines in her bold choices.", "thai": "ความมั่นใจเปล่งประกายในตัวเลือกที่กล้าหาญของเธอ"}
{"word": "bold", "english": "Her bold attitude inspires everyone around her.", "thai": "ทัศนคติที่กล้าหาญของเธอสร้างแรงบันดาลใจให้ทุกคนรอบตัว"}
{"word": "inspires", "english": "His speech inspires young minds to dream big.", "thai": "คำพูดของเขาสร้างแรงบันดาลใจให้เยาวชนฝันใหญ่"}
{"word": "dream", "english": "Chasing a dream takes courage and persistence.", "thai": "การไล่ตามความฝันต้องใช้ความกล้าและความพากเพียร"}
{"word": "courage", "english": "She faced the challenge with unwavering courage.", "thai": "เธอเผชิญหน้ากับความท้าทายด้วยความกล้าที่ไม่หวั่นไหว"}
{"word": "challenge", "english": "The coding challenge pushed his skills to the limit.", "thai": "ความท้าทายในการเขียนโค้ดผลักดันทักษะของเขาให้ถึงขีดสุด"}
{"word": "skills", "english": "Her culinary skills turned dinner into a feast.", "thai": "ทักษะการทำอาหารของเธอเปลี่ยนมื้อเย็นให้เป็นงานเลี้ยง"}
{"word": "dinner", "english": "They planned a cozy dinner by the fireplace.", "thai": "พวกเขาวางแผนมื้อเย็นแสนอบอุ่นข้างเตาผิง"}
{"word": "cozy", "english": "The cozy cabin was perfect for a winter escape.", "thai": "กระท่อมแสนอบอุ่นเหมาะสำหรับการพักผ่อนในฤดูหนาว"}
{"word": "escape", "english": "A weekend trip is the perfect escape from routine.", "thai": "การเดินทางช่วงสุดสัปดาห์เป็นการหลบหนีจากความจำเจที่สมบูรณ์แบบ"}
{"word": "trip", "english": "Their road trip across the country was unforgettable.", "thai": "การเดินทางข้ามประเทศของพวกเขาเป็นที่น่าจดจำ"}
{"word": "unforgettable", "english": "The concert was an unforgettable experience for fans.", "thai": "คอนเสิร์ตเป็นประสบการณ์ที่น่าจดจำสำหรับแฟนๆ"}
{"word": "experience", "english": "Her experience in design landed her the job.", "thai": "ประสบการณ์ด้านการออกแบบของเธอทำให้ได้งาน"}
{"word": "job", "english": "His new job requires working late hours.", "thai": "งานใหม่ของเขาต้องทำงานจนดึก"}
{"word": "hours", "english": "She spent hours perfecting her dance routine.", "thai": "เธอใช้เวลาหลายชั่วโมงเพื่อฝึกซ้อมท่าเต้นให้สมบูรณ์แบบ"}
{"word": "dance", "english": "The dance floor was packed with energetic movers.", "thai": "ฟลอร์เต้นรำเต็มไปด้วยนักเต้นที่เปี่ยมพลัง"}
{"word": "energetic", "english": "His energetic vibe lights up any room.", "thai": "พลังอันเปี่ยมล้นของเขาทำให้ทุกห้องสว่างไสว"}
{"word": "room", "english": "The room buzzed with creative ideas during the meeting.", "thai": "ห้องนั้นเต็มไปด้วยความคิดสร้างสรรค์ระหว่างการประชุม"}
{"word": "ideas", "english": "Her innovative ideas transformed the company’s strategy.", "thai": "แนวคิดนวัตกรรมของเธอเปลี่ยนกลยุทธ์ของบริษัท"}
{"word": "strategy", "english": "A solid strategy helped them win the game.", "thai": "กลยุทธ์ที่แข็งแกร่งช่วยให้พวกเขาชนะเกม"}
{"word": "game", "english": "The chess game tested their patience and wit.", "thai": "เกมหมากรุกทดสอบความอดทนและไหวพริบของพวกเขา"}
{"word": "patience", "english": "Teaching kids requires endless patience and care.", "thai": "การสอนเด็กต้องใช้ความอดทนและความเอาใจใส่อย่างไม่สิ้นสุด"}
{"word": "care", "english": "She handled the project with utmost care.", "thai": "เธอจัดการโปรเจกต์ด้วยความระมัดระวังอย่างที่สุด"}
{"word": "project", "english": "The science project won first place at the fair.", "thai": "โครงงานวิทยาศาสตร์ชนะรางวัลที่หนึ่งในงานนิทรรศการ"}
{"word": "place", "english": "They found a quiet place to study for exams.", "thai": "พวกเขาหาสถานที่เงียบสงบเพื่ออ่านหนังสือสอบ"}
{"word": "study", "english": "Her study of ancient history fascinated the class.", "thai": "การศึกษาประวัติศาสตร์โบราณของเธอทำให้นักเรียนหลงใหล"}
{"word": "history", "english": "The museum showcased the history of local tribes.", "thai": "พิพิธภัณฑ์จัดแสดงประวัติศาสตร์ของชนเผ่าท้องถิ่น"}
{"word": "museum", "english": "A visit to the museum sparked his curiosity.", "thai": "การเยี่ยมชมพิพิธภัณฑ์จุดประกายความอยากรู้อยากเห็นของเขา"}
{"word": "curiosity", "english": "Her curiosity about space led to a science career.", "thai": "ความอยากรู้อยากเห็นเกี่ยวกับอวกาศนำเธอไปสู่อาชีพด้านวิทยาศาสตร์"}
{"word": "career", "english": "His career in music took off after the tour.", "thai": "อาชีพด้านดนตรีของเขาพุ่งแรงหลังจากการทัวร์"}
{"word": "music", "english": "The music at the festival was absolutely electric.", "thai": "ดนตรีในงานเทศกาลนั้นเร้าใจสุดๆ"}
{"word": "festival", "english": "The food festival drew crowds from all over.", "thai": "งานเทศกาลอาหารดึงดูดผู้คนจากทุกที่"}
{"word": "food", "english": "Her love for spicy food surprised her friends.", "thai": "ความรักในอาหารรสเผ็ดของเธอทำให้เพื่อนๆ ประหลาดใจ"}
{"word": "friends", "english": "Good friends make every adventure more fun.", "thai": "เพื่อนที่ดีทำให้ทุกการผจญภัยสนุกยิ่งขึ้น"}
{"word": "adventure", "english": "Their hiking adventure revealed stunning views.", "thai": "การผจญภัยเดินป่าของพวกเขาเผยให้เห็นวิวที่สวยงาม"}
{"word": "views", "english": "The mountain views left them speechless.", "thai": "วิวภูเขาทำให้พวกเขาพูดไม่ออก"}
{"word": "mountain", "english": "Climbing the mountain was a life-changing feat.", "thai": "การปีนเขาคือความสำเร็จที่เปลี่ยนชีวิต"}
{"word": "feat", "english": "Her feat of juggling work and school amazed everyone.", "thai": "ความสามารถในการจัดการงานและการเรียนของเธอทำให้ทุกคนทึ่ง"}
{"word": "school", "english": "The school talent show was a huge hit.", "thai": "การแสดงความสามารถของโรงเรียนได้รับความนิยมอย่างมาก"}
{"word": "talent", "english": "His talent for painting earned him a scholarship.", "thai": "พรสวรรค์ด้านการวาดภาพทำให้เขาได้รับทุนการศึกษา"}
{"word": "painting", "english": "The painting in the gallery told a powerful story.", "thai": "ภาพวาดในแกลเลอรีบอกเล่าเรื่องราวอันทรงพลัง"}
{"word": "story", "english": "Her bedtime story calmed the restless kids.", "thai": "นิทานก่อนนอนของเธอทำให้เด็กๆ ที่กระสับกระส่ายสงบลง"}
{"word": "kids", "english": "The kids built a fort out of blankets.", "thai": "เด็กๆ สร้างป้อมจากผ้าห่ม"}
{"word": "blankets", "english": "Warm blankets made the chilly night cozy.", "thai": "ผ้าห่มอุ่นๆ ทำให้คืนที่หนาวเย็นอบอุ่น"}
{"word": "night", "english": "The starry night inspired a romantic walk.", "thai": "คืนที่เต็มไปด้วยดวงดาวสร้างแรงบันดาลใจให้เดินเล่นอย่างโรแมนติก"}
{"word": "walk", "english": "A morning walk boosts her energy for the day.", "thai": "การเดินยามเช้าช่วยเพิ่มพลังให้เธอตลอดวัน"}
{"word": "energy", "english": "His boundless energy kept the party alive.", "thai": "พลังที่ไร้ขีดจำกัดของเขาทำให้งานปาร์ตี้คึกคัก"}
{"word": "party", "english": "The surprise party was planned in secret.", "thai": "งานปาร์ตี้เซอร์ไพรส์ถูกวางแผนอย่างลับๆ"}
{"word": "secret", "english": "She kept her recipe a closely guarded secret.", "thai": "เธอเก็บสูตรอาหารไว้เป็นความลับอย่างดี"}
{"word": "recipe", "english": "His family recipe for soup warmed everyone’s hearts.", "thai": "สูตรอาหารครอบครัวของเขาสำหรับซุปทำให้ทุกคนอบอุ่นใจ"}
{"word": "soup", "english": "A bowl of hot soup comforted her cold.", "thai": "ชามซุปร้อนๆ ช่วยบรรเทาอาการหวัดของเธอ"}
{"word": "cold", "english": "The cold weather called for thick sweaters.", "thai": "สภาพอากาศหนาวเย็นเรียกร้องให้ใส่เสื้อกันหนาวหนาๆ"}
{"word": "sweaters", "english": "Knitting sweaters became her favorite hobby.", "thai": "การถักเสื้อกันหนาวกลายเป็นงานอดิเรกที่เธอชื่นชอบ"}
{"word": "hobby", "english": "His hobby of collecting coins fascinated visitors.", "thai": "งานอดิเรกสะสมเหรียญของเขาทำให้ผู้มาเยือนหลงใหล"}
{"word": "coins", "english": "Old coins revealed stories of forgotten eras.", "thai": "เหรียญเก่าเล่าเรื่องราวของยุคที่ถูกลืม"}
{"word": "stories", "english": "Grandma’s stories about her youth were captivating.", "thai": "เรื่องเล่าของคุณยายเกี่ยวกับวัยเด็กของเธอน่าหลงใหล"}
{"word": "youth", "english": "The youth group organized a charity run.", "thai": "กลุ่มเยาวชนจัดการวิ่งการกุศล"}
{"word": "charity", "english": "Her charity work uplifted the entire community.", "thai": "งานการกุศลของเธอยกระดับชุมชนทั้งหมด"}
{"word": "community", "english": "The community rallied to clean the park.", "thai": "ชุมชนรวมตัวกันเพื่อทำความสะอาดสวนสาธารณะ"}
{"word": "park", "english": "Kids played tag in the sunny park.", "thai": "เด็กๆ เล่นวิ่งไล่จับในสวนสาธารณะที่แดดจ้า"}
{"word": "sunny", "english": "A sunny day lifted everyone’s spirits.", "thai": "วันที่แดดจ้าทำให้ทุกคนอารมณ์ดี"}
{"word": "spirits", "english": "High spirits fueled their late-night chats.", "thai": "จิตใจที่เบิกบานขับเคลื่อนการพูดคุยยามดึกของพวกเขา"}
{"word": "chats", "english": "Online chats connected friends across continents.", "thai": "การแชทออนไลน์เชื่อมโยงเพื่อนข้ามทวีป"}
{"word": "friends", "english": "Close friends share secrets without fear.", "thai": "เพื่อนสนิทแบ่งปันความลับโดยไม่กลัว"}
{"word": "secrets", "english": "Uncovering secrets in the old diary was thrilling.", "thai": "การค้นพบความลับในไดอารี่เก่าน่าตื่นเต้น"}
{"word": "diary", "english": "Her diary held thoughts too personal to share.", "thai": "ไดอารี่ของเธอเก็บความคิดที่เป็นส่วนตัวเกินกว่าจะแบ่งปัน"}
{"word": "thoughts", "english": "His thoughts wandered during the boring lecture.", "thai": "ความคิดของเขาเร่ร่อนระหว่างการบรรยายที่น่าเบื่อ"}
{"word": "lecture", "english": "The professor’s lecture sparked lively debates.", "thai": "การบรรยายของศาสตราจารย์จุดประกายการถกเถียงอย่างคึกคัก"}
{"word": "debates", "english": "Political debates heated up the election season.", "thai": "การถกเถียงทางการเมืองทำให้ฤดูการเลือกตั้งร้อนแรง"}
{"word": "election", "english": "The election results shocked the entire nation.", "thai": "ผลการเลือกตั้งทำให้ทั้งชาติตกตะลึง"}
{"word": "nation", "english": "The nation celebrated its independence with pride.", "thai": "ชาติเฉลิมฉลองความเป็นอิสระด้วยความภาคภูมิใจ"}
{"word": "pride", "english": "Her pride in her work shone through.", "thai": "ความภูมิใจในงานของเธอเปล่งประกายออกมา"}
{"word": "work", "english": "Hard work earned him a well-deserved promotion.", "thai": "การทำงานหนักทำให้เขาได้รับการเลื่อนตำแหน่งที่สมควร"}
{"word": "promotion", "english": "The promotion came with a corner office.", "thai": "การเลื่อนตำแหน่งมาพร้อมกับห้องทำงานมุม"}
{"word": "office", "english": "The office buzzed with deadline-driven energy.", "thai": "สำนักงานเต็มไปด้วยพลังที่ขับเคลื่อนด้วยกำหนดเวลา"}
{"word": "deadline", "english": "Meeting the deadline required all-night effort.", "thai": "การทำตามกำหนดเวลาต้องใช้ความพยายามทั้งคืน"}
{"word": "effort", "english": "Her effort in training paid off big time.", "thai": "ความพยายามในการฝึกซ้อมของเธอได้ผลตอบแทนมหาศาล"}
{"word": "training", "english": "The training session improved their teamwork skills.", "thai": "เซสชันการฝึกอบรมปรับปรุงทักษะการทำงานเป็นทีมของพวกเขา"}
{"word": "teamwork", "english": "Teamwork made the project a huge success.", "thai": "การทำงานเป็นทีมทำให้โปรเจกต์ประสบความสำเร็จอย่างมาก"}
{"word": "success", "english": "Her success story motivated aspiring entrepreneurs.", "thai": "เรื่องราวความสำเร็จของเธอสร้างแรงบันดาลใจให้ผู้ประกอบการหน้าใหม่"}
{"word": "entrepreneurs", "english": "Young entrepreneurs pitched bold ideas to investors.", "thai": "ผู้ประกอบการหนุ่มสาวนำเสนอแนวคิดที่กล้าหาญต่อนักลงทุน"}
{"word": "investors", "english": "Investors were impressed by her startup’s growth.", "thai": "นักลงทุนประทับใจกับการเติบโตของสตาร์ทอัพของเธอ"}
{"word": "growth", "english": "The garden’s growth amazed the new gardener.", "thai": "การเติบโตของสวนทำให้ชาวสวนใหม่ประหลาดใจ"}
{"word": "garden", "english": "Her garden bloomed with vibrant flowers.", "thai": "สวนของเธอเบ่งบานด้วยดอกไม้สีสันสดใส"}
{"word": "flowers", "english": "Fresh flowers brightened the dull room.", "thai": "ดอกไม้สดทำให้ห้องที่ทึบทมัยสว่างไสว"}
{"word": "room", "english": "The cozy room invited hours of relaxation.", "thai": "ห้องแสนอบอุ่นเชิญชวนให้พักผ่อนเป็นชั่วโมง"}
{"word": "relaxation", "english": "Yoga brought her a sense of relaxation.", "thai": "โยคะนำความรู้สึกผ่อนคลายมาให้เธอ"}
{"word": "sense", "english": "His keen sense of humor won her over.", "thai": "อารมณ์ขันที่เฉียบแหลมของเขาทำให้เธอหลงใหล"}
{"word": "humor", "english": "Her humor kept the team in high spirits.", "thai": "อารมณ์ขันของเธอทำให้ทีมมีจิตใจที่เบิกบาน"}
{"word": "team", "english": "The team collaborated to solve the puzzle.", "thai": "ทีมทำงานร่วมกันเพื่อแก้ปริศนา"}
{"word": "puzzle", "english": "The crossword puzzle stumped even the experts.", "thai": "ปริศนาอักษรไขว้ทำให้แม้แต่ผู้เชี่ยวชาญยังงง"}
{"word": "experts", "english": "Experts predicted a rise in tech stocks.", "thai": "ผู้เชี่ยวชาญคาดการณ์ว่าหุ้นเทคโนโลยีจะพุ่งสูง"}
{"word": "tech", "english": "The tech conference showcased cutting-edge gadgets.", "thai": "การประชุมเทคโนโลยีจัดแสดงอุปกรณ์ล้ำสมัย"}
{"word": "gadgets", "english": "New gadgets made her kitchen more efficient.", "thai": "อุปกรณ์ใหม่ทำให้ครัวของเธอมีประสิทธิภาพมากขึ้น"}
{"word": "kitchen", "english": "The kitchen smelled of freshly baked bread.", "thai": "ครัวมีกลิ่นหอมของขนมปังอบใหม่"}
{"word": "bread", "english": "Homemade bread paired perfectly with soup.", "thai": "ขนมปังทำเองเข้ากันได้อย่างลงตัวกับซุป"}
{"word": "soup", "english": "Spicy soup warmed them on a chilly evening.", "thai": "ซุปรสเผ็ดทำให้พวกเขาอบอุ่นในเย็นที่หนาวเย็น"}
{"word": "evening", "english": "The evening breeze carried scents of jasmine.", "thai": "สายลมยามเย็นพัดพากลิ่นมะลิมา"}
{"word": "breeze", "english": "A cool breeze refreshed the hiking group.", "thai": "สายลมเย็นๆ ทำให้กลุ่มเดินป่าสดชื่น"}
{"word": "cool", "english": "The cool air from the fan was a relief.", "thai": "อากาศเย็นจากพัดลมช่วยให้รู้สึกโล่งใจ"}
{"word": "fan", "english": "The old fan rattled but still worked fine.", "thai": "พัดลมเก่าร้องดังแต่ยังทำงานได้ดี"}
{"word": "worked", "english": "She worked tirelessly to meet the tight deadline.", "thai": "เธอทำงานอย่างไม่รู้จักเหน็ดเหนื่อยเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "Missing the deadline cost them the contract.", "thai": "การพลาดกำหนดเวลาทำให้พวกเขาเสียสัญญา"}
{"word": "contract", "english": "The contract negotiation dragged on for weeks.", "thai": "การเจรจาสัญญายืดเยื้อไปหลายสัปดาห์"}
{"word": "negotiation", "english": "His negotiation skills sealed the business deal.", "thai": "ทักษะการเจรจาของเขาทำให้ข้อตกลงทางธุรกิจสำเร็จ"}
{"word": "deal", "english": "They struck a deal to share the profits.", "thai": "พวกเขาตกลงแบ่งปันผลกำไร"}
{"word": "profits", "english": "The startup’s profits soared after the launch.", "thai": "กำไรของสตาร์ทอัพพุ่งสูงหลังการเปิดตัว"}
{"word": "launch", "english": "The product launch drew a huge crowd.", "thai": "การเปิดตัวผลิตภัณฑ์ดึงดูดฝูงชนจำนวนมาก"}
{"word": "crowd", "english": "The crowd cheered loudly at the game’s end.", "thai": "ฝูงชนส่งเสียงเชียร์ดังลั่นเมื่อเกมจบ"}
{"word": "cheered", "english": "Fans cheered as the band took the stage.", "thai": "แฟนๆ ส่งเสียงเชียร์เมื่อวงดนตรีขึ้นเวที"}
{"word": "stage", "english": "Her performance on stage left everyone speechless.", "thai": "การแสดงบนเวทีของเธอทำให้ทุกคนตะลึง"}
{"word": "performance", "english": "His performance in the play earned rave reviews.", "thai": "การแสดงในละครของเขาได้รับคำวิจารณ์ชื่นชม"}
{"word": "reviews", "english": "Online reviews helped her choose the best restaurant.", "thai": "รีวิวออนไลน์ช่วยให้เธอเลือกร้านอาหารที่ดีที่สุด"}
{"word": "restaurant", "english": "The new restaurant serves authentic Thai cuisine.", "thai": "ร้านอาหารใหม่เสิร์ฟอาหารไทยแท้"}
{"word": "cuisine", "english": "Her love for Italian cuisine inspired her cooking.", "thai": "ความรักในอาหารอิตาเลียนสร้างแรงบันดาลใจให้เธอทำอาหาร"}
{"word": "cooking", "english": "Cooking together brought the family closer.", "thai": "การทำอาหารด้วยกันทำให้ครอบครัวใกล้ชิดกันมากขึ้น"}
{"word": "family", "english": "The family reunion was filled with laughter.", "thai": "การรวมตัวของครอบครัวเต็มไปด้วยเสียงหัวเราะ"}
{"word": "laughter", "english": "Her infectious laughter brightened the gloomy day.", "thai": "เสียงหัวเราะที่ติดต่อของเธอทำให้วันอันหม่นหมองสว่างขึ้น"}
{"word": "day", "english": "A sunny day called for a beach trip.", "thai": "วันที่แดดจ้าชวนให้ไปเที่ยวชายหาด"}
{"word": "beach", "english": "The beach was perfect for a sunset stroll.", "thai": "ชายหาดเหมาะสำหรับการเดินเล่นยามพระอาทิตย์ตก"}
{"word": "sunset", "english": "The sunset painted the sky in vibrant hues.", "thai": "พระอาทิตย์ตกแต่งท้องฟ้าด้วยสีสันสดใส"}
{"word": "sky", "english": "Stars twinkled in the clear night sky.", "thai": "ดวงดาวระยิบระยับในท้องฟ้ายามค่ำคืนที่แจ่มใส"}
{"word": "night", "english": "The night market buzzed with excited shoppers.", "thai": "ตลาดกลางคืนคึกคักไปด้วยนักช้อปที่ตื่นเต้น"}
{"word": "shoppers", "english": "Shoppers hunted for deals during the sale.", "thai": "นักช้อปตามล่าหาดีลในช่วงลดราคา"}
{"word": "sale", "english": "The big sale attracted bargain hunters citywide.", "thai": "การลดราคาครั้งใหญ่ดึงดูดนักล่าดีลทั่วเมือง"}
{"word": "bargain", "english": "She found a bargain on vintage clothes.", "thai": "เธอเจอของถูกสำหรับเสื้อผ้าวินเทจ"}
{"word": "clothes", "english": "New clothes boosted her confidence for the interview.", "thai": "เสื้อผ้าใหม่เพิ่มความมั่นใจให้เธอสำหรับการสัมภาษณ์"}
{"word": "interview", "english": "The job interview went better than expected.", "thai": "การสัมภาษณ์งานดีเกินกว่าที่คาดไว้"}
{"word": "job", "english": "His dream job involved traveling the world.", "thai": "งานในฝันของเขาคือการเดินทางรอบโลก"}
{"word": "traveling", "english": "Traveling abroad opened her eyes to new cultures.", "thai": "การเดินทางไปต่างประเทศเปิดโลกทัศน์ของเธอต่อวัฒนธรรมใหม่"}
{"word": "cultures", "english": "Learning about different cultures enriched her perspective.", "thai": "การเรียนรู้เกี่ยวกับวัฒนธรรมที่แตกต่างทำให้มุมมองของเธอกว้างขึ้น"}
{"word": "perspective", "english": "His perspective on life changed after volunteering.", "thai": "มุมมองต่อชีวิตของเขาเปลี่ยนไปหลังจากเป็นอาสาสมัคร"}
{"word": "volunteering", "english": "Volunteering at the shelter taught her compassion.", "thai": "การเป็นอาสาสมัครที่ศูนย์พักพิงสอนให้เธอมีความเห็นอกเห็นใจ"}
{"word": "compassion", "english": "Her compassion for animals led to rescue efforts.", "thai": "ความเห็นอกเห็นใจต่อสัตว์ทำให้เธอเริ่มช่วยเหลือสัตว์"}
{"word": "animals", "english": "The farm animals roamed freely in the fields.", "thai": "สัตว์ในฟาร์มเดินเตร่อย่างอิสระในท้องทุ่ง"}
{"word": "fields", "english": "Golden fields stretched as far as the eye could see.", "thai": "ทุ่งสีทองทอดยาวไกลสุดสายตา"}
{"word": "eye", "english": "Her sharp eye caught every detail in the design.", "thai": "สายตาอันเฉียบคมของเธอจับทุกรายละเอียดในงานออกแบบ"}
{"word": "design", "english": "The sleek design of the car turned heads.", "thai": "การออกแบบที่โฉบเฉี่ยวของรถทำให้ทุกคนหันมอง"}
{"word": "car", "english": "The car raced down the highway at dusk.", "thai": "รถพุ่งไปบนทางหลวงยามพลบค่ำ"}
{"word": "highway", "english": "The highway was jammed with rush-hour traffic.", "thai": "ทางหลวงติดขัดด้วยการจราจรในชั่วโมงเร่งด่วน"}
{"word": "traffic", "english": "Navigating city traffic requires patience and skill.", "thai": "การขับรถในเมืองต้องใช้ความอดทนและทักษะ"}
{"word": "patience", "english": "Patience is key when teaching young kids.", "thai": "ความอดทนคือกุญแจสำคัญในการสอนเด็กเล็ก"}
{"word": "kids", "english": "The kids giggled during the silly puppet show.", "thai": "เด็กๆ หัวเราะคิกคักระหว่างการแสดงหุ่นเชิดสุดฮา"}
{"word": "show", "english": "The comedy show had everyone in stitches.", "thai": "การแสดงตลกทำให้ทุกคนขำจนท้องแข็ง"}
{"word": "comedy", "english": "Her comedy routine poked fun at daily life.", "thai": "การแสดงตลกของเธอล้อเลียนชีวิตประจำวัน"}
{"word": "life", "english": "A balanced life keeps stress at bay.", "thai": "ชีวิตที่สมดุลช่วยลดความเครียด"}
{"word": "stress", "english": "Work stress pushed him to try meditation.", "thai": "ความเครียดจากงานผลักดันให้เขาลองนั่งสมาธิ"}
{"word": "meditation", "english": "Meditation brought calm to her busy mornings.", "thai": "การนั่งสมาธินำความสงบมาสู่เช้าที่วุ่นวายของเธอ"}
{"word": "mornings", "english": "Crisp fall mornings called for hot coffee.", "thai": "เช้าฤดูใบไม้ร่วงที่สดชื่นชวนให้ดื่มกาแฟร้อน"}
{"word": "coffee", "english": "The coffee shop was a hub for creatives.", "thai": "ร้านกาแฟเป็นศูนย์รวมของคนสร้างสรรค์"}
{"word": "creatives", "english": "Creatives brainstormed ideas for the ad campaign.", "thai": "คนสร้างสรรค์ระดมความคิดสำหรับแคมเปญโฆษณา"}
{"word": "campaign", "english": "The election campaign energized young voters.", "thai": "แคมเปญเลือกตั้งสร้างพลังให้ผู้มีสิทธิเลือกตั้งรุ่นเยาว์"}
{"word": "voters", "english": "Voters lined up early to cast their ballots.", "thai": "ผู้มีสิทธิเลือกตั้งต่อแถวแต่เช้าเพื่อลงคะแนน"}
{"word": "ballots", "english": "Counting ballots took longer than expected.", "thai": "การนับคะแนนใช้เวลานานกว่าที่คาด"}
{"word": "expected", "english": "The party exceeded what everyone expected.", "thai": "งานปาร์ตี้เกินความคาดหวังของทุกคน"}
{"word": "party", "english": "The costume party was a spooky success.", "thai": "งานปาร์ตี้ชุดแฟนซีประสบความสำเร็จอย่างน่าขนลุก"}
{"word": "success", "english": "Her success in debate won her a scholarship.", "thai": "ความสำเร็จในการโต้วาทีทำให้เธอได้ทุนการศึกษา"}
{"word": "scholarship", "english": "The scholarship covered her college tuition costs.", "thai": "ทุนการศึกษาครอบคลุมค่าเล่าเรียนในวิทยาลัยของเธอ"}
{"word": "college", "english": "College life taught him independence and grit.", "thai": "ชีวิตในวิทยาลัยสอนให้เขาเป็นอิสระและเข้มแข็ง"}
{"word": "independence", "english": "Financial independence gave her freedom to explore.", "thai": "อิสรภาพทางการเงินให้อิสระแก่เธอในการสำรวจ"}
{"word": "freedom", "english": "Freedom to create fueled his artistic passion.", "thai": "อิสรภาพในการสร้างสรรค์จุดไฟให้กับความหลงใหลในศิลปะของเขา"}
{"word": "passion", "english": "Her passion for music shone in every note.", "thai": "ความหลงใหลในดนตรีของเธอเปล่งประกายในทุกโน้ต"}
{"word": "music", "english": "Live music filled the festival with energy.", "thai": "ดนตรีสดทำให้งานเทศกาลเต็มไปด้วยพลัง"}
{"word": "festival", "english": "The film festival showcased indie gems.", "thai": "เทศกาลภาพยนตร์จัดแสดงผลงานอินดี้ที่น่าประทับใจ"}
{"word": "film", "english": "The old film captured the charm of the 80s.", "thai": "ภาพยนตร์เก่าจับเสน่ห์ของยุค 80 ได้"}
{"word": "charm", "english": "Her charm won over even the toughest critics.", "thai": "เสน่ห์ของเธอชนะใจแม้แต่นักวิจารณ์ที่เข้มงวดที่สุด"}
{"word": "critics", "english": "Critics praised the novel’s bold narrative.", "thai": "นักวิจารณ์ชื่นชมการเล่าเรื่องที่กล้าหาญของนิยาย"}
{"word": "novel", "english": "The novel kept her up past midnight.", "thai": "นิยายทำให้นอนดึกเกินเที่ยงคืน"}
{"word": "midnight", "english": "Midnight snacks fueled their late-night study session.", "thai": "ของว่างเที่ยงคืนช่วยเติมพลังให้เซสชันเรียนดึก"}
{"word": "study", "english": "Her study of marine life inspired conservation efforts.", "thai": "การศึกษาชีวิตในทะเลของเธอสร้างแรงบันดาลใจให้การอนุรักษ์"}
{"word": "conservation", "english": "Conservation programs saved the endangered species.", "thai": "โปรแกรมอนุรักษ์ช่วยรักษาสายพันธุ์ที่ใกล้สูญพันธุ์"}
{"word": "species", "english": "Rare species thrived in the protected forest.", "thai": "สายพันธุ์หายากเจริญเติบโตในป่าที่ได้รับการคุ้มครอง"}
{"word": "forest", "english": "The forest trail led to a hidden waterfall.", "thai": "เส้นทางในป่านำไปสู่น้ำตกที่ซ่อนอยู่"}
{"word": "waterfall", "english": "The waterfall’s roar echoed through the valley.", "thai": "เสียงคำรามของน้ำตกดังก้องไปทั่วหุบเขา"}
{"word": "valley", "english": "The valley bloomed with wildflowers in spring.", "thai": "หุบเขาเบ่งบานด้วยดอกไม้ป่าในฤดูใบไม้ผลิ"}
{"word": "wildflowers", "english": "Wildflowers added color to the hiking path.", "thai": "ดอกไม้ป่านำสีสันมาสู่เส้นทางเดินป่า"}
{"word": "path", "english": "The narrow path wound through ancient ruins.", "thai": "เส้นทางแคบคดเคี้ยวผ่านซากปรักหักพังโบราณ"}
{"word": "ruins", "english": "Exploring the ruins felt like stepping into history.", "thai": "การสำรวจซากปรักหักพังเหมือนก้าวเข้าสู่ประวัติศาสตร์"}
{"word": "history", "english": "History lessons sparked his curiosity about the past.", "thai": "บทเรียนประวัติศาสตร์จุดประกายความอยากรู้เกี่ยวกับอดีต"}
{"word": "curiosity", "english": "Her curiosity led to unexpected discoveries.", "thai": "ความอยากรู้ของเธอนำไปสู่การค้นพบที่ไม่คาดคิด"}
{"word": "discoveries", "english": "Scientific discoveries reshaped our understanding of space.", "thai": "การค้นพบทางวิทยาศาสตร์เปลี่ยนความเข้าใจของเราเกี่ยวกับอวกาศ"}
{"word": "space", "english": "The vast space of the desert felt endless.", "thai": "พื้นที่อันกว้างใหญ่ของทะเลทรายเหมือนไม่มีที่สิ้นสุด"}
{"word": "desert", "english": "The desert bloomed after rare rainfall.", "thai": "ทะเลทรายเบ่งบานหลังฝนตกที่หายาก"}
{"word": "rainfall", "english": "Heavy rainfall delayed the outdoor wedding.", "thai": "ฝนตกหนักทำให้งานแต่งงานกลางแจ้งล่าช้า"}
{"word": "wedding", "english": "The wedding cake was a sugary masterpiece.", "thai": "เค้กแต่งงานเป็นผลงานชิ้นเอกหวานฉ่ำ"}
{"word": "cake", "english": "Baking a cake filled the house with sweetness.", "thai": "การอบเค้กทำให้บ้านเต็มไปด้วยกลิ่นหอมหวาน"}
{"word": "house", "english": "The old house creaked with every step.", "thai": "บ้านเก่าเอี๊ยดทุกครั้งที่ก้าวเดิน"}
{"word": "step", "english": "Each step up the mountain tested their endurance.", "thai": "ทุกย่างก้าวขึ้นเขาทดสอบความอดทนของพวกเขา"}
{"word": "endurance", "english": "Her endurance in the marathon amazed spectators.", "thai": "ความอดทนของเธอในมาราธอนทำให้ผู้ชมทึ่ง"}
{"word": "marathon", "english": "Training for the marathon took months of dedication.", "thai": "การฝึกซ้อมสำหรับมาราธอนใช้เวลาหลายเดือนแห่งความทุ่มเท"}
{"word": "dedication", "english": "His dedication to art produced stunning works.", "thai": "ความทุ่มเทในศิลปะของเขาสร้างผลงานที่น่าทึ่ง"}
{"word": "art", "english": "Street art transformed the city’s dull walls.", "thai": "ศิลปะข้างถนนเปลี่ยนกำแพงเมืองที่ทึบให้มีชีวิต"}
{"word": "city", "english": "The city skyline glowed under the moonlight.", "thai": "เส้นขอบฟ้าของเมืองส่องสว่างภายใต้แสงจันทร์"}
{"word": "moonlight", "english": "Moonlight danced on the calm lake’s surface.", "thai": "แสงจันทร์เต้นระยิบระยับบนผิวน้ำทะเลสาบที่สงบ"}
{"word": "lake", "english": "The lake reflected the vibrant autumn trees.", "thai": "ทะเลสาบสะท้อนต้นไม้ฤดูใบไม้ร่วงที่สดใส"}
{"word": "trees", "english": "Tall trees shaded the quiet picnic spot.", "thai": "ต้นไม้สูงให้ร่มเงาแก่จุดปิกนิกที่เงียบสงบ"}
{"word": "picnic", "english": "The picnic was packed with homemade treats.", "thai": "ปิกนิกเต็มไปด้วยของว่างทำเอง"}
{"word": "treats", "english": "Halloween treats delighted the neighborhood kids.", "thai": "ของว่างวันฮาโลวีนทำให้เด็กๆ ในละแวกนั้นดีใจ"}
{"word": "kids", "english": "Kids raced to collect the most candy.", "thai": "เด็กๆ แข่งกันเก็บลูกอมให้ได้มากที่สุด"}
{"word": "candy", "english": "The candy store offered a rainbow of flavors.", "thai": "ร้านลูกอมมีรสชาติหลากหลายเหมือนรุ้งกินน้ำ"}
{"word": "store", "english": "The vintage store sold rare vinyl records.", "thai": "ร้านวินเทจขายแผ่นเสียงหายาก"}
{"word": "records", "english": "Her collection of records impressed music buffs.", "thai": "คอลเลกชันแผ่นเสียงของเธอทำให้คอเพลงประทับใจ"}
{"word": "music", "english": "Live music echoed through the bustling festival.", "thai": "ดนตรีสดดังก้องในงานเทศกาลที่คึกคัก"}
{"word": "festival", "english": "The harvest festival celebrated local traditions.", "thai": "เทศกาลเก็บเกี่ยวเฉลิมฉลองประเพณีท้องถิ่น"}
{"word": "traditions", "english": "Family traditions shaped her holiday memories.", "thai": "ประเพณีครอบครัวหล่อหลอมความทรงจำวันหยุดของเธอ"}
{"word": "memories", "english": "Old memories flooded back at the reunion.", "thai": "ความทรงจำเก่าๆ ท่วมท้นกลับมาในงานรวมตัว"}
{"word": "reunion", "english": "The class reunion sparked nostalgic conversations.", "thai": "งานรวมรุ่นจุดประกายการสนทนาที่เต็มไปด้วยความหลัง"}
{"word": "conversations", "english": "Late-night conversations deepened their friendship.", "thai": "การสนทนาดึกดื่นทำให้มิตรภาพของพวกเขาแน่นแฟ้นยิ่งขึ้น"}
{"word": "friendship", "english": "Their friendship grew stronger through shared adventures.", "thai": "มิตรภาพของพวกเขาแข็งแกร่งขึ้นผ่านการผจญภัยร่วมกัน"}
{"word": "adventures", "english": "Outdoor adventures filled their summer with excitement.", "thai": "การผจญภัยกลางแจ้งทำให้ฤดูร้อนของพวกเขาเต็มไปด้วยความตื่นเต้น"}
{"word": "summer", "english": "Summer camp taught kids teamwork and resilience.", "thai": "ค่ายฤดูร้อนสอนเด็กๆ เรื่องการทำงานเป็นทีมและความยืดหยุ่น"}
{"word": "teamwork", "english": "Teamwork turned their project into a masterpiece.", "thai": "การทำงานเป็นทีมเปลี่ยนโปรเจกต์ของพวกเขาให้เป็นผลงานชิ้นเอก"}
{"word": "project", "english": "The science project amazed the school fair.", "thai": "โครงงานวิทยาศาสตร์ทำให้งานนิทรรศการโรงเรียนน่าทึ่ง"}
{"word": "school", "english": "School debates honed her public speaking skills.", "thai": "การโต้วาทีในโรงเรียนฝึกฝนทักษะการพูดในที่สาธารณะของเธอ"}
{"word": "skills", "english": "Her coding skills landed her a tech internship.", "thai": "ทักษะการเขียนโค้ดทำให้เธอได้ฝึกงานด้านเทคโนโลยี"}
{"word": "internship", "english": "The internship offered hands-on industry experience.", "thai": "การฝึกงานมอบประสบการณ์ปฏิบัติจริงในอุตสาหกรรม"}
{"word": "experience", "english": "Traveling abroad was a life-changing experience.", "thai": "การเดินทางไปต่างประเทศเป็นประสบการณ์ที่เปลี่ยนชีวิต"}
{"word": "traveling", "english": "Traveling by train revealed stunning countryside views.", "thai": "การเดินทางโดยรถไฟเผยให้เห็นวิวชนบทที่สวยงาม"}
{"word": "views", "english": "The rooftop views took their breath away.", "thai": "วิวจากดาดฟ้าทำให้พวกเขาตะลึง"}
{"word": "rooftop", "english": "The rooftop party buzzed with vibrant energy.", "thai": "งานปาร์ตี้บนดาดฟ้าเต็มไปด้วยพลังอันคึกคัก"}
{"word": "energy", "english": "Her boundless energy inspired the whole team.", "thai": "พลังที่ไร้ขีดจำกัดของเธอสร้างแรงบันดาลใจให้ทั้งทีม"}
{"word": "team", "english": "The soccer team celebrated their hard-fought victory.", "thai": "ทีมฟุตบอลเฉลิมฉลองชัยชนะที่ได้มาด้วยความยากลำบาก"}
{"word": "victory", "english": "The sweet taste of victory fueled their ambition.", "thai": "รสชาติอันหอมหวานของชัยชนะกระตุ้นความทะเยอทะยานของพวกเขา"}
{"word": "ambition", "english": "Her ambition drove her to start a business.", "thai": "ความทะเยอทะยานผลักดันให้เธอเริ่มต้นธุรกิจ"}
{"word": "business", "english": "The small business thrived despite tough competition.", "thai": "ธุรกิจขนาดเล็กเจริญรุ่งเรืองแม้มีการแข่งขันที่ดุเดือด"}
{"word": "competition", "english": "The dance competition showcased incredible talent.", "thai": "การแข่งขันเต้นรำแสดงให้เห็นถึงพรสวรรค์ที่น่าทึ่ง"}
{"word": "talent", "english": "Her talent for storytelling captivated the audience.", "thai": "พรสวรรค์ในการเล่าเรื่องของเธอดึงดูดผู้ฟัง"}
{"word": "audience", "english": "The audience roared with applause after the show.", "thai": "ผู้ชมส่งเสียงปรบมือดังลั่นหลังการแสดง"}
{"word": "show", "english": "The magic show left kids wide-eyed with wonder.", "thai": "การแสดงมายากลทำให้เด็กๆ ตื่นตาตื่นใจ"}
{"word": "wonder", "english": "A sense of wonder filled her at the museum.", "thai": "ความรู้สึกประหลาดใจเต็มเปี่ยมในตัวเธอที่พิพิธภัณฑ์"}
{"word": "museum", "english": "The museum’s artifacts told stories of ancient times.", "thai": "โบราณวัตถุของพิพิธภัณฑ์เล่าเรื่องราวของยุคโบราณ"}
{"word": "stories", "english": "Bedtime stories sparked her imagination every night.", "thai": "นิทานก่อนนอนจุดประกายจินตนาการของเธอทุกคืน"}
{"word": "imagination", "english": "His vivid imagination created fantastical worlds.", "thai": "จินตนาการอันสดใสของเขาสร้างโลกแห่งแฟนตาซี"}
{"word": "worlds", "english": "Exploring new worlds through books was her passion.", "thai": "การสำรวจโลกใหม่ผ่านหนังสือคือความหลงใหลของเธอ"}
{"word": "passion", "english": "Her passion for baking produced delicious cakes.", "thai": "ความหลงใหลในการอบขนมของเธอสร้างเค้กแสนอร่อย"}
{"word": "cakes", "english": "The bakery’s cakes were the talk of the town.", "thai": "เค้กของร้านเบเกอรี่กลายเป็นที่พูดถึงทั่วเมือง"}
{"word": "town", "english": "The quiet town welcomed tourists with open arms.", "thai": "เมืองเล็กๆ ที่เงียบสงบต้อนรับนักท่องเที่ยวด้วยความอบอุ่น"}
{"word": "tourists", "english": "Tourists flocked to the ancient temple ruins.", "thai": "นักท่องเที่ยวแห่กันไปที่ซากปรักหักพังของวัดโบราณ"}
{"word": "temple", "english": "The temple’s serene atmosphere calmed her mind.", "thai": "บรรยากาศอันเงียบสงบของวัดทำให้จิตใจของเธอสงบ"}
{"word": "mind", "english": "A clear mind helped him solve the puzzle.", "thai": "จิตใจที่ปลอดโปร่งช่วยให้เขาแก้ปริศนาได้"}
{"word": "puzzle", "english": "The crossword puzzle stumped even the sharpest minds.", "thai": "ปริศนาอักษรไขว้ทำให้แม้แต่คนที่เฉียบแหลมที่สุดยังงง"}
{"word": "minds", "english": "Great minds collaborated on the innovative project.", "thai": "มันสมองชั้นยอดร่วมมือกันในโปรเจกต์นวัตกรรม"}
{"word": "project", "english": "The art project transformed the community center.", "thai": "โปรเจกต์ศิลปะเปลี่ยนศูนย์ชุมชนให้ดีขึ้น"}
{"word": "community", "english": "The community rallied to support the local charity.", "thai": "ชุมชนรวมตัวกันเพื่อสนับสนุนการกุศลท้องถิ่น"}
{"word": "charity", "english": "Her charity event raised funds for homeless shelters.", "thai": "งานการกุศลของเธอระดมทุนให้ศูนย์พักพิงคนไร้บ้าน"}
{"word": "funds", "english": "The funds secured new equipment for the school.", "thai": "เงินทุนที่ได้มาซื้ออุปกรณ์ใหม่ให้โรงเรียน"}
{"word": "equipment", "english": "Camping equipment made their trip more comfortable.", "thai": "อุปกรณ์แคมป์ปิ้งทำให้การเดินทางของพวกเขาสะดวกสบายยิ่งขึ้น"}
{"word": "trip", "english": "The road trip across the coast was unforgettable.", "thai": "การเดินทางข้ามชายฝั่งเป็นที่น่าจดจำ"}
{"word": "coast", "english": "The rugged coast offered breathtaking hiking trails.", "thai": "ชายฝั่งที่ขรุขระมีเส้นทางเดินป่าที่น่าทึ่ง"}
{"word": "trails", "english": "Mountain trails challenged even seasoned hikers.", "thai": "เส้นทางบนเขาท้าทายแม้แต่นักเดินป่าที่ช่ำชอง"}
{"word": "hikers", "english": "Hikers paused to admire the vibrant wildflowers.", "thai": "นักเดินป่าหยุดเพื่อชื่นชมดอกไม้ป่าสีสันสดใส"}
{"word": "wildflowers", "english": "Wildflowers dotted the meadow in early spring.", "thai": "ดอกไม้ป่าประดับทุ่งหญ้าในต้นฤดูใบไม้ผลิ"}
{"word": "spring", "english": "Spring showers brought life to the dry valley.", "thai": "ฝนในฤดูใบไม้ผลินำชีวิตมาสู่หุบเขาแห้งแล้ง"}
{"word": "valley", "english": "The valley echoed with the sound of birds.", "thai": "หุบเขาดังก้องด้วยเสียงนก"}
{"word": "birds", "english": "Colorful birds perched on the ancient oak tree.", "thai": "นกสีสันสดใสเกาะอยู่บนต้นโอ๊กโบราณ"}
{"word": "tree", "english": "The tree’s shade offered relief from the heat.", "thai": "ร่มเงาของต้นไม้ช่วยคลายร้อน"}
{"word": "heat", "english": "The summer heat called for ice-cold lemonade.", "thai": "ความร้อนในฤดูร้อนชวนให้ดื่มน้ำมะนาวเย็นฉ่ำ"}
{"word": "lemonade", "english": "Homemade lemonade refreshed the picnic guests.", "thai": "น้ำมะนาวทำเองทำให้แขกในงานปิกนิกสดชื่น"}
{"word": "picnic", "english": "The picnic by the lake was pure bliss.", "thai": "ปิกนิกข้างทะเลสาบคือความสุขล้วนๆ"}
{"word": "lake", "english": "The calm lake mirrored the starry night sky.", "thai": "ทะเลสาบที่สงบสะท้อนท้องฟ้ายามค่ำคืนที่เต็มไปด้วยดวงดาว"}
{"word": "sky", "english": "The clear sky promised perfect weather for hiking.", "thai": "ท้องฟ้าแจ่มใสสัญญาถึงสภาพอากาศที่สมบูรณ์แบบสำหรับการเดินป่า"}
{"word": "weather", "english": "Stormy weather canceled the outdoor concert.", "thai": "สภาพอากาศที่มีพายุยกเลิกคอนเสิร์ตกลางแจ้ง"}
{"word": "concert", "english": "The rock concert kept the crowd buzzing.", "thai": "คอนเสิร์ตร็อกทำให้ฝูงชนคึกคัก"}
{"word": "crowd", "english": "The crowd gathered for the annual parade.", "thai": "ฝูงชนรวมตัวกันเพื่อขบวนพาเหรดประจำปี"}
{"word": "parade", "english": "The parade featured colorful floats and bands.", "thai": "ขบวนพาเหรดมีรถประดับสีสันและวงดนตรี"}
{"word": "bands", "english": "Local bands played lively tunes at the fair.", "thai": "วงดนตรีท้องถิ่นเล่นเพลงสนุกๆ ในงานเทศกาล"}
{"word": "fair", "english": "The county fair offered thrilling rides and games.", "thai": "งานเทศกาลประจำเมืองมีเครื่องเล่นและเกมที่น่าตื่นเต้น"}
{"word": "games", "english": "Board games brought the family together on weekends.", "thai": "เกมกระดานทำให้ครอบครัวใกล้ชิดกันในวันหยุดสุดสัปดาห์"}
{"word": "family", "english": "Family dinners were filled with laughter and stories.", "thai": "มื้อค่ำของครอบครัวเต็มไปด้วยเสียงหัวเราะและเรื่องเล่า"}
{"word": "laughter", "english": "Her infectious laughter lit up the dull room.", "thai": "เสียงหัวเราะที่ติดต่อของเธอทำให้ห้องที่ทึบสว่างไสว"}
{"word": "room", "english": "The cozy room was perfect for reading novels.", "thai": "ห้องแสนอบอุ่นเหมาะสำหรับการอ่านนิยาย"}
{"word": "novels", "english": "Mystery novels kept her hooked until dawn.", "thai": "นิยายลึกลับทำให้เธอติดหนึบจนถึงรุ่งสาง"}
{"word": "dawn", "english": "The dawn hike revealed a stunning sunrise.", "thai": "การเดินป่ายามรุ่งสางเผยให้เห็นพระอาทิตย์ขึ้นที่สวยงาม"}
{"word": "sunrise", "english": "The sunrise painted the horizon with soft pinks.", "thai": "พระอาทิตย์ขึ้นแต่งแต้มขอบฟ้าด้วยสีชมพูอ่อน"}
{"word": "horizon", "english": "The endless horizon inspired dreams of adventure.", "thai": "ขอบฟ้าที่ไม่มีที่สิ้นสุดจุดประกายฝันถึงการผจญภัย"}
{"word": "adventure", "english": "The jungle adventure tested their survival skills.", "thai": "การผจญภัยในป่าทดสอบทักษะการเอาชีวิตรอดของพวกเขา"}
{"word": "skills", "english": "Her photography skills captured nature’s beauty.", "thai": "ทักษะการถ่ายภาพของเธอจับความงามของธรรมชาติ"}
{"word": "nature", "english": "Nature walks soothed her restless spirit.", "thai": "การเดินในธรรมชาติช่วยปลอบประโลมจิตใจที่กระสับกระส่ายของเธอ"}
{"word": "spirit", "english": "Her adventurous spirit led her to new places.", "thai": "จิตวิญญาณที่รักการผจญภัยนำเธอไปสู่สถานที่ใหม่ๆ"}
{"word": "places", "english": "Hidden places in the city held secret charm.", "thai": "สถานที่ซ่อนอยู่ในเมืองมีเสน่ห์ลับ"}
{"word": "charm", "english": "The old bookstore’s charm drew curious readers.", "thai": "เสน่ห์ของร้านหนังสือเก่าดึงดูดนักอ่านที่อยากรู้อยากเห็น"}
{"word": "readers", "english": "Readers gathered for the author’s book signing.", "thai": "นักอ่านรวมตัวกันเพื่องานลงนามหนังสือของผู้เขียน"}
{"word": "book", "english": "The book club discussed their latest read.", "thai": "ชมรมหนังสือหารือเกี่ยวกับหนังสือเล่มล่าสุดที่อ่าน"}
{"word": "club", "english": "The jazz club buzzed with soulful melodies.", "thai": "คลับแจ๊สคึกคักด้วยทำนองที่เต็มไปด้วยจิตวิญญาณ"}
{"word": "melodies", "english": "Soft melodies drifted from the open window.", "thai": "ทำนองนุ่มนวลลอยมาจากหน้าต่างที่เปิดอยู่"}
{"word": "window", "english": "The window offered a view of bustling streets.", "thai": "หน้าต่างเผยให้เห็นถนนที่คึกคัก"}
{"word": "streets", "english": "The streets came alive during the night market.", "thai": "ถนนมีชีวิตชีวาในช่วงตลาดกลางคืน"}
{"word": "market", "english": "The farmer’s market sold fresh organic produce.", "thai": "ตลาดเกษตรกรขายผลิตผลออร์แกนิกสดใหม่"}
{"word": "produce", "english": "Fresh produce inspired her to cook daily.", "thai": "ผลิตผลสดใหม่สร้างแรงบันดาลใจให้เธอทำอาหารทุกวัน"}
{"word": "cook", "english": "Learning to cook Thai curry was a delight.", "thai": "การเรียนทำแกงกะทิไทยเป็นความสุข"}
{"word": "curry", "english": "The spicy curry warmed their chilly evening.", "thai": "แกงรสเผ็ดทำให้เย็นที่หนาวเย็นอบอุ่นขึ้น"}
{"word": "evening", "english": "The evening breeze carried scents of blooming flowers.", "thai": "สายลมยามเย็นพัดพากลิ่นหอมของดอกไม้ที่กำลังบาน"}
{"word": "flowers", "english": "Bright flowers decorated the wedding venue.", "thai": "ดอกไม้สีสันสดใสประดับสถานที่จัดงานแต่งงาน"}
{"word": "wedding", "english": "The wedding vows brought tears to everyone’s eyes.", "thai": "คำสาบานในงานแต่งงานทำให้น้ำตาคลอในตาทุกคน"}
{"word": "tears", "english": "Tears of joy marked their long-awaited reunion.", "thai": "น้ำตาแห่งความสุขบ่งบอกถึงการรวมตัวที่รอคอยมานาน"}
{"word": "reunion", "english": "The family reunion sparked heartfelt memories.", "thai": "การรวมตัวของครอบครัวจุดประกายความทรงจำอันอบอุ่น"}
{"word": "memories", "english": "Childhood memories flooded back during the visit.", "thai": "ความทรงจำวัยเด็กท่วมท้นกลับมาระหว่างการเยี่ยมเยือน"}
{"word": "childhood", "english": "Childhood games filled their afternoons with joy.", "thai": "เกมในวัยเด็กทำให้บ่ายของพวกเขาเต็มไปด้วยความสุข"}
{"word": "games", "english": "Board games brought friends together for laughs.", "thai": "เกมกระดานทำให้เพื่อนๆ รวมตัวกันเพื่อหัวเราะ"}
{"word": "friends", "english": "Close friends shared secrets over coffee.", "thai": "เพื่อนสนิทแบ่งปันความลับขณะดื่มกาแฟ"}
{"word": "coffee", "english": "Morning coffee fueled her busy workday.", "thai": "กาแฟยามเช้าเติมพลังให้วันทำงานที่วุ่นวายของเธอ"}
{"word": "workday", "english": "A hectic workday called for a relaxing evening.", "thai": "วันทำงานที่วุ่นวายชวนให้มีค่ำคืนที่ผ่อนคลาย"}
{"word": "evening", "english": "The evening concert drew a lively crowd.", "thai": "คอนเสิร์ตยามเย็นดึงดูดฝูงชนที่คึกคัก"}
{"word": "crowd", "english": "The crowd cheered wildly at the soccer match.", "thai": "ฝูงชนส่งเสียงเชียร์อย่างเมามันในเกมฟุตบอล"}
{"word": "match", "english": "The chess match tested their strategic minds.", "thai": "การแข่งขันหมากรุกทดสอบจิตใจที่ชาญฉลาดของพวกเขา"}
{"word": "minds", "english": "Creative minds sparked innovation at the workshop.", "thai": "จิตใจที่สร้างสรรค์จุดประกายนวัตกรรมในเวิร์กช็อป"}
{"word": "innovation", "english": "Her innovation revolutionized the tech industry.", "thai": "นวัตกรรมของเธอปฏิวัติวงการเทคโนโลยี"}
{"word": "industry", "english": "The fashion industry embraced bold new trends.", "thai": "อุตสาหกรรมแฟชั่นยอมรับเทรนด์ใหม่ที่กล้าหาญ"}
{"word": "trends", "english": "Social media trends shaped their marketing plan.", "thai": "เทรนด์โซเชียลมีเดียกำหนดแผนการตลาดของพวกเขา"}
{"word": "plan", "english": "Their vacation plan included a mountain hike.", "thai": "แผนวันหยุดของพวกเขารวมถึงการเดินป่าบนเขา"}
{"word": "hike", "english": "The sunrise hike offered breathtaking views.", "thai": "การเดินป่ายามรุ่งสางมอบวิวที่สวยงามตระการตา"}
{"word": "views", "english": "Ocean views calmed her restless spirit.", "thai": "วิวทะเลทำให้จิตใจที่กระสับกระส่ายของเธอสงบลง"}
{"word": "spirit", "english": "Her adventurous spirit led to epic travels.", "thai": "จิตวิญญาณที่รักการผจญภัยนำเธอไปสู่การเดินทางสุดยิ่งใหญ่"}
{"word": "travels", "english": "Her travels inspired a bestselling travel blog.", "thai": "การเดินทางของเธอสร้างแรงบันดาลใจให้บล็อกท่องเที่ยวขายดี"}
{"word": "blog", "english": "The food blog raved about local street eats.", "thai": "บล็อกอาหารยกย่องอาหารริมทางท้องถิ่น"}
{"word": "food", "english": "Spicy food challenged his taste buds daily.", "thai": "อาหารรสเผ็ดท้าทายต่อมรับรสของเขาทุกวัน"}
{"word": "taste", "english": "Her refined taste elevated the party’s decor.", "thai": "รสนิยมที่ประณีตของเธอยกระดับการตกแต่งงานปาร์ตี้"}
{"word": "party", "english": "The costume party was a howling success.", "thai": "งานปาร์ตี้ชุดแฟนซีประสบความสำเร็จอย่างยิ่งใหญ่"}
{"word": "success", "english": "Her success in coding landed a dream job.", "thai": "ความสำเร็จในการเขียนโค้ดทำให้เธอได้งานในฝัน"}
{"word": "job", "english": "The new job demanded long hours but paid well.", "thai": "งานใหม่ต้องการเวลาทำงานนานแต่ได้ค่าตอบแทนดี"}
{"word": "hours", "english": "Hours spent painting produced a stunning canvas.", "thai": "ชั่วโมงที่ใช้ในการวาดภาพสร้างผลงานผ้าใบที่น่าทึ่ง"}
{"word": "canvas", "english": "The blank canvas awaited her creative brushstrokes.", "thai": "ผ้าใบเปล่ารอจังหวะแปรงที่สร้างสรรค์ของเธอ"}
{"word": "creative", "english": "Her creative writing won a literary award.", "thai": "งานเขียนเชิงสร้างสรรค์ของเธอคว้ารางวัลวรรณกรรม"}
{"word": "award", "english": "The award ceremony honored local heroes.", "thai": "พิธีมอบรางวัลให้เกียรติแก่ฮีโร่ท้องถิ่น"}
{"word": "heroes", "english": "Firefighters are the unsung heroes of our city.", "thai": "นักผจญเพลิงคือวีรบุรุษที่ไม่ได้รับการยกย่องของเมืองเรา"}
{"word": "city", "english": "The city skyline sparkled under the moonlight.", "thai": "เส้นขอบฟ้าของเมืองส่องประกายใต้แสงจันทร์"}
{"word": "moonlight", "english": "Moonlight walks by the lake were romantic.", "thai": "การเดินเล่นใต้แสงจันทร์ข้างทะเลสาบแสนโรแมนติก"}
{"word": "lake", "english": "The lake reflected the vibrant autumn colors.", "thai": "ทะเลสาบสะท้อนสีสันฤดูใบไม้ร่วงที่สดใส"}
{"word": "colors", "english": "Bright colors adorned the festival’s main stage.", "thai": "สีสันสดใสประดับเวทีหลักของงานเทศกาล"}
{"word": "stage", "english": "Her solo on stage left the audience speechless.", "thai": "การแสดงเดี่ยวบนเวทีของเธอทำให้ผู้ชมตะลึง"}
{"word": "audience", "english": "The audience clapped wildly for the comedian.", "thai": "ผู้ชมปรบมืออย่างเมามันให้กับนักแสดงตลก"}
{"word": "comedian", "english": "The comedian’s jokes hit every punchline perfectly.", "thai": "มุกตลกของนักแสดงตลกโดนใจทุกประโยค"}
{"word": "jokes", "english": "His silly jokes lightened the tense meeting.", "thai": "มุกตลกโง่ๆ ของเขาทำให้การประชุมที่ตึงเครียดผ่อนคลายลง"}
{"word": "meeting", "english": "The team meeting sparked fresh project ideas.", "thai": "การประชุมทีมจุดประกายไอเดียโปรเจกต์ใหม่ๆ"}
{"word": "ideas", "english": "Her bold ideas reshaped the company’s strategy.", "thai": "แนวคิดที่กล้าหาญของเธอเปลี่ยนกลยุทธ์ของบริษัท"}
{"word": "strategy", "english": "A clever strategy won them the debate.", "thai": "กลยุทธ์ที่ชาญฉลาดทำให้พวกเขาชนะการโต้วาที"}
{"word": "debate", "english": "The heated debate captivated the entire room.", "thai": "การโต้วาทีที่ดุเดือดดึงดูดทุกคนในห้อง"}
{"word": "room", "english": "The cozy room was perfect for book club.", "thai": "ห้องแสนอบอุ่นเหมาะสำหรับชมรมหนังสือ"}
{"word": "book", "english": "The mystery book kept her up all night.", "thai": "หนังสือลึกลับทำให้นอนดึกทั้งคืน"}
{"word": "night", "english": "The starry night inspired poetic thoughts.", "thai": "คืนที่เต็มไปด้วยดวงดาวสร้างแรงบันดาลใจให้ความคิดกวี"}
{"word": "thoughts", "english": "Her deep thoughts fueled philosophical discussions.", "thai": "ความคิดลึกซึ้งของเธอขับเคลื่อนการสนทนาเชิงปรัชญา"}
{"word": "discussions", "english": "Late-night discussions bonded the study group.", "thai": "การสนทนาดึกดื่นทำให้กลุ่มเรียนรู้สนิทกัน"}
{"word": "group", "english": "The hiking group tackled the steep trail.", "thai": "กลุ่มเดินป่าต่อสู้กับเส้นทางชัน"}
{"word": "trail", "english": "The forest trail led to a hidden waterfall.", "thai": "เส้นทางในป่านำไปสู่น้ำตกที่ซ่อนอยู่"}
{"word": "waterfall", "english": "The waterfall’s mist cooled the hot afternoon.", "thai": "ละอองน้ำตกทำให้บ่ายที่ร้อนเย็นลง"}
{"word": "afternoon", "english": "A lazy afternoon called for iced tea.", "thai": "บ่ายที่ขี้เกียจชวนให้ดื่มชาเย็น"}
{"word": "tea", "english": "Herbal tea soothed her after a long day.", "thai": "ชาสมุนไพรปลอบประโลมเธอหลังจากวันอันยาวนาน"}
{"word": "day", "english": "The rainy day kept them indoors with movies.", "thai": "วันที่ฝนตกทำให้พวกเขาอยู่ในบ้านดูหนัง"}
{"word": "movies", "english": "Classic movies played at the outdoor cinema.", "thai": "หนังคลาสสิกฉายที่โรงภาพยนตร์กลางแจ้ง"}
{"word": "cinema", "english": "The cinema was packed for the blockbuster premiere.", "thai": "โรงภาพยนตร์แน่นขนัดสำหรับรอบปฐมทัศน์ภาพยนตร์ดัง"}
{"word": "premiere", "english": "The premiere event glittered with celebrity glamour.", "thai": "งานรอบปฐมทัศน์ส่องประกายด้วยความเย้ายวนของคนดัง"}
{"word": "celebrity", "english": "A celebrity sighting caused a frenzy downtown.", "thai": "การพบเห็นคนดังทำให้เกิดความโกลาหลในเมือง"}
{"word": "downtown", "english": "Downtown cafes buzzed with weekend crowds.", "thai": "ร้านกาแฟในเมืองคึกคักไปด้วยฝูงชนช่วงสุดสัปดาห์"}
{"word": "crowds", "english": "Crowds gathered to watch the street performers.", "thai": "ฝูงชนรวมตัวกันเพื่อดูนักแสดงข้างถนน"}
{"word": "performers", "english": "Street performers juggled fire with ease.", "thai": "นักแสดงข้างถนนเล่นกลกับไฟอย่างง่ายดาย"}
{"word": "fire", "english": "The fire crackled warmly in the cozy cabin.", "thai": "ไฟลุกโชนอย่างอบอุ่นในกระท่อมแสนสบาย"}
{"word": "cabin", "english": "The mountain cabin offered a quiet retreat.", "thai": "กระท่อมบนเขามอบสถานที่พักผ่อนอันเงียบสงบ"}
{"word": "retreat", "english": "The yoga retreat restored her inner peace.", "thai": "การพักผ่อนแบบโยคะฟื้นฟูความสงบภายในของเธอ"}
{"word": "peace", "english": "Finding peace in nature healed her stress.", "thai": "การพบความสงบในธรรมชาติเยียวยาความเครียดของเธอ"}
{"word": "nature", "english": "Nature hikes revealed the forest’s hidden beauty.", "thai": "การเดินป่าในธรรมชาติเผยความงามที่ซ่อนอยู่ในป่า"}
{"word": "beauty", "english": "Her radiant beauty shone at the gala.", "thai": "ความงามที่เปล่งปลั่งของเธอส่องสว่างในงานกาล่า"}
{"word": "gala", "english": "The charity gala raised funds for education.", "thai": "งานกาล่าการกุศลระดมทุนเพื่อการศึกษา"}
{"word": "education", "english": "Quality education opened doors to new opportunities.", "thai": "การศึกษาที่มีคุณภาพเปิดประตูสู่โอกาสใหม่"}
{"word": "opportunities", "english": "New opportunities fueled his entrepreneurial spirit.", "thai": "โอกาสใหม่กระตุ้นจิตวิญญาณผู้ประกอบการของเขา"}
{"word": "spirit", "english": "Her free spirit danced to life’s rhythm.", "thai": "จิตวิญญาณอิสระของเธอเต้นรำไปตามจังหวะชีวิต"}
{"word": "rhythm", "english": "The song’s rhythm got everyone dancing.", "thai": "จังหวะของเพลงทำให้ทุกคนเต้นรำ"}
{"word": "dancing", "english": "Dancing under the stars felt like magic.", "thai": "การเต้นรำใต้ดวงดาวรู้สึกเหมือนเวทมนตร์"}
{"word": "stars", "english": "The stars twinkled above the quiet campsite.", "thai": "ดวงดาวระยิบระยับเหนือแคมป์ที่เงียบสงบ"}
{"word": "campsite", "english": "The campsite buzzed with campfire stories.", "thai": "แคมป์เต็มไปด้วยเรื่องเล่าข้างกองไฟ"}
{"word": "stories", "english": "Ghost stories spooked the kids at midnight.", "thai": "เรื่องผีทำให้เด็กๆ ขนลุกตอนเที่ยงคืน"}
{"word": "midnight", "english": "Midnight runs cleared his cluttered mind.", "thai": "การวิ่งตอนเที่ยงคืนช่วยให้จิตใจที่วุ่นวายของเขาปลอดโปร่ง"}
{"word": "mind", "english": "A focused mind aced the tough exam.", "thai": "จิตใจที่จดจ่อทำให้สอบผ่านข้อสอบยาก"}
{"word": "exam", "english": "The final exam tested months of preparation.", "thai": "ข้อสอบสุดท้ายทดสอบการเตรียมตัวหลายเดือน"}
{"word": "preparation", "english": "Careful preparation ensured a flawless presentation.", "thai": "การเตรียมตัวอย่างรอบคอบทำให้การนำเสนอไร้ที่ติ"}
{"word": "presentation", "english": "Her presentation wowed the corporate board.", "thai": "การนำเสนอของเธอทำให้คณะกรรมการบริษัทตื่นเต้น"}
{"word": "board", "english": "The board game night sparked friendly rivalries.", "thai": "ค่ำคืนเล่นเกมกระดานจุดประกายการแข่งขันที่เป็นมิตร"}
{"word": "night", "english": "A quiet night at home felt refreshing.", "thai": "คืนที่เงียบสงบที่บ้านรู้สึกสดชื่น"}
{"word": "home", "english": "Home cooking filled the kitchen with warmth.", "thai": "การทำอาหารที่บ้านทำให้ครัวเต็มไปด้วยความอบอุ่น"}
{"word": "kitchen", "english": "The kitchen smelled of freshly baked bread.", "thai": "ครัวหอมกลิ่นขนมปังอบใหม่"}
{"word": "bread", "english": "Warm bread paired perfectly with homemade soup.", "thai": "ขนมปังอุ่นเข้ากันอย่างลงตัวกับซุปทำเอง"}
{"word": "soup", "english": "Spicy soup warmed their chilly winter evening.", "thai": "ซุปรสเผ็ดทำให้ค่ำคืนฤดูหนาวที่หนาวเย็นอบอุ่นขึ้น"}
{"word": "winter", "english": "Winter snow blanketed the sleepy village.", "thai": "หิมะฤดูหนาวปกคลุมหมู่บ้านที่เงียบสงบ"}
{"word": "village", "english": "The village market bustled with local vendors.", "thai": "ตลาดหมู่บ้านคึกคักไปด้วยพ่อค้าแม่ค้าท้องถิ่น"}
{"word": "vendors", "english": "Street vendors sold colorful handmade crafts.", "thai": "พ่อค้าแม่ค้าข้างถนนขายงานฝีมือสีสันสดใส"}
{"word": "crafts", "english": "Her crafts adorned the holiday gift table.", "thai": "งานฝีมือของเธอประดับโต๊ะของขวัญวันหยุด"}
{"word": "holiday", "english": "The holiday season sparked joy in everyone.", "thai": "ช่วงวันหยุดจุดประกายความสุขในทุกคน"}
{"word": "joy", "english": "Pure joy lit up her face at the surprise.", "thai": "ความสุขล้วนๆ ทำให้หน้าเธอสว่างไสวเมื่อเจอเซอร์ไพรส์"}
{"word": "surprise", "english": "The surprise party left him utterly speechless.", "thai": "งานปาร์ตี้เซอร์ไพรส์ทำให้เขาพูดไม่ออก"}
{"word": "party", "english": "The beach party rocked until dawn.", "thai": "ปาร์ตี้ชายหาดสนุกสุดเหวี่ยงจนถึงรุ่งสาง"}
{"word": "dawn", "english": "Dawn jogs energized her for the day.", "thai": "การวิ่งยามรุ่งสางทำให้เธอมีพลังสำหรับวันใหม่"}
{"word": "day", "english": "A sunny day invited outdoor adventures.", "thai": "วันที่แดดจ้าชวนให้ออกไปผจญภัยกลางแจ้ง"}
{"word": "adventures", "english": "Camping adventures bonded the group tightly.", "thai": "การผจญภัยแคมป์ปิ้งทำให้กลุ่มสนิทกันมากขึ้น"}
{"word": "group", "english": "The study group aced their final project.", "thai": "กลุ่มเรียนรู้ทำโปรเจกต์สุดท้ายได้ยอดเยี่ยม"}
{"word": "project", "english": "The art project showcased her unique vision.", "thai": "โปรเจกต์ศิลปะแสดงให้เห็นวิสัยทัศน์ที่ไม่เหมือนใครของเธอ"}
{"word": "vision", "english": "Her clear vision guided the team’s success.", "thai": "วิสัยทัศน์ที่ชัดเจนของเธอนำทีมสู่ความสำเร็จ"}
{"word": "success", "english": "Hard-earned success tasted sweeter than expected.", "thai": "ความสำเร็จที่ได้มาด้วยความยากลำบากหวานกว่าที่คาด"}
{"word": "expected", "english": "She expected the meeting to end early.", "thai": "เธอคาดว่าการประชุมจะจบเร็ว"}
{"word": "meeting", "english": "The team scheduled a meeting at noon.", "thai": "ทีมกำหนดการประชุมตอนเที่ยง"}
{"word": "team", "english": "Our team won the championship trophy.", "thai": "ทีมของเราชนะถ้วยรางวัลแชมป์"}
{"word": "trophy", "english": "He polished the trophy until it shone.", "thai": "เขาขัดถ้วยรางวัลจนมันเงาวับ"}
{"word": "polished", "english": "Her polished speech impressed the audience.", "thai": "คำปราศรัยที่ประณีตของเธอทำให้ผู้ฟังประทับใจ"}
{"word": "speech", "english": "His speech class taught him confidence.", "thai": "ชั้นเรียนการพูดของเขาสอนให้เขามีความมั่นใจ"}
{"word": "confidence", "english": "She walked with confidence into the interview.", "thai": "เธอเดินด้วยความมั่นใจเข้าสู่การสัมภาษณ์"}
{"word": "interview", "english": "The job interview lasted thirty minutes.", "thai": "การสัมภาษณ์งานใช้เวลาสามสิบนาที"}
{"word": "job", "english": "He landed a job at the tech startup.", "thai": "เขาได้งานที่บริษัทสตาร์ทอัพด้านเทคโนโลยี"}
{"word": "startup", "english": "The startup launched a groundbreaking app.", "thai": "สตาร์ทอัพเปิดตัวแอปที่ล้ำสมัย"}
{"word": "app", "english": "This app tracks your daily steps.", "thai": "แอปนี้ติดตามจำนวนก้าวรายวันของคุณ"}
{"word": "steps", "english": "She climbed the steps to the temple.", "thai": "เธอปีนบันไดไปที่วัด"}
{"word": "temple", "english": "The ancient temple attracted many tourists.", "thai": "วัดโบราณดึงดูดนักท่องเที่ยวจำนวนมาก"}
{"word": "tourists", "english": "Tourists crowded the vibrant street market.", "thai": "นักท่องเที่ยวแน่นขนัดในตลาดถนนที่คึกคัก"}
{"word": "market", "english": "The market sold fresh organic produce.", "thai": "ตลาดขายผักผลไม้สดจากธรรมชาติ"}
{"word": "produce", "english": "Farmers produce crops for local stores.", "thai": "เกษตรกรผลิตพืชผลให้ร้านค้าในท้องถิ่น"}
{"word": "crops", "english": "Drought ruined the crops this season.", "thai": "ภัยแล้งทำลายพืชผลในฤดูกาลนี้"}
{"word": "drought", "english": "The drought left the riverbed dry.", "thai": "ภัยแล้งทำให้พื้นแม่น้ำแห้ง"}
{"word": "riverbed", "english": "Fish struggled in the shrinking riverbed.", "thai": "ปลาดิ้นรนในพื้นแม่น้ำที่หดตัว"}
{"word": "fish", "english": "He caught a fish with his new rod.", "thai": "เขาจับปลาได้ด้วยคันเบ็ดใหม่"}
{"word": "rod", "english": "The curtain rod broke under pressure.", "thai": "ราวม่านแตกภายใต้แรงกด"}
{"word": "curtain", "english": "She sewed a curtain for her room.", "thai": "เธอเย็บม่านสำหรับห้องของเธอ"}
{"word": "room", "english": "The room smelled of fresh paint.", "thai": "ห้องมีกลิ่นสีใหม่"}
{"word": "paint", "english": "He used paint to create a mural.", "thai": "เขาใช้สีวาดภาพจิตรกรรมฝาผนัง"}
{"word": "mural", "english": "The mural depicted a historic battle.", "thai": "ภาพจิตรกรรมฝาผนังแสดงถึงการรบในประวัติศาสตร์"}
{"word": "battle", "english": "Soldiers prepared for the upcoming battle.", "thai": "ทหารเตรียมพร้อมสำหรับการรบที่กำลังจะมาถึง"}
{"word": "soldiers", "english": "Soldiers trained rigorously in the camp.", "thai": "ทหารฝึกอย่างหนักในค่าย"}
{"word": "camp", "english": "Kids loved the summer camp activities.", "thai": "เด็กๆ ชอบกิจกรรมค่ายฤดูร้อน"}
{"word": "activities", "english": "Outdoor activities kept the group busy.", "thai": "กิจกรรมกลางแจ้งทำให้กลุ่มยุ่งวุ่นวาย"}
{"word": "group", "english": "The study group met every Wednesday.", "thai": "กลุ่มเรียนพบกันทุกวันพุธ"}
{"word": "study", "english": "She stayed up late to study math.", "thai": "เธอนอนดึกเพื่อเรียนคณิตศาสตร์"}
{"word": "math", "english": "Math puzzles challenge my brain daily.", "thai": "ปริศนาคณิตศาสตร์ท้าทายสมองของฉันทุกวัน"}
{"word": "brain", "english": "His brain buzzed with creative ideas.", "thai": "สมองของเขาเต็มไปด้วยความคิดสร้างสรรค์"}
{"word": "ideas", "english": "Her ideas transformed the boring presentation.", "thai": "ความคิดของเธอเปลี่ยนการนำเสนอที่น่าเบื่อ"}
{"word": "presentation", "english": "The presentation wowed the corporate clients.", "thai": "การนำเสนอทำให้ลูกค้าบริษัทประทับใจ"}
{"word": "clients", "english": "Clients demanded faster project delivery.", "thai": "ลูกค้าต้องการให้ส่งมอบโครงการเร็วขึ้น"}
{"word": "project", "english": "The science project won first prize.", "thai": "โครงการวิทยาศาสตร์ได้รับรางวัลที่หนึ่ง"}
{"word": "science", "english": "Science experiments thrilled the curious students.", "thai": "การทดลองวิทยาศาสตร์ทำให้เด็กนักเรียนตื่นเต้น"}
{"word": "students", "english": "Students debated passionately in class.", "thai": "นักเรียนถกเถียงอย่างดุเดือดในชั้นเรียน"}
{"word": "class", "english": "The yoga class relaxed her mind.", "thai": "ชั้นเรียนโยคะทำให้จิตใจของเธอผ่อนคลาย"}
{"word": "mind", "english": "His mind wandered during the lecture.", "thai": "จิตใจของเขาเหม่อลอยระหว่างการบรรยาย"}
{"word": "lecture", "english": "The lecture covered modern art trends.", "thai": "การบรรยายครอบคลุมแนวโน้มศิลปะสมัยใหม่"}
{"word": "art", "english": "Her art reflected deep personal emotions.", "thai": "ศิลปะของเธอสะท้อนอารมณ์ส่วนตัวที่ลึกซึ้ง"}
{"word": "emotions", "english": "Emotions ran high after the game.", "thai": "อารมณ์พุ่งสูงหลังเกม"}
{"word": "game", "english": "The chess game ended in a draw.", "thai": "เกมหมากรุกจบลงด้วยผลเสมอ"}
{"word": "chess", "english": "Chess requires strategic thinking skills.", "thai": "หมากรุกต้องการทักษะการคิดเชิงกลยุทธ์"}
{"word": "skills", "english": "Her cooking skills impressed everyone.", "thai": "ทักษะการทำอาหารของเธอทำให้ทุกคนประทับใจ"}
{"word": "cooking", "english": "Cooking dinner together strengthened their bond.", "thai": "การทำอาหารเย็นด้วยกันทำให้ความสัมพันธ์แน่นแฟ้น"}
{"word": "dinner", "english": "Dinner was served on the patio.", "thai": "อาหารเย็นถูกเสิร์ฟที่ลานบ้าน"}
{"word": "patio", "english": "The patio overlooked a serene garden.", "thai": "ลานบ้านมองเห็นสวนที่เงียบสงบ"}
{"word": "garden", "english": "She planted roses in her garden.", "thai": "เธอปลูกกุหลาบในสวนของเธอ"}
{"word": "roses", "english": "Roses bloomed vibrantly despite the heat.", "thai": "กุหลาบบานสะพรั่งแม้จะมีอากาศร้อน"}
{"word": "heat", "english": "The summer heat exhausted the hikers.", "thai": "ความร้อนในฤดูร้อนทำให้ผู้เดินป่าหมดแรง"}
{"word": "hikers", "english": "Hikers discovered a hidden waterfall.", "thai": "นักเดินป่าค้นพบน้ำตกที่ซ่อนอยู่"}
{"word": "waterfall", "english": "The waterfall sparkled under the sunlight.", "thai": "น้ำตกส่องประกายใต้แสงแดด"}
{"word": "sunlight", "english": "Sunlight streamed through the open window.", "thai": "แสงแดดส่องผ่านหน้าต่างที่เปิดอยู่"}
{"word": "window", "english": "She stared out the window daydreaming.", "thai": "เธอจ้องมองออกไปนอกหน้าต่างพร้อมฝันกลางวัน"}
{"word": "daydreaming", "english": "Daydreaming helped her spark new ideas.", "thai": "การฝันกลางวันช่วยให้เธอจุดประกายความคิดใหม่"}
{"word": "spark", "english": "A spark ignited the campfire instantly.", "thai": "ประกายไฟจุดกองไฟได้ทันที"}
{"word": "campfire", "english": "The campfire warmed the chilly night.", "thai": "กองไฟทำให้คืนที่หนาวเย็นอบอุ่น"}
{"word": "night", "english": "Stars twinkled brightly in the night sky.", "thai": "ดวงดาวส่องแสงระยิบระยับในท้องฟ้ายามค่ำ"}
{"word": "stars", "english": "Stars inspired her to write poetry.", "thai": "ดวงดาวบันดาลใจให้เธอเขียนบทกวี"}
{"word": "poetry", "english": "Her poetry captured raw human emotions.", "thai": "บทกวีของเธอจับความรู้สึกดิบของมนุษย์"}
{"word": "human", "english": "Human kindness restored his faith.", "thai": "ความเมตตาของมนุษย์ฟื้นฟูความเชื่อของเขา"}
{"word": "kindness", "english": "Her kindness touched everyone she met.", "thai": "ความเมตตาของเธอทำให้ทุกคนที่พบประทับใจ"}
{"word": "touched", "english": "The movie touched her heart deeply.", "thai": "ภาพยนตร์ทำให้หัวใจของเธอซาบซึ้งลึกซึ้ง"}
{"word": "heart", "english": "His heart raced during the thrilling race.", "thai": "หัวใจของเขาเต้นแรงระหว่างการแข่งขันที่ตื่นเต้น"}
{"word": "race", "english": "The marathon race tested their endurance.", "thai": "การแข่งขันมาราธอนทดสอบความอดทนของพวกเขา"}
{"word": "endurance", "english": "Endurance training improved her stamina.", "thai": "การฝึกความอดทนช่วยเพิ่มพลังของเธอ"}
{"word": "stamina", "english": "His stamina amazed the entire team.", "thai": "พลังของเขาทำให้ทีมทั้งหมดทึ่ง"}
{"word": "amazed", "english": "The magic trick amazed the audience.", "thai": "กลเม็ดมายากลทำให้ผู้ชมตื่นตะลึง"}
{"word": "magic", "english": "Magic filled the air at the festival.", "thai": "มนต์ขลังเติมเต็มบรรยากาศในงานเทศกาล"}
{"word": "festival", "english": "The music festival drew huge crowds.", "thai": "เทศกาลดนตรีดึงดูดฝูงชนจำนวนมาก"}
{"word": "music", "english": "Live music energized the lively party.", "thai": "ดนตรีสดทำให้งานปาร์ตี้คึกคัก"}
{"word": "party", "english": "The birthday party lasted until midnight.", "thai": "งานเลี้ยงวันเกิดยาวนานถึงเที่ยงคืน"}
{"word": "midnight", "english": "At midnight, the city was still awake.", "thai": "ตอนเที่ยงคืน เมืองยังคงตื่นตัว"}
{"word": "city", "english": "The city buzzed with vibrant energy.", "thai": "เมืองเต็มไปด้วยพลังที่คึกคัก"}
{"word": "energy", "english": "Her energy inspired the whole group.", "thai": "พลังของเธอบันดาลใจทั้งกลุ่ม"}
{"word": "inspired", "english": "The novel inspired a hit movie.", "thai": "นิยายเล่มนี้บันดาลใจให้เกิดภาพยนตร์ดัง"}
{"word": "movie", "english": "The movie theater was packed tonight.", "thai": "โรงภาพยนตร์แน่นขนัดคืนนี้"}
{"word": "theater", "english": "The theater performance received rave reviews.", "thai": "การแสดงละครได้รับคำวิจารณ์ชื่นชม"}
{"word": "performance", "english": "His performance on stage was flawless.", "thai": "การแสดงของเขาบนเวทีไร้ที่ติ"}
{"word": "stage", "english": "The band took the stage by storm.", "thai": "วงดนตรีขึ้นเวทีอย่างยิ่งใหญ่"}
{"word": "band", "english": "The jazz band played soulful tunes.", "thai": "วงดนตรีแจ๊สเล่นเพลงที่เต็มไปด้วยอารมณ์"}
{"word": "tunes", "english": "Her favorite tunes lifted her mood.", "thai": "เพลงโปรดของเธอยกระดับอารมณ์ของเธอ"}
{"word": "mood", "english": "The rainy day dampened his mood.", "thai": "วันที่ฝนตกทำให้อารมณ์ของเขาหดหู่"}
{"word": "rainy", "english": "Rainy afternoons are perfect for reading.", "thai": "บ่ายวันที่ฝนตกเหมาะสำหรับการอ่าน"}
{"word": "reading", "english": "Reading novels expanded her imagination.", "thai": "การอ่านนิยายขยายจินตนาการของเธอ"}
{"word": "imagination", "english": "Her imagination crafted vivid fantasy worlds.", "thai": "จินตนาการของเธอสร้างโลกแฟนตาซีที่สดใส"}
{"word": "worlds", "english": "Exploring new worlds excited the adventurer.", "thai": "การสำรวจโลกใหม่ทำให้ผจญภัยตื่นเต้น"}
{"word": "adventurer", "english": "The adventurer scaled the tallest mountain.", "thai": "นักผจญภัยปีนเขาที่สูงที่สุด"}
{"word": "mountain", "english": "The mountain trail was steep and rocky.", "thai": "เส้นทางบนเขาชันและเต็มไปด้วยหิน"}
{"word": "trail", "english": "The trail led to a hidden cave.", "thai": "เส้นทางนำไปสู่ถ้ำที่ซ่อนอยู่"}
{"word": "cave", "english": "The cave echoed with dripping water.", "thai": "ถ้ำดังก้องด้วยเสียงน้ำหยด"}
{"word": "water", "english": "Fresh water sustained the small village.", "thai": "น้ำจืดค้ำจุนหมู่บ้านเล็กๆ"}
{"word": "village", "english": "The village celebrated its annual festival.", "thai": "หมู่บ้านเฉลิมฉลองเทศกาลประจำปี"}
{"word": "celebrated", "english": "They celebrated their victory with joy.", "thai": "พวกเขาเฉลิมฉลองชัยชนะด้วยความยินดี"}
{"word": "victory", "english": "The victory parade filled the streets.", "thai": "ขบวนพาเหรดชัยชนะเต็มไปด้วยถนน"}
{"word": "parade", "english": "The parade featured colorful floats.", "thai": "ขบวนพาเหรดมีขบวนรถประดับสีสัน"}
{"word": "colorful", "english": "Her colorful scarf caught everyone’s eye.", "thai": "ผ้าพันคอสีสันของเธอดึงดูดสายตาทุกคน"}
{"word": "scarf", "english": "She knitted a scarf for winter.", "thai": "เธอถักผ้าพันคอสำหรับฤดูหนาว"}
{"word": "winter", "english": "Winter brought heavy snow to town.", "thai": "ฤดูหนาวนำหิมะตกหนักมาสู่เมือง"}
{"word": "snow", "english": "Kids built a snow fort outside.", "thai": "เด็กๆ สร้างป้อมหิมะด้านนอก"}
{"word": "fort", "english": "The old fort stood on the hill.", "thai": "ป้อมเก่าตั้งอยู่บนเนินเขา"}
{"word": "hill", "english": "She hiked up the hill at dawn.", "thai": "เธอเดินป่าขึ้นเนินตอนรุ่งสาง"}
{"word": "dawn", "english": "Dawn revealed a stunning pink sky.", "thai": "รุ่งสางเผยท้องฟ้าสีชมพูที่สวยงาม"}
{"word": "sky", "english": "The sky cleared after the storm.", "thai": "ท้องฟ้าแจ่มใสหลังพายุ"}
{"word": "storm", "english": "The storm knocked out the power.", "thai": "พายุทำให้ไฟฟ้าดับ"}
{"word": "power", "english": "Solar power fueled their tiny cabin.", "thai": "พลังงานแสงอาทิตย์ขับเคลื่อนกระท่อมเล็กของพวกเขา"}
{"word": "cabin", "english": "The cabin smelled of pine wood.", "thai": "กระท่อมมีกลิ่นไม้สน"}
{"word": "pine", "english": "Pine trees lined the winding path.", "thai": "ต้นสนเรียงรายตามทางคดเคี้ยว"}
{"word": "path", "english": "The path led to a quiet lake.", "thai": "เส้นทางนำไปสู่ทะเลสาบเงียบสงบ"}
{"word": "lake", "english": "They fished at the lake all morning.", "thai": "พวกเขาตกปลาที่ทะเลสาบทั้งเช้า"}
{"word": "fished", "english": "He fished for compliments with his outfit.", "thai": "เขาพยายามเรียกร้องคำชมด้วยชุดของเขา"}
{"word": "outfit", "english": "Her outfit matched the vibrant festival.", "thai": "ชุดของเธอเข้ากับงานเทศกาลที่คึกคัก"}
{"word": "festival", "english": "The food festival offered spicy tacos.", "thai": "งานเทศกาลอาหารมีทาโก้รสเผ็ด"}
{"word": "food", "english": "Homemade food warmed their family gathering.", "thai": "อาหารโฮมเมดทำให้การรวมตัวของครอบครัวอบอุ่น"}
{"word": "family", "english": "Family traditions shaped her childhood memories.", "thai": "ประเพณีครอบครัวหล่อหลอมความทรงจำวัยเด็กของเธอ"}
{"word": "memories", "english": "Old memories flooded back during the reunion.", "thai": "ความทรงจำเก่าๆ ท่วมท้นกลับมาในงานคืนสู่เหย้า"}
{"word": "reunion", "english": "The class reunion sparked nostalgic chats.", "thai": "งานคืนสู่เหย้าชั้นเรียนจุดประกายการสนทนาที่คิดถึง"}
{"word": "nostalgic", "english": "Nostalgic tunes played on the radio.", "thai": "เพลงชวนคิดถึงดังจากวิทยุ"}
{"word": "radio", "english": "The radio blared catchy pop songs.", "thai": "วิทยุดังด้วยเพลงป๊อปที่ติดหู"}
{"word": "songs", "english": "Her songs told stories of heartbreak.", "thai": "เพลงของเธอบอกเล่าเรื่องราวของความอกหัก"}
{"word": "heartbreak", "english": "Heartbreak taught him to value trust.", "thai": "ความอกหักสอนให้เขาเห็นคุณค่าของความไว้วางใจ"}
{"word": "trust", "english": "Trust grew between the new teammates.", "thai": "ความไว้วางใจเพิ่มขึ้นระหว่างเพื่อนร่วมทีมใหม่"}
{"word": "teammates", "english": "Teammates cheered loudly after the goal.", "thai": "เพื่อนร่วมทีมโห่ร้องดังลั่นหลังทำประตู"}
{"word": "goal", "english": "Scoring the goal boosted his confidence.", "thai": "การทำประตูเพิ่มความมั่นใจให้เขา"}
{"word": "confidence", "english": "Her confidence shone during the speech.", "thai": "ความมั่นใจของเธอเปล่งประกายระหว่างการพูด"}
{"word": "speech", "english": "The speech inspired the young graduates.", "thai": "คำปราศรัยสร้างแรงบันดาลใจให้บัณฑิตหนุ่มสาว"}
{"word": "graduates", "english": "Graduates tossed their caps in celebration.", "thai": "บัณฑิตโยนหมวกขึ้นเพื่อเฉลิมฉลอง"}
{"word": "celebration", "english": "The celebration included fireworks and music.", "thai": "งานเฉลิมฉลองมีทั้งดอกไม้ไฟและดนตรี"}
{"word": "fireworks", "english": "Fireworks lit up the night sky.", "thai": "ดอกไม้ไฟส่องสว่างท้องฟ้ายามค่ำ"}
{"word": "night", "english": "The night market buzzed with excitement.", "thai": "ตลาดกลางคืนคึกคักด้วยความตื่นเต้น"}
{"word": "market", "english": "Fresh fruit filled the market stalls.", "thai": "ผลไม้สดเต็มร้านค้าในตลาด"}
{"word": "fruit", "english": "She blended fruit for a smoothie.", "thai": "เธอปั่นผลไม้ทำสมูทตี้"}
{"word": "smoothie", "english": "The smoothie tasted refreshing and sweet.", "thai": "สมูทตี้รสชาติสดชื่นและหวาน"}
{"word": "sweet", "english": "Sweet pastries tempted everyone at the bakery.", "thai": "ขนมหวานล่อใจทุกคนที่ร้านเบเกอรี่"}
{"word": "bakery", "english": "The bakery opened early every morning.", "thai": "ร้านเบเกอรี่เปิดแต่เช้าทุกวัน"}
{"word": "morning", "english": "Morning jogs energized her whole day.", "thai": "การวิ่งตอนเช้าทำให้เธอมีพลังทั้งวัน"}
{"word": "jogs", "english": "His daily jogs improved his health.", "thai": "การวิ่งทุกวันของเขาช่วยให้สุขภาพดีขึ้น"}
{"word": "health", "english": "Good health requires balanced meals daily.", "thai": "สุขภาพดีต้องรับประทานอาหารสมดุลทุกวัน"}
{"word": "meals", "english": "Family meals strengthened their close bond.", "thai": "มื้ออาหารครอบครัวทำให้ความสัมพันธ์แน่นแฟ้น"}
{"word": "bond", "english": "Their bond grew through shared adventures.", "thai": "ความผูกพันของพวกเขาเติบโตผ่านการผจญภัยร่วมกัน"}
{"word": "adventures", "english": "Adventures abroad broadened her perspective.", "thai": "การผจญภัยในต่างแดนขยายมุมมองของเธอ"}
{"word": "perspective", "english": "His perspective shifted after the debate.", "thai": "มุมมองของเขาเปลี่ยนไปหลังการโต้วาที"}
{"word": "debate", "english": "The debate sparked heated online discussions.", "thai": "การโต้วาทีจุดประกายการถกเถียงออนไลน์อย่างดุเดือด"}
{"word": "discussions", "english": "Discussions at work solved the issue.", "thai": "การสนทนาที่ทำงานแก้ปัญหาได้"}
{"word": "work", "english": "Work deadlines kept her up late.", "thai": "กำหนดเวลางานทำให้เธอนอนดึก"}
{"word": "deadlines", "english": "Meeting deadlines earned her a promotion.", "thai": "การทำตามกำหนดเวลาได้ทำให้เธอได้เลื่อนตำแหน่ง"}
{"word": "promotion", "english": "The promotion came with a bigger office.", "thai": "การเลื่อนตำแหน่งมาพร้อมสำนักงานที่ใหญ่ขึ้น"}
{"word": "office", "english": "Her office overlooked the bustling city.", "thai": "สำนักงานของเธอมองเห็นเมืองที่คึกคัก"}
{"word": "city", "english": "The city skyline glowed at dusk.", "thai": "เส้นขอบฟ้าของเมืองส่องสว่างยามพลบค่ำ"}
{"word": "skyline", "english": "The skyline inspired her latest painting.", "thai": "เส้นขอบฟ้าบันดาลใจให้ภาพวาดล่าสุดของเธอ"}
{"word": "painting", "english": "Painting landscapes calmed her busy mind.", "thai": "การวาดภาพทิวทัศน์ทำให้จิตใจที่วุ่นวายของเธอสงบ"}
{"word": "mind", "english": "His mind raced with new ideas.", "thai": "จิตใจของเขาเต็มไปด้วยความคิดใหม่"}
{"word": "ideas", "english": "Creative ideas fueled the team’s project.", "thai": "ความคิดสร้างสรรค์ขับเคลื่อนโครงการของทีม"}
{"word": "project", "english": "The project required late-night brainstorming.", "thai": "โครงการนี้ต้องมีการระดมสมองตอนดึก"}
{"word": "brainstorming", "english": "Brainstorming sessions sparked innovative solutions.", "thai": "การระดมสมองจุดประกายแนวทางแก้ปัญหาที่สร้างสรรค์"}
{"word": "solutions", "english": "Simple solutions fixed the complex bug.", "thai": "วิธีแก้ปัญหาง่ายๆ ซ่อมแซมข้อบกพร่องที่ซับซ้อน"}
{"word": "bug", "english": "The software bug crashed the app.", "thai": "ข้อบกพร่องของซอฟต์แวร์ทำให้แอปขัดข้อง"}
{"word": "app", "english": "The new app streamlined daily tasks.", "thai": "แอปใหม่ทำให้งานประจำวันง่ายขึ้น"}
{"word": "tasks", "english": "Tasks piled up before the holidays.", "thai": "งานกองพะเนินก่อนวันหยุด"}
{"word": "holidays", "english": "Holidays brought families closer together.", "thai": "วันหยุดทำให้ครอบครัวใกล้ชิดกันมากขึ้น"}
{"word": "families", "english": "Families gathered for a festive dinner.", "thai": "ครอบครัวรวมตัวกันเพื่ออาหารค่ำเทศกาล"}
{"word": "dinner", "english": "Dinner conversations turned to old memories.", "thai": "การสนทนาระหว่างมื้อค่ำกลายเป็นเรื่องความทรงจำเก่า"}
{"word": "conversations", "english": "Conversations with friends eased her stress.", "thai": "การสนทนากับเพื่อนช่วยลดความเครียดของเธอ"}
{"word": "stress", "english": "Stress melted away during her vacation.", "thai": "ความเครียดหายไประหว่างการพักร้อนของเธอ"}
{"word": "vacation", "english": "The beach vacation was pure bliss.", "thai": "การพักร้อนที่ชายหาดคือความสุขล้วนๆ"}
{"word": "beach", "english": "The beach stretched for miles ahead.", "thai": "ชายหาดทอดยาวไปหลายไมล์"}
{"word": "miles", "english": "He ran miles to train for the race.", "thai": "เขาวิ่งหลายไมล์เพื่อฝึกซ้อมสำหรับการแข่งขัน"}
{"word": "race", "english": "The race ended in a photo finish.", "thai": "การแข่งขันจบลงด้วยการเข้าเส้นชัยที่สูสี"}
{"word": "finish", "english": "They worked hard to finish the puzzle.", "thai": "พวกเขาทำงานหนักเพื่อทำปริศนาให้เสร็จ"}
{"word": "puzzle", "english": "The puzzle challenged their logical thinking.", "thai": "ปริศนาท้าทายการคิดเชิงตรรกะของพวกเขา"}
{"word": "thinking", "english": "Critical thinking solved the tricky problem.", "thai": "การคิดอย่างมีวิจารณญาณแก้ปัญหาที่ยากได้"}
{"word": "problem", "english": "The math problem stumped the class.", "thai": "โจทย์คณิตศาสตร์ทำให้ทั้งชั้นเรียนงง"}
{"word": "class", "english": "The cooking class taught new recipes.", "thai": "ชั้นเรียนทำอาหารสอนสูตรใหม่"}
{"word": "recipes", "english": "Her recipes always included fresh herbs.", "thai": "สูตรอาหารของเธอมักมีสมุนไพรสด"}
{"word": "herbs", "english": "Herbs added flavor to the soup.", "thai": "สมุนไพรเพิ่มรสชาติให้ซุป"}
{"word": "soup", "english": "Hot soup warmed them on cold nights.", "thai": "ซุปร้อนทำให้พวกเขาอบอุ่นในคืนที่หนาว"}
{"word": "nights", "english": "Nights by the campfire were unforgettable.", "thai": "คืนข้างกองไฟนั้นน่าจดจำ"}
{"word": "campfire", "english": "The campfire crackled under the stars.", "thai": "กองไฟดังเปาะแปะใต้ดวงดาว"}
{"word": "stars", "english": "Stars guided their late-night hike.", "thai": "ดวงดาวนำทางในการเดินป่ากลางคืน"}
{"word": "hike", "english": "The hike revealed breathtaking mountain views.", "thai": "การเดินป่าทำให้เห็นวิวภูเขาที่ตื่นตา"}
{"word": "views", "english": "The hotel offered views of the ocean.", "thai": "โรงแรมมีวิวทะเล"}
{"word": "ocean", "english": "The ocean waves crashed against the shore.", "thai": "คลื่นทะเลซัดเข้าฝั่ง"}
{"word": "waves", "english": "Waves of excitement hit the crowd.", "thai": "คลื่นแห่งความตื่นเต้นกระทบฝูงชน"}
{"word": "crowd", "english": "The crowd cheered for the home team.", "thai": "ฝูงชนโห่ร้องให้ทีมเจ้าบ้าน"}
{"word": "team", "english": "The team collaborated on a new design.", "thai": "ทีมร่วมมือกันออกแบบใหม่"}
{"word": "design", "english": "Her dress design won first place.", "thai": "การออกแบบชุดของเธอได้รางวัลที่หนึ่ง"}
{"word": "place", "english": "This place feels like home now.", "thai": "สถานที่นี้รู้สึกเหมือนบ้านแล้ว"}
{"word": "home", "english": "Home renovations took months to complete.", "thai": "การปรับปรุงบ้านใช้เวลาหลายเดือนกว่าจะเสร็จ"}
{"word": "renovations", "english": "Renovations transformed the old library.", "thai": "การปรับปรุงเปลี่ยนโฉมห้องสมุดเก่า"}
{"word": "library", "english": "The library offered free coding workshops.", "thai": "ห้องสมุดมีเวิร์กช็อปเขียนโค้ดฟรี"}
{"word": "workshops", "english": "Workshops taught her woodworking skills.", "thai": "เวิร์กช็อปสอนทักษะงานไม้ให้เธอ"}
{"word": "skills", "english": "Her skills impressed the hiring manager.", "thai": "ทักษะของเธอทำให้ผู้จัดการจ้างงานประทับใจ"}
{"word": "manager", "english": "The manager praised her creative input.", "thai": "ผู้จัดการชื่นชมความคิดสร้างสรรค์ของเธอ"}
{"word": "praised", "english": "Her teacher praised her excellent essay.", "thai": "ครูของเธอชื่นชมเรียงความที่ยอดเยี่ยมของเธอ"}
{"word": "essay", "english": "The essay explored themes of freedom.", "thai": "เรียงความสำรวจประเด็นเรื่องอิสรภาพ"}
{"word": "freedom", "english": "Freedom inspired his bold career move.", "thai": "อิสรภาพจุดประกายให้เขาเปลี่ยนงานอย่างกล้าหาญ"}
{"word": "career", "english": "Her career in tech took off rapidly.", "thai": "อาชีพของเธอในด้านเทคโนโลยีเติบโตอย่างรวดเร็ว"}
{"word": "tech", "english": "The tech conference showcased new gadgets.", "thai": "งานประชุมเทคโนโลยีแสดงอุปกรณ์ใหม่"}
{"word": "gadgets", "english": "Gadgets simplified their daily routines.", "thai": "อุปกรณ์ช่วยให้ชีวิตประจำวันของพวกเขาง่ายขึ้น"}
{"word": "routines", "english": "Morning routines set a productive tone.", "thai": "กิจวัตรตอนเช้าสร้างบรรยากาศที่ productive"}
{"word": "productive", "english": "A productive day boosted her morale.", "thai": "วันที่ productive เพิ่มขวัญกำลังใจให้เธอ"}
{"word": "morale", "english": "Team morale soared after the win.", "thai": "ขวัญกำลังใจของทีมพุ่งสูงหลังชัยชนะ"}
{"word": "win", "english": "The win secured their playoff spot.", "thai": "ชัยชนะทำให้พวกเขาได้ตำแหน่งในรอบเพลย์ออฟ"}
{"word": "playoff", "english": "Playoff games always draw huge crowds.", "thai": "เกมเพลย์ออฟมักดึงดูดฝูงชนจำนวนมาก"}
{"word": "crowds", "english": "Crowds gathered for the street concert.", "thai": "ฝูngชนรวมตัวกันเพื่อคอนเสิร์ตข้างถนน"}
{"word": "concert", "english": "The concert featured local indie bands.", "thai": "คอนเสิร์ตมีวงดนตรีอินดี้ท้องถิ่น"}
{"word": "bands", "english": "Friendship bands symbolized their tight bond.", "thai": "สายรัดข้อมือมิตรภาพเป็นสัญลักษณ์ของความผูกพันที่แน่นแฟ้น"}
{"word": "bond", "english": "Their bond grew stronger through challenges.", "thai": "ความผูกพันของพวกเขาแข็งแกร่งขึ้นผ่านความท้าทาย"}
{"word": "challenges", "english": "Challenges in coding sharpened his skills.", "thai": "ความท้าทายในการเขียนโค้ดเพิ่มทักษะของเขา"}
{"word": "skills", "english": "Her language skills impressed the interviewer.", "thai": "ทักษะด้านภาษาของเธอทำให้ผู้สัมภาษณ์ประทับใจ"}
{"word": "interviewer", "english": "The interviewer asked tough personal questions.", "thai": "ผู้สัมภาษณ์ถามคำถามส่วนตัวที่ยาก"}
{"word": "questions", "english": "Questions about history stumped the quiz team.", "thai": "คำถามเกี่ยวกับประวัติศาสตร์ทำให้ทีมควิซงง"}
{"word": "history", "english": "History lessons revealed forgotten local stories.", "thai": "บทเรียนประวัติศาสตร์เผยเรื่องราวท้องถิ่นที่ถูกลืม"}
{"word": "stories", "english": "Bedtime stories sparked her vivid imagination.", "thai": "นิทานก่อนนอนจุดประกายจินตนาการที่สดใสของเธอ"}
{"word": "imagination", "english": "His imagination crafted wild adventure novels.", "thai": "จินตนาการของเขาสร้างนิยายผจญภัยสุดมัน"}
{"word": "novels", "english": "Novels lined the shelves of her room.", "thai": "นิยายวางเรียงรายบนชั้นในห้องของเธอ"}
{"word": "shelves", "english": "The shelves held colorful ceramic pots.", "thai": "ชั้นวางของเต็มไปด้วยหม้อเซรามิกสีสัน"}
{"word": "pots", "english": "Pots simmered with fragrant curry sauce.", "thai": "หม้อเคี่ยวซอสแกงที่มีกลิ่นหอม"}
{"word": "curry", "english": "The curry recipe needed fresh spices.", "thai": "สูตรแกงต้องใช้เครื่องเทศสด"}
{"word": "spices", "english": "Spices added zest to her cooking.", "thai": "เครื่องเทศเพิ่มรสชาติให้การทำอาหารของเธอ"}
{"word": "cooking", "english": "Cooking together became their weekend ritual.", "thai": "การทำอาหารด้วยกันกลายเป็นพิธีกรรมวันหยุดสุดสัปดาห์"}
{"word": "weekend", "english": "The weekend hike offered stunning views.", "thai": "การเดินป่าช่วงสุดสัปดาห์มีวิวที่สวยงาม"}
{"word": "views", "english": "Her views on art sparked debates.", "thai": "มุมมองของเธอเกี่ยวกับศิลปะจุดประกายการถกเถียง"}
{"word": "art", "english": "Street art transformed the dull alley.", "thai": "ศิลปะข้างถนนเปลี่ยนตรอกที่จืดชืด"}
{"word": "alley", "english": "The alley echoed with stray cats’ meows.", "thai": "ตรอกดังก้องด้วยเสียงร้องของแมวจร"}
{"word": "cats", "english": "Cats napped lazily in the sunlight.", "thai": "แมวนอนขี้เกียจในแสงแดด"}
{"word": "sunlight", "english": "Sunlight filtered through the dense forest.", "thai": "แสงแดดกรองผ่านป่าที่ยึดแน่น"}
{"word": "forest", "english": "The forest trail led to a waterfall.", "thai": "เส้นทางในป่านำไปสู่น้ำตก"}
{"word": "waterfall", "english": "The waterfall mist cooled the hikers.", "thai": "หมอกจากน้ำตกทำให้ผู้เดินป่าชื่นใจ"}
{"word": "hikers", "english": "Hikers shared stories around the campfire.", "thai": "ผู้เดินป่าแบ่งปันเรื่องราวรอบกองไฟ"}
{"word": "campfire", "english": "The campfire crackled under a starry sky.", "thai": "กองไฟดังเปาะแปะใต้ท้องฟ้าที่เต็มไปด้วยดวงดาว"}
{"word": "sky", "english": "The clear sky promised perfect weather.", "thai": "ท้องฟ้าแจ่มใสสัญญาถึงสภาพอากาศที่สมบูรณ์แบบ"}
{"word": "weather", "english": "Stormy weather delayed their road trip.", "thai": "สภาพอากาศที่มีพายุทำให้การเดินทางล่าช้า"}
{"word": "trip", "english": "The road trip included scenic detours.", "thai": "การเดินทางรวมถึงเส้นทางเลี่ยงที่สวยงาม"}
{"word": "scenic", "english": "Scenic overlooks attracted adventurous photographers.", "thai": "จุดชมวิวที่สวยงามดึงดูดช่างภาพที่ชอบผจญภัย"}
{"word": "photographers", "english": "Photographers captured the vibrant festival.", "thai": "ช่างภาพจับภาพงานเทศกาลที่คึกคัก"}
{"word": "festival", "english": "The festival offered live music nightly.", "thai": "งานเทศกาลมีดนตรีสดทุกคืน"}
{"word": "music", "english": "Music filled the air at dusk.", "thai": "ดนตรีเติมเต็มบรรยากาศยามพลบค่ำ"}
{"word": "dusk", "english": "Dusk brought a calm over the lake.", "thai": "พลบค่ำนำความสงบมาสู่ทะเลสาบ"}
{"word": "lake", "english": "The lake reflected the glowing moon.", "thai": "ทะเลสาบสะท้อนแสงจันทร์ที่สว่างไสว"}
{"word": "moon", "english": "The full moon lit their path.", "thai": "พระจันทร์เต็มดวงส่องทางให้พวกเขา"}
{"word": "path", "english": "A narrow path wound through the village.", "thai": "เส้นทางแคบคดเคี้ยวผ่านหมู่บ้าน"}
{"word": "village", "english": "The village hosted a lively market.", "thai": "หมู่บ้านจัดตลาดที่คึกคัก"}
{"word": "market", "english": "The market bustled with local vendors.", "thai": "ตลาดคึกคักไปด้วยพ่อค้าแม่ค้าท้องถิ่น"}
{"word": "vendors", "english": "Vendors sold handmade crafts enthusiastically.", "thai": "พ่อค้าแม่ค้าขายงานฝีมืออย่างกระตือรือร้น"}
{"word": "crafts", "english": "Crafts decorated the cozy community center.", "thai": "งานฝีมือประดับศูนย์ชุมชนที่อบอุ่น"}
{"word": "community", "english": "The community rallied to clean the park.", "thai": "ชุมชนรวมตัวกันทำความสะอาดสวนสาธารณะ"}
{"word": "park", "english": "Kids played soccer in the park.", "thai": "เด็กๆ เล่นฟุตบอลในสวนสาธารณะ"}
{"word": "soccer", "english": "Soccer matches united the neighborhood kids.", "thai": "การแข่งขันฟุตบอลรวมเด็กๆ ในละแวก"}
{"word": "neighborhood", "english": "The neighborhood threw a block party.", "thai": "ละแวกจัดงานเลี้ยงบล็อก"}
{"word": "party", "english": "The party featured a live DJ.", "thai": "งานเลี้ยงมีดีเจสด"}
{"word": "DJ", "english": "The DJ mixed tracks until midnight.", "thai": "ดีเจผสมเพลงจนถึงเที่ยงคืน"}
{"word": "tracks", "english": "Train tracks ran through the quiet town.", "thai": "รางรถไฟวิ่งผ่านเมืองเงียบสงบ"}
{"word": "town", "english": "The town square hosted weekly concerts.", "thai": "จัตุรัสเมืองจัดคอนเสิร์ตทุกสัปดาห์"}
{"word": "square", "english": "The chessboard’s square pattern intrigued her.", "thai": "ลายสี่เหลี่ยมของกระดานหมากรุกทำให้เธอสนใจ"}
{"word": "pattern", "english": "Her scarf’s pattern matched her outfit.", "thai": "ลายผ้าพันคอของเธอเข้ากับชุด"}
{"word": "outfit", "english": "Her outfit turned heads at the gala.", "thai": "ชุดของเธอทำให้คนหันมองในงานกาล่า"}
{"word": "gala", "english": "The charity gala raised significant funds.", "thai": "งานกาล่าการกุศลระดมทุนได้มาก"}
{"word": "funds", "english": "Funds supported the new school library.", "thai": "เงินทุนสนับสนุนห้องสมุดโรงเรียนใหม่"}
{"word": "library", "english": "The library offered free storytelling sessions.", "thai": "ห้องสมุดมีเซสชันเล่านิทานฟรี"}
{"word": "storytelling", "english": "Storytelling captivated the young audience.", "thai": "การเล่าเรื่องดึงดูดผู้ฟังวัยเยาว์"}
{"word": "audience", "english": "The audience applauded the stunning performance.", "thai": "ผู้ชมปรบมือให้การแสดงที่ยอดเยี่ยม"}
{"word": "performance", "english": "Her performance in math improved steadily.", "thai": "ผลงานด้านคณิตศาสตร์ของเธอดีขึ้นอย่างต่อเนื่อง"}
{"word": "math", "english": "Math puzzles challenged his quick thinking.", "thai": "ปริศนาคณิตศาสตร์ท้าทายการคิดเร็วของเขา"}
{"word": "thinking", "english": "Creative thinking solved the team’s dilemma.", "thai": "การคิดสร้างสรรค์แก้ปัญหาของทีม"}
{"word": "dilemma", "english": "The dilemma forced a tough decision.", "thai": "ปัญหาทำให้ต้องตัดสินใจยาก"}
{"word": "decision", "english": "Her decision to travel changed everything.", "thai": "การตัดสินใจเดินทางของเธอเปลี่ยนทุกอย่าง"}
{"word": "travel", "english": "Travel broadened his cultural horizons.", "thai": "การเดินทางขยายขอบเขตวัฒนธรรมของเขา"}
{"word": "horizons", "english": "New horizons awaited the bold explorer.", "thai": "ขอบฟ้าใหม่รอคอยนักสำรวจที่กล้าหาญ"}
{"word": "explorer", "english": "The explorer mapped uncharted jungle terrain.", "thai": "นักสำรวจทำแผนที่ภูมิประเทศป่าที่ยังไม่เคยสำรวจ"}
{"word": "jungle", "english": "Jungle sounds filled the humid night.", "thai": "เสียงป่าดังก้องในคืนที่ชื้น"}
{"word": "sounds", "english": "Strange sounds echoed in the old house.", "thai": "เสียงแปลกๆ ดังก้องในบ้านเก่า"}
{"word": "house", "english": "The house smelled of fresh cookies.", "thai": "บ้านมีกลิ่นคุกกี้สดใหม่"}
{"word": "cookies", "english": "Cookies crumbled in her lunch bag.", "thai": "คุกกี้แตกในถุงอาหารกลางวันของเธอ"}
{"word": "lunch", "english": "Lunch with friends sparked lively chats.", "thai": "มื้อกลางวันกับเพื่อนจุดประกายการสนทนาคึกคัก"}
{"word": "chats", "english": "Online chats connected her with strangers.", "thai": "การแชทออนไลน์เชื่อมโยงเธอกับคนแปลกหน้า"}
{"word": "strangers", "english": "Strangers helped during the sudden storm.", "thai": "คนแปลกหน้าช่วยเหลือระหว่างพายุที่มาแบบกะทันหัน"}
{"word": "storm", "english": "The storm scattered leaves across the yard.", "thai": "พายุทำให้ใบไม้กระจัดกระจายทั่วลาน"}
{"word": "yard", "english": "The yard bloomed with colorful flowers.", "thai": "ลานเต็มไปด้วยดอกไม้สีสัน"}
{"word": "flowers", "english": "Flowers brightened the dull hospital room.", "thai": "ดอกไม้ทำให้ห้องโรงพยาบาลที่จืดชืดสดใสขึ้น"}
{"word": "hospital", "english": "The hospital staff worked tirelessly overnight.", "thai": "เจ้าหน้าที่โรงพยาบาลทำงานอย่างไม่เหน็ดเหนื่อยตลอดคืน"}
{"word": "staff", "english": "The coffee shop staff brewed perfect lattes.", "thai": "พนักงานร้านกาแฟชงลาเต้ได้อย่างสมบูรณ์แบบ"}
{"word": "coffee", "english": "Coffee fueled her early morning study.", "thai": "กาแฟช่วยให้เธอเรียนตอนเช้าได้"}
{"word": "study", "english": "The study group tackled complex equations.", "thai": "กลุ่มเรียนแก้โจทย์สมการที่ซับซ้อน"}
{"word": "equations", "english": "Equations on the board confused everyone.", "thai": "สมการบนกระดานทำให้ทุกคนสับสน"}
{"word": "board", "english": "The surfboard glided over crashing waves.", "thai": "กระดานโต้คลื่นลื่นไหลไปบนคลื่นที่ซัดสาด"}
{"word": "waves", "english": "Waves of laughter filled the comedy club.", "thai": "คลื่นแห่งเสียงหัวเราะเต็มไปในคลับตลก"}
{"word": "laughter", "english": "Her laughter echoed through the empty hall.", "thai": "เสียงหัวเราะของเธอดังก้องในโถงที่ว่างเปล่า"}
{"word": "hall", "english": "The hall displayed vibrant student artwork.", "thai": "โถงแสดงผลงานศิลปะนักเรียนที่สดใส"}
{"word": "artwork", "english": "Her artwork captured the city’s energy.", "thai": "ผลงานศิลปะของเธอจับพลังของเมือง"}
{"word": "city", "english": "The city pulsed with vibrant nightlife.", "thai": "เมืองเต้นระรัวด้วยชีวิตยามค่ำคืนที่คึกคัก"}
{"word": "nightlife", "english": "Nightlife in the downtown area thrived.", "thai": "ชีวิตยามค่ำคืนในย่านใจกลางเมืองเจริญรุ่งเรือง"}
{"word": "downtown", "english": "Downtown cafes buzzed with morning crowds.", "thai": "ร้านกาแฟในย่านใจกลางเมืองคึกคักไปด้วยผู้คนตอนเช้า"}
{"word": "cafes", "english": "Cafes served aromatic coffee all day.", "thai": "ร้านกาแฟเสิร์ฟกาแฟหอมกรุ่นทั้งวัน"}
{"word": "coffee", "english": "Her coffee spilled during the commute.", "thai": "กาแฟของเธอหกระหว่างเดินทาง"}
{"word": "commute", "english": "The daily commute tested his patience.", "thai": "การเดินทางประจำวันทดสอบความอดทนของเขา"}
{"word": "patience", "english": "Patience helped her master the guitar.", "thai": "ความอดทนช่วยให้เธอเชี่ยวชาญกีตาร์"}
{"word": "guitar", "english": "The guitar strings vibrated with each strum.", "thai": "สายกีตาร์สั่นสะเทือนทุกครั้งที่ดีด"}
{"word": "strings", "english": "Puppet strings controlled the wooden marionette.", "thai": "เชือกหุ่นควบคุมหุ่นไม้"}
{"word": "marionette", "english": "The marionette danced at the festival show.", "thai": "หุ่นเชิดเต้นรำในงานแสดงเทศกาล"}
{"word": "festival", "english": "The festival featured spicy street food.", "thai": "งานเทศกาลมีอาหารข้างถนนรสเผ็ด"}
{"word": "food", "english": "Homemade food warmed the family reunion.", "thai": "อาหารโฮมเมดทำให้งานรวมญาติอบอุ่น"}
{"word": "reunion", "english": "The reunion brought old friends together.", "thai": "งานรวมตัวนำเพื่อนเก่ามารวมกัน"}
{"word": "friends", "english": "Friends laughed over pizza and games.", "thai": "เพื่อนๆ หัวเราะกันขณะกินพิซซ่าและเล่นเกม"}
{"word": "pizza", "english": "The pizza arrived hot and cheesy.", "thai": "พิซซ่ามาถึงร้อนๆ และเต็มไปด้วยชีส"}
{"word": "cheesy", "english": "His cheesy jokes cracked everyone up.", "thai": "มุกตลกจืดๆ ของเขาทำให้ทุกคนขำ"}
{"word": "jokes", "english": "Jokes lightened the tense meeting room.", "thai": "มุกตลกทำให้ห้องประช biteum ผ่อนคลาย"}
{"word": "meeting", "english": "The meeting dragged on past lunch.", "thai": "การประชุมยืดเยื้อเกินเวลาพักเที่ยง"}
{"word": "lunch", "english": "Lunch at the park was relaxing.", "thai": "มื้อเที่ยงที่buraya ที่สวนสาธารณะผ่อนคลาย"}
{"word": "park", "english": "Kids played tag in the park.", "thai": "เด็กๆ เล่นวิ่งไล่จับในสวนสาธารณะ"}
{"word": "tag", "english": "Tag was their favorite playground game.", "thai": "วิ่งไล่จับเป็นเกมโปรดในสนามเด็กเล่น"}
{"word": "playground", "english": "The playground echoed with joyful laughter.", "thai": "สนามเด็กเล่นดังก้องด้วยเสียงหัวเราะร่าเริง"}
{"word": "laughter", "english": "Laughter filled the cozy movie night.", "thai": "เสียงหัวเราะเต็มไปในค่ำคืนดูหนังที่อบอุ่น"}
{"word": "movie", "english": "The movie kept everyone on edge.", "thai": "ภาพยนตร์ทำให้ทุกคนลุ้นระทึก"}
{"word": "edge", "english": "She stood on the edge of adventure.", "thai": "เธอยืนอยู่บนขอบของการผจญภัย"}
{"word": "adventure", "english": "Adventure called them to distant lands.", "thai": "การผจญภัยเรียกพวกเขาไปยังดินแดนห่างไกล"}
{"word": "lands", "english": "Uncharted lands awaited the brave explorer.", "thai": "ดินแดนที่ยังไม่ถูกสำรวจรอนักสำรวจผู้กล้าหาญ"}
{"word": "explorer", "english": "The explorer uncovered ancient hidden ruins.", "thai": "นักสำรวจค้นพบซากปรักหักพังโบราณที่ซ่อนอยู่"}
{"word": "ruins", "english": "Ruins whispered stories of forgotten civilizations.", "thai": "ซากปรักหักพังกระซิบเรื่องราวของอารยธรรมที่ถูกลืม"}
{"word": "stories", "english": "Her stories captivated the young campers.", "thai": "เรื่องราวของเธอดึงดูดเด็กๆ ในค่าย"}
{"word": "campers", "english": "Campers roasted marshmallows under the stars.", "thai": "ผู้ตั้งแคมป์ย่างมาร์ชเมลโลว์ใต้ดวงดาว"}
{"word": "stars", "english": "Stars twinkled above the quiet valley.", "thai": "ดวงดาวระยิบระยับเหนือหุบเขาที่เงียบสงบ"}
{"word": "valley", "english": "The valley bloomed with wildflowers.", "thai": "หุบเขาเบ่งบานด้วยดอกไม้ป่า"}
{"word": "wildflowers", "english": "Wildflowers added color to her hike.", "thai": "ดอกไม้ป่าเพิ่มสีสันให้การเดินป่าของเธอ"}
{"word": "hike", "english": "The hike challenged their endurance greatly.", "thai": "การเดินป่าท้าทายความอดทนของพวกเขาอย่างมาก"}
{"word": "endurance", "english": "Endurance races pushed her to limits.", "thai": "การแข่งขันความอดทนผลักดันเธอถึงขีดจำกัด"}
{"word": "limits", "english": "Pushing limits sparked her personal growth.", "thai": "การผลักดันขีดจำกัดจุดประกายการเติบโตส่วนตัวของเธอ"}
{"word": "growth", "english": "Personal growth transformed her outlook.", "thai": "การเติบโตส่วนตัวเปลี่ยนมุมมองของเธอ"}
{"word": "outlook", "english": "Her optimistic outlook inspired the team.", "thai": "มุมมองที่มองโลกในแง่ดีของเธอสร้างแรงบันดาลใจให้ทีม"}
{"word": "team", "english": "The team collaborated on a bold project.", "thai": "ทีมร่วมมือกันในโครงการที่กล้าหาญ"}
{"word": "project", "english": "The project demanded creative problem-solving.", "thai": "โครงการนี้ต้องการการแก้ปัญหาอย่างสร้างสรรค์"}
{"word": "problem-solving", "english": "Problem-solving skills saved the tight deadline.", "thai": "ทักษะการแก้ปัญหาช่วยให้ทันกำหนดเวลาที่คับขัน"}
{"word": "deadline", "english": "The deadline loomed over their heads.", "thai": "กำหนดเวลาคืบคลานเข้ามาใกล้"}
{"word": "heads", "english": "Cool heads prevailed in the crisis.", "thai": "ความใจเย็นมีชัยในวิกฤต"}
{"word": "crisis", "english": "The crisis tested their quick thinking.", "thai": "วิกฤตทดสอบการคิดเร็วของพวกเขา"}
{"word": "thinking", "english": "Clear thinking led to a breakthrough.", "thai": "การคิดอย่างชัดเจนนำไปสู่ความก้าวหน้า"}
{"word": "breakthrough", "english": "The breakthrough revolutionized their research approach.", "thai": "ความก้าวหน้าปฏิวัติวิธีการวิจัยของพวกเขา"}
{"word": "research", "english": "Research uncovered surprising historical facts.", "thai": "การวิจัยเผยข้อเท็จจริงทางประวัติศาสตร์ที่น่าประหลาดใจ"}
{"word": "facts", "english": "Facts grounded her persuasive argument.", "thai": "ข้อเท็จจริงสนับสนุนข้อโต้แย้งที่โน้มน้าวของเธอ"}
{"word": "argument", "english": "Their argument fizzled out over coffee.", "thai": "การโต้เถียงของพวกเขาคลายลงระหว่างดื่มกาแฟ"}
{"word": "coffee", "english": "Morning coffee fueled her busy day.", "thai": "กาแฟยามเช้าช่วยเติมพลังให้วันอันวุ่นวายของเธอ"}
{"word": "day", "english": "The day ended with a sunset walk.", "thai": "วันนั้นจบลงด้วยการเดินชมพระอาทิตย์ตก"}
{"word": "sunset", "english": "The sunset painted the sky orange.", "thai": "พระอาทิตย์ตกแต้มสีส้มให้ท้องฟ้า"}
{"word": "sky", "english": "A clear sky promised perfect stargazing.", "thai": "ท้องฟ้าแจ่มใสสัญญาถึงการดูดาวที่สมบูรณ์แบบ"}
{"word": "stargazing", "english": "Stargazing bonded the group under moonlight.", "thai": "การดูดาวทำให้กลุ่มผูกพันใต้แสงจันทร์"}
{"word": "moonlight", "english": "Moonlight illuminated their romantic evening stroll.", "thai": "แสงจันทร์ส่องสว่างการเดินเล่นยามค่ำคืนสุดโรแมนติก"}
{"word": "stroll", "english": "A stroll through the market was lively.", "thai": "การเดินเล่นในตลาดเต็มไปด้วยชีวิตชีวา"}
{"word": "market", "english": "The market offered fresh local produce.", "thai": "ตลาดมีผลผลิตท้องถิ่นสดใหม่"}
{"word": "produce", "english": "Fresh produce inspired her new recipe.", "thai": "ผลผลิตสดใหม่จุดประกายสูตรอาหารใหม่ของเธอ"}
{"word": "recipe", "english": "Her recipe won the cooking contest.", "thai": "สูตรอาหารของเธอชนะการแข่งขันทำอาหาร"}
{"word": "contest", "english": "The contest drew talented young artists.", "thai": "การแข่งขันดึงดูดศิลปินรุ่นเยาว์ที่มีความสามารถ"}
{"word": "artists", "english": "Artists sketched vibrant street scenes daily.", "thai": "ศิลปินร่างภาพทิวทัศน์ถนนที่คึกคักทุกวัน"}
{"word": "scenes", "english": "Scenes from the play lingered vividly.", "thai": "ฉากจากละครยังคงติดตาอย่างชัดเจน"}
{"word": "play", "english": "The school play showcased student talent.", "thai": "ละครโรงเรียนแสดงความสามารถของนักเรียน"}
{"word": "talent", "english": "Her talent shone in the choir performance.", "thai": "ความสามารถของเธอเปล่งประกายในการแสดงคณะนักร้องประสานเสียง"}
{"word": "choir", "english": "The choir sang soulful holiday carols.", "thai": "คณะนักร้องประสานเสียงร้องเพลงคริสต์มาสที่เต็มไปด้วยอารมณ์"}
{"word": "carols", "english": "Carols echoed through the snowy streets.", "thai": "เพลงคริสต์มาสดังก้องในถนนที่ปกคลุมด้วยหิมะ"}
{"word": "streets", "english": "Streets buzzed with festive holiday lights.", "thai": "ถนนคึกคักด้วยแสงไฟวันหยุดที่รื่นเริง"}
{"word": "lights", "english": "Twinkling lights adorned the cozy cabin.", "thai": "แสงไฟระยิบระยับประดับกระท่อมที่อบอุ่น"}
{"word": "cabin", "english": "The cabin offered refuge from storms.", "thai": "กระท่อมเป็นที่หลบภัยจากพายุ"}
{"word": "storms", "english": "Storms delayed their mountain hiking plans.", "thai": "พายุทำให้แผนการเดินป่าบนเขาล่าช้า"}
{"word": "hiking", "english": "Hiking trails revealed breathtaking valley views.", "thai": "เส้นทางเดินป่าเผยให้เห็นวิวหุบเขาที่น่าทึ่ง"}
{"word": "views", "english": "Panoramic views rewarded their long climb.", "thai": "วิวแบบพาโนรามาเป็นรางวัลสำหรับการปีนเขาที่ยาวนาน"}
{"word": "climb", "english": "The steep climb tested their stamina.", "thai": "การปีนเขาที่ชันทดสอบความแข็งแกร่งของพวกเขา"}
{"word": "stamina", "english": "Stamina carried her through the marathon.", "thai": "ความแข็งแกร่งพาเธอผ่านการวิ่งมาราธอน"}
{"word": "marathon", "english": "The marathon united runners from everywhere.", "thai": "มาราธอนรวมนักวิ่งจากทุกหนแห่ง"}
{"word": "runners", "english": "Runners dashed through the foggy park.", "thai": "นักวิ่งพุ่งผ่านสวนสาธารณะที่หมอกลง"}
{"word": "park", "english": "The park hosted a lively picnic.", "thai": "สวนสาธารณะจัดงานปิกนิกที่คึกคัก"}
{"word": "picnic", "english": "The picnic featured homemade lemonade.", "thai": "ปิกนิกมีน้ำมะนาวโฮมเมด"}
{"word": "lemonade", "english": "Lemonade cooled them on hot afternoons.", "thai": "น้ำมะนาวช่วยคลายร้อนในบ่ายที่ร้อนอบอ้าว"}
{"word": "afternoons", "english": "Afternoons spent reading felt so relaxing.", "thai": "ช่วงบ่ายที่ใช้ในการอ่านรู้สึกผ่อนคลายมาก"}
{"word": "reading", "english": "Reading novels sparked her wild imagination.", "thai": "การอ่านนิยายจุดประกายจินตนาการอันสุดโต่งของเธอ"}
{"word": "imagination", "english": "Her imagination fueled bold creative projects.", "thai": "จินตนาการของเธอขับเคลื่อนโครงการสร้างสรรค์ที่กล้าหาญ"}
{"word": "projects", "english": "Group projects taught them teamwork skills.", "thai": "โครงการกลุ่มสอนทักษะการทำงานเป็นทีมให้พวกเขา"}
{"word": "teamwork", "english": "Teamwork turned their vision into reality.", "thai": "การทำงานเป็นทีมเปลี่ยนวิสัยทัศน์ของพวกเขาให้เป็นจริง"}
{"word": "vision", "english": "Her vision inspired innovative startup ideas.", "thai": "วิสัยทัศน์ของเธอสร้างแรงบันดาลใจให้แนวคิดสตาร์ทอัพที่สร้างสรรค์"}
{"word": "startup", "english": "The startup pitched to eager investors.", "thai": "สตาร์ทอัพนำเสนอต่อนักลงทุนที่กระตือรือร้น"}
{"word": "investors", "english": "Investors funded her eco-friendly product line.", "thai": "นักลงทุนให้ทุนสนับสนุนสายผลิตภัณฑ์ที่เป็นมิตรต่อสิ่งแวดล้อมของเธอ"}
{"word": "product", "english": "The new product sold out instantly.", "thai": "ผลิตภัณฑ์ใหม่ขายหมดทันที"}
{"word": "sold", "english": "Her artwork sold at the gallery.", "thai": "งานศิลปะของเธอขายได้ที่แกลเลอรี่"}
{"word": "gallery", "english": "The gallery showcased vibrant modern paintings.", "thai": "แกลเลอรี่แสดงภาพวาดสมัยใหม่ที่สดใส"}
{"word": "paintings", "english": "Paintings adorned the quiet coffee shop.", "thai": "ภาพวาดประดับร้านกาแฟที่เงียบสงบ"}
{"word": "shop", "english": "The thrift shop had vintage treasures.", "thai": "ร้านมือสองมีสมบัติวินเทจ"}
{"word": "treasures", "english": "Hidden treasures awaited in the attic.", "thai": "สมบัติที่ซ่อนอยู่รออยู่ในห้องใต้หลังคา"}
{"word": "attic", "english": "The attic held dusty family heirlooms.", "thai": "ห้องใต้หลังคาเก็บมรดกครอบครัวที่เต็มไปด้วยฝุ่น"}
{"word": "heirlooms", "english": "Heirlooms told stories of past generations.", "thai": "มรดกครอบครัวเล่าเรื่องราวของรุ่นก่อน"}
{"word": "generations", "english": "Generations gathered for the annual reunion.", "thai": "หลายรุ่นรวมตัวกันในงานรวมญาติประจำปี"}
{"word": "reunion", "english": "The reunion rekindled old childhood friendships.", "thai": "งานรวมญาติจุดไฟมิตรภาพวัยเด็กเก่าๆ"}
{"word": "friendships", "english": "Old friendships blossomed over coffee chats.", "thai": "มิตรภาพเก่าๆ เบ่งบานระหว่างการจิบกาแฟคุยกัน"}
{"word": "coffee", "english": "The coffee shop buzzed with students.", "thai": "ร้านกาแฟคึกคักไปด้วยนักเรียน"}
{"word": "shop", "english": "The antique shop hid rare treasures.", "thai": "ร้านขายของเก่าซ่อนสมบัติหายาก"}
{"word": "treasures", "english": "Treasures from the past fascinated her.", "thai": "สมบัติจากอดีตทำให้เธอหลงใหล"}
{"word": "past", "english": "Memories of the past shaped his choices.", "thai": "ความทรงจำในอดีตหล่อหลอมการเลือกของเขา"}
{"word": "memories", "english": "Memories flooded back at the reunion.", "thai": "ความทรงจำท่วมท้นในงานรวมตัว"}
{"word": "reunion", "english": "The family reunion sparked joyful laughter.", "thai": "งานรวมญาติจุดประกายเสียงหัวเราะร่าเริง"}
{"word": "laughter", "english": "Her laughter echoed through the quiet park.", "thai": "เสียงหัวเราะของเธอดังก้องในสวนสาธารณะเงียบสงบ"}
{"word": "park", "english": "The park hosted a lively festival.", "thai": "สวนสาธารณะจัดงานเทศกาลที่คึกคัก"}
{"word": "festival", "english": "The festival showcased vibrant street art.", "thai": "งานเทศกาลแสดงศิลปะข้างถนนที่สดใส"}
{"word": "art", "english": "Her art captured raw human emotions.", "thai": "ศิลปะของเธอจับความรู้สึกดิบของมนุษย์"}
{"word": "emotions", "english": "Emotions ran high during the debate.", "thai": "อารมณ์พุ่งสูงในระหว่างการโต้วาที"}
{"word": "debate", "english": "The debate team practiced every evening.", "thai": "ทีมโต้วาทีฝึกซ้อมทุกเย็น"}
{"word": "team", "english": "The team bonded over shared goals.", "thai": "ทีมผูกพันผ่านเป้าหมายร่วมกัน"}
{"word": "goals", "english": "Her goals pushed her to study harder.", "thai": "เป้าหมายของเธอผลักดันให้เธอเรียนหนักขึ้น"}
{"word": "study", "english": "Late-night study sessions improved her grades.", "thai": "การเรียนดึกดื่นช่วยให้เกรดของเธอดีขึ้น"}
{"word": "grades", "english": "Good grades opened doors to scholarships.", "thai": "เกรดดีเปิดประตูสู่ทุนการศึกษา"}
{"word": "scholarships", "english": "Scholarships funded her dream college journey.", "thai": "ทุนการศึกษาสนับสนุนการเดินทางสู่มหาวิทยาลัยในฝันของเธอ"}
{"word": "college", "english": "College life taught her time management.", "thai": "ชีวิตในมหาวิทยาลัยสอนให้เธอจัดการเวลา"}
{"word": "time", "english": "Time slipped away during the road trip.", "thai": "เวลาผ่านไปอย่างรวดเร็วระหว่างการเดินทาง"}
{"word": "trip", "english": "The camping trip was a wild adventure.", "thai": "การเดินทางตั้งแคมป์เป็นการผจญภัยสุดมัน"}
{"word": "adventure", "english": "Adventure novels fueled his vivid imagination.", "thai": "นิยายผจญภัยจุดประกายจินตนาการอันสดใสของเขา"}
{"word": "imagination", "english": "Her imagination crafted magical story worlds.", "thai": "จินตนาการของเธอสร้างโลกแห่งเรื่องราวที่มหัศจรรย์"}
{"word": "story", "english": "Every story she told captivated listeners.", "thai": "ทุกเรื่องราวที่เธอเล่าดึงดูดผู้ฟัง"}
{"word": "listeners", "english": "Listeners cheered at her poetry reading.", "thai": "ผู้ฟังโห่ร้องในงานอ่านบทกวีของเธอ"}
{"word": "poetry", "english": "Poetry expressed her deepest hidden feelings.", "thai": "บทกวีแสดงความรู้สึกที่ซ่อนลึกที่สุดของเธอ"}
{"word": "feelings", "english": "Mixed feelings clouded his big decision.", "thai": "ความรู้สึกที่หลากหลายทำให้การตัดสินใจครั้งใหญ่ของเขาขุ่นมัว"}
{"word": "decision", "english": "The decision to move changed everything.", "thai": "การตัดสินใจย้ายที่อยู่อาศัยเปลี่ยนทุกอย่าง"}
{"word": "move", "english": "The dance move stunned the audience.", "thai": "ท่าเต้นทำให้ผู้ชมตะลึง"}
{"word": "audience", "english": "The audience roared after the performance.", "thai": "ผู้ชมคำรามหลังการแสดง"}
{"word": "performance", "english": "Her performance in the play was flawless.", "thai": "การแสดงของเธอในละครไร้ที่ติ"}
{"word": "play", "english": "Kids loved to play soccer after school.", "thai": "เด็กๆ ชอบเล่นฟุตบอลหลังเลิกเรียน"}
{"word": "soccer", "english": "Soccer matches brought the community together.", "thai": "การแข่งขันฟุตบอลรวมชุมชนเข้าด้วยกัน"}
{"word": "community", "english": "The community garden bloomed with vegetables.", "thai": "สวนชุมชนเต็มไปด้วยผักที่เบ่งบาน"}
{"word": "garden", "english": "Her garden attracted colorful hummingbirds daily.", "thai": "สวนของเธอดึงดูดนกฮัมมิงเบิร์ดสีสันทุกวัน"}
{"word": "hummingbirds", "english": "Hummingbirds darted around the sweet nectar.", "thai": "นกฮัมมิงเบิร์ดพุ่งไปรอบๆ น้ำหวาน"}
{"word": "nectar", "english": "Nectar sweetened the homemade fruit juice.", "thai": "น้ำหวานทำให้น้ำผลไม้โฮมเมดหวานขึ้น"}
{"word": "juice", "english": "Fresh juice refreshed them after hiking.", "thai": "น้ำผลไม้สดชื่นใจหลังการเดินป่า"}
{"word": "hiking", "english": "Hiking through mountains tested their endurance.", "thai": "การเดินป่าผ่านภูเขาทดสอบความอดทนของพวกเขา"}
{"word": "endurance", "english": "Endurance training built her mental strength.", "thai": "การฝึกความอดทนสร้างความเข้มแข็งทางจิตใจให้เธอ"}
{"word": "strength", "english": "Her strength inspired the entire gym.", "thai": "ความแข็งแกร่งของเธอสร้างแรงบันดาลใจให้ทั้งยิม"}
{"word": "gym", "english": "The gym offered intense yoga classes.", "thai": "ยิมมีชั้นเรียนโยคะที่เข้มข้น"}
{"word": "yoga", "english": "Yoga calmed her after stressful days.", "thai": "โยคะทำให้เธอสงบหลังจากวันที่เครียด"}
{"word": "days", "english": "Sunny days called for beach picnics.", "thai": "วันที่แดดจ้าชวนไปปิกนิกที่ชายหาด"}
{"word": "beach", "english": "The beach sparkled under golden sunlight.", "thai": "ชายหาดส่องประกายใต้แสงแดดสีทอง"}
{"word": "sunlight", "english": "Sunlight streamed through the classroom windows.", "thai": "แสงแดดส่องผ่านหน้าต่างห้องเรียน"}
{"word": "classroom", "english": "The classroom buzzed with curious students.", "thai": "ห้องเรียนคึกคักไปด้วยนักเรียนที่อยากรู้อยากเห็น"}
{"word": "students", "english": "Students collaborated on a science project.", "thai": "นักเรียนร่วมมือกันในโครงการวิทยาศาสตร์"}
{"word": "project", "english": "The project deadline kept them up late.", "thai": "กำหนดเวลาโครงการทำให้พวกเขานอนดึก"}
{"word": "deadline", "english": "Meeting the deadline earned her praise.", "thai": "การทำตามกำหนดเวลาได้ทำให้เธอได้รับคำชม"}
{"word": "praise", "english": "Her teacher’s praise boosted her confidence.", "thai": "คำชมของครูเพิ่มความมั่นใจให้เธอ"}
{"word": "confidence", "english": "Confidence shone in her public speech.", "thai": "ความมั่นใจเปล่งประกายในการพูดต่อหน้าสาธารณะของเธอ"}
{"word": "speech", "english": "The speech rallied the excited crowd.", "thai": "คำปราศรัยปลุกเร้าฝูงชนที่ตื่นเต้น"}
{"word": "crowd", "english": "The crowd cheered at the fireworks display.", "thai": "ฝูงชนโห่ร้องในงานแสดงดอกไม้ไฟ"}
{"word": "fireworks", "english": "Fireworks lit up the festive night.", "thai": "ดอกไม้ไฟส่องสว่างคืนเทศกาล"}
{"word": "night", "english": "The night market offered unique trinkets.", "thai": "ตลาดกลางคืนมีของที่ระลึกไม่เหมือนใคร"}
{"word": "market", "english": "The market bustled with eager shoppers.", "thai": "ตลาดคึกคักไปด้วยนักช้อปที่กระตือรือร้น"}
{"word": "shoppers", "english": "Shoppers hunted for holiday gift deals.", "thai": "นักช้อปตามล่าหาดีลของขวัญวันหยุด"}
{"word": "gift", "english": "Her gift was a handmade scarf.", "thai": "ของขวัญของเธอคือผ้าพันคอทำมือ"}
{"word": "scarf", "english": "The scarf warmed her chilly morning commute.", "thai": "ผ้าพันคอทำให้การเดินทางยามเช้าที่หนาวเย็นของเธออบอุ่น"}
{"word": "commute", "english": "Her commute included a scenic train ride.", "thai": "การเดินทางของเธอรวมถึงการนั่งรถไฟที่มีวิวสวยงาม"}
{"word": "train", "english": "The train whistled through rural landscapes.", "thai": "รถไฟผิวปากผ่านทิวทัศน์ชนบท"}
{"word": "landscapes", "english": "Landscapes inspired her latest watercolor painting.", "thai": "ทิวทัศน์จุดประกายภาพวาดสีน้ำล่าสุดของเธอ"}
{"word": "painting", "english": "The painting captured a serene sunset.", "thai": "ภาพวาดจับภาพพระอาทิตย์ตกที่เงียบสงบ"}
{"word": "sunset", "english": "The sunset cast a glow over the lake.", "thai": "พระอาทิตย์ตกทอดแสงสว่างเหนือทะเลสาบ"}
{"word": "lake", "english": "The lake reflected the starry night sky.", "thai": "ทะเลสาบสะท้อนท้องฟ้ายามค่ำคืนที่เต็มไปด้วยดวงดาว"}
{"word": "sky", "english": "A clear sky promised a perfect picnic.", "thai": "ท้องฟ้าแจ่มใสสัญญาถึงปิกนิกที่สมบูรณ์แบบ"}
{"word": "picnic", "english": "The picnic included fresh fruit salad.", "thai": "ปิกนิกมีสลัดผลไม้สด"}
{"word": "fruit", "english": "Fruit smoothies cooled their summer afternoon.", "thai": "สมูทตี้ผลไม้ช่วยคลายร้อนในบ่ายฤดูร้อน"}
{"word": "afternoon", "english": "The afternoon breeze felt refreshingly cool.", "thai": "สายลมยามบ่ายรู้สึกเย็นชื่นใจ"}
{"word": "breeze", "english": "A gentle breeze rustled the autumn leaves.", "thai": "สายลมอ่อนๆ ทำให้ใบไม้ฤดูใบไม้ร่วงสั่นไหว"}
{"word": "leaves", "english": "Leaves crunched under their hiking boots.", "thai": "ใบไม้กรอบแกรบใต้รองเท้าเดินป่าของพวกเขา"}
{"word": "boots", "english": "Her boots trudged through muddy trails.", "thai": "รองเท้าบูทของเธอลุยผ่านเส้นทางโคลน"}
{"word": "trails", "english": "Trails wound through the dense forest.", "thai": "เส้นทางคดเคี้ยวผ่านป่าที่ยึดแน่น"}
{"word": "forest", "english": "The forest echoed with chirping birds.", "thai": "ป่าดังก้องด้วยเสียงนกร้อง"}
{"word": "birds", "english": "Birds nested in the tall oak trees.", "thai": "นกทำรังในต้นโอ๊กสูง"}
{"word": "trees", "english": "Trees swayed in the stormy wind.", "thai": "ต้นไม้ไหวในลมพายุ"}
{"word": "wind", "english": "The wind carried scents of fresh pine.", "thai": "ลมพัดพากลิ่นสนสดชื่น"}
{"word": "pine", "english": "Pine needles carpeted the campsite ground.", "thai": "เข็มสนปกคลุมพื้นแคมป์"}
{"word": "campsite", "english": "The campsite glowed with a warm fire.", "thai": "แคมป์สว่างไสวด้วยกองไฟอุ่น"}
{"word": "fire", "english": "The fire crackled as stories unfolded.", "thai": "กองไฟดังเปาะแปะขณะที่เรื่องราวคลายออก"}
{"word": "stories", "english": "Ghost stories spooked the young campers.", "thai": "เรื่องผีทำให้เด็กแคมป์กลัว"}
{"word": "campers", "english": "Campers bonded over roasted marshmallows.", "thai": "ผู้ตั้งแคมป์ผูกพันกันผ่านการย่างมาร์ชเมลโลว์"}
{"word": "marshmallows", "english": "Marshmallows melted into gooey sweet treats.", "thai": "มาร์ชเมลโลว์ละลายเป็นของหวานเหนียวหนึบ"}
{"word": "treats", "english": "Holiday treats filled the festive table.", "thai": "ของหวานวันหยุดเต็มโต๊ะรื่นเริง"}
{"word": "table", "english": "The table creaked under heavy dishes.", "thai": "โต๊ะดังเอี๊ยดใต้จานหนักๆ"}
{"word": "dishes", "english": "Dishes piled up after the big dinner.", "thai": "จานกองพะเนินหลังอาหารค่ำมื้อใหญ่"}
{"word": "dinner", "english": "Dinner conversations sparked new friendships.", "thai": "การสนทนาระหว่างมื้อค่ำจุดประกายมิตรภาพใหม่"}
{"word": "friendships", "english": "Friendships grew stronger at the book club.", "thai": "มิตรภาพแข็งแกร่งขึ้นในชมรมหนังสือ"}
{"word": "book", "english": "The book revealed forgotten historical secrets.", "thai": "หนังสือเผยความลับทางประวัติศาสตร์ที่ถูกลืม"}
{"word": "secrets", "english": "Secrets whispered in the old mansion.", "thai": "ความลับกระซิบในคฤหาสน์เก่า"}
{"word": "mansion", "english": "The mansion hosted an elegant gala.", "thai": "คฤหาสน์จัดงานกาล่าที่สง่างาม"}
{"word": "gala", "english": "The gala sparkled with dazzling lights.", "thai": "งานกาล่าส่องประกายด้วยแสงไฟที่เจิดจ้า"}
{"word": "lights", "english": "Christmas lights twinkled on the street.", "thai": "ไฟคริสต์มาสระยิบระยับบนถนน"}
{"word": "street", "english": "The street bustled with morning joggers.", "thai": "ถนนคึกคักไปด้วยนักวิ่งยามเช้า"}
{"word": "joggers", "english": "Joggers raced through the foggy park.", "thai": "นักวิ่งพุ่งผ่านสวนสาธารณะที่หมอกลง"}
{"word": "park", "english": "The park bloomed with vibrant tulips.", "thai": "สวนสาธารณะเบ่งบานด้วยทิวลิปสีสัน"}
{"word": "tulips", "english": "Tulips brightened her small backyard garden.", "thai": "ทิวลิปทำให้สวนหลังบ้านเล็กๆ ของเธอสดใส"}
{"word": "garden", "english": "Her garden thrived with fresh herbs.", "thai": "สวนของเธอเจริญงอกงามด้วยสมุนไพรสด"}
{"word": "herbs", "english": "Herbs flavored the homemade soup perfectly.", "thai": "สมุนไพรเพิ่มรสชาติให้ซุปโฮมเมดอย่างลงตัว"}
{"word": "soup", "english": "The soup warmed their chilly evening.", "thai": "ซุปทำให้ค่ำคืนที่หนาวเย็นของพวกเขาอบอุ่น"}
{"word": "evening", "english": "An evening stroll cleared her mind.", "thai": "การเดินเล่นยามเย็นทำให้จิตใจของเธอปลอดโปร่ง"}
{"word": "mind", "english": "Her mind buzzed with creative ideas.", "thai": "จิตใจของเธอเต็มไปด้วยความคิดสร้างสรรค์"}
{"word": "ideas", "english": "New ideas sparked a lively brainstorm.", "thai": "ความคิดใหม่จุดประกายการระดมสมองที่คึกคัก"}
{"word": "brainstorm", "english": "The brainstorm session solved the puzzle.", "thai": "เซสชันระดมสมองแก้ปริศนาได้"}
{"word": "puzzle", "english": "The puzzle challenged their logical thinking.", "thai": "ปริศนาท้าทายการคิดเชิงตรรกะของพวกเขา"}
{"word": "thinking", "english": "Quick thinking saved the failing project.", "thai": "การคิดเร็วช่วยโครงการที่กำลังล้มเหลว"}
{"word": "project", "english": "The project united the diverse team.", "thai": "โครงการรวมทีมที่หลากหลายเข้าด้วยกัน"}
{"word": "team", "english": "The team celebrated their hard-earned victory.", "thai": "ทีมเฉลิมฉลองชัยชนะที่ได้มาด้วยความยากลำบาก"}
{"word": "victory", "english": "Victory boosted their confidence sky-high.", "thai": "ชัยชนะเพิ่มความมั่นใจของพวกเขาอย่างมาก"}
{"word": "confidence", "english": "Her confidence shone during the presentation.", "thai": "ความมั่นใจของเธอเปล่งประกายระหว่างการนำเสนอ"}
{"word": "presentation", "english": "The presentation wowed the corporate clients.", "thai": "การนำเสนอทำให้ลูกค้าบริษัทประทับใจ"}
{"word": "clients", "english": "Clients praised her innovative design approach.", "thai": "ลูกค้าชื่นชมวิธีการออกแบบที่สร้างสรรค์ของเธอ"}
{"word": "design", "english": "Her design transformed the outdated office.", "thai": "การออกแบบของเธอเปลี่ยนสำนักงานที่ล้าสมัย"}
{"word": "office", "english": "The office hummed with morning chatter.", "thai": "สำนักงานคึกคักด้วยการพูดคุยตอนเช้า"}
{"word": "chatter", "english": "Chatter filled the lively coffee shop.", "thai": "การพูดคุยเต็มไปในร้านกาแฟที่คึกคัก"}
{"word": "coffee", "english": "Coffee fueled their late-night study session.", "thai": "กาแฟช่วยเติมพลังให้เซสชันเรียนดึก"}
{"word": "session", "english": "The therapy session eased her stress.", "thai": "เซสชันบำบัดช่วยลดความเครียดของเธอ"}
{"word": "stress", "english": "Stress melted away during her vacation.", "thai": "ความเครียดหายไประหว่างการพักร้อนของเธอ"}
{"word": "vacation", "english": "The beach vacation was pure bliss.", "thai": "การพักร้อนที่ชายหาดคือความสุขล้วนๆ"}
{"word": "beach", "english": "The beach sparkled under the midday sun.", "thai": "ชายหาดส่องประกายใต้แสงแดดตอนเที่ยง"}
{"word": "sun", "english": "The sun set behind the rugged mountains.", "thai": "ดวงอาทิตย์ตกหลังภูเขาที่ขรุขระ"}
{"word": "mountains", "english": "Mountains challenged their hiking endurance daily.", "thai": "ภูเขาท้าทายความอดทนในการเดินป่าของพวกเขาทุกวัน"}
{"word": "hiking", "english": "Hiking trails revealed stunning forest views.", "thai": "เส้นทางเดินป่าเผยให้เห็นวิวป่าที่น่าทึ่ง"}
{"word": "forest", "english": "The forest buzzed with chirping wildlife.", "thai": "ป่าคึกคักด้วยเสียงสัตว์ป่าที่ร้องเจี๊ยกๆ"}
{"word": "wildlife", "english": "Wildlife documentaries inspired her conservation passion.", "thai": "สารคดีสัตว์ป่าจุดประกายความหลงใหลในการอนุรักษ์ของเธอ"}
{"word": "passion", "english": "Her passion for music shone through.", "thai": "ความหลงใหลในดนตรีของเธอเปล่งประกาย"}
{"word": "music", "english": "Live music energized the summer festival.", "thai": "ดนตรีสดทำให้งานเทศกาลฤ concerti คึกคัก"}
{"word": "festival", "english": "The festival offered spicy street tacos.", "thai": "งานเทศกาลมีทาโก้ข้างถนนรสเผ็ด"}
{"word": "tacos", "english": "Tacos paired perfectly with fresh salsa.", "thai": "ทาโก้เข้ากันดีกับซัลซ่าสด"}
{"word": "salsa", "english": "Salsa dancing lit up the party.", "thai": "การเต้นซัลซ่าทำให้งานปาร์ตี้คึกคัก"}
{"word": "party", "english": "The party spilled into the backyard.", "thai": "งานปาร์ตี้ล้นออกมาที่สนามหลังบ้าน"}
{"word": "backyard", "english": "The backyard bloomed with colorful roses.", "thai": "สนามหลังบ้านเบ่งบานด้วยกุหลาบสีสัน"}
{"word": "roses", "english": "Roses scented the warm evening air.", "thai": "กุหลาบส่งกลิ่นหอมในอากาศยามเย็นที่อบอุ่น"}
{"word": "air", "english": "Fresh air revived her during the jog.", "thai": "อากาศบริสุทธิ์ทำให้เธอสดชื่นระหว่างวิ่ง"}
{"word": "jog", "english": "A morning jog cleared his thoughts.", "thai": "การวิ่งตอนเช้าทำให้ความคิดของเขาปลอดโปร่ง"}
{"word": "thoughts", "english": "His thoughts wandered during the lecture.", "thai": "ความคิดของเขาเหม่อลอยระหว่างการบรรยาย"}
{"word": "lecture", "english": "The lecture explored cutting-edge tech trends.", "thai": "การบรรยายสำรวจเทรนด์เทคโนโลยีล้ำสมัย"}
{"word": "tech", "english": "Tech startups competed for investor attention.", "thai": "สตาร์ทอัพเทคโนโลยีแข่งขันเพื่อดึงดูดความสนใจของนักลงทุน"}
{"word": "investor", "english": "The investor backed her bold vision.", "thai": "นักลงทุนสนับสนุนวิสัยทัศน์ที่กล้าหาญของเธอ"}
{"word": "vision", "english": "Her vision shaped the company’s future.", "thai": "วิสัยทัศน์ของเธอหล่อหลอมอนาคตของบริษัท"}
{"word": "company", "english": "The company launched a sustainable product.", "thai": "บริษัทเปิดตัวผลิตภัณฑ์ที่ยั่งยืน"}
{"word": "product", "english": "The product sold out in hours.", "thai": "ผลิตภัณฑ์ขายหมดในไม่กี่ชั่วโมง"}
{"word": "hours", "english": "Hours of practice perfected her dance.", "thai": "ชั่วโมงแห่งการฝึกซ้อมทำให้การเต้นของเธอสมบูรณ์แบบ"}
{"word": "dance", "english": "The dance class taught salsa moves.", "thai": "ชั้นเรียนเต้นสอนท่าสัลซ่า"}
{"word": "moves", "english": "Her chess moves outsmarted the opponent.", "thai": "การเดินหมากรุกของเธอฉลาดกว่าคู่ต่อสู้"}
{"word": "opponent", "english": "The opponent faltered under intense pressure.", "thai": "คู่ต่อสู้สะดุดภายใต้แรงกดดันที่หนักหน่วง"}
{"word": "pressure", "english": "Pressure to win drove the team.", "thai": "แรงกดดันเพื่อชัยชนะผลักดันทีม"}
{"word": "win", "english": "The win sparked wild crowd cheers.", "thai": "ชัยชนะจุดประกายเสียงโห่ร้องของฝูงชน"}
{"word": "crowd", "english": "The crowd gathered for the parade.", "thai": "ฝูงชนรวมตัวกันเพื่อขบวนพาเหรด"}
{"word": "parade", "english": "The parade featured vibrant marching bands.", "thai": "ขบวนพาเหรดมีวงดนตรีเดินขบวนที่สดใส"}
{"word": "bands", "english": "Bands played soulful tunes at dusk.", "thai": "วงดนตรีเล่นเพลงที่เต็มไปด้วยอารมณ์ในยามพลบค่ำ"}
{"word": "dusk", "english": "Dusk painted the sky with pinks.", "thai": "พลบค่ำแต้มท้องฟ้าด้วยสีชมพู"}
{"word": "sky", "english": "The clear sky promised perfect stargazing.", "thai": "ท้องฟ้าแจ่มใสสัญญาถึงการดูดาวที่สมบูรณ์แบบ"}
{"word": "stargazing", "english": "Stargazing bonded them under the moonlight.", "thai": "การดูดาวทำให้พวกเขาผูกพันใต้แสงจันทร์"}
{"word": "moonlight", "english": "Moonlight illuminated the quiet forest path.", "thai": "แสงจันทร์ส่องสว่างเส้นทางป่าที่เงียบสงบ"}
{"word": "path", "english": "The path wound through blooming meadows.", "thai": "เส้นทางคดเคี้ยวผ่านทุ่งหญ้าที่เบ่งบาน"}
{"word": "meadows", "english": "Meadows buzzed with busy honeybees.", "thai": "ทุ่งหญ้าคึกคักด้วยผึ้งที่วุ่นวาย"}
{"word": "honeybees", "english": "Honeybees pollinated the vibrant wildflowers.", "thai": "ผึ้งผสมเกสรดอกไม้ป่าที่สดใส"}
{"word": "wildflowers", "english": "Wildflowers dotted the scenic hiking trail.", "thai": "ดอกไม้ป่าประดับเส้นทางเดินป่าที่สวยงาม"}
{"word": "trail", "english": "The trail led to a hidden waterfall.", "thai": "เส้นทางนำไปสู่น้ำตกที่ซ่อนอยู่"}
{"word": "waterfall", "english": "The waterfall mist cooled their faces.", "thai": "หมอกน้ำตกทำให้ใบหน้าของพวกเขาเย็นลง"}
{"word": "faces", "english": "Smiling faces greeted her at the party.", "thai": "ใบหน้าที่ยิ้มแย้มต้อนรับเธอในงานปาร์ตี้"}
{"word": "party", "english": "The party rocked with loud music.", "thai": "งานปาร์ตี้คึกคักด้วยดนตรีเสียงดัง"}
{"word": "music", "english": "Music flowed through the open windows.", "thai": "ดนตรีไหลผ่านหน้าต่างที่เปิดอยู่"}
{"word": "windows", "english": "Windows reflected the glowing city lights.", "thai": "หน้าต่างสะท้อนแสงไฟเมืองที่สว่างไสว"}
{"word": "lights", "english": "Holiday lights twinkled on the tree.", "thai": "ไฟวันหยุดระยิบระยับบนต้นไม้"}
{"word": "tree", "english": "The tree shaded their cozy picnic.", "thai": "ต้นไม้ให้ร่มเงางานปิกนิกที่อบอุ่นของพวกเขา"}
{"word": "picnic", "english": "The picnic featured homemade lemonade stands.", "thai": "ปิกนิกมีร้านน้ำมะนาวโฮมเมด"}
{"word": "lemonade", "english": "Lemonade refreshed them after the game.", "thai": "น้ำมะนาวทำให้พวกเขาสดชื่นหลังเกม"}
{"word": "game", "english": "The board game sparked friendly competition.", "thai": "เกมกระดานจุดประกายการแข่งขันที่เป็นมิตร"}
{"word": "competition", "english": "Competition drove her to train harder.", "thai": "การแข่งขันผลักดันให้เธอฝึกหนักขึ้น"}
{"word": "train", "english": "The train journey offered stunning views.", "thai": "การเดินทางโดยรถไฟมีวิวที่สวยงาม"}
{"word": "views", "english": "Ocean views calmed her restless heart.", "thai": "วิวทะเลทำให้หัวใจที่กระสับกระส่ายของเธอสงบลง"}
{"word": "heart", "english": "Her heart raced during the thriller movie.", "thai": "หัวใจของเธอเต้นแรงระหว่างดูหนังระทึกขวัญ"}
{"word": "movie", "english": "The movie night ended with laughter.", "thai": "คืนดูหนังจบลงด้วยเสียงหัวเราะ"}
{"word": "laughter", "english": "Laughter echoed through the family gathering.", "thai": "เสียงหัวเราะดังก้องในงานรวมญาติ"}
{"word": "gathering", "english": "The gathering celebrated their shared traditions.", "thai": "งานรวมตัวเฉลิมฉลองประเพณีร่วมกันของพวกเขา"}
{"word": "traditions", "english": "Traditions shaped their vibrant holiday feast.", "thai": "ประเพณีหล่อหลอมงานเลี้ยงวันหยุดที่คึกคักของพวกเขา"}
{"word": "feast", "english": "The feast included spicy roasted chicken.", "thai": "งานเลี้ยงมีไก่อบรสเผ็ด"}
{"word": "chicken", "english": "Chicken curry simmered on the stove.", "thai": "แกงไก่เคี่ยวนานบนเตา"}
{"word": "stove", "english": "The stove warmed the cozy kitchen.", "thai": "เตาทำให้ห้องครัวที่อบอุ่นร้อนขึ้น"}
{"word": "kitchen", "english": "The kitchen smelled of fresh-baked bread.", "thai": "ห้องครัวมีกลิ่นขนมปังอบใหม่"}
{"word": "bread", "english": "Bread paired perfectly with creamy butter.", "thai": "ขนมปังเข้ากันดีกับเนยครีม"}
{"word": "butter", "english": "Butter melted over the hot pancakes.", "thai": "เนยละลายบนแพนเค้กร้อนๆ"}
{"word": "pancakes", "english": "Pancakes made Sunday mornings extra special.", "thai": "แพนเค้กทำให้เช้าวันอาทิตย์พิเศษยิ่งขึ้น"}
{"word": "mornings", "english": "Mornings began with a jog outdoors.", "thai": "เช้าเริ่มต้นด้วยการวิ่งกลางแจ้ง"}
{"word": "outdoors", "english": "Outdoors adventures thrilled the young explorers.", "thai": "การผจญภัยกลางแจ้งทำให้ผู้สำรวจรุ่นเยาว์ตื่นเต้น"}
{"word": "explorers", "english": "Explorers charted the unspoiled wilderness.", "thai": "นักสำรวจทำแผนที่ถิ่นทุรกันดารที่ยังบริสุทธิ์"}
{"word": "wilderness", "english": "The wilderness whispered tales of survival.", "thai": "ถิ่นทุรกันดารกระซิบเรื่องราวของการเอาชีวิตรอด"}
{"word": "survival", "english": "Survival skills saved them during the storm.", "thai": "ทักษะการเอาชีวิตรอดช่วยพวกเขาระหว่างพายุ"}
{"word": "storm", "english": "The storm scattered leaves across the yard.", "thai": "พายุทำให้ใบไม้กระจัดกระจายทั่วลาน"}
{"word": "yard", "english": "The yard hosted a lively barbecue.", "thai": "ลานจัดงานบาร์บีคิวที่คึกคัก"}
{"word": "barbecue", "english": "The barbecue sizzled with juicy burgers.", "thai": "บาร์บีคิวร้อนฉ่าไปด้วยเบอร์เกอร์ฉ่ำ"}
{"word": "burgers", "english": "Burgers paired well with crispy fries.", "thai": "เบอร์เกอร์เข้ากันดีกับเฟรนช์ฟรายส์กรอบ"}
{"word": "fries", "english": "Fries dipped in ketchup were her favorite.", "thai": "เฟรนช์ฟรายส์จิ้มซอสมะเขือเทศเป็นของโปรดของเธอ"}
{"word": "ketchup", "english": "Ketchup stained her favorite white shirt.", "thai": "ซอสมะเขือเทศเปื้อนเสื้อขาวตัวโปรดของเธอ"}
{"word": "shirt", "english": "The shirt matched her vibrant personality.", "thai": "เสื้อเข้ากับบุคลิกที่สดใสของเธอ"}
{"word": "vibrant", "english": "The vibrant festival attracted lively crowds.", "thai": "งานเทศกาลที่สดใสดึงดูดฝูงชนที่คึกคัก"}
{"word": "festival", "english": "The festival sparkled with vibrant lights.", "thai": "งานเทศกาลส่องประกายด้วยแสงไฟที่สดใส"}
{"word": "lights", "english": "Twinkling lights adorned the cozy cafe.", "thai": "แสงไฟระยิบระยับประดับร้านกาแฟที่อบอุ่น"}
{"word": "cafe", "english": "The cafe buzzed with morning chatter.", "thai": "ร้านกาแฟคึกคักด้วยการพูดคุยยามเช้า"}
{"word": "chatter", "english": "Chatter filled the lively classroom discussion.", "thai": "เสียงพูดคุยเต็มไปในการสนทนาในชั้นเรียนที่คึกคัก"}
{"word": "classroom", "english": "The classroom echoed with student laughter.", "thai": "ห้องเรียนดังก้องด้วยเสียงหัวเราะของนักเรียน"}
{"word": "laughter", "english": "Her laughter brightened the gloomy afternoon.", "thai": "เสียงหัวเราะของเธอทำให้บ่ายที่หม่นหมองสดใสขึ้น"}
{"word": "afternoon", "english": "The afternoon breeze cooled their picnic.", "thai": "สายลมยามบ่ายทำให้ปิกนิกของพวกเขาเย็นสบาย"}
{"word": "picnic", "english": "The picnic featured homemade apple pie.", "thai": "ปิกนิกมีพายแอปเปิ้ลโฮมเมด"}
{"word": "pie", "english": "The pie crust flaked perfectly when cut.", "thai": "แป้งพายกรอบสมบูรณ์แบบเมื่อตัด"}
{"word": "crust", "english": "The pizza crust was crispy and golden.", "thai": "แป้งพิซซ่ากรอบและสีทอง"}
{"word": "pizza", "english": "Pizza night united the whole family.", "thai": "คืนพิซซ่ารวมครอบครัวทั้งหมดเข้าด้วยกัน"}
{"word": "family", "english": "Family traditions warmed their holiday gathering.", "thai": "ประเพณีครอบครัวทำให้การรวมตัววันหยุดอบอุ่น"}
{"word": "gathering", "english": "The gathering spilled into the moonlit yard.", "thai": "การรวมตัวล้นออกมาที่ลานใต้แสงจันทร์"}
{"word": "yard", "english": "The yard bloomed with colorful tulips.", "thai": "ลานเต็มไปด้วยทิวลิปสีสัน"}
{"word": "tulips", "english": "Tulips lined the path to her cottage.", "thai": "ทิวลิปเรียงรายตามทางไปยังกระท่อมของเธอ"}
{"word": "path", "english": "The path wound through a quiet forest.", "thai": "เส้นทางคดเคี้ยวผ่านป่าที่เงียบสงบ"}
{"word": "forest", "english": "The forest hummed with chirping birds.", "thai": "ป่าคึกคักด้วยเสียงนกร้อง"}
{"word": "birds", "english": "Birds nested in the tall oak trees.", "thai": "นกทำรังในต้นโอ๊กสูง"}
{"word": "trees", "english": "Trees swayed gently in the evening breeze.", "thai": "ต้นไม้ไหวเบาๆ ในสายลมยามเย็น"}
{"word": "breeze", "english": "A cool breeze refreshed the hikers.", "thai": "สายลมเย็นทำให้ผู้เดินป่าสดชื่น"}
{"word": "hikers", "english": "Hikers discovered a hidden mountain stream.", "thai": "นักเดินป่าค้นพบลำธารบนเขาที่ซ่อนอยู่"}
{"word": "stream", "english": "The stream sparkled under the midday sun.", "thai": "ลำธารส่องประกายใต้แสงแดดตอนเที่ยง"}
{"word": "sun", "english": "The sun warmed their early morning jog.", "thai": "ดวงอาทิตย์ทำให้การวิ่งยามเช้าของพวกเขาอบอุ่น"}
{"word": "jog", "english": "A jog through the park energized her.", "thai": "การวิ่งผ่านสวนสาธารณะทำให้เธอมีพลัง"}
{"word": "park", "english": "The park hosted a vibrant music festival.", "thai": "สวนสาธารณะจัดงานเทศกาลดนตรีที่คึกคัก"}
{"word": "music", "english": "Music drifted from the open coffee shop.", "thai": "ดนตรีลอยมาจากร้านกาแฟที่เปิดหน้าต่าง"}
{"word": "coffee", "english": "Coffee fueled their late-night study group.", "thai": "กาแฟช่วยเติมพลังให้กลุ่มเรียนดึก"}
{"word": "group", "english": "The group bonded over shared campfire stories.", "thai": "กลุ่มผูกพันผ่านเรื่องราวรอบกองไฟ"}
{"word": "campfire", "english": "The campfire crackled under a starry sky.", "thai": "กองไฟดังเปาะแปะใต้ท้องฟ้าที่เต็มไปด้วยดวงดาว"}
{"word": "sky", "english": "The clear sky promised perfect stargazing.", "thai": "ท้องฟ้าแจ่มใสสัญญาถึงการดูดาวที่สมบูรณ์แบบ"}
{"word": "stargazing", "english": "Stargazing inspired her poetic journal entries.", "thai": "การดูดาวจุดประกายบันทึกบทกวีของเธอ"}
{"word": "journal", "english": "Her journal captured raw daily emotions.", "thai": "สมุดบันทึกของเธอบันทึกอารมณ์ประจำวันอย่างแท้จริง"}
{"word": "emotions", "english": "Emotions ran high during the heated debate.", "thai": "อารมณ์พุ่งสูงในระหว่างการโต้วาทีที่ดุเดือด"}
{"word": "debate", "english": "The debate team practiced sharp arguments.", "thai": "ทีมโต้วาทีฝึกฝนข้อโต้แย้งที่เฉียบคม"}
{"word": "arguments", "english": "Arguments faded over a warm dinner.", "thai": "การโต้เถียงจางหายไปในมื้อค่ำที่อบอุ่น"}
{"word": "dinner", "english": "Dinner featured spicy homemade curry.", "thai": "มื้อค่ำมีแกงโฮมเมดรสเผ็ด"}
{"word": "curry", "english": "Curry simmered with fresh market herbs.", "thai": "แกงเคี่ยวนานด้วยสมุนไพรสดจากตลาด"}
{"word": "herbs", "english": "Herbs scented the cozy kitchen air.", "thai": "สมุนไพรส่งกลิ่นหอมในอากาศห้องครัวที่อบอุ่น"}
{"word": "kitchen", "english": "The kitchen bustled with holiday baking.", "thai": "ห้องครัวคึกคักด้วยการอบขนมวันหยุด"}
{"word": "baking", "english": "Baking cookies filled the house with warmth.", "thai": "การอบคุกกี้ทำให้บ้านเต็มไปด้วยความอบอุ่น"}
{"word": "cookies", "english": "Cookies crumbled in her picnic basket.", "thai": "คุกกี้แตกในตะกร้าปิกนิกของเธอ"}
{"word": "basket", "english": "The basket held fresh farmer’s market produce.", "thai": "ตะกร้าใส่ผลผลิตสดจากตลาดเกษตรกร"}
{"word": "produce", "english": "Fresh produce inspired her new recipe.", "thai": "ผลผลิตสดจุดประกายสูตรอาหารใหม่ของเธอ"}
{"word": "recipe", "english": "The recipe called for ripe tomatoes.", "thai": "สูตรอาหารต้องใช้มะเขือเทศสุก"}
{"word": "tomatoes", "english": "Tomatoes added color to the salad.", "thai": "มะเขือเทศเพิ่มสีสันให้สลัด"}
{"word": "salad", "english": "The salad paired well with grilled chicken.", "thai": "สลัดเข้ากันดีกับไก่ย่าง"}
{"word": "chicken", "english": "Chicken sizzled on the backyard grill.", "thai": "ไก่ร้อนฉ่าบนเตาย่างในสวนหลังบ้าน"}
{"word": "grill", "english": "The grill smoked with juicy burgers.", "thai": "เตาย่างควันโขมงด้วยเบอร์เกอร์ฉ่ำ"}
{"word": "burgers", "english": "Burgers tempted everyone at the barbecue.", "thai": "เบอร์เกอร์ล่อใจทุกคนในงานบาร์บีคิว"}
{"word": "barbecue", "english": "The barbecue brought neighbors together outdoors.", "thai": "งานบาร์บีคิวนำเพื่อนบ้านมารวมตัวกันกลางแจ้ง"}
{"word": "neighbors", "english": "Neighbors shared stories over evening drinks.", "thai": "เพื่อนบ้านแบ่งปันเรื่องราวระหว่างเครื่องดื่มยามเย็น"}
{"word": "drinks", "english": "Cool drinks refreshed the hot summer day.", "thai": "เครื่องดื่มเย็นๆ ทำให้วันฤดูร้อนที่ร้อนอบอ้าวสดชื่น"}
{"word": "summer", "english": "Summer vibes filled the beach party.", "thai": "บรรยากาศฤดูร้อนเต็มไปในงานปาร์ตี้ชายหาด"}
{"word": "beach", "english": "The beach sparkled under golden sunlight.", "thai": "ชายหาดส่องประกายใต้แสงแดดสีทอง"}
{"word": "sunlight", "english": "Sunlight streamed through the open windows.", "thai": "แสงแดดส่องผ่านหน้าต่างที่เปิดอยู่"}
{"word": "windows", "english": "Windows framed views of the quiet valley.", "thai": "หน้าต่างล้อมกรอบวิวของหุบเขาที่เงียบสงบ"}
{"word": "valley", "english": "The valley bloomed with wildflower patches.", "thai": "หุบเขาเบ่งบานด้วยแปลงดอกไม้ป่า"}
{"word": "wildflower", "english": "Wildflower bouquets decorated the rustic wedding.", "thai": "ช่อดอกไม้ป่าประดับงานแต่งงานสไตล์ชนบท"}
{"word": "wedding", "english": "The wedding featured a lively dance floor.", "thai": "งานแต่งงานมีฟลอร์เต้นรำที่คึกคัก"}
{"word": "dance", "english": "Dance lessons taught her salsa moves.", "thai": "บทเรียนเต้นรำสอนท่าสัลซ่าให้เธอ"}
{"word": "moves", "english": "Her chess moves stunned the opponent.", "thai": "การเดินหมากรุกของเธอทำให้คู่ต่อสู้ตะลึง"}
{"word": "opponent", "english": "The opponent faltered under tough questions.", "thai": "คู่ต่อสู้สะดุดเมื่อเจอคำถามยาก"}
{"word": "questions", "english": "Questions sparked a lively classroom debate.", "thai": "คำถามจุดประกายการโต้วาทีในชั้นเรียนที่คึกคัก"}
{"word": "debate", "english": "The debate honed her critical thinking.", "thai": "การโต้วาทีฝึกฝนการคิดวิเคราะห์ของเธอ"}
{"word": "thinking", "english": "Creative thinking fueled her art project.", "thai": "การคิดสร้างสรรค์ขับเคลื่อนโครงการศิลปะของเธอ"}
{"word": "project", "english": "The project deadline loomed over them.", "thai": "กำหนดเวลาโครงการคืบคลานเข้ามาใกล้"}
{"word": "deadline", "english": "Meeting the deadline earned her praise.", "thai": "การทำตามกำหนดเวลาได้ทำให้เธอได้รับคำชม"}
{"word": "praise", "english": "Her teacher’s praise boosted her confidence.", "thai": "คำชมของครูเพิ่มความมั่นใจให้เธอ"}
{"word": "confidence", "english": "Confidence carried her through the interview.", "thai": "ความมั่นใจพาเธอผ่านการสัมภาษณ์"}
{"word": "interview", "english": "The job interview tested her quick wit.", "thai": "การสัมภาษณ์งานทดสอบไหวพริบว่องไวของเธอ"}
{"word": "wit", "english": "Her wit charmed the entire audience.", "thai": "ไหวพริบของเธอทำให้ผู้ชมทั้งหมดหลงใหล"}
{"word": "audience", "english": "The audience roared after the comedy show.", "thai": "ผู้ชมคำรามหลังการแสดงตลก"}
{"word": "comedy", "english": "Comedy sketches lightened the tense mood.", "thai": "การแสดงตลกสั้นๆ ทำให้บรรยากาศที่ตึงเครียดผ่อนคลาย"}
{"word": "mood", "english": "The rainy mood inspired her poetry.", "thai": "บรรยากาศฝนตกจุดประกายบทกวีของเธอ"}
{"word": "poetry", "english": "Poetry readings filled the cozy bookstore.", "thai": "การอ่านบทกวีเต็มไปในร้านหนังสือที่อบอุ่น"}
{"word": "bookstore", "english": "The bookstore hosted a local author event.", "thai": "ร้านหนังสือจัดงานพบปะนักเขียนท้องถิ่น"}
{"word": "author", "english": "The author signed copies of her novel.", "thai": "นักเขียนลงนามในสำเนานิยายของเธอ"}
{"word": "novel", "english": "Her novel explored deep human struggles.", "thai": "นิยายของเธอสำรวจการต่อสู้ของมนุษย์อย่างลึกซึ้ง"}
{"word": "struggles", "english": "Struggles shaped her resilient character.", "thai": "การต่อสู้หล่อหลอมบุคลิกที่ยืดหยุ่นของเธอ"}
{"word": "character", "english": "Her character shone in tough moments.", "thai": "บุคลิกของเธอเปล่งประกายในช่วงเวลาที่ยากลำบาก"}
{"word": "moments", "english": "Quiet moments by the lake soothed her.", "thai": "ช่วงเวลาเงียบสงบข้างทะเลสาบปลอบโยนเธอ"}
{"word": "lake", "english": "The lake reflected a stunning sunset glow.", "thai": "ทะเลสาบสะท้อนแสงพระอาทิตย์ตกที่สวยงาม"}
{"word": "sunset", "english": "Sunset walks calmed his racing thoughts.", "thai": "การเดินเล่นตอนพระอาทิตย์ตกทำให้ความคิดที่วุ่นวายของเขาสงบลง"}
{"word": "thoughts", "english": "His thoughts wandered during the long lecture.", "thai": "ความคิดของเขาเหม่อลอยระหว่างการบรรยายที่ยาวนาน"}
{"word": "lecture", "english": "The lecture unpacked complex scientific theories.", "thai": "การบรรยายอธิบายทฤษฎีวิทยาศาสตร์ที่ซับซ้อน"}
{"word": "theories", "english": "Theories sparked heated classroom discussions.", "thai": "ทฤษฎีจุดประกายการสนทนาในชั้นเรียนที่ดุเดือด"}
{"word": "discussions", "english": "Discussions over coffee fueled new ideas.", "thai": "การสนทนาระหว่างดื่มกาแฟจุดประกายความคิดใหม่"}
{"word": "ideas", "english": "Her ideas revolutionized the team’s approach.", "thai": "ความคิดของเธอปฏิวัติวิธีการของทีม"}
{"word": "approach", "english": "A fresh approach solved the old problem.", "thai": "วิธีการใหม่แก้ปัญหาเก่าได้"}
{"word": "problem", "english": "The math problem stumped the entire class.", "thai": "โจทย์คณิตศาสตร์ทำให้ทั้งชั้นเรียนงง"}
{"word": "class", "english": "The class cheered for their winning team.", "thai": "ชั้นเรียนโห่ร้องให้ทีมที่ชนะ"}
{"word": "team", "english": "The team collaborated on a bold project.", "thai": "ทีมร่วมมือกันในโครงการที่กล้าหาญ"}
{"word": "project", "english": "The project showcased their creative talents.", "thai": "โครงการแสดงความสามารถสร้างสรรค์ของพวกเขา"}
{"word": "talents", "english": "Her talents shone in the art gallery.", "thai": "ความสามารถของเธอเปล่งประกายในแกลเลอรีศิลปะ"}
{"word": "gallery", "english": "The gallery displayed vibrant local paintings.", "thai": "แกลเลอรีแสดงภาพวาดท้องถิ่นที่สดใส"}
{"word": "paintings", "english": "Paintings inspired her to start sketching.", "thai": "ภาพวาดจุดประกายให้เธอเริ่มร่างภาพ"}
{"word": "sketching", "english": "Sketching nature calmed her busy mind.", "thai": "การร่างภาพธรรมชาติทำให้จิตใจที่วุ่นวายของเธอสงบ"}
{"word": "nature", "english": "Nature hikes revealed breathtaking mountain views.", "thai": "การเดินป่าธรรมชาติเผยให้เห็นวิวภูเขาที่น่าทึ่ง"}
{"word": "views", "english": "Ocean views soothed her restless soul.", "thai": "วิวทะเลปลอบโยนจิตใจที่กระสับกระส่ายของเธอ"}
{"word": "soul", "english": "Her soul connected with the soulful music.", "thai": "จิตวิญญาณของเธอเชื่อมโยงกับดนตรีที่เต็มไปด้วยอารมณ์"}
{"word": "music", "english": "Music filled the air at the concert.", "thai": "ดนตรีเติมเต็มบรรยากาศในคอนเสิร์ต"}
{"word": "concert", "english": "The concert drew a massive excited crowd.", "thai": "คอนเสิร์ตดึงดูดฝูงชนที่ตื่นเต้นจำนวนมาก"}
