{"word":"breathing","english":"Deep breathing calms my nerves before a big presentation.","thai":"การหายใจลึกๆ ช่วยให้ฉันสงบสติอารมณ์ก่อนการนำเสนอครั้งใหญ่"}
{"word":"calms","english":"A hot cup of tea calms me down after a long day.","thai":"ชาร้อนหนึ่งแก้วช่วยให้ฉันผ่อนคลายหลังจากวันที่ยาวนาน"}
{"word":"tea","english":"I spilled my tea while texting my friend.","thai":"ฉันทำชาหกขณะส่งข้อความหาเพื่อน"}
{"word":"texting","english":"Texting during class can get you in trouble.","thai":"การส่งข้อความระหว่างเรียนอาจทำให้คุณเดือดร้อน"}
{"word":"class","english":"The yoga class helps me find balance.","thai":"คลาสโยคะช่วยให้ฉันพบความสมดุล"}
{"word":"balance","english":"I need to balance work and play this weekend.","thai":"ฉันต้องรักษาสมดุลระหว่างงานและการพักผ่อนสุดสัปดาห์นี้"}
{"word":"work","english":"Teamwork makes the dream work at the office.","thai":"การทำงานเป็นทีมทำให้ความฝันเป็นจริงที่ออฟฟิศ"}
{"word":"teamwork","english":"Teamwork during the project led to awesome results.","thai":"การทำงานเป็นทีมในโปรเจกต์นำไปสู่ผลลัพธ์ที่ยอดเยี่ยม"}
{"word":"project","english":"I’m hyped to start my new art project.","thai":"ฉันตื่นเต้นที่จะเริ่มโปรเจกต์ศิลปะใหม่"}
{"word":"art","english":"Her street art totally blew my mind.","thai":"ศิลปะบนถนนของเธอทำให้ฉันทึ่งสุดๆ"}
{"word":"mind","english":"I changed my mind about joining the book club.","thai":"ฉันเปลี่ยนใจเกี่ยวกับการเข้าร่วมชมรมหนังสือ"}
{"word":"book","english":"I picked up a cool book at the thrift store.","thai":"ฉันหยิบหนังสือเจ๋งๆ มาจากร้านมือสอง"}
{"word":"store","english":"The grocery store ran out of my favorite chips.","thai":"ร้านขายของชำหมดชิปที่ฉันชอบ"}
{"word":"chips","english":"Chips and salsa are my go-to snack for movie night.","thai":"ชิปกับซัลซ่าเป็นของว่างประจำของฉันสำหรับคืนดูหนัง"}
{"word":"movie","english":"That new horror movie scared the pants off me.","thai":"หนังสยองขวัญใหม่นั้นทำให้ฉันกลัวจนตัวสั่น"}
{"word":"scared","english":"I got scared when my dog ran into traffic.","thai":"ฉันตกใจเมื่อสุนัขของฉันวิ่งเข้าไปในถนน"}
{"word":"dog","english":"My dog loves chasing squirrels in the park.","thai":"สุนัขของฉันชอบวิ่งไล่กระรอกในสวนสาธารณะ"}
{"word":"park","english":"We hung out at the park for a picnic.","thai":"เราไปนั่งเล่นที่สวนสาธารณะเพื่อปิกนิก"}
{"word":"picnic","english":"The picnic got rained out, so we stayed home.","thai":"ปิกนิกต้องยกเลิกเพราะฝนตก เลยอยู่บ้าน"}
{"word":"home","english":"Working from home boosts my productivity.","thai":"การทำงานจากบ้านช่วยเพิ่มประสิทธิภาพของฉัน"}
{"word":"productivity","english":"Good music pumps up my productivity.","thai":"ดนตรีดีๆ ช่วยกระตุ้นประสิทธิภาพของฉัน"}
{"word":"music","english":"Live music at the festival was straight fire.","thai":"ดนตรีสดที่งานเทศกาลมันสุดยอดมาก"}
{"word":"festival","english":"The food festival served up some dope dishes.","thai":"งานเทศกาลอาหารมีอาหารเจ๋งๆ เสิร์ฟเยอะมาก"}
{"word":"food","english":"I’m craving spicy food for dinner tonight.","thai":"ฉันอยากกินอาหารเผ็ดสำหรับมื้อเย็นคืนนี้"}
{"word":"dinner","english":"Cooking dinner with friends is always a blast.","thai":"การทำอาหารเย็นกับเพื่อนๆ สนุกสุดๆ เสมอ"}
{"word":"friends","english":"My friends dragged me to a karaoke night.","thai":"เพื่อนๆ ลากฉันไปคืนคาราโอเกะ"}
{"word":"night","english":"Stargazing at night clears my head.","thai":"การดูดาวตอนกลางคืนช่วยให้ฉันผ่อนคลาย"}
{"word":"head","english":"I can’t get that song out of my head.","thai":"ฉันเอาเพลงนั้นออกจากหัวไม่ได้"}
{"word":"song","english":"Writing a song for the band takes guts.","thai":"การแต่งเพลงให้วงต้องใช้ความกล้า"}
{"word":"band","english":"The band played a sick set at the club.","thai":"วงดนตรีเล่นเซ็ตเจ๊งสุดๆ ที่คลับ"}
{"word":"club","english":"Joining the hiking club was a game-changer.","thai":"การเข้าร่วมคลับเดินป่าคือตัวเปลี่ยนเกม"}
{"word":"hiking","english":"Hiking up the mountain wore me out.","thai":"การเดินป่าขึ้นเขาทำให้ฉันเหนื่อยสุดๆ"}
{"word":"mountain","english":"The mountain view from the cabin was unreal.","thai":"วิวภูเขาจากกระท่อมมันสุดยอดมาก"}
{"word":"view","english":"I love the view from my new apartment.","thai":"ฉันชอบวิวจากอพาร์ทเมนต์ใหม่ของฉัน"}
{"word":"apartment","english":"My apartment needs a deep clean this weekend.","thai":"อพาร์ทเมนต์ของฉันต้องทำความสะอาดครั้งใหญ่สุดสัปดาห์นี้"}
{"word":"clean","english":"I clean my desk to stay organized.","thai":"ฉันทำความสะอาดโต๊ะเพื่อให้เป็นระเบียบ"}
{"word":"desk","english":"My desk is piled high with research papers.","thai":"โต๊ะของฉันกองสูงไปด้วยเอกสารวิจัย"}
{"word":"research","english":"Her research on climate change blew me away.","thai":"งานวิจัยของเธอเกี่ยวกับการเปลี่ยนแปลงสภาพภูมิอากาศทำให้ฉันทึ่ง"}
{"word":"climate","english":"The climate here messes with my allergies.","thai":"สภาพอากาศที่นี่ทำให้ฉันแพ้หนัก"}
{"word":"allergies","english":"My allergies act up during spring blooms.","thai":"อาการแพ้ของฉันกำเริบช่วงดอกไม้บานในฤดูใบไม้ผลิ"}
{"word":"spring","english":"Spring break is perfect for road trips.","thai":"ช่วงปิดเทอมฤดูใบไม้ผลิเหมาะสำหรับการขับรถเที่ยว"}
{"word":"road","english":"The road trip took us through epic landscapes.","thai":"การขับรถเที่ยวพาเราผ่านทิวทัศน์สุดยอด"}
{"word":"trip","english":"I booked a trip to a beach resort.","thai":"ฉันจองทริปไปรีสอร์ทชายหาด"}
{"word":"beach","english":"The beach was packed with surfers.","thai":"ชายหาดเต็มไปด้วยนักโต้คลื่น"}
{"word":"surfers","english":"Surfers catch waves at dawn for the best rides.","thai":"นักโต้คลื่นจับคลื่นตอนรุ่งสางเพื่อการขี่ที่ดีที่สุด"}
{"word":"waves","english":"The waves crashed hard during the storm.","thai":"คลื่นซัดแรงในช่วงพายุ"}
{"word":"storm","english":"The storm knocked out our power last night.","thai":"พายุทำให้ไฟฟ้าดับเมื่อคืนนี้"}
{"word":"power","english":"Solar power is gaining traction in my town.","thai":"พลังงานแสงอาทิตย์กำลังได้รับความนิยมในเมืองของฉัน"}
{"word":"town","english":"The town fair had the best cotton candy.","thai":"งานเทศกาลเมืองมีสายไหมที่อร่อยที่สุด"}
{"word":"fair","english":"The job fair hooked me up with new leads.","thai":"งานจ้างงานช่วยให้ฉันได้โอกาสใหม่ๆ"}
{"word":"job","english":"I landed a job at a startup downtown.","thai":"ฉันได้งานที่สตาร์ทอัพในตัวเมือง"}
{"word":"startup","english":"The startup culture is super fast-paced.","thai":"วัฒนธรรมสตาร์ทอัพเร็วสุดๆ"}
{"word":"culture","english":"Pop culture shapes how we vibe online.","thai":"วัฒนธรรมป๊อปกำหนดวิธีที่เราเชื่อมต่อออนไลน์"}
{"word":"online","english":"Shopping online saves me so much time.","thai":"การช้อปปิ้งออนไลน์ช่วยประหยัดเวลาฉันเยอะมาก"}
{"word":"time","english":"Time flies when I’m gaming with friends.","thai":"เวลาเร็วมากเมื่อฉันเล่นเกมกับเพื่อนๆ"}
{"word":"gaming","english":"Gaming on my new console is next-level.","thai":"การเล่นเกมบนคอนโซลใหม่ของฉันมันสุดยอด"}
{"word":"console","english":"The console broke down mid-tournament.","thai":"คอนโซลพังระหว่างทัวร์นาเมนต์"}
{"word":"tournament","english":"The chess tournament got super intense.","thai":"การแข่งขันหมากรุกเข้มข้นสุดๆ"}
{"word":"chess","english":"Playing chess sharpens my focus.","thai":"การเล่นหมากรุกช่วยให้ฉันมีสมาธิมากขึ้น"}
{"word":"focus","english":"I lose focus when my phone keeps buzzing.","thai":"ฉันเสียสมาธิเมื่อโทรศัพท์ดังไม่หยุด"}
{"word":"phone","english":"My phone died during the video call.","thai":"โทรศัพท์ของฉันแบตหมดระหว่างวิดีโอคอล"}
{"word":"video","english":"I edited a video for my YouTube channel.","thai":"ฉันตัดต่อวิดีโอสำหรับช่องยูทูบของฉัน"}
{"word":"channel","english":"The cooking channel inspired my dinner menu.","thai":"ช่องทำอาหารเป็นแรงบันดาลใจให้เมนูอาหารเย็นของฉัน"}
{"word":"cooking","english":"Cooking with fresh herbs smells amazing.","thai":"การทำอาหารด้วยสมุนไพรสดหอมมาก"}
{"word":"herbs","english":"I grow herbs in my backyard garden.","thai":"ฉันปลูกสมุนไพรในสวนหลังบ้าน"}
{"word":"garden","english":"The community garden brings neighbors together.","thai":"สวนชุมชนทำให้เพื่อนบ้านใกล้ชิดกัน"}
{"word":"community","english":"The community center hosts dope events.","thai":"ศูนย์ชุมชนจัดงานเจ๋งๆ"}
{"word":"events","english":"Charity events make a real difference.","thai":"งานการกุศลสร้างความแตกต่างจริงๆ"}
{"word":"charity","english":"I donated clothes to a local charity.","thai":"ฉันบริจาคเสื้อผ้าให้การกุศลท้องถิ่น"}
{"word":"clothes","english":"New clothes always boost my confidence.","thai":"เสื้อผ้าใหม่ช่วยเพิ่มความมั่นใจให้ฉัน"}
{"word":"confidence","english":"Public speaking builds my confidence.","thai":"การพูดในที่สาธารณะช่วยสร้างความมั่นใจให้ฉัน"}
{"word":"speaking","english":"Speaking up in meetings gets easier with practice.","thai":"การพูดในที่ประชุมง่ายขึ้นเมื่อฝึกฝน"}
{"word":"meetings","english":"Virtual meetings save me commuting time.","thai":"การประชุมออนไลน์ช่วยประหยัดเวลาเดินทางของฉัน"}
{"word":"time","english":"Managing my time well keeps me sane.","thai":"การจัดการเวลาอย่างดีช่วยให้ฉันไม่เสียสติ"}
{"word":"managing","english":"Managing stress with meditation is a lifesaver.","thai":"การจัดการความเครียดด้วยการทำสมาธิช่วยชีวิตไว้"}
{"word":"meditation","english":"Meditation in the morning sets a chill vibe.","thai":"การทำสมาธิตอนเช้าสร้างบรรยากาศผ่อนคลาย"}
{"word":"morning","english":"Morning jogs kickstart my day.","thai":"การวิ่งตอนเช้าช่วยเริ่มวันของฉัน"}
{"word":"day","english":"A rainy day calls for cozy movie marathons.","thai":"วันที่ฝนตกเหมาะกับการดูหนังมาราธอนแบบอบอุ่น"}
{"word":"movie","english":"The movie theater was packed for the premiere.","thai":"โรงหนังแน่นไปด้วยผู้คนในรอบปฐมทัศน์"}
{"word":"theater","english":"The community theater put on a killer show.","thai":"โรงละครชุมชนจัดแสดงสุดยอด"}
{"word":"show","english":"The talent show had some wild performances.","thai":"การแสดงความสามารถมีโชว์ที่บ้าคลั่ง"}
{"word":"talent","english":"Her singing talent stole the spotlight.","thai":"พรสวรรค์ด้านการร้องเพลงของเธอโดดเด่น"}
{"word":"singing","english":"Singing in the shower is my daily jam.","thai":"ร้องเพลงในห้องน้ำคือความสนุกประจำวันของฉัน"}
{"word":"shower","english":"A hot shower melts away my tension.","thai":"การอาบน้ำร้อนช่วยคลายความตึงเครียด"}
{"word":"tension","english":"Workplace tension can mess with team vibes.","thai":"ความตึงเครียดในที่ทำงานอาจรบกวนบรรยากาศทีม"}
{"word":"team","english":"The soccer team crushed it at the finals.","thai":"ทีมฟุตบอลถล่มคู่แข่งในรอบชิง"}
{"word":"soccer","english":"Playing soccer with friends is pure fun.","thai":"การเล่นฟุตบอลกับเพื่อนๆ สนุกสุดๆ"}
{"word":"fun","english":"Board games are fun for family nights.","thai":"เกมกระดานสนุกสำหรับคืนครอบครัว"}
{"word":"games","english":"Mobile games keep me entertained on commutes.","thai":"เกมมือถือทำให้ฉันเพลิดเพลินระหว่างเดินทาง"}
{"word":"commutes","english":"Long commutes give me time to read.","thai":"การเดินทางไกลให้เวลาฉันอ่านหนังสือ"}
{"word":"read","english":"I read a thriller that kept me up all night.","thai":"ฉันอ่านนิยายระทึกขวัญที่ทำให้ฉันนอนไม่หลับทั้งคืน"}
{"word":"night","english":"Friday night pizza is a household tradition.","thai":"พิซซ่าคืนวันศุกร์คือประเพณีในบ้าน"}
{"word":"pizza","english":"I burned the pizza while chatting online.","thai":"ฉันเผลอเผาพิซซ่าขณะแชทออนไลน์"}
{"word":"chatting","english":"Chatting with coworkers sparks new ideas.","thai":"การคุยกับเพื่อนร่วมงานจุดประกายไอเดียใหม่ๆ"}
{"word":"ideas","english":"Brainstorming ideas for the project was a blast.","thai":"การระดมสมองหาไอเดียสำหรับโปรเจกต์สนุกมาก"}
{"word":"blast","english":"The concert was an absolute blast.","thai":"คอนเสิร์ตมันสุดยอดมาก"}
{"word":"concert","english":"The concert tickets sold out in minutes.","thai":"บัตรคอนเสิร์ตขายหมดในไม่กี่นาที"}
{"word":"tickets","english":"I scored tickets to the big game.","thai":"ฉันได้บัตรไปดูเกมใหญ่"}
{"word":"game","english":"Playing a board game with family is always fun.","thai":"การเล่นบอร์ดเกมกับครอบครัวสนุกเสมอ"}
{"word":"family","english":"Family dinners bring us closer together.","thai":"มื้อเย็นกับครอบครัวทำให้เราใกล้ชิดกันมากขึ้น"}
{"word":"dinners","english":"Our weekly dinners at the new restaurant are lit.","thai":"มื้อเย็นประจำสัปดาห์ที่ร้านใหม่มันเจ๋งมาก"}
{"word":"restaurant","english":"The restaurant downtown has killer tacos.","thai":"ร้านอาหารในตัวเมืองมีทาโก้ที่เจ๋งสุดๆ"}
{"word":"tacos","english":"I ate too many tacos at the food truck.","thai":"ฉันกินทาโก้เยอะเกินไปที่รถขายอาหาร"}
{"word":"food","english":"Trying new food at the market is my jam.","thai":"การลองอาหารใหม่ที่ตลาดคือสไตล์ของฉัน"}
{"word":"market","english":"The farmers’ market has fresh veggies every Saturday.","thai":"ตลาดเกษตรกรมีผักสดทุกวันเสาร์"}
{"word":"veggies","english":"I chopped up veggies for a quick stir-fry.","thai":"ฉันหั่นผักสำหรับผัดเร็วๆ"}
{"word":"quick","english":"A quick workout keeps me energized.","thai":"การออกกำลังกายสั้นๆ ทำให้ฉันมีพลัง"}
{"word":"workout","english":"My morning workout routine is a game-changer.","thai":"กิจวัตรการออกกำลังกายตอนเช้าคือตัวเปลี่ยนเกม"}
{"word":"morning","english":"Morning coffee fuels my day.","thai":"กาแฟตอนเช้าช่วยเติมพลังให้วันของฉัน"}
{"word":"coffee","english":"I spilled coffee on my laptop during a meeting.","thai":"ฉันทำกาแฟหกใส่แล็ปท็อประหว่างประชุม"}
{"word":"meeting","english":"The team meeting dragged on too long.","thai":"การประชุมทีมยืดเยื้อนานเกินไป"}
{"word":"team","english":"Our soccer team crushed the competition.","thai":"ทีมฟุตบอลของเราถล่มคู่แข่ง"}
{"word":"competition","english":"The baking competition got super intense.","thai":"การแข่งขันทำขนมเข้มข้นสุดๆ"}
{"word":"baking","english":"Baking cookies fills the house with warmth.","thai":"การอบคุกกี้ทำให้บ้านอบอุ่น"}
{"word":"house","english":"I’m fixing up my house this weekend.","thai":"ฉันจะซ่อมแซมบ้านสุดสัปดาห์นี้"}
{"word":"weekend","english":"The weekend hike was absolutely epic.","thai":"การเดินป่าสุดสัปดาห์มันยอดเยี่ยมมาก"}
{"word":"hike","english":"I love to hike with my dog in the woods.","thai":"ฉันรักการเดินป่ากับสุนัขในป่า"}
{"word":"dog","english":"My dog chewed up my favorite shoes.","thai":"สุนัขของฉันเคี้ยวรองเท้าคู่โปรดของฉัน"}
{"word":"shoes","english":"New running shoes make me feel unstoppable.","thai":"รองเท้าวิ่งใหม่ทำให้ฉันรู้สึกหยุดไม่อยู่"}
{"word":"running","english":"Running in the park clears my mind.","thai":"การวิ่งในสวนช่วยให้จิตใจฉันปลอดโปร่ง"}
{"word":"park","english":"The park was buzzing with a summer festival.","thai":"สวนสาธารณะคึกคักด้วยงานเทศกาลฤดูร้อน"}
{"word":"festival","english":"The music festival had an awesome lineup.","thai":"เทศกาลดนตรีมีรายชื่อศิลปินที่เจ๋งมาก"}
{"word":"music","english":"Blasting music helps me focus on coding.","thai":"การเปิดเพลงดังๆ ช่วยให้ฉันมีสมาธิกับการเขียนโค้ด"}
{"word":"coding","english":"Coding a new app is my latest obsession.","thai":"การเขียนโค้ดแอปใหม่คือสิ่งที่ฉันหมกมุ่น"}
{"word":"app","english":"This new app tracks my daily habits.","thai":"แอปใหม่นี้ติดตามนิสัยประจำวันของฉัน"}
{"word":"habits","english":"Breaking bad habits takes serious effort.","thai":"การเลิกนิสัยไม่ดีต้องใช้ความพยายามอย่างมาก"}
{"word":"effort","english":"Putting in effort at the gym pays off.","thai":"การทุ่มเทที่ยิมให้ผลตอบแทนคุ้มค่า"}
{"word":"gym","english":"The gym was packed after New Year’s resolutions.","thai":"ยิมแน่นไปด้วยคนหลังปณิธานปีใหม่"}
{"word":"resolutions","english":"My resolutions this year include reading more.","thai":"ปณิธานปีนี้ของฉันรวมถึงการอ่านหนังสือมากขึ้น"}
{"word":"reading","english":"Reading a good novel keeps me up late.","thai":"การอ่านนิยายดีๆ ทำให้ฉันนอนดึก"}
{"word":"novel","english":"Her debut novel got rave reviews.","thai":"นิยายเล่มแรกของเธอได้รับคำวิจารณ์ชื่นชม"}
{"word":"reviews","english":"I check reviews before buying tech gadgets.","thai":"ฉันตรวจสอบรีวิวก่อนซื้ออุปกรณ์เทคโนโลยี"}
{"word":"tech","english":"Tech startups are popping up everywhere.","thai":"สตาร์ทอัพด้านเทคโนโลยีผุดขึ้นทุกหนแห่ง"}
{"word":"startups","english":"Startups need to hustle to survive.","thai":"สตาร์ทอัพต้องเร่งรีบเพื่ออยู่รอด"}
{"word":"hustle","english":"The side hustle keeps my bank account happy.","thai":"งานเสริมทำให้บัญชีธนาคารของฉันแฮปปี้"}
{"word":"bank","english":"I stopped by the bank to deposit cash.","thai":"ฉันแวะธนาคารเพื่อฝากเงินสด"}
{"word":"cash","english":"Paying with cash feels so old-school.","thai":"การจ่ายด้วยเงินสดรู้สึกโบราณมาก"}
{"word":"school","english":"The cooking school taught me knife skills.","thai":"โรงเรียนสอนทำอาหารสอนฉันทักษะการใช้มีด"}
{"word":"skills","english":"My photography skills are getting better.","thai":"ทักษะการถ่ายภาพของฉันดีขึ้นเรื่อยๆ"}
{"word":"photography","english":"Photography captures moments I’ll never forget.","thai":"การถ่ายภาพเก็บช่วงเวลาที่ฉันจะไม่มีวันลืม"}
{"word":"moments","english":"Those quiet moments at sunrise are magical.","thai":"ช่วงเวลเงียบสงบตอนพระอาทิตย์ขึ้นนั้นวิเศษมาก"}
{"word":"sunrise","english":"Watching the sunrise on the beach is unreal.","thai":"การดูพระอาทิตย์ขึ้นที่ชายหาดมันสุดยอด"}
{"word":"beach","english":"The beach cleanup made a huge difference.","thai":"การทำความสะอาดชายหาดสร้างความแตกต่างอย่างมาก"}
{"word":"cleanup","english":"The community cleanup was a total success.","thai":"การทำความสะอาดชุมชนประสบความสำเร็จอย่างมาก"}
{"word":"community","english":"The community garden grows amazing herbs.","thai":"สวนชุมชนปลูกสมุนไพรที่ยอดเยี่ยม"}
{"word":"herbs","english":"Fresh herbs make my pasta dishes pop.","thai":"สมุนไพรสดทำให้อาหารพาสต้าของฉันเด่นขึ้น"}
{"word":"pasta","english":"I cooked pasta for a quick dinner.","thai":"ฉันทำพาสต้าสำหรับมื้อเย็นเร็วๆ"}
{"word":"dinner","english":"Dinner with friends always lifts my spirits.","thai":"มื้อเย็นกับเพื่อนๆ ทำให้ฉันอารมณ์ดีเสมอ"}
{"word":"friends","english":"I ran into friends at the mall yesterday.","thai":"ฉันเจอเพื่อนๆ ที่ห้างเมื่อวาน"}
{"word":"mall","english":"The mall was packed with holiday shoppers.","thai":"ห้างแน่นไปด้วยนักช้อปช่วงวันหยุด"}
{"word":"holiday","english":"Holiday baking fills my house with joy.","thai":"การอบขนมช่วงวันหยุดทำให้บ้านของฉันเต็มไปด้วยความสุข"}
{"word":"joy","english":"Finding joy in small things keeps me grounded.","thai":"การหาความสุขในสิ่งเล็กๆ ทำให้ฉันมั่นคง"}
{"word":"things","english":"Packing up things for the move was exhausting.","thai":"การเก็บของเพื่อย้ายบ้านมันเหนื่อยมาก"}
{"word":"move","english":"I’m planning to move to a bigger city.","thai":"ฉันวางแผนจะย้ายไปเมืองใหญ่"}
{"word":"city","english":"The city lights at night are breathtaking.","thai":"แสงไฟเมืองตอนกลางคืนสวยงามตระการตา"}
{"word":"night","english":"Friday night game nights are my favorite.","thai":"คืนวันศุกร์ที่เล่นเกมคือช่วงเวลาที่ฉันชอบ"}
{"word":"game","english":"The trivia game at the bar was a blast.","thai":"เกมตอบคำถามที่บาร์สนุกสุดๆ"}
{"word":"bar","english":"The coffee bar has the best lattes.","thai":"ร้านกาแฟมีลาเต้ที่ดีที่สุด"}
{"word":"lattes","english":"Sipping lattes while working feels so cozy.","thai":"การจิบลาเต้ขณะทำงานรู้สึกอบอุ่นมาก"}
{"word":"working","english":"Working remotely lets me travel more.","thai":"การทำงานจากระยะไกลทำให้ฉันเดินทางได้มากขึ้น"}
{"word":"travel","english":"Travel blogs inspire my next adventure.","thai":"บล็อกท่องเที่ยวเป็นแรงบันดาลใจให้การผจญภัยครั้งต่อไปของฉัน"}
{"word":"adventure","english":"The camping adventure was totally worth it.","thai":"การผจญภัยแคมป์ปิ้งคุ้มค่าสุดๆ"}
{"word":"camping","english":"Camping under the stars feels like freedom.","thai":"การแคมป์ปิ้งใต้ดวงดาวรู้สึกเหมือนอิสรภาพ"}
{"word":"stars","english":"Counting stars with my kids is pure magic.","thai":"การนับดาวกับลูกๆ เป็นความวิเศษล้วนๆ"}
{"word":"kids","english":"The kids love building forts in the backyard.","thai":"เด็กๆ ชอบสร้างป้อมในสวนหลังบ้าน"}
{"word":"backyard","english":"The backyard barbecue brought everyone together.","thai":"งานบาร์บีคิวในสวนหลังบ้านทำให้ทุกคนมารวมกัน"}
{"word":"barbecue","english":"The barbecue sauce was a total game-changer.","thai":"ซอสบาร์บีคิวคือตัวเปลี่ยนเกมเลย"}
{"word":"sauce","english":"I whipped up a sauce for tonight’s dinner.","thai":"ฉันทำซอสสำหรับมื้อเย็นคืนนี้"}
{"word":"ton24","english":"The art gallery showcased local talent.","thai":"แกลเลอรีศิลปะจัดแสดงผลงานของศิลปินท้องถิ่น"}
{"word":"talent","english":"Her singing talent blew everyone away.","thai":"พรสวรรค์การร้องเพลงของเธอทำให้ทุกคนทึ่ง"}
{"word":"singing","english":"Singing karaoke with coworkers is always a hoot.","thai":"ร้องคาราโอเกะกับเพื่อนร่วมงานสนุกสุดๆ เสมอ"}
{"word":"coworkers","english":"My coworkers threw a surprise birthday party.","thai":"เพื่อนร่วมงานจัดงานเลี้ยงวันเกิดเซอร์ไพรส์"}
{"word":"party","english":"The block party had the best live band.","thai":"งานปาร์ตี้ในชุมชนมีวงดนตรีสดที่ดีที่สุด"}
{"word":"band","english":"The band’s new album dropped last week.","thai":"อัลบั้มใหม่ของวงออกเมื่อสัปดาห์ที่แล้ว"}
{"word":"album","english":"I pre-ordered the album on vinyl.","thai":"ฉันสั่งจองอัลบั้มในรูปแบบแผ่นเสียง"}
{"word":"vinyl","english":"Collecting vinyl records is my new hobby.","thai":"การสะสมแผ่นเสียงคืองานอดิเรกใหม่ของฉัน"}
{"word":"hobby","english":"Photography as a hobby keeps me creative.","thai":"การถ่ายภาพเป็นงานอดิเรกทำให้ฉันมีความสร้างสรรค์"}
{"word":"creative","english":"Her creative approach to problem-solving is inspiring.","thai":"วิธีแก้ปัญหาอย่างสร้างสรรค์ของเธอเป็นแรงบันดาลใจ"}
{"word":"approach","english":"This new approach to meditation is super chill.","thai":"วิธีการทำสมาธิแบบใหม่นี้ผ่อนคลายสุดๆ"}
{"word":"meditation","english":"Meditation helps me stay focused at work.","thai":"การทำสมาธิช่วยให้ฉันมีสมาธิที่งาน"}
{"word":"work","english":"I love to work on my blog after hours.","thai":"ฉันชอบทำงานบล็อกหลังเลิกงาน"}
{"word":"blog","english":"Her travel blog has thousands of followers.","thai":"บล็อกท่องเที่ยวของเธอมีผู้ติดตามเป็นพัน"}
{"word":"followers","english":"Gaining followers on social media takes strategy.","thai":"การเพิ่มผู้ติดตามในโซเชียลมีเดียต้องมีกลยุทธ์"}
{"word":"media","english":"The media hyped up the new movie release.","thai":"สื่อโหมกระพือการเปิดตัวภาพยนตร์ใหม่"}
{"word":"movie","english":"The movie marathon kept us up all night.","thai":"การดูหนังมาราธอนทำให้เรานอนดึกทั้งคืน"}
{"word":"night","english":"Date night at the arcade was super fun.","thai":"คืนเดทที่อาร์เคดสนุกมาก"}
{"word":"arcade","english":"The arcade games brought back childhood vibes.","thai":"เกมอาร์เคดทำให้หวนนึกถึงวัยเด็ก"}
{"word":"childhood","english":"Childhood memories shape who we are.","thai":"ความทรงจำวัยเด็กกำหนดตัวตนของเรา"}
{"word":"memories","english":"Making memories with friends is priceless.","thai":"การสร้างความทรงจำกับเพื่อนๆ ล้ำค่า"}
{"word":"friends","english":"Hanging out with friends always lifts my mood.","thai":"การออกไปเที่ยวกับเพื่อนๆ ทำให้อารมณ์ดีขึ้นเสมอ"}
{"word":"mood","english":"A good playlist can totally shift my mood.","thai":"เพลย์ลิสต์ดีๆ สามารถเปลี่ยนอารมณ์ของฉันได้เลย"}
{"word":"playlist","english":"I curated a playlist for the road trip.","thai":"ฉันจัดเพลย์ลิสต์สำหรับทริปขับรถเที่ยว"}
{"word":"road","english":"The road to success is full of twists.","thai":"เส้นทางสู่ความสำเร็จเต็มไปด้วยความท้าทาย"}
{"word":"success","english":"Celebrating small successes keeps me motivated.","thai":"การฉลองความสำเร็จเล็กๆ ทำให้ฉันมีแรงจูงใจ"}
