{"word": "board", "english": "The board approved the new budget yesterday.", "thai": "คณะกรรมการอนุมัติงบประมาณใหม่เมื่อวานนี้"}
{"word": "board", "english": "She was elected to the board of directors last month.", "thai": "เธอได้รับเลือกให้เป็นสมาชิกคณะกรรมการบริหารเมื่อเดือนที่แล้ว"}
{"word": "board", "english": "We need to discuss this with the board before moving forward.", "thai": "เราต้องหารือเรื่องนี้กับคณะกรรมการก่อนดำเนินการต่อ"}
{"word": "board", "english": "The bulletin board in the hallway has the new schedule.", "thai": "กระดานประกาศในโถงทางเดินมีตารางใหม่"}
{"word": "board", "english": "He nailed the plank to the board for the project.", "thai": "เขาตอกไม้กระดานเข้ากับแผ่นไม้สำหรับโปรเจกต์"}
{"word": "board", "english": "The board of trustees meets every quarter.", "thai": "คณะกรรมการมูลนิธิประชุมทุกไตรมาส"}
{"word": "board", "english": "Can you write the answers on the board, please?", "thai": "คุณเขียนคำตอบบนกระดานได้ไหม"}
{"word": "board", "english": "The board game night is scheduled for Friday.", "thai": "คืนเกมกระดานถูกกำหนดไว้สำหรับวันศุกร์"}
{"word": "board", "english": "She posted the flyer on the community board.", "thai": "เธอติดใบปลิวบนกระดานชุมชน"}
{"word": "board", "english": "The board is reviewing the proposal this week.", "thai": "คณะกรรมการกำลังพิจารณาข้อเสนอในสัปดาห์นี้"}
{"word": "board", "english": "He serves on the advisory board for the charity.", "thai": "เขาดำรงตำแหน่งในคณะที่ปรึกษาขององค์กรการกุศล"}
{"word": "board", "english": "The chalkboard is too dusty to write on.", "thai": "กระดานดำมีฝุ่นมากเกินไปที่จะเขียน"}
{"word": "board", "english": "The board will vote on the new policy tomorrow.", "thai": "คณะกรรมการจะลงคะแนนเกี่ยวกับนโยบายใหม่พรุ่งนี้"}
{"word": "board", "english": "We need a new board for the construction project.", "thai": "เราต้องการแผ่นไม้ใหม่สำหรับโครงการก่อสร้าง"}
{"word": "board", "english": "The message board online is full of complaints.", "thai": "กระดานข้อความออนไลน์เต็มไปด้วยการร้องเรียน"}
{"word": "board", "english": "She’s the chair of the school board this year.", "thai": "เธอเป็นประธานคณะกรรมการโรงเรียนในปีนี้"}
{"word": "board", "english": "The board members disagreed on the funding plan.", "thai": "สมาชิกคณะกรรมการไม่เห็นด้วยกับแผนการระดมทุน"}
{"word": "board", "english": "I saw the job posting on the career board.", "thai": "ฉันเห็นประกาศงานบนกระดานอาชีพ"}
{"word": "board", "english": "The board is made of solid oak.", "thai": "แผ่นไม้ทำจากไม้โอ๊คแข็ง"}
{"word": "board", "english": "The board meeting was rescheduled to next week.", "thai": "การประชุมคณะกรรมการถูกเลื่อนไปสัปดาห์หน้า"}
{"word": "board", "english": "He wrote the equation on the whiteboard.", "thai": "เขาเขียนสมการบนไวต์บอร์ด"}
{"word": "board", "english": "The board of advisors recommended a new strategy.", "thai": "คณะที่ปรึกษาแนะนำกลยุทธ์ใหม่"}
{"word": "board", "english": "We played chess on a wooden board.", "thai": "เราเล่นหมากรุกบนกระดานไม้"}
{"word": "board", "english": "The board is still debating the issue.", "thai": "คณะกรรมการยังคงถกเถียงเรื่องนี้"}
{"word": "board", "english": "She pinned the notice to the cork board.", "thai": "เธอปักหมุดประกาศบนกระดานคอร์ก"}
{"word": "board", "english": "The board oversees the company’s operations.", "thai": "คณะกรรมการดูแลการดำเนินงานของบริษัท"}
{"word": "board", "english": "The diving board at the pool is broken.", "thai": "กระดานกระโดดน้ำที่สระว่ายน้ำพัง"}
{"word": "board", "english": "The board agreed to fund the new program.", "thai": "คณะกรรมการตกลงที่จะให้ทุนโปรแกรมใหม่"}
{"word": "board", "english": "I need to sand the board before painting it.", "thai": "ฉันต้องขัดแผ่นไม้ก่อนทาสี"}
{"word": "board", "english": "The board of education set new guidelines.", "thai": "คณะกรรมการการศึกษากำหนดแนวทางใหม่"}
{"word": "board", "english": "The notice board has the exam schedule.", "thai": "กระดานประกาศมีตารางสอบ"}
{"word": "board", "english": "He’s a member of the editorial board.", "thai": "เขาเป็นสมาชิกของคณะบรรณาธิการ"}
{"word": "board", "english": "The board rejected the initial proposal.", "thai": "คณะกรรมการปฏิเสธข้อเสนอแรก"}
{"word": "board", "english": "We need to replace the warped board.", "thai": "เราต้องเปลี่ยนแผ่นไม้ที่บิดงอ"}
{"word": "board", "english": "The board is meeting to discuss enrollment.", "thai": "คณะกรรมการกำลังประชุมเพื่อหารือเรื่องการลงทะเบียน"}
{"word": "board", "english": "She drew a diagram on the board.", "thai": "เธอวาดแผนภาพบนกระดาน"}
{"word": "board", "english": "The board of governors approved the plan.", "thai": "คณะผู้ว่าการอนุมัติแผน"}
{"word": "board", "english": "The cutting board needs to be cleaned.", "thai": "เขียงต้องทำความสะอาด"}
{"word": "board", "english": "The board is split on the decision.", "thai": "คณะกรรมการมีความเห็นไม่ลงรอยกันในเรื่องนี้"}
{"word": "board", "english": "He posted the rules on the board.", "thai": "เขาโพสต์กฎบนกระดาน"}
{"word": "board", "english": "The board will finalize the budget soon.", "thai": "คณะกรรมการจะสรุปงบประมาณเร็ว ๆ นี้"}
{"word": "board", "english": "The surfboard is stored in the garage.", "thai": "กระดานโต้คลื่นถูกเก็บไว้ในโรงรถ"}
{"word": "board", "english": "The board appointed a new CEO.", "thai": "คณะกรรมการแต่งตั้ง CEO คนใหม่"}
{"word": "board", "english": "We need a board to fix the fence.", "thai": "เราต้องการแผ่นไม้เพื่อซ่อมรั้ว"}
{"word": "board", "english": "The board is considering new members.", "thai": "คณะกรรมการกำลังพิจารณาสมาชิกใหม่"}
{"word": "board", "english": "She erased the board after class.", "thai": "เธอลบกระดานหลังเลิกเรียน"}
{"word": "board", "english": "The advisory board gave helpful feedback.", "thai": "คณะที่ปรึกษาให้ข้อเสนอแนะที่เป็นประโยชน์"}
{"word": "board", "english": "The board game was a hit at the party.", "thai": "เกมกระดานได้รับความนิยมในงานปาร์ตี้"}
{"word": "board", "english": "The board is responsible for major decisions.", "thai": "คณะกรรมการรับผิดชอบการตัดสินใจที่สำคัญ"}
{"word": "board", "english": "He cut the vegetables on a wooden board.", "thai": "เขาหั่นผักบนเขียงไม้"}
{"word": "board", "english": "The board meets twice a month.", "thai": "คณะกรรมการประชุมเดือนละสองครั้ง"}
{"word": "board", "english": "The whiteboard is covered in notes.", "thai": "ไวต์บอร์ดเต็มไปด้วยบันทึก"}
{"word": "board", "english": "The board endorsed the new initiative.", "thai": "คณะกรรมการสนับสนุนโครงการใหม่"}
{"word": "board", "english": "She checked the board for announcements.", "thai": "เธอตรวจสอบกระดานเพื่อดูประกาศ"}
{"word": "board", "english": "The board of directors sets the company’s goals.", "thai": "คณะกรรมการบริหารกำหนดเป้าหมายของบริษัท"}
{"word": "board", "english": "The board needs to be painted white.", "thai": "แผ่นไม้ต้องทาสีขาว"}
{"word": "board", "english": "The board discussed the merger proposal.", "thai": "คณะกรรมการหารือเกี่ยวกับข้อเสนอควบรวม"}
{"word": "board", "english": "The bulletin board is near the entrance.", "thai": "กระดานประกาศอยู่ใกล้ทางเข้า"}
{"word": "board", "english": "The board is looking for new funding sources.", "thai": "คณะกรรมการกำลังมองหาแหล่งเงินทุนใหม่"}
{"word": "board", "english": "He used a board to block the window.", "thai": "เขาใช้แผ่นไม้ปิดหน้าต่าง"}
{"word": "board", "english": "The board voted unanimously on the issue.", "thai": "คณะกรรมการลงคะแนนเป็นเอกฉันท์ในเรื่องนี้"}
{"word": "board", "english": "The chess board is missing a piece.", "thai": "กระดานหมากรุกขาดหมากตัวหนึ่ง"}
{"word": "board", "english": "The board will announce its decision soon.", "thai": "คณะกรรมการจะประกาศการตัดสินใจในไม่ช้า"}
{"word": "board", "english": "She wrote her name on the board.", "thai": "เธอเขียนชื่อของเธอบนกระดาน"}
{"word": "board", "english": "The board of regents oversees the university.", "thai": "คณะผู้สำเร็จราชการดูแลมหาวิทยาลัย"}
{"word": "board", "english": "The board is too heavy to lift alone.", "thai": "แผ่นไม้หนักเกินกว่าจะยกคนเดียว"}
{"word": "board", "english": "The board meeting lasted three hours.", "thai": "การประชุมคณะกรรมการกินเวลาสามชั่วโมง"}
{"word": "board", "english": "The notice board lists upcoming events.", "thai": "กระดานประกาศแสดงรายการกิจกรรมที่กำลังจะมาถึง"}
{"word": "board", "english": "The board is split down the middle.", "thai": "แผ่นไม้แตกตรงกลาง"}
{"word": "board", "english": "The advisory board meets next Friday.", "thai": "คณะที่ปรึกษาจะประชุมในวันศุกร์หน้า"}
{"word": "board", "english": "The board game club meets weekly.", "thai": "ชมรมเกมกระดานประชุมทุกสัปดาห์"}
{"word": "board", "english": "The board reviewed the financial reports.", "thai": "คณะกรรมการตรวจสอบรายงานการเงิน"}
{"word": "board", "english": "She taped the poster to the board.", "thai": "เธอติดโปสเตอร์บนกระดานด้วยเทป"}
{"word": "board", "english": "The board is responsible for hiring the dean.", "thai": "คณะกรรมการรับผิดชอบการจ้างคณบดี"}
{"word": "board", "english": "The diving board was replaced last summer.", "thai": "กระดานกระโดดน้ำถูกเปลี่ยนเมื่อฤดูร้อนที่แล้ว"}
{"word": "board", "english": "The board approved the new curriculum.", "thai": "คณะกรรมการอนุมัติหลักสูตรใหม่"}
{"word": "board", "english": "He painted the board for the sign.", "thai": "เขาทาสีแผ่นไม้สำหรับป้าย"}
{"word": "board", "english": "The board of trustees supports the project.", "thai": "คณะกรรมการมูลนิธิสนับสนุนโครงการ"}
{"word": "board", "english": "The whiteboard marker ran out of ink.", "thai": "ปากกาไวต์บอร์ดหมึกหมด"}
{"word": "board", "english": "The board is discussing new policies.", "thai": "คณะกรรมการกำลังหารือเกี่ยวกับนโยบายใหม่"}
{"word": "board", "english": "The board game was fun for everyone.", "thai": "เกมกระดานสนุกสำหรับทุกคน"}
{"word": "board", "english": "The board needs to address this issue.", "thai": "คณะกรรมการต้องแก้ไขปัญหานี้"}
{"word": "board", "english": "She checked the board for the room number.", "thai": "เธอตรวจสอบกระดานเพื่อหาเลขห้อง"}
{"word": "board", "english": "The board of directors will meet online.", "thai": "คณะกรรมการบริหารจะประชุมออนไลน์"}
{"word": "board", "english": "The board was cut to fit the shelf.", "thai": "แผ่นไม้ถูกตัดให้พอดีกับชั้นวาง"}
{"word": "board", "english": "The board is planning a fundraiser.", "thai": "คณะกรรมการกำลังวางแผนระดมทุน"}
{"word": "board", "english": "The chalkboard needs to be replaced.", "thai": "กระดานดำต้องเปลี่ยนใหม่"}
{"word": "board", "english": "The board agreed to the new terms.", "thai": "คณะกรรมการตกลงตามเงื่อนไขใหม่"}
{"word": "board", "english": "He posted his resume on the job board.", "thai": "เขาโพสต์เรซูเม่บนกระดานงาน"}
{"word": "board", "english": "The board is made of recycled materials.", "thai": "แผ่นไม้ทำจากวัสดุรีไซเคิล"}
{"word": "board", "english": "The board meeting is open to the public.", "thai": "การประชุมคณะกรรมการเปิดให้สาธารณชนเข้าร่วม"}
{"word": "board", "english": "She drew a picture on the board.", "thai": "เธอวาดรูปบนกระดาน"}
{"word": "board", "english": "The board of advisors suggested changes.", "thai": "คณะที่ปรึกษาแนะนำการเปลี่ยนแปลง"}
{"word": "board", "english": "The board game tournament starts tomorrow.", "thai": "การแข่งขันเกมกระดานเริ่มพรุ่งนี้"}
{"word": "board", "english": "The board will review the applications.", "thai": "คณะกรรมการจะพิจารณาใบสมัคร"}
{"word": "board", "english": "The wooden board was used for the floor.", "thai": "แผ่นไม้ถูกใช้สำหรับพื้น"}
{"word": "board", "english": "The board is finalizing the event plans.", "thai": "คณะกรรมการกำลังสรุปแผนงาน"}
{"word": "board", "english": "The bulletin board is updated weekly.", "thai": "กระดานประกาศได้รับการอัปเดตทุกสัปดาห์"}
{"word": "bursar", "english": "The bursar’s office handles all tuition payments.", "thai": "สำนักงานเหรัญญิกจัดการการชำระค่าเล่าเรียนทั้งหมด"}
{"word": "bursar", "english": "I need to talk to the bursar about my scholarship.", "thai": "ฉันต้องคุยกับเหรัญญิกเกี่ยวกับทุนการศึกษาของฉัน"}
{"word": "bursar", "english": "The bursar sent me a bill for the semester.", "thai": "เหรัญญิกส่งใบเรียกเก็บเงินสำหรับภาคเรียนนี้มาให้ฉัน"}
{"word": "bursar", "english": "You can pay your fees at the bursar’s office.", "thai": "คุณสามารถชำระค่าธรรมเนียมได้ที่สำนักงานเหรัญญิก"}
{"word": "bursar", "english": "The bursar explained the payment plan options.", "thai": "เหรัญญิกอธิบายตัวเลือกแผนการชำระเงิน"}
{"word": "bursar", "english": "I got a refund check from the bursar today.", "thai": "ฉันได้รับเช็คคืนเงินจากเหรัญญิกวันนี้"}
{"word": "bursar", "english": "The bursar’s office is closed on weekends.", "thai": "สำนักงานเหรัญญิกปิดทำการในวันสุดสัปดาห์"}
{"word": "bursar", "english": "She visited the bursar to settle her account.", "thai": "เธอไปที่สำนักงานเหรัญญิกเพื่อชำระบัญชีของเธอ"}
{"word": "bursar", "english": "The bursar can help with financial aid questions.", "thai": "เหรัญญิกสามารถช่วยตอบคำถามเกี่ยวกับความช่วยเหลือทางการเงิน"}
{"word": "bursar", "english": "I forgot to pay my fees, so the bursar called me.", "thai": "ฉันลืมชำระค่าธรรมเนียม ดังนั้นเหรัญญิกจึงโทรหาฉัน"}
{"word": "bursar", "english": "The bursar’s office is on the second floor.", "thai": "สำนักงานเหรัญญิกอยู่ที่ชั้นสอง"}
{"word": "bursar", "english": "The bursar processes all student refunds.", "thai": "เหรัญญิกจัดการการคืนเงินให้กับนักเรียนทั้งหมด"}
{"word": "bursar", "english": "I need to check my balance with the bursar.", "thai": "ฉันต้องตรวจสอบยอดคงเหลือกับเหรัญญิก"}
{"word": "bursar", "english": "The bursar’s office sent out payment reminders.", "thai": "สำนักงานเหรัญญิกส่งการแจ้งเตือนการชำระเงิน"}
{"word": "bursar", "english": "She works part-time at the bursar’s office.", "thai": "เธอทำงานพาร์ทไทม์ที่สำนักงานเหรัญญิก"}
{"word": "bursar", "english": "The bursar helped me set up a payment plan.", "thai": "เหรัญญิกช่วยฉันจัดทำแผนการชำระเงิน"}
{"word": "bursar", "english": "The bursar’s office is open until 5 p.m.", "thai": "สำนักงานเหรัญญิกเปิดจนถึงห้าโมงเย็น"}
{"word": "bursar", "english": "I owe the bursar for my dorm fees.", "thai": "ฉันเป็นหนี้เหรัญญิกสำหรับค่าหอพัก"}
{"word": "bursar", "english": "The bursar issued a late fee for my account.", "thai": "เหรัญญิกเรียกเก็บค่าปรับล่าช้าจากบัญชีของฉัน"}
{"word": "bursar", "english": "You need to see the bursar to clear your hold.", "thai": "คุณต้องพบเหรัญญิกเพื่อเคลียร์สถานะระงับของคุณ"}
{"word": "bursar", "english": "The bursar’s office manages student accounts.", "thai": "สำนักงานเหรัญญิกจัดการบัญชีนักเรียน"}
{"word": "bursar", "english": "I got an email from the bursar about my balance.", "thai": "ฉันได้รับอีเมลจากเหรัญญิกเกี่ยวกับยอดคงเหลือของฉัน"}
{"word": "bursar", "english": "The bursar can explain the tuition breakdown.", "thai": "เหรัญญิกสามารถอธิบายรายละเอียดค่าเล่าเรียนได้"}
{"word": "bursar", "english": "The bursar’s office accepts online payments.", "thai": "สำนักงานเหรัญญิกยอมรับการชำระเงินออนไลน์"}
{"word": "bursar", "english": "The bursar told me about a fee waiver option.", "thai": "เหรัญญิกบอกฉันเกี่ยวกับตัวเลือกการยกเว้นค่าธรรมเนียม"}
{"word": "bursar", "english": "I need to drop off a check at the bursar’s office.", "thai": "ฉันต้องนำเช็คไปส่งที่สำนักงานเหรัญญิก"}
{"word": "bursar", "english": "The bursar handles all financial transactions.", "thai": "เหรัญญิกจัดการธุรกรรมทางการเงินทั้งหมด"}
{"word": "bursar", "english": "The bursar’s office was crowded this morning.", "thai": "สำนักงานเหรัญญิกแออัดในเช้าวันนี้"}
{"word": "bursar", "english": "I asked the bursar about my refund status.", "thai": "ฉันถามเหรัญญิกเกี่ยวกับสถานะการคืนเงินของฉัน"}
{"word": "bursar", "english": "The bursar’s office is next to the registrar.", "thai": "สำนักงานเหรัญญิกอยู่ติดกับสำนักทะเบียน"}
{"word": "bursar", "english": "The bursar can issue a payment receipt.", "thai": "เหรัญญิกสามารถออกใบเสร็จรับเงินได้"}
{"word": "bursar", "english": "I paid my tuition through the bursar’s portal.", "thai": "ฉันชำระค่าเล่าเรียนผ่านพอร์ทัลของเหรัญญิก"}
{"word": "bursar", "english": "The bursar’s office is updating its system.", "thai": "สำนักงานเหรัญญิกกำลังอัปเดตระบบ"}
{"word": "bursar", "english": "The bursar helped me fix a billing error.", "thai": "เหรัญญิกช่วยฉันแก้ไขข้อผิดพลาดในการเรียกเก็บเงิน"}
{"word": "bursar", "english": "I need to see the bursar about my late fees.", "thai": "ฉันต้องพบเหรัญญิกเกี่ยวกับค่าปรับล่าช้าของฉัน"}
{"word": "bursar", "english": "The bursar’s office processes loan payments.", "thai": "สำนักงานเหรัญญิกจัดการการชำระเงินกู้"}
{"word": "bursar", "english": "The bursar sent a reminder about the deadline.", "thai": "เหรัญญิกส่งการแจ้งเตือนเกี่ยวกับกำหนดเวลา"}
{"word": "bursar", "english": "I called the bursar to confirm my payment.", "thai": "ฉันโทรหาเหรัญญิกเพื่อยืนยันการชำระเงินของฉัน"}
{"word": "bursar", "english": "The bursar’s office is handling my refund.", "thai": "สำนักงานเหรัญญิกกำลังจัดการการคืนเงินของฉัน"}
{"word": "bursar", "english": "The bursar can answer questions about fees.", "thai": "เหรัญญิกสามารถตอบคำถามเกี่ยวกับค่าธรรมเนียม"}
{"word": "bursar", "english": "I visited the bursar to pay my lab fees.", "thai": "ฉันไปที่สำนักงานเหรัญญิกเพื่อชำระค่าห้องปฏิบัติการ"}
{"word": "bursar", "english": "The bursar’s office offers payment plans.", "thai": "สำนักงานเหรัญญิกมีแผนการชำระเงินให้เลือก"}
{"word": "bursar", "english": "The bursar explained the billing process to me.", "thai": "เหรัญญิกอธิบายขั้นตอนการเรียกเก็บเงินให้ฉัน"}
{"word": "bursar", "english": "I owe the bursar for my parking permit.", "thai": "ฉันเป็นหนี้เหรัญญิกสำหรับใบอนุญาตจอดรถ"}
{"word": "bursar", "english": "The bursar’s office is busy during registration.", "thai": "สำนักงานเหรัญญิกวุ่นวายในช่วงลงทะเบียน"}
{"word": "bursar", "english": "The bursar can help with tuition disputes.", "thai": "เหรัญญิกสามารถช่วยแก้ไขข้อพิพาทเกี่ยวกับค่าเล่าเรียน"}
{"word": "bursar", "english": "I need to email the bursar about my account.", "thai": "ฉันต้องส่งอีเมลถึงเหรัญญิกเกี่ยวกับบัญชีของฉัน"}
{"word": "bursar", "english": "The bursar’s office mailed me a statement.", "thai": "สำนักงานเหรัญญิกส่งใบแจ้งยอดมาให้ฉันทางไปรษณีย์"}
{"word": "bursar", "english": "The bursar handles student fee collections.", "thai": "เหรัญญิกจัดการการเก็บค่าธรรมเนียมนักเรียน"}
{"word": "bursar", "english": "I spoke to the bursar about my financial aid.", "thai": "ฉันคุยกับเหรัญญิกเกี่ยวกับความช่วยเหลือทางการเงินของฉัน"}
{"word": "bursar", "english": "The bursar’s office is in the admin building.", "thai": "สำนักงานเหรัญญิกอยู่ในอาคารบริหาร"}
{"word": "bursar", "english": "The bursar can waive certain fees.", "thai": "เหรัญญิกสามารถยกเว้นค่าธรรมเนียมบางอย่างได้"}
{"word": "bursar", "english": "I need to visit the bursar before classes start.", "thai": "ฉันต้องไปพบเหรัญญิกก่อนเริ่มชั้นเรียน"}
{"word": "bursar", "english": "The bursar’s office processes all payments.", "thai": "สำนักงานเหรัญญิกจัดการการชำระเงินทั้งหมด"}
{"word": "bursar", "english": "The bursar helped me with my tuition refund.", "thai": "เหรัญญิกช่วยฉันเกี่ยวกับการคืนเงินค่าเล่าเรียน"}
{"word": "bursar", "english": "I got a notice from the bursar about my fees.", "thai": "ฉันได้รับแจ้งจากเหรัญญิกเกี่ยวกับค่าธรรมเนียมของฉัน"}
{"word": "bursar", "english": "The bursar’s office has a new payment system.", "thai": "สำนักงานเหรัญญิกมีระบบการชำระเงินใหม่"}
{"word": "bursar", "english": "The bursar can clarify your account balance.", "thai": "เหรัญญิกสามารถชี้แจงยอดคงเหลือในบัญชีของคุณ"}
{"word": "bursar", "english": "I paid my fees at the bursar’s office today.", "thai": "ฉันชำระค่าธรรมเนียมที่สำนักงานเหรัญญิกวันนี้"}
{"word": "bursar", "english": "The bursar’s office is open during lunch.", "thai": "สำนักงานเหรัญญิกเปิดให้บริการช่วงพักเที่ยง"}
{"word": "bursar", "english": "The bursar handles all billing inquiries.", "thai": "เหรัญญิกจัดการคำถามเกี่ยวกับการเรียกเก็บเงินทั้งหมด"}
{"word": "bursar", "english": "I need to ask the bursar about a fee error.", "thai": "ฉันต้องถามเหรัญญิกเกี่ยวกับข้อผิดพลาดในค่าธรรมเนียม"}
{"word": "bursar", "english": "The bursar’s office sent me a payment plan.", "thai": "สำนักงานเหรัญญิกส่งแผนการชำระเงินมาให้ฉัน"}
{"word": "bursar", "english": "The bursar can issue a financial statement.", "thai": "เหรัญญิกสามารถออกใบแจ้งยอดทางการเงินได้"}
{"word": "bursar", "english": "I met with the bursar to discuss my fees.", "thai": "ฉันพบกับเหรัญญิกเพื่อหารือเกี่ยวกับค่าธรรมเนียมของฉัน"}
{"word": "bursar", "english": "The bursar’s office is updating my account.", "thai": "สำนักงานเหรัญญิกกำลังอัปเดตบัญชีของฉัน"}
{"word": "bursar", "english": "The bursar helped me apply for a scholarship.", "thai": "เหรัญญิกช่วยฉันสมัครทุนการศึกษา"}
{"word": "bursar", "english": "I need to see the bursar about my refund.", "thai": "ฉันต้องพบเหรัญญิกเกี่ยวกับการคืนเงินของฉัน"}
{"word": "bursar", "english": "The bursar’s office handles late payments.", "thai": "สำนักงานเหรัญญิกจัดการการชำระเงินล่าช้า"}
{"word": "bursar", "english": "The bursar sent me a tuition invoice.", "thai": "เหรัญญิกส่งใบแจ้งหนี้ค่าเล่าเรียนมาให้ฉัน"}
{"word": "bursar", "english": "I called the bursar to dispute a charge.", "thai": "ฉันโทรหาเหรัญญิกเพื่อโต้แย้งค่าใช้จ่าย"}
{"word": "bursar", "english": "The bursar’s office is near the library.", "thai": "สำนักงานเหรัญญิกอยู่ใกล้ห้องสมุด"}
{"word": "bursar", "english": "The bursar can help with payment extensions.", "thai": "เหรัญญิกสามารถช่วยเรื่องการขยายเวลาการชำระเงิน"}
{"word": "bursar", "english": "I paid my balance at the bursar’s office.", "thai": "ฉันชำระยอดคงเหลือที่สำนักงานเหรัญญิก"}
{"word": "bursar", "english": "The bursar’s office is processing my refund.", "thai": "สำนักงานเหรัญญิกกำลังดำเนินการคืนเงินของฉัน"}
{"word": "bursar", "english": "The bursar explained the fee structure.", "thai": "เหรัญญิกอธิบายโครงสร้างค่าธรรมเนียม"}
{"word": "bursar", "english": "I need to contact the bursar about my bill.", "thai": "ฉันต้องติดต่อเหรัญญิกเกี่ยวกับใบเรียกเก็บเงินของฉัน"}
{"word": "bursar", "english": "The bursar’s office accepts credit cards.", "thai": "สำนักงานเหรัญญิกยอมรับบัตรเครดิต"}
{"word": "bursar", "english": "The bursar can provide a payment receipt.", "thai": "เหรัญญิกสามารถออกใบเสร็จรับเงินได้"}
{"word": "bursar", "english": "I visited the bursar to clear my account.", "thai": "ฉันไปที่สำนักงานเหรัญญิกเพื่อเคลียร์บัญชีของฉัน"}
{"word": "bursar", "english": "The bursar’s office is handling my scholarship.", "thai": "สำนักงานเหรัญญิกกำลังจัดการทุนการศึกษาของฉัน"}
{"word": "bursar", "english": "The bursar sent out billing statements.", "thai": "เหรัญญิกส่งใบแจ้งยอดการเรียกเก็บเงิน"}
{"word": "bursar", "english": "I need to ask the bursar about a refund.", "thai": "ฉันต้องถามเหรัญญิกเกี่ยวกับการคืนเงิน"}
{"word": "bursar", "english": "The bursar’s office is open for inquiries.", "thai": "สำนักงานเหรัญญิกเปิดให้สอบถามข้อมูล"}
{"word": "bursar", "english": "The bursar can assist with fee disputes.", "thai": "เหรัญญิกสามารถช่วยแก้ไขข้อพิพาทเกี่ยวกับค่าธรรมเนียม"}
{"word": "bursar", "english": "I paid my fees through the bursar’s website.", "thai": "ฉันชำระค่าธรรมเนียมผ่านเว็บไซต์ของเหรัญญิก"}
{"word": "bursar", "english": "The bursar’s office manages student billing.", "thai": "สำนักงานเหรัญญิกจัดการการเรียกเก็บเงินของนักเรียน"}
{"word": "bursar", "english": "The bursar helped me with my payment plan.", "thai": "เหรัญญิกช่วยฉันเกี่ยวกับแผนการชำระเงินของฉัน"}
{"word": "bursar", "english": "I got a call from the bursar about my fees.", "thai": "ฉันได้รับโทรศัพท์จากเหรัญญิกเกี่ยวกับค่าธรรมเนียมของฉัน"}
{"word": "bursar", "english": "The bursar’s office is processing my payment.", "thai": "สำนักงานเหรัญญิกกำลังดำเนินการชำระเงินของฉัน"}
{"word": "bursar", "english": "The bursar can explain the refund process.", "thai": "เหรัญญิกสามารถอธิบายขั้นตอนการคืนเงินได้"}
{"word": "bursar", "english": "I need to see the bursar about my balance.", "thai": "ฉันต้องพบเหรัญญิกเกี่ยวกับยอดคงเหลือของฉัน"}
{"word": "bursar", "english": "The bursar’s office sent a late fee notice.", "thai": "สำนักงานเหรัญญิกส่งหนังสือแจ้งค่าปรับล่าช้า"}
{"word": "bursar", "english": "The bursar handles all tuition transactions.", "thai": "เหรัญญิกจัดการธุรกรรมค่าเล่าเรียนทั้งหมด"}
{"word": "bursar", "english": "I emailed the bursar about a billing issue.", "thai": "ฉันส่งอีเมลถึงเหรัญญิกเกี่ยวกับปัญหาการเรียกเก็บเงิน"}
{"word": "bursar", "english": "The bursar’s office is updating its records.", "thai": "สำนักงานเหรัญญิกกำลังอัปเดตบันทึก"}
{"word": "bursar", "english": "The bursar can help with financial inquiries.", "thai": "เหรัญญิกสามารถช่วยตอบคำถามทางการเงิน"}
{"word": "bursar", "english": "I paid my tuition at the bursar’s office.", "thai": "ฉันชำระค่าเล่าเรียนที่สำนักงานเหรัญญิก"}
{"word": "bursar", "english": "The bursar’s office is closed for the holiday.", "thai": "สำนักงานเหรัญญิกปิดทำการในวันหยุด"}
{"word": "bursar", "english": "The bursar sent me a payment confirmation.", "thai": "เหรัญญิกส่งการยืนยันการชำระเงินมาให้ฉัน"}
{"word": "catalog", "english": "The university sent me the course catalog for next semester.", "thai": "มหาวิทยาลัยส่งแคตตาล็อกวิชาเรียนสำหรับภาคการศึกษาหน้าให้ฉัน"}
{"word": "catalog", "english": "I found a great chair in the furniture catalog.", "thai": "ฉันเจอเก้าอี้สวยในแคตตาล็อกเฟอร์นิเจอร์"}
{"word": "catalog", "english": "She browsed the catalog to choose her classes.", "thai": "เธอเปิดดูแคตตาล็อกเพื่อเลือกวิชาเรียน"}
{"word": "catalog", "english": "The library’s online catalog is easy to use.", "thai": "แคตตาล็อกออนไลน์ของห้องสมุดใช้งานง่าย"}
{"word": "catalog", "english": "I ordered a dress from the clothing catalog.", "thai": "ฉันสั่งชุดจากแคตตาล็อกเสื้อผ้า"}
{"word": "catalog", "english": "The course catalog lists all the prerequisites.", "thai": "แคตตาล็อกวิชาเรียนระบุวิชาที่ต้องเรียนมาก่อนทั้งหมด"}
{"word": "catalog", "english": "He’s updating the product catalog for the store.", "thai": "เขากำลังอัปเดตแคตตาล็อกสินค้าสำหรับร้านค้า"}
{"word": "catalog", "english": "The catalog has details about the new programs.", "thai": "แคตตาล็อกมีรายละเอียดเกี่ยวกับโปรแกรมใหม่"}
{"word": "catalog", "english": "I need to check the catalog for book availability.", "thai": "ฉันต้องตรวจสอบแคตตาล็อกเพื่อดูว่ามีหนังสือหรือไม่"}
{"word": "catalog", "english": "The museum’s catalog describes all the exhibits.", "thai": "แคตตาล็อกของพิพิธภัณฑ์อธิบายนิทรรศการทั้งหมด"}
{"word": "catalog", "english": "She flipped through the catalog to find a gift.", "thai": "เธอพลิกดูแคตตาล็อกเพื่อหาของขวัญ"}
{"word": "catalog", "english": "The catalog is available online this year.", "thai": "แคตตาล็อกมีให้ดูออนไลน์ในปีนี้"}
{"word": "catalog", "english": "I found the class times in the course catalog.", "thai": "ฉันเจอตารางเรียนในแคตตาล็อกวิชา"}
{"word": "catalog", "english": "The store mailed me their latest catalog.", "thai": "ร้านค้าส่งแคตตาล็อกล่าสุดมาให้ฉันทางไปรษณีย์"}
{"word": "catalog", "english": "The catalog lists all the available electives.", "thai": "แคตตาล็อกระบุวิชาเลือกทั้งหมดที่มีให้"}
{"word": "catalog", "english": "He’s designing a new catalog for the company.", "thai": "เขากำลังออกแบบแคตตาล็อกใหม่สำหรับบริษัท"}
{"word": "catalog", "english": "The library catalog shows the book is checked out.", "thai": "แคตตาล็อกห้องสมุดแสดงว่าหนังสือถูกยืมไปแล้ว"}
{"word": "catalog", "english": "I saw a cool gadget in the tech catalog.", "thai": "ฉันเห็นอุปกรณ์เจ๋งๆ ในแคตตาล็อกเทคโนโลยี"}
{"word": "catalog", "english": "The course catalog is updated every year.", "thai": "แคตตาล็อกวิชาจะได้รับการอัปเดตทุกปี"}
{"word": "catalog", "english": "She ordered a rug from the home decor catalog.", "thai": "เธอสั่งพรมจากแคตตาล็อกของตกแต่งบ้าน"}
{"word": "catalog", "english": "The catalog has a section for graduate programs.", "thai": "แคตตาล็อกมีส่วนสำหรับหลักสูตรบัณฑิตศึกษา"}
{"word": "catalog", "english": "I need the catalog to pick my major’s courses.", "thai": "ฉันต้องการแคตตาล็อกเพื่อเลือกวิชาของสาขาวิชาเอก"}
{"word": "catalog", "english": "The online catalog crashed during registration.", "thai": "แคตตาล็อกออนไลน์ล่มระหว่างการลงทะเบียน"}
{"word": "catalog", "english": "The catalog includes prices for all items.", "thai": "แคตตาล็อกรวมราคาของสินค้าทั้งหมด"}
{"word": "catalog", "english": "He’s adding new products to the catalog.", "thai": "เขากำลังเพิ่มสินค้าใหม่ลงในแคตตาล็อก"}
{"word": "catalog", "english": "The course catalog is on the university website.", "thai": "แคตตาล็อกวิชาอยู่บนเว็บไซต์ของมหาวิทยาลัย"}
{"word": "catalog", "english": "I found a lamp in the catalog I really like.", "thai": "ฉันเจอโคมไฟในแคตตาล็อกที่ฉันชอบมาก"}
{"word": "catalog", "english": "The library catalog helps you find books fast.", "thai": "แคตตาล็อกห้องสมุดช่วยให้คุณหาหนังสือได้เร็ว"}
{"word": "catalog", "english": "The catalog lists all the summer courses.", "thai": "แคตตาล็อกระบุวิชาฤดูร้อนทั้งหมด"}
{"word": "catalog", "english": "She’s reviewing the catalog for new arrivals.", "thai": "เธอกำลังตรวจสอบแคตตาล็อกสำหรับสินค้าใหม่"}
{"word": "catalog", "english": "The catalog has a guide for online classes.", "thai": "แคตตาล็อกมีคู่มือสำหรับชั้นเรียนออนไลน์"}
{"word": "catalog", "english": "I checked the catalog for the store’s deals.", "thai": "ฉันตรวจสอบแคตตาล็อกเพื่อดูข้อเสนอของร้านค้า"}
{"word": "catalog", "english": "The course catalog is over 200 pages long.", "thai": "แคตตาล็อกวิชามีความยาวกว่า 200 หน้า"}
{"word": "catalog", "english": "The catalog arrived in the mail yesterday.", "thai": "แคตตาล็อกมาถึงทางไปรษณีย์เมื่อวานนี้"}
{"word": "catalog", "english": "He used the catalog to plan his schedule.", "thai": "เขาใช้แคตตาล็อกเพื่อวางแผนตารางเรียน"}
{"word": "catalog", "english": "The catalog shows all the new book releases.", "thai": "แคตตาล็อกแสดงหนังสือออกใหม่ทั้งหมด"}
{"word": "catalog", "english": "I need to download the digital catalog.", "thai": "ฉันต้องดาวน์โหลดแคตตาล็อกดิจิทัล"}
{"word": "catalog", "english": "The catalog lists the professor for each class.", "thai": "แคตตาล็อกระบุอาจารย์สำหรับแต่ละวิชา"}
{"word": "catalog", "english": "She ordered a jacket from the winter catalog.", "thai": "เธอสั่งแจ็คเก็ตจากแคตตาล็อกฤดูหนาว"}
{"word": "catalog", "english": "The library catalog is down for maintenance.", "thai": "แคตตาล็อกห้องสมุดปิดปรับปรุง"}
{"word": "catalog", "english": "The catalog has a discount code inside.", "thai": "แคตตาล็อกมีรหัสส่วนลดอยู่ข้างใน"}
{"word": "catalog", "english": "I’m browsing the catalog for new courses.", "thai": "ฉันกำลังดูแคตตาล็อกเพื่อหาวิชาใหม่"}
{"word": "catalog", "english": "The store’s catalog is updated monthly.", "thai": "แคตตาล็อกของร้านค้าอัปเดตทุกเดือน"}
{"word": "catalog", "english": "The catalog includes a map of the campus.", "thai": "แคตตาล็อกมีแผนที่ของวิทยาเขต"}
{"word": "catalog", "english": "She found a couch in the furniture catalog.", "thai": "เธอเจอโซฟาในแคตตาล็อกเฟอร์นิเจอร์"}
{"word": "catalog", "english": "The course catalog is hard to navigate.", "thai": "แคตตาล็อกวิชายากต่อการค้นหา"}
{"word": "catalog", "english": "The catalog lists all the lab requirements.", "thai": "แคตตาล็อกระบุข้อกำหนดห้องปฏิบัติการทั้งหมด"}
{"word": "catalog", "english": "I saw a sale in the holiday catalog.", "thai": "ฉันเห็นส่วน reduced ในแคตตาล็อกวันหยุด"}
{"word": "catalog", "english": "The library catalog tracks every book.", "thai": "แคตตาล็อกห้องสมุดติดตามทุกเล่ม"}
{"word": "catalog", "english": "The catalog has a section for art supplies.", "thai": "แคตตาล็อกมีส่วนสำหรับอุปกรณ์ศิลปะ"}
{"word": "catalog", "english": "I need the catalog to check class credits.", "thai": "ฉันต้องการแคตตาล็อกเพื่อตรวจสอบหน่วยกิตวิชา"}
{"word": "catalog", "english": "The catalog was mailed to all students.", "thai": "แคตตาล็อกถูกส่งไปรษณีย์ถึงนักเรียนทุกคน"}
{"word": "catalog", "english": "She’s creating a catalog for the art gallery.", "thai": "เธอกำลังสร้างแคตตาล็อกสำหรับหอศิลป์"}
{"word": "catalog", "english": "The catalog shows the new degree programs.", "thai": "แคตตาล็อกแสดงหลักสูตรปริญญาใหม่"}
{"word": "catalog", "english": "I found a great deal in the online catalog.", "thai": "ฉันเจอข้อเสนอดีๆ ในแคตตาล็อกออนไลน์"}
{"word": "catalog", "english": "The course catalog has a search feature.", "thai": "แคตตาล็อกวิชามีฟีเจอร์ค้นหา"}
{"word": "catalog", "english": "The catalog lists the store’s inventory.", "thai": "แคตตาล็อกระบุสินค้าคงคลังของร้าน"}
{"word": "catalog", "english": "He’s updating the catalog with new items.", "thai": "เขากำลังอัปเดตแคตตาล็อกด้วยสินค้าใหม่"}
{"word": "catalog", "english": "The catalog is free to download online.", "thai": "แคตตาล็อกสามารถดาวน์โหลดฟรีออนไลน์"}
{"word": "catalog", "english": "I checked the catalog for evening classes.", "thai": "ฉันตรวจสอบแคตตาล็อกเพื่อหาวิชาค่ำ"}
{"word": "catalog", "english": "The catalog has pictures of all products.", "thai": "แคตตาล็อกมีรูปภาพของสินค้าทั้งหมด"}
{"word": "catalog", "english": "The library catalog is linked to the database.", "thai": "แคตตาล็อกห้องสมุดเชื่อมต่อกับฐานข้อมูล"}
{"word": "catalog", "english": "She ordered shoes from the spring catalog.", "thai": "เธอสั่งรองเท้าจากแคตตาล็อกฤดูใบไม้ผลิ"}
{"word": "catalog", "english": "The catalog includes course descriptions.", "thai": "แคตตาล็อกรวมคำอธิบายวิชา"}
{"word": "catalog", "english": "I found the book in the library catalog.", "thai": "ฉันเจอหนังสือในแคตตาล็อกห้องสมุด"}
{"word": "catalog", "english": "The catalog arrived with the new semester info.", "thai": "แคตตาล็อกมาพร้อมข้อมูลภาคการศึกษาใหม่"}
{"word": "catalog", "english": "The store catalog has a clearance section.", "thai": "แคตตาล็อกของร้านมีส่วนสินค้าลดราคา"}
{"word": "catalog", "english": "The catalog lists all the faculty members.", "thai": "แคตตาล็อกระบุรายชื่อคณาจารย์ทั้งหมด"}
{"word": "catalog", "english": "I’m browsing the catalog for gift ideas.", "thai": "ฉันกำลังดูแคตตาล็อกเพื่อหาไอเดียของขวัญ"}
{"word": "catalog", "english": "The course catalog is available in PDF format.", "thai": "แคตตาล็อกวิชามีให้ในรูปแบบ PDF"}
{"word": "catalog", "english": "The catalog shows the latest tech gadgets.", "thai": "แคตตาล็อกแสดงอุปกรณ์เทคโนโลยีล่าสุด"}
{"word": "catalog", "english": "She’s organizing the catalog for the auction.", "thai": "เธอกำลังจัดระเบียบแคตตาล็อกสำหรับการประมูล"}
{"word": "catalog", "english": "The catalog has all the course requirements.", "thai": "แคตตาล็อกมีข้อกำหนดวิชาทั้งหมด"}
{"word": "catalog", "english": "I ordered a table from the catalog online.", "thai": "ฉันสั่งโต๊ะจากแคตตาล็อกออนไลน์"}
{"word": "catalog", "english": "The library catalog needs an update.", "thai": "แคตตาล็อกห้องสมุดต้องการการอัปเดต"}
{"word": "catalog", "english": "The catalog lists the new certificate programs.", "thai": "แคตตาล็อกระบุหลักสูตรประกาศนียบัตรใหม่"}
{"word": "catalog", "english": "I found a sweater in the fall catalog.", "thai": "ฉันเจอเสื้อสเวตเตอร์ในแคตตาล็อกฤดูใบไม้ร่วง"}
{"word": "catalog", "english": "The catalog is divided by department.", "thai": "แคตตาล็อกถูกแบ่งตามแผนก"}
{"word": "catalog", "english": "She’s mailing out the new store catalog.", "thai": "เธอกำลังส่งแคตตาล็อกร้านค้าใหม่ทางไปรษณีย์"}
{"word": "catalog", "english": "The catalog has a guide for new students.", "thai": "แคตตาล็อกมีคู่มือสำหรับนักเรียนใหม่"}
{"word": "citation", "english": "I need to add a citation for this quote in my paper.", "thai": "ฉันต้องเพิ่มการอ้างอิงสำหรับคำพูดนี้ในงานวิจัยของฉัน"}
{"word": "citation", "english": "The professor emphasized the importance of proper citation.", "thai": "อาจารย์เน้นย้ำถึงความสำคัญของการอ้างอิงที่ถูกต้อง"}
{"word": "citation", "english": "She got a citation for parking in a no-parking zone.", "thai": "เธอได้รับใบสั่งจอดรถในเขตห้ามจอด"}
{"word": "citation", "english": "The book includes a citation for every source used.", "thai": "หนังสือเล่มนี้มีการอ้างอิงสำหรับทุกแหล่งที่มา"}
{"word": "citation", "english": "He received a citation for his bravery during the rescue.", "thai": "เขาได้รับรางวัลเกียรติยศสำหรับความกล้าหาญในการช่วยเหลือ"}
{"word": "citation", "english": "The citation format for APA is different from MLA.", "thai": "รูปแบบการอ้างอิงสำหรับ APA แตกต่างจาก MLA"}
{"word": "citation", "english": "I got a traffic citation for speeding last week.", "thai": "ฉันได้รับใบสั่งจราจรสำหรับการขับรถเร็วเมื่อสัปดาห์ที่แล้ว"}
{"word": "citation", "english": "The article has a citation missing for the data.", "thai": "บทความนี้ขาดการอ้างอิงสำหรับข้อมูล"}
{"word": "citation", "english": "She was awarded a citation for her volunteer work.", "thai": "เธอได้รับรางวัลเกียรติยศสำหรับงานอาสาสมัครของเธอ"}
{"word": "citation", "english": "The citation in the bibliography was formatted wrong.", "thai": "การอ้างอิงในบรรณานุกรมจัดรูปแบบผิด"}
{"word": "citation", "english": "He got a citation for running a red light.", "thai": "เขาได้รับใบสั่งสำหรับการฝ่าไฟแดง"}
{"word": "citation", "english": "The paper needs at least five citations to support the argument.", "thai": "งานวิจัยนี้ต้องการการอ้างอิงอย่างน้อยห้าครั้งเพื่อสนับสนุนข้อโต้แย้ง"}
{"word": "citation", "english": "The police issued a citation for littering.", "thai": "ตำรวจออกใบสั่งสำหรับการทิ้งขยะ"}
{"word": "citation", "english": "I’m using a citation generator for my references.", "thai": "ฉันใช้เครื่องมือสร้างการอ้างอิงสำหรับเอกสารอ้างอิงของฉัน"}
{"word": "citation", "english": "The citation for the journal article was incomplete.", "thai": "การอ้างอิงสำหรับบทความวารสารไม่สมบูรณ์"}
{"word": "citation", "english": "She received a citation for outstanding academic performance.", "thai": "เธอได้รับรางวัลเกียรติยศสำหรับผลการเรียนที่ยอดเยี่ยม"}
{"word": "citation", "english": "The citation style for this class is Chicago.", "thai": "รูปแบบการอ้างอิงสำหรับวิชานี้คือ Chicago"}
{"word": "citation", "english": "He got a citation for parking without a permit.", "thai": "เขาได้รับใบสั่งสำหรับการจอดรถโดยไม่มีใบอนุญาต"}
{"word": "citation", "english": "The citation in the text needs to match the bibliography.", "thai": "การอ้างอิงในเนื้อหาต้องตรงกับบรรณานุกรม"}
{"word": "citation", "english": "The officer gave me a citation for expired tags.", "thai": "เจ้าหน้าที่ให้ใบสั่งฉันสำหรับป้ายทะเบียนหมดอายุ"}
{"word": "citation", "english": "The citation for the book includes the publisher’s name.", "thai": "การอ้างอิงสำหรับหนังสือรวมถึงชื่อสำนักพิมพ์"}
{"word": "citation", "english": "She was honored with a citation for her research.", "thai": "เธอได้รับรางวัลเกียรติยศสำหรับงานวิจัยของเธอ"}
{"word": "citation", "english": "I need to fix the citation for this website.", "thai": "ฉันต้องแก้ไขการอ้างอิงสำหรับเว็บไซต์นี้"}
{"word": "citation", "english": "The citation for jaywalking came with a fine.", "thai": "ใบสั่งสำหรับการข้ามถนนผิดกฎหมายมาพร้อมกับค่าปรับ"}
{"word": "citation", "english": "The professor requires a citation for every fact.", "thai": "อาจารย์กำหนดให้มีการอ้างอิงสำหรับทุกข้อเท็จจริง"}
{"word": "citation", "english": "He received a citation for his community service.", "thai": "เขาได้รับรางวัลเกียรติยศสำหรับการบริการชุมชน"}
{"word": "citation", "english": "The citation tool helped me format my references.", "thai": "เครื่องมือการอ้างอิงช่วยฉันจัดรูปแบบเอกสารอ้างอิง"}
{"word": "citation", "english": "I got a citation for not wearing a seatbelt.", "thai": "ฉันได้รับใบสั่งสำหรับการไม่คาดเข็มขัดนิรภัย"}
{"word": "citation", "english": "The citation in the paper was marked as incorrect.", "thai": "การอ้างอิงในงานวิจัยถูกทำเครื่องหมายว่าไม่ถูกต้อง"}
{"word": "citation", "english": "She earned a citation for her leadership skills.", "thai": "เธอได้รับรางวัลเกียรติยศสำหรับทักษะความเป็นผู้นำ"}
{"word": "citation", "english": "The citation for the article includes the DOI.", "thai": "การอ้างอิงสำหรับบทความรวมถึง DOI"}
{"word": "citation", "english": "The police issued a citation for loud music.", "thai": "ตำรวจออกใบสั่งสำหรับการเล่นดนตรีเสียงดัง"}
{"word": "citation", "english": "I need to include a citation for this statistic.", "thai": "ฉันต้องรวมการอ้างอิงสำหรับสถิตินี้"}
{"word": "citation", "english": "He got a citation for parking too close to a hydrant.", "thai": "เขาได้รับใบสั่งสำหรับการจอดรถใกล้หัวดับเพลิงเกินไป"}
{"word": "citation", "english": "The citation format is explained in the syllabus.", "thai": "รูปแบบการอ้างอิงอธิบายอยู่ในหลักสูตร"}
{"word": "citation", "english": "She received a citation for her charitable work.", "thai": "เธอได้รับรางวัลเกiaรติยศสำหรับงานการกุศล"}
{"word": "citation", "english": "The citation for the study is in APA style.", "thai": "การอ้างอิงสำหรับการศึกษานี้อยู่ในรูปแบบ APA"}
{"word": "citation", "english": "I got a citation for speeding on the highway.", "thai": "ฉันได้รับใบสั่งสำหรับการขับรถเร็วบนทางหลวง"}
{"word": "citation", "english": "The citation in the text was properly formatted.", "thai": "การอ้างอิงในเนื้อหาถูกจัดรูปแบบอย่างถูกต้อง"}
{"word": "citation", "english": "He was given a citation for his heroic actions.", "thai": "เขาได้รับรางวัลเกียรติยศสำหรับการกระทำที่กล้าหาญ"}
{"word": "citation", "english": "The citation for the book was missing a page number.", "thai": "การอ้างอิงสำหรับหนังสือขาดเลขหน้า"}
{"word": "citation", "english": "The officer issued a citation for illegal parking.", "thai": "เจ้าหน้าที่ออกใบสั่งสำหรับการจอดรถผิดกฎหมาย"}
{"word": "citation", "english": "I need to double-check the citation for accuracy.", "thai": "ฉันต้องตรวจสอบการอ้างอิงซ้ำเพื่อความถูกต้อง"}
{"word": "citation", "english": "She got a citation for her academic excellence.", "thai": "เธอได้รับรางวัลเกียรติยศสำหรับความเป็นเลิศทางวิชาการ"}
{"word": "citation", "english": "The citation style guide is online.", "thai": "คู่มือรูปแบบการอ้างอิงมีให้ออนไลน์"}
{"word": "citation", "english": "He received a citation for driving without a license.", "thai": "เขาได้รับใบสั่งสำหรับการขับรถโดยไม่มีใบขับขี่"}
{"word": "citation", "english": "The citation for the source was incomplete.", "thai": "การอ้างอิงสำหรับแหล่งที่มาไม่สมบูรณ์"}
{"word": "citation", "english": "She was awarded a citation for her project.", "thai": "เธอได้รับรางวัลเกียรติยศสำหรับโครงการของเธอ"}
{"word": "citation", "english": "The citation in the essay needs to be revised.", "thai": "การอ้างอิงในเรียงความต้องได้รับการแก้ไข"}
{"word": "citation", "english": "I got a citation for parking in a handicap space.", "thai": "ฉันได้รับใบสั่งสำหรับการจอดรถในที่สำหรับผู้พิการ"}
{"word": "citation", "english": "The citation for the journal includes the volume number.", "thai": "การอ้างอิงสำหรับวารสารรวมถึงเลขที่วารสาร"}
{"word": "citation", "english": "He earned a citation for his teaching excellence.", "thai": "เขาได้รับรางวัลเกียรติยศสำหรับความเป็นเลิศในการสอน"}
{"word": "citation", "english": "The citation rules are strict in this course.", "thai": "กฎการอ้างอิงเข้มงวดในวิชานี้"}
{"word": "citation", "english": "The officer gave a citation for reckless driving.", "thai": "เจ้าหน้าที่ออกใบสั่งสำหรับการขับรถโดยประมาท"}
{"word": "citation", "english": "I need a citation for this historical fact.", "thai": "ฉันต้องการการอ้างอิงสำหรับข้อเท็จจริงทางประวัติศาสตร์นี้"}
{"word": "citation", "english": "She received a citation for her scientific discovery.", "thai": "เธอได้รับรางวัลเกียรติยศสำหรับการค้นพบทางวิทยาศาสตร์"}
{"word": "citation", "english": "The citation generator saved me a lot of time.", "thai": "เครื่องมือสร้างการอ้างอิงช่วยประหยัดเวลาฉันได้มาก"}
{"word": "citation", "english": "He got a citation for fishing without a permit.", "thai": "เขาได้รับใบสั่งสำหรับการตกปลาโดยไม่มีใบอนุญาต"}
{"word": "citation", "english": "The citation for the article was in MLA format.", "thai": "การอ้างอิงสำหรับบทความอยู่ในรูปแบบ MLA"}
{"word": "citation", "english": "She was given a citation for her teamwork.", "thai": "เธอได้รับรางวัลเกียรติยศสำหรับการทำงานเป็นทีม"}
{"word": "citation", "english": "The citation in the paper was marked as plagiarized.", "thai": "การอ้างอิงในงานวิจัยถูกทำเครื่องหมายว่าลอกเลียน"}
{"word": "citation", "english": "I received a citation for a broken tail light.", "thai": "ฉันได้รับใบสั่งสำหรับไฟท้ายรถเสีย"}
{"word": "citation", "english": "The citation for the study includes the author’s name.", "thai": "การอ้างอิงสำหรับการศึกษารวมถึงชื่อผู้เขียน"}
{"word": "citation", "english": "He was awarded a citation for his innovation.", "thai": "เขาได้รับรางวัลเกียรติยศสำหรับนวัตกรรมของเขา"}
{"word": "citation", "english": "The citation style for this journal is APA.", "thai": "รูปแบบการอ้างอิงสำหรับวารสารนี้คือ APA"}
{"word": "citation", "english": "She got a citation for parking on the sidewalk.", "thai": "เธอได้รับใบสั่งสำหรับการจอดรถบนทางเท้า"}
{"word": "citation", "english": "I need to include a citation for this image.", "thai": "ฉันต้องรวมการอ้างอิงสำหรับรูปภาพนี้"}
{"word": "citation", "english": "He received a citation for his environmental work.", "thai": "เขาได้รับรางวัลเกียรติยศสำหรับงานด้านสิ่งแวดล้อม"}
{"word": "citation", "english": "The citation for the book was missing the year.", "thai": "การอ้างอิงสำหรับหนังสือขาดปีที่พิมพ์"}
{"word": "citation", "english": "The officer issued a citation for speeding.", "thai": "เจ้าหน้าที่ออกใบสั่งสำหรับการขับรถเร็ว"}
{"word": "citation", "english": "The citation in the report was formatted correctly.", "thai": "การอ้างอิงในรายงานถูกจัดรูปแบบอย่างถูกต้อง"}
{"word": "citation", "english": "She earned a citation for her dedication.", "thai": "เธอได้รับรางวัลเกียรติยศสำหรับความทุ่มเท"}
{"word": "citation", "english": "The citation for the website needs a URL.", "thai": "การอ้างอิงสำหรับเว็บไซต์ต้องการ URL"}
{"word": "citation", "english": "I got a citation for parking in a fire lane.", "thai": "ฉันได้รับใบสั่งสำหรับการจอดรถในช่องทางดับเพลิง"}
{"word": "citation", "english": "The citation guide is available online.", "thai": "คู่มือการอ้างอิงมีให้ออนไลน์"}
{"word": "citation", "english": "He was given a citation for his research paper.", "thai": "เขาได้รับรางวัลเกียรติยศสำหรับงานวิจัยของเขา"}
{"word": "citation", "english": "The citation for the article was in Chicago style.", "thai": "การอ้างอิงสำหรับบทความอยู่ในรูปแบบ Chicago"}
{"word": "citation", "english": "She got a citation for illegal dumping.", "thai": "เธอได้รับใบสั่งสำหรับการทิ้งขยะผิดกฎหมาย"}
{"word": "citation", "english": "I need to check the citation for this quote.", "thai": "ฉันต้องตรวจสอบการอ้างอิงสำหรับคำพูดนี้"}
{"word": "citation", "english": "He received a citation for his mentorship.", "thai": "เขาได้รับรางวัลเกียรติยศสำหรับการเป็นที่ปรึกษา"}
{"word": "citation", "english": "The citation in the paper was incomplete.", "thai": "การอ้างอิงในงานวิจัยไม่สมบูรณ์"}
{"word": "citation", "english": "The officer gave me a citation for no insurance.", "thai": "เจ้าหน้าที่ให้ใบสั่งฉันสำหรับการไม่มีประกัน"}
{"word": "citation", "english": "The citation for the source was accurate.", "thai": "การอ้างอิงสำหรับแหล่งที่มาถูกต้อง"}
{"word": "citation", "english": "She was awarded a citation for her presentation.", "thai": "เธอได้รับรางวัลเกียรติยศสำหรับการนำเสนอของเธอ"}
{"word": "citation", "english": "The citation style is specified in the guidelines.", "thai": "รูปแบบการอ้างอิงระบุไว้ในแนวทาง"}
{"word": "citation", "english": "He got a citation for blocking a driveway.", "thai": "เขาได้รับใบสั่งสำหรับการจอดรถขวางทางเข้า"}
{"word": "citation", "english": "I need a citation for this research data.", "thai": "ฉันต้องการการอ้างอิงสำหรับข้อมูลการวิจัยนี้"}
{"word": "citation", "english": "She received a citation for her contributions.", "thai": "เธอได้รับรางวัลเกียรติยศสำหรับการมีส่วนร่วมของเธอ"}
{"word": "citation", "english": "The citation for the journal was in MLA style.", "thai": "การอ้างอิงสำหรับวารสารอยู่ในรูปแบบ MLA"}
{"word": "citation", "english": "The officer issued a citation for a broken headlight.", "thai": "เจ้าหน้าที่ออกใบสั่งสำหรับไฟหน้าชำรุด"}
{"word": "citation", "english": "The citation in the essay was properly cited.", "thai": "การอ้างอิงในเรียงความถูกอ้างอิงอย่างถูกต้อง"}
{"word": "citation", "english": "He earned a citation for his volunteer efforts.", "thai": "เขาได้รับรางวัลเกียรติยศสำหรับความพยายามในการเป็นอาสาสมัคร"}
{"word": "citation", "english": "The citation for the book needs the edition number.", "thai": "การอ้างอิงสำหรับหนังสือต้องการเลขฉบับ"}
{"word": "citation", "english": "I got a citation for parking without a meter.", "thai": "ฉันได้รับใบสั่งสำหรับการจอดรถโดยไม่ใช้มิเตอร์"}
{"word": "citation", "english": "The citation tool formats references automatically.", "thai": "เครื่องมือการอ้างอิงจัดรูปแบบเอกสารอ้างอิงโดยอัตโนมัติ"}
{"word": "citation", "english": "She was given a citation for her innovation.", "thai": "เธอได้รับรางวัลเกียรติยศสำหรับนวัตกรรมของเธอ"}
{"word": "citation", "english": "The citation for the article was missing the date.", "thai": "การอ้างอิงสำหรับบทความขาดวันที่"}
{"word": "citation", "english": "The police issued a citation for loitering.", "thai": "ตำรวจออกใบสั่งสำหรับการยืนเตร็ดเตร่"}
{"word": "citation", "english": "I need to include a citation for this theory.", "thai": "ฉันต้องรวมการอ้างอิงสำหรับทฤษฎีนี้"}
{"word": "citation", "english": "He received a citation for his academic work.", "thai": "เขาได้รับรางวัลเกียรติยศสำหรับงานวิชาการของเขา"}
{"word": "clinic", "english": "I have an appointment at the clinic tomorrow.", "thai": "ฉันมีนัดที่คลินิกพรุ่งนี้"}
{"word": "clinic", "english": "The clinic is offering free flu shots this week.", "thai": "คลินิกกำลังให้บริการฉีดวัคซีนไข้หวัดใหญ่ฟรีในสัปดาห์นี้"}
{"word": "clinic", "english": "She volunteers at the community health clinic.", "thai": "เธอเป็นอาสาสมัครที่คลินิกสุขภาพชุมชน"}
{"word": "clinic", "english": "The dental clinic is open on Saturdays.", "thai": "คลินิกทันตกรรมเปิดให้บริการในวันเสาร์"}
{"word": "clinic", "english": "He visited the clinic for a routine checkup.", "thai": "เขาไปที่คลินิกเพื่อตรวจสุขภาพประจำ"}
{"word": "clinic", "english": "The clinic has a new doctor on staff.", "thai": "คลินิกมีแพทย์คนใหม่ประจำการ"}
{"word": "clinic", "english": "I need to call the clinic to reschedule.", "thai": "ฉันต้องโทรไปที่คลินิกเพื่อเลื่อนนัด"}
{"word": "clinic", "english": "The veterinary clinic treated my dog’s injury.", "thai": "คลินิกสัตวแพทย์รักษาอาการบาดเจ็บของสุนัขฉัน"}
{"word": "clinic", "english": "The clinic provides mental health services.", "thai": "คลินิกให้บริการด้านสุขภาพจิต"}
{"word": "clinic", "english": "She works as a nurse at the pediatric clinic.", "thai": "เธอทำงานเป็นพยาบาลที่คลินิกเด็ก"}
{"word": "clinic", "english": "The clinic is closed for the holiday.", "thai": "คลินิกปิดทำการในวันหยุด"}
{"word": "clinic", "english": "I got my blood test done at the clinic.", "thai": "ฉันไปตรวจเลือดที่คลินิก"}
{"word": "clinic", "english": "The university runs a free legal clinic.", "thai": "มหาวิทยาลัยเปิดคลินิกกฎหมายฟรี"}
{"word": "clinic", "english": "The clinic is booked for appointments all day.", "thai": "คลินิกถูกจองเต็มสำหรับนัดทั้งวัน"}
{"word": "clinic", "english": "He’s interning at the sports medicine clinic.", "thai": "เขากำลังฝึกงานที่คลินิกเวชศาสตร์การกีฬา"}
{"word": "clinic", "english": "The clinic offers low-cost vaccinations.", "thai": "คลินิกให้บริการฉีดวัคซีนราคาประหยัด"}
{"word": "clinic", "english": "I need to visit the clinic for a physical.", "thai": "ฉันต้องไปที่คลินิกเพื่อตรวจร่างกาย"}
{"word": "clinic", "english": "The eye clinic fixed my prescription.", "thai": "คลินิกตาครับแก้ไขใบสั่งยาของฉัน"}
{"word": "clinic", "english": "The clinic is part of the hospital network.", "thai": "คลินิกเป็นส่วนหนึ่งของเครือข่ายโรงพยาบาล"}
{"word": "clinic", "english": "She got a referral to a specialty clinic.", "thai": "เธอได้รับการส่งต่อไปยังคลินิกเฉพาะทาง"}
{"word": "clinic", "english": "The clinic has a new X-ray machine.", "thai": "คลินิกมีเครื่องเอ็กซเรย์ใหม่"}
{"word": "clinic", "english": "I called the clinic to ask about walk-ins.", "thai": "ฉันโทรไปที่คลินิกเพื่อถามเกี่ยวกับการเข้ารับบริการโดยไม่นัด"}
{"word": "clinic", "english": "The mobile clinic visits rural areas monthly.", "thai": "คลินิกเคลื่อนที่เยี่ยมชมพื้นที่ชนบททุกเดือน"}
{"word": "clinic", "english": "The clinic staff was very friendly.", "thai": "เจ้าหน้าที่คลินิกเป็นมิตรมาก"}
{"word": "clinic", "english": "He’s getting treatment at the pain clinic.", "thai": "เขากำลังรับการรักษาที่คลินิกจัดการความเจ็บปวด"}
{"word": "clinic", "english": "The clinic offers free health screenings.", "thai": "คลินิกให้บริการตรวจสุขภาพฟรี"}
{"word": "clinic", "english": "I need to pick up a prescription from the clinic.", "thai": "ฉันต้องไปรับยาตามใบสั่งจากคลินิก"}
{"word": "clinic", "english": "The dermatology clinic is always busy.", "thai": "คลินิกผิวหนังยุ่งอยู่เสมอ"}
{"word": "clinic", "english": "The clinic is hiring new medical assistants.", "thai": "คลินิกกำลังจ้างผู้ช่วยแพทย์ใหม่"}
{"word": "clinic", "english": "She visited the clinic for allergy testing.", "thai": "เธอไปที่คลินิกเพื่อตรวจอาการแพ้"}
{"word": "clinic", "english": "The university’s clinic is open to students.", "thai": "คลินิกของมหาวิทยาลัยเปิดให้บริการแก่นักศึกษา"}
{"word": "clinic", "english": "The clinic has a waiting list for appointments.", "thai": "คลินิกมีรายชื่อรอนัดหมาย"}
{"word": "clinic", "english": "I got my flu shot at the campus clinic.", "thai": "ฉันฉีดวัคซีนไข้หวัดใหญ่ที่คลินิกในมหาวิทยาลัย"}
{"word": "clinic", "english": "The clinic specializes in women’s health.", "thai": "คลินิกเชี่ยวชาญด้านสุขภาพสตรี"}
{"word": "clinic", "english": "He’s volunteering at the free clinic downtown.", "thai": "เขากำลังเป็นอาสาสมัครที่คลินิกฟรีในตัวเมือง"}
{"word": "clinic", "english": "The clinic is running a health awareness campaign.", "thai": "คลินิกกำลังดำเนินแคมเปญรณรงค์ด้านสุขภาพ"}
{"word": "clinic", "english": "I need to book an appointment at the eye clinic.", "thai": "ฉันต้องจองนัดที่คลินิกตา"}
{"word": "clinic", "english": "The veterinary clinic is next to the pet store.", "thai": "คลินิกสัตวแพทย์อยู่ติดกับร้านขายสัตว์เลี้ยง"}
{"word": "clinic", "english": "The clinic provides counseling services.", "thai": "คลินิกให้บริการปรึกษาด้านจิตใจ"}
{"word": "clinic", "english": "She’s training at the medical clinic this summer.", "thai": "เธอกำลังฝึกอบรมที่คลินิกการแพทย์ในฤดูร้อนนี้"}
{"word": "clinic", "english": "The clinic is offering COVID testing today.", "thai": "คลินิกให้บริการตรวจโควิดวันนี้"}
{"word": "clinic", "english": "I visited the clinic for a sore throat.", "thai": "ฉันไปที่คลินิกเพราะเจ็บคอ"}
{"word": "clinic", "english": "The legal clinic helped with my paperwork.", "thai": "คลินิกกฎหมายช่วยฉันจัดการเอกสาร"}
{"word": "clinic", "english": "The clinic has extended hours on weekdays.", "thai": "คลินิกมีเวลาทำการเพิ่มเติมในวันธรรมดา"}
{"word": "clinic", "english": "He got a checkup at the walk-in clinic.", "thai": "เขาไปตรวจร่างกายที่คลินิกแบบไม่ต้องนัด"}
{"word": "clinic", "english": "The clinic is part of a research study.", "thai": "คลินิกเป็นส่วนหนึ่งของการศึกษาวิจัย"}
{"word": "clinic", "english": "I need to visit the clinic for a blood test.", "thai": "ฉันต้องไปที่คลินิกเพื่อตรวจเลือด"}
{"word": "clinic", "english": "The dental clinic offers teeth whitening.", "thai": "คลินิกทันตกรรมให้บริการฟอกฟันขาว"}
{"word": "clinic", "english": "The clinic is hosting a health fair next month.", "thai": "คลินิกกำลังจัดงานสุขภาพในเดือนหน้า"}
{"word": "clinic", "english": "She got her prescription refilled at the clinic.", "thai": "เธอไปเติมยาตามใบสั่งที่คลินิก"}
{"word": "clinic", "english": "The sports clinic helped with my knee injury.", "thai": "คลินิกกีฬาช่วยรักษาอาการบาดเจ็บที่เข่าของฉัน"}
{"word": "clinic", "english": "The clinic has a new online booking system.", "thai": "คลินิกมีระบบจองออนไลน์ใหม่"}
{"word": "clinic", "english": "I went to the clinic for a vaccination.", "thai": "ฉันไปที่คลินิกเพื่อฉีดวัคซีน"}
{"word": "clinic", "english": "The pediatric clinic is kid-friendly.", "thai": "คลินิกเด็กเป็นมิตรกับเด็ก"}
{"word": "clinic", "english": "The clinic offers free consultations this week.", "thai": "คลินิกให้คำปรึกษาฟรีในสัปดาห์นี้"}
{"word": "clinic", "english": "He’s shadowing a doctor at the clinic.", "thai": "เขากำลังติดตามแพทย์ที่คลินิก"}
{"word": "clinic", "english": "The clinic provides low-cost medical care.", "thai": "คลินิกให้บริการการรักษาพยาบาลราคาประหยัด"}
{"word": "clinic", "english": "I need to call the clinic about my results.", "thai": "ฉันต้องโทรไปที่คลินิกเกี่ยวกับผลตรวจของฉัน"}
{"word": "clinic", "english": "The eye clinic is across from the hospital.", "thai": "คลินิกตาอยู่ตรงข้ามโรงพยาบาล"}
{"word": "clinic", "english": "The clinic is running a diabetes workshop.", "thai": "คลินิกกำลังจัดเวิร์กช็อปเกี่ยวกับโรคเบาหวาน"}
{"word": "clinic", "english": "She visited the clinic for a skin check.", "thai": "เธอไปที่คลินิกเพื่อตรวจผิวหนัง"}
{"word": "clinic", "english": "The veterinary clinic vaccinated my cat.", "thai": "คลินิกสัตวแพทย์ฉีดวัคซีนให้แมวของฉัน"}
{"word": "clinic", "english": "The clinic has a new mental health program.", "thai": "คลินิกมีโปรแกรมสุขภาพจิตใหม่"}
{"word": "clinic", "english": "I got a referral to the cardiology clinic.", "thai": "ฉันได้รับการส่งต่อไปยังคลินิกหัวใจ"}
{"word": "clinic", "english": "The clinic is offering telehealth appointments.", "thai": "คลินิกให้บริการนัดหมายผ่านทางไกล"}
{"word": "clinic", "english": "He works at the urgent care clinic.", "thai": "เขาทำงานที่คลินิกฉุกเฉิน"}
{"word": "clinic", "english": "The clinic provides free prenatal care.", "thai": "คลินิกให้บริการดูแลก่อนคลอดฟรี"}
{"word": "clinic", "english": "I need to visit the clinic for a follow-up.", "thai": "ฉันต้องไปที่คลินิกเพื่อติดตามผล"}
{"word": "clinic", "english": "The dental clinic fixed my chipped tooth.", "thai": "คลินิกทันตกรรมซ่อมฟันที่บิ่นของฉัน"}
{"word": "clinic", "english": "The clinic is crowded during flu season.", "thai": "คลินิกแออัดในช่วงฤดูไข้หวัดใหญ่"}
{"word": "clinic", "english": "She’s studying at the university’s health clinic.", "thai": "เธอกำลังศึกษาที่คลินิกสุขภาพของมหาวิทยาลัย"}
{"word": "clinic", "english": "The clinic offers physical therapy sessions.", "thai": "คลินิกให้บริการกายภาพบำบัด"}
{"word": "clinic", "english": "I got my stitches removed at the clinic.", "thai": "ฉันไปถอนไหมเย็บที่คลินิก"}
{"word": "clinic", "english": "The legal clinic helped with my contract.", "thai": "คลินิกกฎหมายช่วยฉันจัดการสัญญา"}
{"word": "clinic", "english": "The clinic has a new ultrasound machine.", "thai": "คลินิกมีเครื่องอัลตราซาวนด์ใหม่"}
{"word": "clinic", "english": "I visited the clinic for a travel vaccine.", "thai": "ฉันไปที่คลินิกเพื่อฉีดวัคซีนสำหรับการเดินทาง"}
{"word": "clinic", "english": "The clinic is hosting a blood drive.", "thai": "คลินิกกำลังจัดงานบริจาคเลือด"}
{"word": "clinic", "english": "The pediatric clinic has a play area.", "thai": "คลินิกเด็กมีพื้นที่เล่น"}
{"word": "clinic", "english": "I need to check in at the clinic early.", "thai": "ฉันต้องลงทะเบียนที่คลินิกแต่เช้า"}
{"word": "clinic", "english": "The clinic provides free HIV testing.", "thai": "คลินิกให้บริการตรวจ HIV ฟรี"}
{"word": "clinic", "english": "She’s a receptionist at the eye clinic.", "thai": "เธอเป็นพนักงานต้อนรับที่คลินิกตา"}
{"word": "clinic", "english": "The clinic is part of a medical study.", "thai": "คลินิกเป็นส่วนหนึ่งของการศึกษาทางการแพทย์"}
{"word": "clinic", "english": "I went to the clinic for a sprained ankle.", "thai": "ฉันไปที่คลินิกเพราะข้อเท้าแพลง"}
{"word": "clinic", "english": "The veterinary clinic is open late.", "thai": "คลินิกสัตวแพทย์เปิดถึงดึก"}
{"word": "clinic", "english": "The clinic offers nutrition counseling.", "thai": "คลินิกให้บริการปรึกษาด้านโภชนาการ"}
{"word": "clinic", "english": "I need to visit the clinic for a TB test.", "thai": "ฉันต้องไปที่คลินิกเพื่อตรวจวัณโรค"}
{"word": "clinic", "english": "The sports clinic helped with my recovery.", "thai": "คลินิกกีฬาช่วยฉันฟื้นฟูร่างกาย"}
{"word": "clinic", "english": "The clinic has a new patient portal.", "thai": "คลินิกมีพอร์ทัลผู้ป่วยใหม่"}
{"word": "clinic", "english": "I got my allergy shots at the clinic.", "thai": "ฉันไปฉีดยาแก้แพ้ที่คลินิก"}
{"word": "clinic", "english": "The dental clinic is booking appointments.", "thai": "คลินิกทันตกรรมกำลังจองนัดหมาย"}
{"word": "clinic", "english": "The clinic provides emergency care services.", "thai": "คลินิกให้บริการดูแลฉุกเฉิน"}
{"word": "clinic", "english": "I visited the clinic for a health screening.", "thai": "ฉันไปที่คลินิกเพื่อตรวจสุขภาพ"}
{"word": "clinic", "english": "The legal clinic offers free advice.", "thai": "คลินิกกฎหมายให้คำปรึกษาฟรี"}
{"word": "clinic", "english": "The clinic is training new interns.", "thai": "คลินิกกำลังฝึกอบรมนักศึกษาฝึกงานใหม่"}
{"word": "clinic", "english": "I need to go to the clinic for a checkup.", "thai": "ฉันต้องไปที่คลินิกเพื่อตรวจสุขภาพ"}
{"word": "clinic", "english": "The veterinary clinic treated my puppy.", "thai": "คลินิกสัตวแพทย์รักษาลูกสุนัขของฉัน"}
{"word": "clinic", "english": "The clinic has a new mental health specialist.", "thai": "คลินิกมีผู้เชี่ยวชาญด้านสุขภาพจิตคนใหม่"}
{"word": "clinic", "english": "I got a referral to the orthopedic clinic.", "thai": "ฉันได้รับการส่งต่อไปยังคลินิกกระดูก"}
{"word": "clinic", "english": "The clinic is open for walk-in patients.", "thai": "คลินิกเปิดให้บริการสำหรับผู้ป่วยที่มาโดยไม่นัด"}
{"word": "clinic", "english": "The university clinic offers free flu shots.", "thai": "คลินิกของมหาวิทยาลัยให้บริการฉีดวัคซีนไข้หวัดใหญ่ฟรี"}
{"word": "clinic", "english": "The clinic helped me with my back pain.", "thai": "คลินิกช่วยฉันจัดการกับอาการปวดหลัง"}
{"word": "club", "english": "I joined the chess club at school last week.", "thai": "ฉันเข้าร่วมชมรมหมากรุกที่โรงเรียนเมื่อสัปดาห์ที่แล้ว"}
{"word": "club", "english": "The book club meets every Tuesday evening.", "thai": "ชมรมหนังสือพบกันทุกเย็นวันอังคาร"}
{"word": "club", "english": "She’s the president of the debate club.", "thai": "เธอเป็นประธานชมรมโต้วาที"}
{"word": "club", "english": "We went to a jazz club downtown last night.", "thai": "เราไปที่คลับแจ๊สในตัวเมืองเมื่อคืนนี้"}
{"word": "club", "english": "The golf club is hosting a tournament this weekend.", "thai": "สโมสรกอล์ฟกำลังจัดทัวร์นาเมนต์ในสุดสัปดาห์นี้"}
{"word": "club", "english": "I’m thinking about joining the photography club.", "thai": "ฉันกำลังคิดจะเข้าร่วมชมรมถ่ายภาพ"}
{"word": "club", "english": "The club organized a charity fundraiser.", "thai": "ชมรมจัดงานระดมทุนเพื่อการกุศล"}
{"word": "club", "english": "He’s a member of the local fishing club.", "thai": "เขาเป็นสมาชิกของชมรมตกปลาท้องถิ่น"}
{"word": "club", "english": "The dance club is practicing for the show.", "thai": "ชมรมเต้นรำกำลังฝึกซ้อมสำหรับการแสดง"}
{"word": "club", "english": "We had fun at the comedy club on Friday.", "thai": "เราสนุกที่คลับตลกในวันศุกร์"}
{"word": "club", "english": "The science club is building a robot.", "thai": "ชมรมวิทยาศาสตร์กำลังสร้างหุ่นยนต์"}
{"word": "club", "english": "The club’s annual meeting is next month.", "thai": "การประชุมประจำปีของชมรมจะมีขึ้นในเดือนหน้า"}
{"word": "club", "english": "She hit the ball with a golf club.", "thai": "เธอตีลูกด้วยไม้กอล์ฟ"}
{"word": "club", "english": "The hiking club plans trips every month.", "thai": "ชมรมเดินป่าวางแผนทริปทุกเดือน"}
{"word": "club", "english": "I saw a great band at the music club.", "thai": "ฉันเห็นวงดนตรีเจ๋งๆ ที่คลับดนตรี"}
{"word": "club", "english": "The art club is hosting an exhibition.", "thai": "ชมรมศิลปะกำลังจัดนิทรรศการ"}
{"word": "club", "english": "He’s trying out for the soccer club.", "thai": "เขากำลังคัดตัวเข้าชมรมฟุตบอล"}
{"word": "club", "english": "The club has a new advisor this year.", "thai": "ชมรมมีที่ปรึกษาคนใหม่ในปีนี้"}
{"word": "club", "english": "We went dancing at a nightclub.", "thai": "เราไปเต้นรำที่ไนต์คลับ"}
{"word": "club", "english": "The gardening club planted new flowers.", "thai": "ชมรมทำสวนปลูกดอกไม้ใหม่"}
{"word": "club", "english": "The club is looking for new members.", "thai": "ชมรมกำลังมองหาสมาชิกใหม่"}
{"word": "club", "english": "I’m in the coding club at college.", "thai": "ฉันอยู่ในชมรมเขียนโค้ดที่วิทยาลัย"}
{"word": "club", "english": "The tennis club meets on weekends.", "thai": "สโมสรเทนนิสพบกันในวันหยุดสุดสัปดาห์"}
{"word": "club", "english": "The club threw a party for its anniversary.", "thai": "ชมรมจัดงานเลี้ยงฉลองครบรอบ"}
{"word": "club", "english": "She’s designing posters for the drama club.", "thai": "เธอกำลังออกแบบโปสเตอร์ให้ชมรมละคร"}
{"word": "club", "english": "The running club trains every morning.", "thai": "ชมรมวิ่งฝึกซ้อมทุกเช้า"}
{"word": "club", "english": "We visited a country club for the event.", "thai": "เราไปที่คันทรีคลับเพื่อร่วมงาน"}
{"word": "club", "english": "The club voted on new bylaws.", "thai": "ชมรมลงคะแนนเกี่ยวกับข้อบังคับใหม่"}
{"word": "club", "english": "He joined the astronomy club to stargaze.", "thai": "เขาเข้าร่วมชมรมดาราศาสตร์เพื่อดูดาว"}
{"word": "club", "english": "The dance club performed at the festival.", "thai": "ชมรมเต้นรำแสดงในงานเทศกาล"}
{"word": "club", "english": "The club is planning a community cleanup.", "thai": "ชมรมกำลังวางแผนทำความสะอาดชุมชน"}
{"word": "club", "english": "I’m the treasurer of the film club.", "thai": "ฉันเป็นเหรัญญิกของชมรมภาพยนตร์"}
{"word": "club", "english": "The yoga club meets in the park.", "thai": "ชมรมโยคะพบกันที่สวนสาธารณะ"}
{"word": "club", "english": "The club hosted a guest speaker today.", "thai": "ชมรมเชิญวิทยากรรับเชิญมาวันนี้"}
{"word": "club", "english": "She’s in the environmental club at school.", "thai": "เธออยู่ในชมรมสิ่งแวดล้อมที่โรงเรียน"}
{"word": "club", "english": "The chess club won the regional tournament.", "thai": "ชมรมหมากรุกชนะการแข่งขันระดับภูมิภาค"}
{"word": "club", "english": "We went to a karaoke club last weekend.", "thai": "เราไปที่คลับคาราโอเกะเมื่อสุดสัปดาห์ที่แล้ว"}
{"word": "club", "english": "The club is organizing a bake sale.", "thai": "ชมรมกำลังจัดงานขายขนมอบ"}
{"word": "club", "english": "He plays for the rugby club at college.", "thai": "เขาเล่นให้กับชมรมรักบี้ที่วิทยาลัย"}
{"word": "club", "english": "The book club discussed a new novel.", "thai": "ชมรมหนังสือหารือเกี่ยวกับนิยายเล่มใหม่"}
{"word": "club", "english": "The club needs volunteers for the event.", "thai": "ชมรมต้องการอาสาสมัครสำหรับงานนี้"}
{"word": "club", "english": "I signed up for the robotics club.", "thai": "ฉันสมัครเข้าร่วมชมรมหุ่นยนต์"}
{"word": "club", "english": "The swim club practices every afternoon.", "thai": "ชมรมว่ายน้ำฝึกซ้อมทุกบ่าย"}
{"word": "club", "english": "The club is hosting a movie night.", "thai": "ชมรมกำลังจัดคืนดูหนัง"}
{"word": "club", "english": "She’s leading the knitting club this semester.", "thai": "เธอกำลังนำชมรมถักนิตติ้งในภาคเรียนนี้"}
{"word": "club", "english": "The jazz club has live music every Friday.", "thai": "คลับแจ๊สมีดนตรีสดทุกวันศุกร์"}
{"word": "club", "english": "The club raised money for a local charity.", "thai": "ชมรมระดมทุนให้กับองค์กรการกุศลท้องถิ่น"}
{"word": "club", "english": "He’s coaching the fencing club.", "thai": "เขากำลังฝึกสอนชมรมฟันดาบ"}
{"word": "club", "english": "The photography club went on a field trip.", "thai": "ชมรมถ่ายภาพไปทัศนศึกษา"}
{"word": "club", "english": "The club is open to all students.", "thai": "ชมรมเปิดให้ทุกนักเรียนเข้าร่วม"}
{"word": "club", "english": "We had a blast at the dance club.", "thai": "เราสนุกสุดเหวี่ยงที่คลับเต้นรำ"}
{"word": "club", "english": "The hiking club explored a new trail.", "thai": "ชมรมเดินป่าสำรวจเส้นทางใหม่"}
{"word": "club", "english": "The club elected new officers yesterday.", "thai": "ชมรมเลือกตั้งเจ้าหน้าที่ใหม่เมื่อวานนี้"}
{"word": "club", "english": "She’s organizing the anime club’s convention.", "thai": "เธอกำลังจัดงานประชุมของชมรมอนิเมะ"}
{"word": "club", "english": "The golf club has a new driving range.", "thai": "สโมสรกอล์ฟมีสนามซ้อมใหม่"}
{"word": "club", "english": "The club is planning a trip to the museum.", "thai": "ชมรมกำลังวางแผนทริปไปพิพิธภัณฑ์"}
{"word": "club", "english": "I’m attending the cooking club’s workshop.", "thai": "ฉันกำลังเข้าร่วมเวิร์กช็อปของชมรมทำอาหาร"}
{"word": "club", "english": "The debate club won the state championship.", "thai": "ชมรมโต้วาทีชนะการแข่งขันระดับรัฐ"}
{"word": "club", "english": "The club meets in the library every week.", "thai": "ชมรมพบกันที่ห้องสมุดทุกสัปดาห์"}
{"word": "club", "english": "He’s designing a logo for the art club.", "thai": "เขากำลังออกแบบโลโก้ให้ชมรมศิลปะ"}
{"word": "club", "english": "The running club is training for a marathon.", "thai": "ชมรมวิ่งกำลังฝึกซ้อมสำหรับมาราธอน"}
{"word": "club", "english": "The club hosted a talent show last night.", "thai": "ชมรมจัดงานแสดงความสามารถเมื่อคืนนี้"}
{"word": "club", "english": "She’s in the math club at her school.", "thai": "เธออยู่ในชมรมคณิตศาสตร์ที่โรงเรียน"}
{"word": "club", "english": "The music club performed at the assembly.", "thai": "ชมรมดนตรีแสดงในงานชุมนุม"}
{"word": "club", "english": "The club is fundraising for new equipment.", "thai": "ชมรมกำลังระดมทุนเพื่อซื้ออุปกรณ์ใหม่"}
{"word": "club", "english": "I joined the cycling club to stay active.", "thai": "ฉันเข้าร่วมชมรมปั่นจักรยานเพื่อรักษาความแอคทีฟ"}
{"word": "club", "english": "The drama club is rehearsing a new play.", "thai": "ชมรมละครกำลังซ้อมละครเรื่องใหม่"}
{"word": "club", "english": "The club has a booth at the fair.", "thai": "ชมรมมีบูธที่งานแฟร์"}
{"word": "club", "english": "He’s the captain of the volleyball club.", "thai": "เขาเป็นกัปตันของชมรมวอลเลย์บอล"}
{"word": "club", "english": "The book club picked a mystery novel.", "thai": "ชมรมหนังสือเลือกนิยายลึกลับ"}
{"word": "club", "english": "The club is hosting a guest lecturer.", "thai": "ชมรมกำลังเชิญอาจารย์รับเชิญ"}
{"word": "club", "english": "I went to a salsa club with friends.", "thai": "ฉันไปที่คลับซัลซ่ากับเพื่อนๆ"}
{"word": "club", "english": "The science club did a cool experiment.", "thai": "ชมรมวิทยาศาสตร์ทำการทดลองเจ๋งๆ"}
{"word": "club", "english": "The club is planning a beach cleanup.", "thai": "ชมรมกำลังวางแผนทำความสะอาดชายหาด"}
{"word": "club", "english": "She’s teaching a workshop for the craft club.", "thai": "เธอกำลังสอนเวิร์กช็อปให้ชมรมงานฝีมือ"}
{"word": "club", "english": "The tennis club needs new nets.", "thai": "สโมสรเทนนิสต้องการตาข่ายใหม่"}
{"word": "club", "english": "The club is open to community members.", "thai": "ชมรมเปิดให้สมาชิกชุมชนเข้าร่วม"}
{"word": "club", "english": "I’m helping the film club edit a video.", "thai": "ฉันกำลังช่วยชมรมภาพยนตร์ตัดต่อวิดีโอ"}
{"word": "club", "english": "The yoga club is hosting a free class.", "thai": "ชมรมโยคะกำลังจัดชั้นเรียนฟรี"}
{"word": "club", "english": "The club won an award for its projects.", "thai": "ชมรมได้รับรางวัลสำหรับโครงการของพวกเขา"}
{"word": "club", "english": "He’s in the chess club and loves it.", "thai": "เขาอยู่ในชมรมหมากรุกและชอบมาก"}
{"word": "club", "english": "The dance club is learning a new routine.", "thai": "ชมรมเต้นรำกำลังเรียนรู้ท่าเต้นใหม่"}
{"word": "club", "english": "The club is recruiting at the activities fair.", "thai": "ชมรมกำลังรับสมัครที่งานกิจกรรม"}
{"word": "club", "english": "I went to a hip-hop club last night.", "thai": "ฉันไปที่คลับฮิปฮอปเมื่อคืนนี้"}
{"word": "club", "english": "The gardening club grew prize-winning roses.", "thai": "ชมรมทำสวนปลูกกุหลาบที่ชนะรางวัล"}
{"word": "club", "english": "The club is planning a volunteer day.", "thai": "ชมรมกำลังวางแผนวันอาสาสมัคร"}
{"word": "club", "english": "She’s the secretary of the history club.", "thai": "เธอเป็นเลขานุการของชมรมประวัติศาสตร์"}
{"word": "club", "english": "The swim club qualified for nationals.", "thai": "ชมรมว่ายน้ำผ่านเข้ารอบชิงแชมป์แห่งชาติ"}
{"word": "club", "english": "The club is hosting a trivia night.", "thai": "ชมรมกำลังจัดคืนตอบคำถาม"}
{"word": "club", "english": "I’m in the astronomy club’s stargazing event.", "thai": "ฉันเข้าร่วมงานดูดาวของชมรมดาราศาสตร์"}
{"word": "club", "english": "The art club painted a mural on campus.", "thai": "ชมรมศิลปะวาดภาพจิตรกรรมฝาผนังในวิทยาเขต"}
{"word": "club", "english": "The club needs a new meeting space.", "thai": "ชมรมต้องการสถานที่ประชุมใหม่"}
{"word": "club", "english": "He joined the sailing club at the lake.", "thai": "เขาเข้าร่วมชมรมแล่นเรือที่ทะเลสาบ"}
{"word": "club", "english": "The robotics club built a competition bot.", "thai": "ชมรมหุ่นยนต์สร้างหุ่นยนต์สำหรับแข่งขัน"}
{"word": "club", "english": "The club is planning a cultural festival.", "thai": "ชมรมกำลังวางแผนงานเทศกาลวัฒนธรรม"}
{"word": "club", "english": "I attended the coding club’s hackathon.", "thai": "ฉันเข้าร่วมแฮกกาธอนของชมรมเขียนโค้ด"}
{"word": "club", "english": "The music club is recording a new song.", "thai": "ชมรมดนตรีกำลังบันทึกเพลงใหม่"}
{"word": "club", "english": "The club’s next meeting is on Thursday.", "thai": "การประชุมครั้งต่อไปของชมรมคือวันพฤหัสบดี"}
{"word": "club", "english": "She’s choreographing for the dance club.", "thai": "เธอกำลังออกแบบท่าเต้นให้ชมรมเต้นรำ"}
{"word": "club", "english": "The environmental club planted trees.", "thai": "ชมรมสิ่งแวดล้อมปลูกต้นไม้"}
{"word": "committee", "english": "The committee approved the new policy yesterday.", "thai": "คณะกรรมการอนุมัตินโยบายใหม่เมื่อวานนี้"}
{"word": "committee", "english": "She was elected to the planning committee.", "thai": "เธอได้รับเลือกเข้าสู่คณะกรรมการวางแผน"}
{"word": "committee", "english": "The committee meets every Monday afternoon.", "thai": "คณะกรรมการประชุมทุกบ่ายวันจันทร์"}
{"word": "committee", "english": "I’m on the committee for the school fundraiser.", "thai": "ฉันอยู่ในคณะกรรมการระดมทุนของโรงเรียน"}
{"word": "committee", "english": "The committee is reviewing the budget proposal.", "thai": "คณะกรรมการกำลังพิจารณาข้อเสนองบประมาณ"}
{"word": "committee", "english": "He chairs the ethics committee at work.", "thai": "เขาเป็นประธานคณะกรรมการจริยธรรมที่ทำงาน"}
{"word": "committee", "english": "The committee voted to expand the program.", "thai": "คณะกรรมการลงคะแนนให้ขยายโปรแกรม"}
{"word": "committee", "english": "She’s organizing the committee’s next meeting.", "thai": "เธอกำลังจัดระเบียบการประชุมครั้งต่อไปของคณะกรรมการ"}
{"word": "committee", "english": "The hiring committee interviewed ten candidates.", "thai": "คณะกรรมการสรรหาสัมภาษณ์ผู้สมัครสิบคน"}
{"word": "committee", "english": "The committee rejected the initial plan.", "thai": "คณะกรรมการปฏิเสธแผนแรกเริ่ม"}
{"word": "committee", "english": "I need to submit my report to the committee.", "thai": "ฉันต้องยื่นรายงานให้คณะกรรมการ"}
{"word": "committee", "english": "The committee is discussing new regulations.", "thai": "คณะกรรมการกำลังหารือเกี่ยวกับระเบียบใหม่"}
{"word": "committee", "english": "He’s a member of the safety committee.", "thai": "เขาเป็นสมาชิกของคณะกรรมการความปลอดภัย"}
{"word": "committee", "english": "The committee will announce its decision tomorrow.", "thai": "คณะกรรมการจะประกาศการตัดสินใจในวันพรุ่งนี้"}
{"word": "committee", "english": "She volunteered for the events committee.", "thai": "เธอสมัครเป็นอาสาสมัครให้คณะกรรมการจัดงาน"}
{"word": "committee", "english": "The committee is split on the new proposal.", "thai": "คณะกรรมการมีความเห็นไม่ลงรอยกันเกี่ยวกับข้อเสนอใหม่"}
{"word": "committee", "english": "I was appointed to the advisory committee.", "thai": "ฉันได้รับแต่งตั้งให้อยู่ในคณะกรรมการที่ปรึกษา"}
{"word": "committee", "english": "The committee is drafting a new policy.", "thai": "คณะกรรมการกำลังร่างนโยบายใหม่"}
{"word": "committee", "english": "He presented his idea to the committee.", "thai": "เขาเสนอแนวคิดของเขาให้คณะกรรมการ"}
{"word": "committee", "english": "The committee oversees the annual budget.", "thai": "คณะกรรมการดูแลงบประมาณประจำปี"}
{"word": "committee", "english": "The disciplinary committee reviewed the case.", "thai": "คณะกรรมการวินัยพิจารณาคดี"}
{"word": "committee", "english": "She’s the secretary of the finance committee.", "thai": "เธอเป็นเลขานุการของคณะกรรมการการเงิน"}
{"word": "committee", "english": "The committee is planning a community event.", "thai": "คณะกรรมการกำลังวางแผนงานชุมชน"}
{"word": "committee", "english": "I joined the committee to help with outreach.", "thai": "ฉันเข้าร่วมคณะกรรมการเพื่อช่วยด้านการประชาสัมพันธ์"}
{"word": "committee", "english": "The committee needs more volunteers.", "thai": "คณะกรรมการต้องการอาสาสมัครเพิ่ม"}
{"word": "committee", "english": "The selection committee chose the winner.", "thai": "คณะกรรมการคัดเลือกผู้ชนะ"}
{"word": "committee", "english": "The committee meeting was postponed to Friday.", "thai": "การประชุมคณะกรรมการถูกเลื่อนไปเป็นวันศุกร์"}
{"word": "committee", "english": "He’s leading the research committee this year.", "thai": "เขาเป็นผู้นำคณะกรรมการวิจัยในปีนี้"}
{"word": "committee", "english": "The committee approved the new curriculum.", "thai": "คณะกรรมการอนุมัติหลักสูตรใหม่"}
{"word": "committee", "english": "She’s on the committee for campus safety.", "thai": "เธออยู่ในคณะกรรมการด้านความปลอดภัยในวิทยาเขต"}
{"word": "committee", "english": "The committee discussed funding options.", "thai": "คณะกรรมการหารือเกี่ยวกับตัวเลือกการระดมทุน"}
{"word": "committee", "english": "I need to prepare for the committee presentation.", "thai": "ฉันต้องเตรียมตัวสำหรับการนำเสนอต่อคณะกรรมการ"}
{"word": "committee", "english": "The committee is revising the guidelines.", "thai": "คณะกรรมการกำลังปรับปรุงแนวทาง"}
{"word": "committee", "english": "He was invited to join the steering committee.", "thai": "เขาได้รับเชิญให้เข้าร่วมคณะกรรมการบริหาร"}
{"word": "committee", "english": "The committee will meet again next week.", "thai": "คณะกรรมการจะประชุมอีกครั้งในสัปดาห์หน้า"}
{"word": "committee", "english": "She’s chairing the diversity committee.", "thai": "เธอเป็นประธานคณะกรรมการความหลากหลาย"}
{"word": "committee", "english": "The committee is organizing a charity drive.", "thai": "คณะกรรมการกำลังจัดงานระดมทุนการกุศล"}
{"word": "committee", "english": "The audit committee reviewed the finances.", "thai": "คณะกรรมการตรวจสอบบัญชีพิจารณาการเงิน"}
{"word": "committee", "english": "I’m on the committee for the annual conference.", "thai": "ฉันอยู่ในคณะกรรมการสำหรับการประชุมประจำปี"}
{"word": "committee", "english": "The committee rejected the funding request.", "thai": "คณะกรรมการปฏิเสธคำขอระดมทุน"}
{"word": "committee", "english": "He’s a member of the scholarship committee.", "thai": "เขาเป็นสมาชิกของคณะกรรมการทุนการศึกษา"}
{"word": "committee", "english": "The committee is evaluating new projects.", "thai": "คณะกรรมการกำลังประเมินโครงการใหม่"}
{"word": "committee", "english": "She presented her proposal to the committee.", "thai": "เธอนำเสนอข้อเสนอของเธอให้คณะกรรมการ"}
{"word": "committee", "english": "The committee is hosting a public forum.", "thai": "คณะกรรมการกำลังจัดฟอรัมสาธารณะ"}
{"word": "committee", "english": "The tenure committee reviewed his application.", "thai": "คณะกรรมการพิจารณาตำแหน่งถาวรพิจารณาใบสมัครของเขา"}
{"word": "committee", "english": "The committee needs to finalize the agenda.", "thai": "คณะกรรมการต้องสรุปวาระการประชุม"}
{"word": "committee", "english": "I volunteered for the fundraising committee.", "thai": "ฉันสมัครเป็นอาสาสมัครให้คณะกรรมการระดมทุน"}
{"word": "committee", "english": "The committee is revising the bylaws.", "thai": "คณะกรรมการกำลังปรับปรุงข้อบังคับ"}
{"word": "committee", "english": "He’s on the committee for student activities.", "thai": "เขาอยู่ในคณะกรรมการด้านกิจกรรมนักเรียน"}
{"word": "committee", "english": "The committee approved the new building plan.", "thai": "คณะกรรมการอนุมัติแผนการก่อสร้างใหม่"}
{"word": "committee", "english": "She’s the head of the review committee.", "thai": "เธอเป็นหัวหน้าคณะกรรมการตรวจสอบ"}
{"word": "committee", "english": "The committee is planning a town hall meeting.", "thai": "คณะกรรมการกำลังวางแผนการประชุมสาธารณะ"}
{"word": "committee", "english": "I need to email the committee about my idea.", "thai": "ฉันต้องส่งอีเมลถึงคณะกรรมการเกี่ยวกับแนวคิดของฉัน"}
{"word": "committee", "english": "The ethics committee is investigating the issue.", "thai": "คณะกรรมการจริยธรรมกำลังสืบสวนประเด็นนี้"}
{"word": "committee", "english": "The committee will vote on the proposal soon.", "thai": "คณะกรรมการจะลงคะแนนเกี่ยวกับข้อเสนอในไม่ช้า"}
{"word": "committee", "english": "She joined the committee to improve campus life.", "thai": "เธอเข้าร่วมคณะกรรมการเพื่อปรับปรุงชีวิตในวิทยาเขต"}
{"word": "committee", "english": "The committee is responsible for hiring staff.", "thai": "คณะกรรมการรับผิดชอบการจ้างพนักงาน"}
{"word": "committee", "english": "The safety committee issued new guidelines.", "thai": "คณะกรรมการความปลอดภัยออกแนวทางใหม่"}
{"word": "committee", "english": "He’s presenting to the committee next week.", "thai": "เขาจะนำเสนอต่อคณะกรรมการในสัปดาห์หน้า"}
{"word": "committee", "english": "The committee is organizing a volunteer day.", "thai": "คณะกรรมการกำลังจัดวันอาสาสมัคร"}
{"word": "committee", "english": "I was selected for the awards committee.", "thai": "ฉันได้รับเลือกให้อยู่ในคณะกรรมการรางวัล"}
{"word": "committee", "english": "The committee is reviewing grant applications.", "thai": "คณะกรรมการกำลังพิจารณาใบสมัครขอทุน"}
{"word": "committee", "english": "She’s on the committee for the new library.", "thai": "เธออยู่ในคณะกรรมการสำหรับห้องสมุดใหม่"}
{"word": "committee", "english": "The committee meets twice a month.", "thai": "คณะกรรมการประชุมเดือนละสองครั้ง"}
{"word": "committee", "english": "The budget committee cut some expenses.", "thai": "คณะกรรมการงบประมาณตัดค่าใช้จ่ายบางส่วน"}
{"word": "committee", "english": "I need to prepare slides for the committee.", "thai": "ฉันต้องเตรียมสไลด์สำหรับคณะกรรมการ"}
{"word": "committee", "english": "The committee is hosting a workshop.", "thai": "คณะกรรมการกำลังจัดเวิร์กช็อป"}
{"word": "committee", "english": "He’s the chair of the events committee.", "thai": "เขาเป็นประธานคณะกรรมการจัดงาน"}
{"word": "committee", "english": "The committee is drafting a new proposal.", "thai": "คณะกรรมการกำลังร่างข้อเสนอใหม่"}
{"word": "committee", "english": "She’s a member of the diversity committee.", "thai": "เธอเป็นสมาชิกของคณะกรรมการความหลากหลาย"}
{"word": "committee", "english": "The committee will finalize the schedule soon.", "thai": "คณะกรรมการจะสรุปตารางในไม่ช้า"}
{"word": "committee", "english": "I joined the committee to plan the festival.", "thai": "ฉันเข้าร่วมคณะกรรมการเพื่อวางแผนงานเทศกาล"}
{"word": "committee", "english": "The committee approved the new hire.", "thai": "คณะกรรมการอนุมัติการจ้างงานใหม่"}
{"word": "committee", "english": "The research committee funded the project.", "thai": "คณะกรรมการวิจัยให้ทุนสนับสนุนโครงการ"}
{"word": "committee", "english": "She’s organizing the committee’s annual report.", "thai": "เธอกำลังจัดทำรายงานประจำปีของคณะกรรมการ"}
{"word": "committee", "english": "The committee is evaluating the new software.", "thai": "คณะกรรมการกำลังประเมินซอฟต์แวร์ใหม่"}
{"word": "committee", "english": "He’s on the committee for employee benefits.", "thai": "เขาอยู่ในคณะกรรมการด้านสวัสดิการพนักงาน"}
{"word": "committee", "english": "The committee is planning a training session.", "thai": "คณะกรรมการกำลังวางแผนการฝึกอบรม"}
{"word": "committee", "english": "I need to attend the committee meeting tomorrow.", "thai": "ฉันต้องเข้าร่วมการประชุมคณะกรรมการพรุ่งนี้"}
{"word": "committee", "english": "The committee is revising the hiring process.", "thai": "คณะกรรมการกำลังปรับปรุงกระบวนการจ้างงาน"}
{"word": "committee", "english": "She was appointed to the oversight committee.", "thai": "เธอได้รับแต่งตั้งให้อยู่ในคณะกรรมการกำกับดูแล"}
{"word": "committee", "english": "The committee discussed environmental policies.", "thai": "คณะกรรมการหารือเกี่ยวกับนโยบายด้านสิ่งแวดล้อม"}
{"word": "committee", "english": "The committee is recruiting new members.", "thai": "คณะกรรมการกำลังรับสมัครสมาชิกใหม่"}
{"word": "committee", "english": "He’s leading the committee on sustainability.", "thai": "เขาเป็นผู้นำคณะกรรมการด้านความยั่งยืน"}
{"word": "committee", "english": "The committee will present its findings soon.", "thai": "คณะกรรมการจะนำเสนอผลการค้นพบในไม่ช้า"}
{"word": "committee", "english": "I’m volunteering for the awards committee.", "thai": "ฉันสมัครเป็นอาสาสมัครให้คณะกรรมการรางวัล"}
{"word": "committee", "english": "The committee is updating the employee handbook.", "thai": "คณะกรรมการกำลังอัปเดตคู่มือพนักงาน"}
{"word": "committee", "english": "She’s on the committee for community outreach.", "thai": "เธออยู่ในคณะกรรมการด้านการประชาสัมพันธ์ชุมชน"}
{"word": "committee", "english": "The committee approved the renovation plans.", "thai": "คณะกรรมการอนุมัติแผนการปรับปรุง"}
{"word": "committee", "english": "The ethics committee is reviewing complaints.", "thai": "คณะกรรมการจริยธรรมกำลังพิจารณาคำร้องเรียน"}
{"word": "committee", "english": "I need to submit my proposal to the committee.", "thai": "ฉันต้องยื่นข้อเสนอให้คณะกรรมการ"}
{"word": "committee", "english": "The committee is hosting a public hearing.", "thai": "คณะกรรมการกำลังจัดรับฟังความคิดเห็นสาธารณะ"}
{"word": "committee", "english": "He’s a member of the budget committee.", "thai": "เขาเป็นสมาชิกของคณะกรรมการงบประมาณ"}
{"word": "committee", "english": "The committee is planning a diversity workshop.", "thai": "คณะกรรมการกำลังวางแผนเวิร์กช็อปความหลากหลาย"}
{"word": "committee", "english": "She joined the committee to improve safety.", "thai": "เธอเข้าร่วมคณะกรรมการเพื่อปรับปรุงความปลอดภัย"}
{"word": "committee", "english": "The committee will meet to discuss funding.", "thai": "คณะกรรมการจะประชุมเพื่อหารือเกี่ยวกับการระดมทุน"}
{"word": "committee", "english": "I was invited to join the events committee.", "thai": "ฉันได้รับเชิญให้เข้าร่วมคณะกรรมการจัดงาน"}
{"word": "committee", "english": "The committee is responsible for the new policy.", "thai": "คณะกรรมการรับผิดชอบนโยบายใหม่"}
{"word": "committee", "english": "The hiring committee is interviewing tomorrow.", "thai": "คณะกรรมการสรรหาจะสัมภาษณ์ในวันพรุ่งนี้"}
{"word": "committee", "english": "The committee is finalizing the event schedule.", "thai": "คณะกรรมการกำลังสรุปตารางงาน"}
{"word": "committee", "english": "She’s on the committee for academic standards.", "thai": "เธออยู่ในคณะกรรมการด้านมาตรฐานวิชาการ"}
{"word": "conference", "english": "I’m attending a science conference next week.", "thai": "ฉันจะเข้าร่วมการประชุมทางวิทยาศาสตร์ในสัปดาห์หน้า"}
{"word": "conference", "english": "The conference is being held in Chicago.", "thai": "การประชุมจัดขึ้นที่ชิคาโก"}
{"word": "conference", "english": "She’s presenting a paper at the conference.", "thai": "เธอกำลังนำเสนอเอกสารที่การประชุม"}
{"word": "conference", "english": "The conference call is scheduled for 3 p.m.", "thai": "การประชุมทางโทรศัพท์กำหนดไว้เวลา 15.00 น."}
{"word": "conference", "english": "He organized the annual business conference.", "thai": "เขาจัดการประชุมธุรกิจประจำปี"}
{"word": "conference", "english": "The conference has over 500 attendees.", "thai": "การประชุมมีผู้เข้าร่วมมากกว่า 500 คน"}
{"word": "conference", "english": "I need to register for the tech conference.", "thai": "ฉันต้องลงทะเบียนสำหรับการประชุมด้านเทคโนโลยี"}
{"word": "conference", "english": "The conference keynote speaker was inspiring.", "thai": "วิทยากรหลักของการประชุมสร้างแรงบันดาลใจ"}
{"word": "conference", "english": "We’re hosting a virtual conference this year.", "thai": "เรากำลังจัดประชุมเสมือนจริงในปีนี้"}
{"word": "conference", "english": "The conference agenda is online now.", "thai": "วาระการประชุมออนไลน์แล้วตอนนี้"}
{"word": "conference", "english": "She’s moderating a panel at the conference.", "thai": "เธอกำลังเป็นผู้ดำเนินรายการที่การประชุม"}
{"word": "conference", "english": "The conference focuses on climate change.", "thai": "การประชุมมุ่งเน้นเรื่องการเปลี่ยนแปลงสภาพภูมิอากาศ"}
{"word": "conference", "english": "I met a lot of people at the conference.", "thai": "ฉันพบผู้คนมากมายที่การประชุม"}
{"word": "conference", "english": "The conference is free for students.", "thai": "การประชุมฟรีสำหรับนักศึกษา"}
{"word": "conference", "english": "He’s speaking at the education conference.", "thai": "เขากำลังพูดที่การประชุมด้านการศึกษา"}
{"word": "conference", "english": "The conference runs from Monday to Friday.", "thai": "การประชุมจัดขึ้นตั้งแต่วันจันทร์ถึงวันศุกร์"}
{"word": "conference", "english": "I’m preparing slides for the conference.", "thai": "ฉันกำลังเตรียมสไลด์สำหรับการประชุม"}
{"word": "conference", "english": "The conference venue is near the airport.", "thai": "สถานที่จัดการประชุมอยู่ใกล้สนามบิน"}
{"word": "conference", "english": "She attended a medical conference last month.", "thai": "เธอเข้าร่วมการประชุมทางการแพทย์เมื่อเดือนที่แล้ว"}
{"word": "conference", "english": "The conference has a networking session.", "thai": "การประชุมมีช่วงสร้างเครือข่าย"}
{"word": "conference", "english": "I need a hotel for the conference weekend.", "thai": "ฉันต้องการโรงแรมสำหรับช่วงสุดสัปดาห์ของการประชุม"}
{"word": "conference", "english": "The conference is about artificial intelligence.", "thai": "การประชุมเกี่ยวกับปัญญาประดิษฐ์"}
{"word": "conference", "english": "He’s chairing the conference organizing committee.", "thai": "เขาเป็นประธานคณะกรรมการจัดงานประชุม"}
{"word": "conference", "english": "The conference offers workshops for beginners.", "thai": "การประชุมมีเวิร์กช็อปสำหรับผู้เริ่มต้น"}
{"word": "conference", "english": "I got a free pass to the conference.", "thai": "ฉันได้บัตรผ่านฟรีสำหรับการประชุม"}
{"word": "conference", "english": "The conference is livestreamed online.", "thai": "การประชุมถ่ายทอดสดทางออนไลน์"}
{"word": "conference", "english": "She’s presenting research at the conference.", "thai": "เธอกำลังนำเสนองานวิจัยที่การประชุม"}
{"word": "conference", "english": "The conference schedule is packed with talks.", "thai": "ตารางการประชุมเต็มไปด้วยการบรรยาย"}
{"word": "conference", "english": "I’m volunteering at the conference next week.", "thai": "ฉันจะเป็นอาสาสมัครที่การประชุมในสัปดาห์หน้า"}
{"word": "conference", "english": "The conference is hosted by the university.", "thai": "การประชุมจัดโดยมหาวิทยาลัย"}
{"word": "conference", "english": "He’s attending a leadership conference.", "thai": "เขากำลังเข้าร่วมการประชุมด้านภาวะผู้นำ"}
{"word": "conference", "english": "The conference has a mobile app for updates.", "thai": "การประชุมมีแอปมือถือสำหรับอัปเดต"}
{"word": "conference", "english": "I need to book a flight for the conference.", "thai": "ฉันต้องจองเที่ยวบินสำหรับการประชุม"}
{"word": "conference", "english": "The conference includes a poster session.", "thai": "การประชุมมีช่วงโปสเตอร์"}
{"word": "conference", "english": "She’s a speaker at the marketing conference.", "thai": "เธอเป็นวิทยากรที่การประชุมด้านการตลาด"}
{"word": "conference", "english": "The conference is sold out this year.", "thai": "การประชุมเต็มในปีนี้"}
{"word": "conference", "english": "I’m presenting a project at the conference.", "thai": "ฉันกำลังนำเสนอโครงการที่การประชุม"}
{"word": "conference", "english": "The conference covers new teaching methods.", "thai": "การประชุมครอบคลุมวิธีการสอนใหม่"}
{"word": "conference", "english": "He’s on the conference planning team.", "thai": "เขาอยู่ในทีมวางแผนการประชุม"}
{"word": "conference", "english": "The conference is for industry professionals.", "thai": "การประชุมสำหรับผู้เชี่ยวชาญในอุตสาหกรรม"}
{"word": "conference", "english": "I attended a conference on renewable energy.", "thai": "ฉันเข้าร่วมการประชุมเกี่ยวกับพลังงานหมุนเวียน"}
{"word": "conference", "english": "The conference has breakout sessions daily.", "thai": "การประชุมมีช่วงกลุ่มย่อยทุกวัน"}
{"word": "conference", "english": "She’s organizing the conference logistics.", "thai": "เธอกำลังจัดการด้านโลจิสติกส์ของการประชุม"}
{"word": "conference", "english": "The conference is in a convention center.", "thai": "การประชุมจัดในศูนย์การประชุม"}
{"word": "conference", "english": "I need to submit a paper for the conference.", "thai": "ฉันต้องยื่นเอกสารสำหรับการประชุม"}
{"word": "conference", "english": "The conference theme is innovation.", "thai": "ธีมของการประชุมคือการนวัตกรรม"}
{"word": "conference", "english": "He’s attending a conference on cybersecurity.", "thai": "เขากำลังเข้าร่วมการประชุมด้านความปลอดภัยทางไซเบอร์"}
{"word": "conference", "english": "The conference offers continuing education credits.", "thai": "การประชุมให้หน่วยกิตการศึกษาต่อเนื่อง"}
{"word": "conference", "english": "I’m networking at the conference tomorrow.", "thai": "ฉันจะสร้างเครือข่ายที่การประชุมในวันพรุ่งนี้"}
{"word": "conference", "english": "The conference has a panel on diversity.", "thai": "การประชุมมีคณะอภิปรายเกี่ยวกับความหลากหลาย"}
{"word": "conference", "english": "She’s a guest speaker at the conference.", "thai": "เธอเป็นวิทยากรรับเชิญที่การประชุม"}
{"word": "conference", "english": "The conference registration fee is $200.", "thai": "ค่าลงทะเบียนการประชุมคือ 200 ดอลลาร์"}
{"word": "conference", "english": "I’m excited for the annual conference.", "thai": "ฉันตื่นเต้นกับการประชุมประจำปี"}
{"word": "conference", "english": "The conference is hybrid this year.", "thai": "การประชุมเป็นแบบผสมผสานในปีนี้"}
{"word": "conference", "english": "He’s presenting data at the conference.", "thai": "เขากำลังนำเสนอข้อมูลที่การประชุม"}
{"word": "conference", "english": "The conference has a trade show attached.", "thai": "การประชุมมีงานแสดงสินค้าแนบมาด้วย"}
{"word": "conference", "english": "I need a badge for the conference entry.", "thai": "ฉันต้องการป้ายสำหรับเข้าการประชุม"}
{"word": "conference", "english": "The conference is about global health issues.", "thai": "การประชุมเกี่ยวกับประเด็นสุขภาพระดับโลก"}
{"word": "conference", "english": "She’s moderating the conference keynote.", "thai": "เธอกำลังดำเนินรายการปาฐกถาของการประชุม"}
{"word": "conference", "english": "The conference has a virtual attendance option.", "thai": "การประชุมมีตัวเลือกเข้าร่วมแบบเสมือนจริง"}
{"word": "conference", "english": "I’m preparing a poster for the conference.", "thai": "ฉันกำลังเตรียมโปสเตอร์สำหรับการประชุม"}
{"word": "conference", "english": "The conference is sponsored by a tech company.", "thai": "การประชุมได้รับการสนับสนุนจากบริษัทเทคโนโลยี"}
{"word": "conference", "english": "He’s attending a finance conference.", "thai": "เขากำลังเข้าร่วมการประชุมด้านการเงิน"}
{"word": "conference", "english": "The conference includes a Q&A session.", "thai": "การประชุมมีช่วงถามตอบ"}
{"word": "conference", "english": "I’m speaking at the education conference.", "thai": "ฉันจะพูดที่การประชุมด้านการศึกษา"}
{"word": "conference", "english": "The conference has a mobile app for schedules.", "thai": "การประชุมมีแอปมือถือสำหรับตาราง"}
{"word": "conference", "english": "She’s on the conference organizing team.", "thai": "เธออยู่ในทีมจัดงานประชุม"}
{"word": "conference", "english": "The conference is focused on sustainability.", "thai": "การประชุมมุ่งเน้นเรื่องความยั่งยืน"}
{"word": "conference", "english": "I need to pack for the conference trip.", "thai": "ฉันต้องเตรียมกระเป๋าสำหรับทริปการประชุม"}
{"word": "conference", "english": "The conference has a session on leadership.", "thai": "การประชุมมีช่วงเกี่ยวกับภาวะผู้นำ"}
{"word": "conference", "english": "He’s presenting a case study at the conference.", "thai": "เขากำลังนำเสนอกรณีศึกษาที่การประชุม"}
{"word": "conference", "english": "The conference is for medical professionals.", "thai": "การประชุมสำหรับผู้เชี่ยวชาญทางการแพทย์"}
{"word": "conference", "english": "I’m attending a conference on urban planning.", "thai": "ฉันกำลังเข้าร่วมการประชุมด้านการวางผังเมือง"}
{"word": "conference", "english": "The conference has a workshop on coding.", "thai": "การประชุมมีเวิร์กช็อปเกี่ยวกับการเขียนโค้ด"}
{"word": "conference", "english": "She’s a panelist at the tech conference.", "thai": "เธอเป็นผู้ร่วมอภิปรายที่การประชุมด้านเทคโนโลยี"}
{"word": "conference", "english": "The conference starts with a welcome reception.", "thai": "การประชุมเริ่มต้นด้วยงานต้อนรับ"}
{"word": "conference", "english": "I need to submit an abstract for the conference.", "thai": "ฉันต้องยื่นบทคัดย่อสำหรับการประชุม"}
{"word": "conference", "english": "The conference is held every two years.", "thai": "การประชุมจัดขึ้นทุกสองปี"}
{"word": "conference", "english": "He’s moderating a session at the conference.", "thai": "เขากำลังดำเนินรายการช่วงหนึ่งที่การประชุม"}
{"word": "conference", "english": "The conference has a focus on innovation.", "thai": "การประชุมมุ่งเน้นเรื่องนวัตกรรม"}
{"word": "conference", "english": "I’m attending a conference on data science.", "thai": "ฉันกำลังเข้าร่วมการประชุมด้านวิทยาศาสตร์ข้อมูล"}
{"word": "conference", "english": "The conference includes a career fair.", "thai": "การประชุมมีงานแสดงอาชีพรวมอยู่ด้วย"}
{"word": "conference", "english": "She’s organizing the conference catering.", "thai": "เธอกำลังจัดการด้านอาหารสำหรับการประชุม"}
{"word": "conference", "english": "The conference is in a downtown hotel.", "thai": "การประชุมจัดในโรงแรมใจกลางเมือง"}
{"word": "conference", "english": "I need to prepare for the conference panel.", "thai": "ฉันต้องเตรียมตัวสำหรับคณะอภิปรายของการประชุม"}
{"word": "conference", "english": "The conference has a session on AI ethics.", "thai": "การประชุมมีช่วงเกี่ยวกับจริยธรรมปัญญาประดิษฐ์"}
{"word": "conference", "english": "He’s attending a conference on public health.", "thai": "เขากำลังเข้าร่วมการประชุมด้านสาธารณสุข"}
{"word": "conference", "english": "The conference offers live translation services.", "thai": "การประชุมมีบริการแปลสด"}
{"word": "conference", "english": "I’m presenting a workshop at the conference.", "thai": "ฉันกำลังนำเสนอเวิร์กช็อปที่การประชุม"}
{"word": "conference", "english": "The conference is about renewable energy solutions.", "thai": "การประชุมเกี่ยวกับโซลูชันพลังงานหมุนเวียน"}
{"word": "conference", "english": "She’s a keynote speaker at the conference.", "thai": "เธอเป็นวิทยากรหลักที่การประชุม"}
{"word": "conference", "english": "The conference has a virtual breakout room.", "thai": "การประชุมมีห้องกลุ่มย่อยเสมือนจริง"}
{"word": "conference", "english": "I need to book a room for the conference.", "thai": "ฉันต้องจองห้องสำหรับการประชุม"}
{"word": "conference", "english": "The conference is for nonprofit leaders.", "thai": "การประชุมสำหรับผู้นำองค์กรไม่แสวงผลกำไร"}
{"word": "conference", "english": "He’s attending a conference on engineering.", "thai": "เขากำลังเข้าร่วมการประชุมด้านวิศวกรรม"}
{"word": "conference", "english": "The conference has a session on mental health.", "thai": "การประชุมมีช่วงเกี่ยวกับสุขภาพจิต"}
{"word": "conference", "english": "I’m volunteering at the conference registration desk.", "thai": "ฉันเป็นอาสาสมัครที่โต๊ะลงทะเบียนการประชุม"}
{"word": "conference", "english": "The conference is about global trade policies.", "thai": "การประชุมเกี่ยวกับนโยบายการค้าโลก"}
{"word": "conference", "english": "She’s presenting a poster at the conference.", "thai": "เธอกำลังนำเสนอโปสเตอร์ที่การประชุม"}
{"word": "conference", "english": "The conference has a mobile app for networking.", "thai": "การประชุมมีแอปมือถือสำหรับการสร้างเครือข่าย"}
{"word": "conference", "english": "I’m attending a conference on climate solutions.", "thai": "ฉันกำลังเข้าร่วมการประชุมเกี่ยวกับโซลูชันสภาพภูมิอากาศ"}
{"word": "counselor", "english": "I met with my school counselor to plan my classes.", "thai": "ฉันพบที่ปรึกษาโรงเรียนเพื่อวางแผนวิชาเรียน"}
{"word": "counselor", "english": "The camp counselor led the kids on a hike.", "thai": "ที่ปรึกษาค่ายพาเด็กๆ ไปเดินป่า"}
{"word": "counselor", "english": "She’s a career counselor at the university.", "thai": "เธอเป็นที่ปรึกษาด้านอาชีพที่มหาวิทยาลัย"}
{"word": "counselor", "english": "The counselor helped me with my college applications.", "thai": "ที่ปรึกษาช่วยฉันเรื่องการสมัครเรียนมหาวิทยาลัย"}
{"word": "counselor", "english": "I’m seeing a counselor for stress management.", "thai": "ฉันกำลังพบที่ปรึกษาเพื่อจัดการความเครียด"}
{"word": "counselor", "english": "The guidance counselor recommended a new course.", "thai": "ที่ปรึกษาแนะแนวแนะนำวิชาใหม่"}
{"word": "counselor", "english": "He works as a camp counselor every summer.", "thai": "เขาทำงานเป็นที่ปรึกษาค่ายทุกฤดูร้อน"}
{"word": "counselor", "english": "The counselor gave me advice about my major.", "thai": "ที่ปรึกษาให้คำแนะนำเกี่ยวกับสาขาวิชาเอกของฉัน"}
{"word": "counselor", "english": "She’s a licensed therapist and counselor.", "thai": "เธอเป็นนักบำบัดและที่ปรึกษาที่มีใบอนุญาต"}
{"word": "counselor", "english": "The school counselor is available for drop-ins.", "thai": "ที่ปรึกษาโรงเรียนพร้อมให้บริการแบบไม่ต้องนัด"}
{"word": "counselor", "english": "I talked to a counselor about my anxiety.", "thai": "ฉันคุยกับที่ปรึกษาเกี่ยวกับความกังวลของฉัน"}
{"word": "counselor", "english": "The camp counselor organized a talent show.", "thai": "ที่ปรึกษาค่ายจัดการแสดงความสามารถ"}
{"word": "counselor", "english": "The counselor helped me choose a career path.", "thai": "ที่ปรึกษาช่วยฉันเลือกเส้นทางอาชีพ"}
{"word": "counselor", "english": "She’s meeting with the academic counselor today.", "thai": "เธอกำลังพบที่ปรึกษาด้านวิชาการวันนี้"}
{"word": "counselor", "english": "The counselor runs a support group for students.", "thai": "ที่ปรึกษาดำเนินกลุ่มสนับสนุนสำหรับนักเรียน"}
{"word": "counselor", "english": "I need to see the counselor about my schedule.", "thai": "ฉันต้องพบที่ปรึกษาเกี่ยวกับตารางเรียนของฉัน"}
{"word": "counselor", "english": "The camp counselor taught us how to kayak.", "thai": "ที่ปรึกษาค่ายสอนเราพายเรือคายัค"}
{"word": "counselor", "english": "The counselor specializes in family therapy.", "thai": "ที่ปรึกษาเชี่ยวชาญด้านการบำบัดครอบครัว"}
{"word": "counselor", "english": "He’s a counselor at the community center.", "thai": "เขาเป็นที่ปรึกษาที่ศูนย์ชุมชน"}
{"word": "counselor", "english": "The counselor helped me with my resume.", "thai": "ที่ปรึกษาช่วยฉันทำเรซูเม่"}
{"word": "counselor", "english": "She’s seeing a counselor for grief support.", "thai": "เธอกำลังพบที่ปรึกษาเพื่อสนับสนุนการสูญเสีย"}
{"word": "counselor", "english": "The school counselor hosts a college fair.", "thai": "ที่ปรึกษาโรงเรียนจัดงานมหาวิทยาลัย"}
{"word": "counselor", "english": "The camp counselor led a campfire sing-along.", "thai": "ที่ปรึกษาค่ายนำการร้องเพลงรอบกองไฟ"}
{"word": "counselor", "english": "I spoke to the counselor about scholarships.", "thai": "ฉันคุยกับที่ปรึกษาเกี่ยวกับทุนการศึกษา"}
{"word": "counselor", "english": "The counselor offers mental health workshops.", "thai": "ที่ปรึกษาจัดเวิร์กช็อปด้านสุขภาพจิต"}
{"word": "counselor", "english": "He’s a guidance counselor at the high school.", "thai": "เขาเป็นที่ปรึกษาแนะแนวที่โรงเรียนมัธยม"}
{"word": "counselor", "english": "The counselor helped me plan my graduation.", "thai": "ที่ปรึกษาช่วยฉันวางแผนการสำเร็จการศึกษา"}
{"word": "counselor", "english": "The camp counselor supervised the archery range.", "thai": "ที่ปรึกษาค่ายดูแลสนามยิงธนู"}
{"word": "counselor", "english": "I need to book a session with the counselor.", "thai": "ฉันต้องจองคิวกับที่ปรึกษา"}
{"word": "counselor", "english": "The counselor gave advice on job interviews.", "thai": "ที่ปรึกษาให้คำแนะนำเกี่ยวกับการสัมภาษณ์งาน"}
{"word": "counselor", "english": "She’s a counselor for at-risk youth.", "thai": "เธอเป็นที่ปรึกษาสำหรับเยาวชนที่มีความเสี่ยง"}
{"word": "counselor", "english": "The academic counselor reviewed my transcript.", "thai": "ที่ปรึกษาด้านวิชาการตรวจสอบใบรับรองผลการเรียนของฉัน"}
{"word": "counselor", "english": "The camp counselor organized a scavenger hunt.", "thai": "ที่ปรึกษาค่ายจัดการล่าสมบัติ"}
{"word": "counselor", "english": "I’m meeting the counselor to discuss my grades.", "thai": "ฉันจะพบที่ปรึกษาเพื่อพูดคุยเกี่ยวกับผลการเรียน"}
{"word": "counselor", "english": "The counselor runs a therapy group weekly.", "thai": "ที่ปรึกษาดำเนินกลุ่มบำบัดทุกสัปดาห์"}
{"word": "counselor", "english": "He’s a counselor at the summer camp.", "thai": "เขาเป็นที่ปรึกษาที่ค่ายฤดูร้อน"}
{"word": "counselor", "english": "The counselor helped me with financial aid forms.", "thai": "ที่ปรึกษาช่วยฉันกรอกแบบฟอร์มขอความช่วยเหลือทางการเงิน"}
{"word": "counselor", "english": "She’s a marriage counselor with years of experience.", "thai": "เธอเป็นที่ปรึกษาการสมรสที่มีประสบการณ์หลายปี"}
{"word": "counselor", "english": "The counselor is available for walk-in appointments.", "thai": "ที่ปรึกษาพร้อมให้บริการแบบไม่ต้องนัด"}
{"word": "counselor", "english": "The camp counselor taught us survival skills.", "thai": "ที่ปรึกษาค่ายสอนทักษะการเอาตัวรอดให้เรา"}
{"word": "counselor", "english": "I talked to the counselor about my career goals.", "thai": "ฉันคุยกับที่ปรึกษาเกี่ยวกับเป้าหมายอาชีพของฉัน"}
{"word": "counselor", "english": "The counselor offers stress-relief workshops.", "thai": "ที่ปรึกษาจัดเวิร์กช็อปบรรเทาความเครียด"}
{"word": "counselor", "english": "He’s a counselor for the study abroad program.", "thai": "เขาเป็นที่ปรึกษาสำหรับโปรแกรมเรียนต่อต่างประเทศ"}
{"word": "counselor", "english": "The school counselor helped me pick electives.", "thai": "ที่ปรึกษาโรงเรียนช่วยฉันเลือกวิชาเลือก"}
{"word": "counselor", "english": "The camp counselor led a team-building activity.", "thai": "ที่ปรึกษาค่ายนำกิจกรรมสร้างทีม"}
{"word": "counselor", "english": "I need to see the counselor about my internship.", "thai": "ฉันต้องพบที่ปรึกษาเกี่ยวกับการฝึกงานของฉัน"}
{"word": "counselor", "english": "The counselor specializes in addiction recovery.", "thai": "ที่ปรึกษาเชี่ยวชาญด้านการฟื้นฟูจากการติดยา"}
{"word": "counselor", "english": "She’s a counselor at the community health center.", "thai": "เธอเป็นที่ปรึกษาที่ศูนย์สุขภาพชุมชน"}
{"word": "counselor", "english": "The counselor gave me tips for time management.", "thai": "ที่ปรึกษาให้เคล็ดลับเกี่ยวกับการบริหารเวลา"}
{"word": "counselor", "english": "The camp counselor planned a sports day.", "thai": "ที่ปรึกษาค่ายวางแผนวันกีฬา"}
{"word": "counselor", "english": "I’m seeing a counselor for personal issues.", "thai": "ฉันกำลังพบที่ปรึกษาเกี่ยวกับปัญหาส่วนตัว"}
{"word": "counselor", "english": "The counselor helped me with my scholarship essay.", "thai": "ที่ปรึกษาช่วยฉันเขียนเรียงความขอทุนการศึกษา"}
{"word": "counselor", "english": "The camp counselor is great with kids.", "thai": "ที่ปรึกษาค่ายเก่งในการดูแลเด็กๆ"}
{"word": "counselor", "english": "The counselor runs a peer support group.", "thai": "ที่ปรึกษาดำเนินกลุ่มสนับสนุนเพื่อน"}
{"word": "counselor", "english": "I met with the counselor to discuss my major.", "thai": "ฉันพบที่ปรึกษาเพื่อพูดคุยเกี่ยวกับสาขาวิชาเอก"}
{"word": "counselor", "english": "The camp counselor taught us how to pitch a tent.", "thai": "ที่ปรึกษาค่ายสอนเรากางเต็นท์"}
{"word": "counselor", "english": "The counselor offers career planning sessions.", "thai": "ที่ปรึกษาจัดเซสชันวางแผนอาชีพ"}
{"word": "counselor", "english": "She’s a counselor for students with disabilities.", "thai": "เธอเป็นที่ปรึกษาสำหรับนักเรียนที่มีความพิการ"}
{"word": "counselor", "english": "The counselor helped me with my transfer credits.", "thai": "ที่ปรึกษาช่วยฉันเรื่องหน่วยกิตโอนย้าย"}
{"word": "counselor", "english": "The camp counselor organized a craft workshop.", "thai": "ที่ปรึกษาค่ายจัดการเวิร์กช็อปงานฝีมือ"}
{"word": "counselor", "english": "I need to talk to the counselor about my grades.", "thai": "ฉันต้องคุยกับที่ปรึกษาเกี่ยวกับผลการเรียนของฉัน"}
{"word": "counselor", "english": "The counselor specializes in trauma recovery.", "thai": "ที่ปรึกษาเชี่ยวชาญด้านการฟื้นฟูจากบาดแผลทางจิตใจ"}
{"word": "counselor", "english": "He’s a counselor at the youth center.", "thai": "เขาเป็นที่ปรึกษาที่ศูนย์เยาวชน"}
{"word": "counselor", "english": "The counselor gave me advice on internships.", "thai": "ที่ปรึกษาให้คำแนะนำเกี่ยวกับการฝึกงาน"}
{"word": "counselor", "english": "The camp counselor led a nature walk.", "thai": "ที่ปรึกษาค่ายนำการเดินสำรวจธรรมชาติ"}
{"word": "counselor", "english": "I’m seeing the counselor for anxiety support.", "thai": "ฉันกำลังพบที่ปรึกษาเพื่อสนับสนุนเรื่องความกังวล"}
{"word": "counselor", "english": "The counselor helped me with my course schedule.", "thai": "ที่ปรึกษาช่วยฉันจัดตารางวิชาเรียน"}
{"word": "counselor", "english": "The camp counselor planned a canoe trip.", "thai": "ที่ปรึกษาค่ายวางแผนทริปพายเรือแคนู"}
{"word": "counselor", "english": "The counselor offers resume-building workshops.", "thai": "ที่ปรึกษาจัดเวิร์กช็อปสร้างเรซูเม่"}
{"word": "counselor", "english": "She’s a counselor for international students.", "thai": "เธอเป็นที่ปรึกษาสำหรับนักเรียนต่างชาติ"}
{"word": "counselor", "english": "The counselor helped me with my grad school apps.", "thai": "ที่ปรึกษาช่วยฉันเรื่องการสมัครเรียนบัณฑิตศึกษา"}
{"word": "counselor", "english": "The camp counselor taught us first aid skills.", "thai": "ที่ปรึกษาค่ายสอนทักษะการปฐมพยาบาลให้เรา"}
{"word": "counselor", "english": "I need to see the counselor about my transcript.", "thai": "ฉันต้องพบที่ปรึกษาเกี่ยวกับใบรับรองผลการเรียน"}
{"word": "counselor", "english": "The counselor runs a mindfulness workshop.", "thai": "ที่ปรึกษาจัดเวิร์กช็อปการเจริญสติ"}
{"word": "counselor", "english": "He’s a counselor at the career services office.", "thai": "เขาเป็นที่ปรึกษาที่สำนักงานบริการด้านอาชีพ"}
{"word": "counselor", "english": "The counselor helped me with my study plan.", "thai": "ที่ปรึกษาช่วยฉันวางแผนการเรียน"}
{"word": "counselor", "english": "The camp counselor led a group discussion.", "thai": "ที่ปรึกษาค่ายนำการสนทนากลุ่ม"}
{"word": "counselor", "english": "I’m meeting the counselor to discuss scholarships.", "thai": "ฉันจะพบที่ปรึกษาเพื่อพูดคุยเกี่ยวกับทุนการศึกษา"}
{"word": "counselor", "english": "The counselor specializes in couples therapy.", "thai": "ที่ปรึกษาเชี่ยวชาญด้านการบำบัดคู่รัก"}
{"word": "counselor", "english": "She’s a counselor at the wellness center.", "thai": "เธอเป็นที่ปรึกษาที่ศูนย์สุขภาพ"}
{"word": "counselor", "english": "The counselor gave me tips for job searches.", "thai": "ที่ปรึกษาให้เคล็ดลับสำหรับการหางาน"}
{"word": "counselor", "english": "The camp counselor organized a campfire night.", "thai": "ที่ปรึกษาค่ายจัดการคืนกองไฟ"}
{"word": "counselor", "english": "I talked to the counselor about my future plans.", "thai": "ฉันคุยกับที่ปรึกษาเกี่ยวกับแผนอนาคตของฉัน"}
{"word": "counselor", "english": "The counselor runs a stress management group.", "thai": "ที่ปรึกษาดำเนินกลุ่มจัดการความเครียด"}
{"word": "counselor", "english": "He’s a counselor for the honors program.", "thai": "เขาเป็นที่ปรึกษาสำหรับโปรแกรมเกียรตินิยม"}
{"word": "counselor", "english": "The counselor helped me with my transfer application.", "thai": "ที่ปรึกษาช่วยฉันเรื่องการสมัครโอนย้าย"}
{"word": "counselor", "english": "The camp counselor led a swimming lesson.", "thai": "ที่ปรึกษาค่ายนำการสอนว่ายน้ำ"}
{"word": "counselor", "english": "I need to see the counselor about my major change.", "thai": "ฉันต้องพบที่ปรึกษาเกี่ยวกับการเปลี่ยนสาขาวิชาเอก"}
{"word": "counselor", "english": "The counselor offers workshops on mental health.", "thai": "ที่ปรึกษาจัดเวิร์กช็อปเกี่ยวกับสุขภาพจิต"}
{"word": "counselor", "english": "She’s a counselor at the crisis hotline.", "thai": "เธอเป็นที่ปรึกษาที่สายด่วนวิกฤต"}
{"word": "counselor", "english": "The counselor helped me with my course load.", "thai": "ที่ปรึกษาช่วยฉันจัดการภาระวิชาเรียน"}
{"word": "counselor", "english": "The camp counselor planned a hiking trip.", "thai": "ที่ปรึกษาค่ายวางแผนทริปเดินป่า"}
{"word": "counselor", "english": "I’m seeing the counselor for career advice.", "thai": "ฉันกำลังพบที่ปรึกษาเพื่อขอคำแนะนำด้านอาชีพ"}
{"word": "counselor", "english": "The counselor runs a support group for veterans.", "thai": "ที่ปรึกษาดำเนินกลุ่มสนับสนุนสำหรับทหารผ่านศึก"}
{"word": "counselor", "english": "He’s a counselor at the academic advising office.", "thai": "เขาเป็นที่ปรึกษาที่สำนักงานแนะแนววิชาการ"}
{"word": "counselor", "english": "The counselor helped me with my study abroad plan.", "thai": "ที่ปรึกษาช่วยฉันวางแผนเรียนต่อต่างประเทศ"}
{"word": "counselor", "english": "The camp counselor taught us how to make a fire.", "thai": "ที่ปรึกษาค่ายสอนเราจุดไฟ"}
{"word": "counselor", "english": "I need to talk to the counselor about my schedule.", "thai": "ฉันต้องคุยกับที่ปรึกษาเกี่ยวกับตารางของฉัน"}
{"word": "counselor", "english": "The counselor specializes in child therapy.", "thai": "ที่ปรึกษาเชี่ยวชาญด้านการบำบัดเด็ก"}
{"word": "counselor", "english": "She’s a counselor at the community outreach program.", "thai": "เธอเป็นที่ปรึกษาที่โปรแกรมประชาสัมพันธ์ชุมชน"}
{"word": "credit", "english": "I need three more credits to graduate.", "thai": "ฉันต้องการอีกสามหน่วยกิตเพื่อจบการศึกษา"}
{"word": "credit", "english": "She paid off her credit card balance.", "thai": "เธอชำระยอดคงค้างในบัตรเครดิต"}
{"word": "credit", "english": "He got credit for his group project work.", "thai": "เขาได้รับเครดิตสำหรับงานกลุ่ม"}
{"word": "credit", "english": "The store offers a credit for returns.", "thai": "ร้านค้าให้เครดิตสำหรับการคืนสินค้า"}
{"word": "credit", "english": "I’m taking a course for extra credit.", "thai": "ฉันกำลังเรียนวิชาเพื่อหน่วยกิตพิเศษ"}
{"word": "credit", "english": "Her credit score improved this year.", "thai": "คะแนนเครดิตของเธอดีขึ้นในปีนี้"}
{"word": "credit", "english": "The professor gave me credit for my essay.", "thai": "อาจารย์ให้เครดิตฉันสำหรับเรียงความ"}
{"word": "credit", "english": "I used store credit to buy a new shirt.", "thai": "ฉันใช้เครดิตร้านค้าเพื่อซื้อเสื้อใหม่"}
{"word": "credit", "english": "The course is worth three credits.", "thai": "วิชานี้มีค่าเท่ากับสามหน่วยกิต"}
{"word": "credit", "english": "He applied for a credit card online.", "thai": "เขาสมัครบัตรเครดิตทางออนไลน์"}
{"word": "credit", "english": "She deserves credit for organizing the event.", "thai": "เธอสมควรได้รับเครดิตสำหรับการจัดงาน"}
{"word": "credit", "english": "I need to check my credit report.", "thai": "ฉันต้องตรวจสอบรายงานเครดิตของฉัน"}
{"word": "credit", "english": "The class offers credit for attendance.", "thai": "วิชานี้ให้หน่วยกิตสำหรับการเข้าร่วม"}
{"word": "credit", "english": "He has a good credit history.", "thai": "เขามีประวัติเครดิตที่ดี"}
{"word": "credit", "english": "I got extra credit for my presentation.", "thai": "ฉันได้หน่วยกิตพิเศษสำหรับการนำเสนอ"}
{"word": "credit", "english": "The bank approved my credit application.", "thai": "ธนาคารอนุมัติใบสมัครเครดิตของฉัน"}
{"word": "credit", "english": "She gave credit to her team for the success.", "thai": "เธอให้เครดิตทีมของเธอสำหรับความสำเร็จ"}
{"word": "credit", "english": "I’m short one credit for my degree.", "thai": "ฉันขาดหนึ่งหน่วยกิตสำหรับปริญญา"}
{"word": "credit", "english": "He used a credit card to pay for dinner.", "thai": "เขาใช้บัตรเครดิตจ่ายค่าอาหารค่ำ"}
{"word": "credit", "english": "The professor doesn’t give partial credit.", "thai": "อาจารย์ไม่ให้หน่วยกิตบางส่วน"}
{"word": "credit", "english": "I got a store credit for the damaged item.", "thai": "ฉันได้เครดิตร้านค้าสำหรับสินค้าที่เสียหาย"}
{"word": "credit", "english": "She’s taking 15 credits this semester.", "thai": "เธอกำลังเรียน 15 หน่วยกิตในภาคเรียนนี้"}
{"word": "credit", "english": "His credit limit was increased recently.", "thai": "วงเงินเครดิตของเขาเพิ่มขึ้นเมื่อเร็ว ๆ นี้"}
{"word": "credit", "english": "I need to earn credit for my internship.", "thai": "ฉันต้องได้รับหน่วยกิตสำหรับการฝึกงาน"}
{"word": "credit", "english": "The bank denied my credit request.", "thai": "ธนาคารปฏิเสธคำขอเครดิตของฉัน"}
{"word": "credit", "english": "She got credit for her volunteer work.", "thai": "เธอได้รับเครดิตสำหรับงานอาสาสมัคร"}
{"word": "credit", "english": "I’m paying off my credit card debt.", "thai": "ฉันกำลังชำระหนี้บัตรเครดิต"}
{"word": "credit", "english": "The course counts for elective credit.", "thai": "วิชานี้นับเป็นหน่วยกิตวิชาเลือก"}
{"word": "credit", "english": "He checked his credit score online.", "thai": "เขาตรวจสอบคะแนนเครดิตทางออนไลน์"}
{"word": "credit", "english": "I gave her credit for the project idea.", "thai": "ฉันให้เครดิตเธอสำหรับแนวคิดโครงการ"}
{"word": "credit", "english": "I need six more credits to transfer.", "thai": "ฉันต้องการอีกหกหน่วยกิตเพื่อโอนย้าย"}
{"word": "credit", "english": "She used her credit card for the purchase.", "thai": "เธอใช้บัตรเครดิตสำหรับการซื้อ"}
{"word": "credit", "english": "The professor offered extra credit for the quiz.", "thai": "อาจารย์ให้หน่วยกิตพิเศษสำหรับแบบทดสอบ"}
{"word": "credit", "english": "His credit application was approved.", "thai": "ใบสมัครเครดิตของเขาได้รับการอนุมัติ"}
{"word": "credit", "english": "I got credit for my prior coursework.", "thai": "ฉันได้รับหน่วยกิตสำหรับวิชาที่เรียนมาก่อน"}
{"word": "credit", "english": "She’s working on her credit repair plan.", "thai": "เธอกำลังดำเนินการตามแผนฟื้นฟูเครดิต"}
{"word": "credit", "english": "The team deserves credit for their effort.", "thai": "ทีมสมควรได้รับเครดิตสำหรับความพยายาม"}
{"word": "credit", "english": "I’m enrolled in a three-credit course.", "thai": "ฉันลงทะเบียนในวิชาสามหน่วยกิต"}
{"word": "credit", "english": "He got a refund as store credit.", "thai": "เขาได้รับเงินคืนเป็นเครดิตร้านค้า"}
{"word": "credit", "english": "The counselor helped me transfer my credits.", "thai": "ที่ปรึกษาช่วยฉันโอนหน่วยกิต"}
{"word": "credit", "english": "Her credit card was declined at the store.", "thai": "บัตรเครดิตของเธอถูกปฏิเสธที่ร้าน"}
{"word": "credit", "english": "I earned extra credit for my research.", "thai": "ฉันได้รับหน่วยกิตพิเศษสำหรับงานวิจัย"}
{"word": "credit", "english": "The bank offered a low-interest credit line.", "thai": "ธนาคารเสนอวงเงินเครดิตดอกเบี้ยต่ำ"}
{"word": "credit", "english": "She gave credit to her mentor for the idea.", "thai": "เธอให้เครดิตแก่ที่ปรึกษาสำหรับแนวคิด"}
{"word": "credit", "english": "I need 120 credits to get my degree.", "thai": "ฉันต้องการ 120 หน่วยกิตเพื่อรับปริญญา"}
{"word": "credit", "english": "He’s building his credit with a new card.", "thai": "เขากำลังสร้างเครดิตด้วยบัตรใหม่"}
{"word": "credit", "english": "The professor doesn’t offer extra credit.", "thai": "อาจารย์ไม่ให้หน่วยกิตพิเศษ"}
{"word": "credit", "english": "I used store credit to buy shoes.", "thai": "ฉันใช้เครดิตร้านค้าเพื่อซื้อรองเท้า"}
{"word": "credit", "english": "The course is worth four credits.", "thai": "วิชานี้มีค่าเท่ากับสี่หน่วยกิต"}
{"word": "credit", "english": "Her credit score dropped after missing a payment.", "thai": "คะแนนเครดิตของเธอลดลงหลังจากพลาดการชำระเงิน"}
{"word": "credit", "english": "I got credit for attending the workshop.", "thai": "ฉันได้รับหน่วยกิตสำหรับการเข้าร่วมเวิร์กช็อป"}
{"word": "credit", "english": "He applied for a small business credit.", "thai": "เขาสมัครเครดิตธุรกิจขนาดเล็ก"}
{"word": "credit", "english": "She deserves credit for the design.", "thai": "เธอสมควรได้รับเครดิตสำหรับการออกแบบ"}
{"word": "credit", "english": "I’m taking 12 credits this semester.", "thai": "ฉันกำลังเรียน 12 หน่วยกิตในภาคเรียนนี้"}
{"word": "credit", "english": "The store gave me credit for the return.", "thai": "ร้านค้าให้เครดิตฉันสำหรับการคืนสินค้า"}
{"word": "credit", "english": "I need to check my credit card statement.", "thai": "ฉันต้องตรวจสอบใบแจ้งยอดบัตรเครดิต"}
{"word": "credit", "english": "The class offers credit for participation.", "thai": "วิชานี้ให้หน่วยกิตสำหรับการมีส่วนร่วม"}
{"word": "credit", "english": "He’s working to improve his credit score.", "thai": "เขากำลังพยายามปรับปรุงคะแนนเครดิต"}
{"word": "credit", "english": "I earned credit for my summer internship.", "thai": "ฉันได้รับหน่วยกิตสำหรับการฝึกงานฤดูร้อน"}
{"word": "credit", "english": "She used a credit card to book the flight.", "thai": "เธอใช้บัตรเครดิตเพื่อจองเที่ยวบิน"}
{"word": "credit", "english": "The professor gave me partial credit.", "thai": "อาจารย์ให้หน่วยกิตบางส่วนแก่ฉัน"}
{"word": "credit", "english": "I got a credit for the defective product.", "thai": "ฉันได้รับเครดิตสำหรับสินค้าชำรุด"}
{"word": "credit", "english": "The course requires 30 credits to complete.", "thai": "วิชานี้ต้องใช้ 30 หน่วยกิตจึงจะสำเร็จ"}
{"word": "credit", "english": "Her credit limit is $5,000.", "thai": "วงเงินเครดิตของเธอคือ 5,000 ดอลลาร์"}
{"word": "credit", "english": "I gave him credit for the group effort.", "thai": "ฉันให้เครดิตเขาสำหรับความพยายามของกลุ่ม"}
{"word": "credit", "english": "I need two more credits for my minor.", "thai": "ฉันต้องการอีกสองหน่วยกิตสำหรับวิชาโท"}
{"word": "credit", "english": "He’s paying down his credit card debt.", "thai": "เขากำลังชำระหนี้บัตรเครดิต"}
{"word": "credit", "english": "The professor offered credit for the assignment.", "thai": "อาจารย์ให้หน่วยกิตสำหรับงานที่มอบหมาย"}
{"word": "credit", "english": "The bank extended my line of credit.", "thai": "ธนาคารขยายวงเงินเครดิตของฉัน"}
{"word": "credit", "english": "She got credit for her community service.", "thai": "เธอได้รับเครดิตสำหรับการบริการชุมชน"}
{"word": "credit", "english": "I’m enrolled in a one-credit seminar.", "thai": "ฉันลงทะเบียนในสัมมนาหนึ่งหน่วยกิต"}
{"word": "credit", "english": "His credit card was stolen last week.", "thai": "บัตรเครดิตของเขาถูกขโมยเมื่อสัปดาห์ที่แล้ว"}
{"word": "credit", "english": "I earned extra credit for my project.", "thai": "ฉันได้รับหน่วยกิตพิเศษสำหรับโครงการ"}
{"word": "credit", "english": "She applied for a home equity credit line.", "thai": "เธอสมัครวงเงินเครดิตส่วนของบ้าน"}
{"word": "credit", "english": "The team got credit for their innovation.", "thai": "ทีมได้รับเครดิตสำหรับนวัตกรรมของพวกเขา"}
{"word": "credit", "english": "I need 18 credits to finish this year.", "thai": "ฉันต้องการ 18 หน่วยกิตเพื่อจบในปีนี้"}
{"word": "credit", "english": "He used store credit to buy a jacket.", "thai": "เขาใช้เครดิตร้านค้าเพื่อซื้อแจ็คเก็ต"}
{"word": "credit", "english": "The counselor helped me with credit transfers.", "thai": "ที่ปรึกษาช่วยฉันเรื่องการโอนหน่วยกิต"}
{"word": "credit", "english": "Her credit score is excellent now.", "thai": "คะแนนเครดิตของเธอยอดเยี่ยมแล้วตอนนี้"}
{"word": "credit", "english": "I got credit for my online course.", "thai": "ฉันได้รับหน่วยกิตสำหรับวิชาออนไลน์"}
{"word": "credit", "english": "He’s applying for a business credit card.", "thai": "เขากำลังสมัครบัตรเครดิตสำหรับธุรกิจ"}
{"word": "credit", "english": "She gave credit to her professor for guidance.", "thai": "เธอให้เครดิตอาจารย์สำหรับคำแนะนำ"}
{"word": "credit", "english": "The course is only one credit but very tough.", "thai": "วิชานี้มีเพียงหนึ่งหน่วยกิตแต่ยากมาก"}
{"word": "credit", "english": "I used my credit card for the hotel booking.", "thai": "ฉันใช้บัตรเครดิตสำหรับการจองโรงแรม"}
{"word": "credit", "english": "The professor gave credit for class participation.", "thai": "อาจารย์ให้หน่วยกิตสำหรับการมีส่วนร่วมในชั้นเรียน"}
{"word": "credit", "english": "The store issued a credit for my return.", "thai": "ร้านค้าออกเครดิตสำหรับการคืนสินค้าของฉัน"}
{"word": "credit", "english": "I’m taking 15 credits to stay on track.", "thai": "ฉันกำลังเรียน 15 หน่วยกิตเพื่อให้ทันตามแผน"}
{"word": "credit", "english": "Her credit card has a rewards program.", "thai": "บัตรเครดิตของเธอมีโปรแกรมรางวัล"}
{"word": "credit", "english": "I got credit for my study abroad program.", "thai": "ฉันได้รับหน่วยกิตสำหรับโปรแกรมเรียนต่อต่างประเทศ"}
{"word": "credit", "english": "He’s monitoring his credit for fraud.", "thai": "เขากำลังตรวจสอบเครดิตของเขาเพื่อป้องกันการฉ้อโกง"}
{"word": "credit", "english": "She deserves credit for the team’s success.", "thai": "เธอสมควรได้รับเครดิตสำหรับความสำเร็จของทีม"}
{"word": "credit", "english": "I need nine more credits for my major.", "thai": "ฉันต้องการอีกเก้าหน่วยกิตสำหรับสาขาวิชาเอก"}
{"word": "credit", "english": "He paid for the car with a credit card.", "thai": "เขาจ่ายค่ารถด้วยบัตรเครดิต"}
{"word": "credit", "english": "The professor offered credit for the field trip.", "thai": "อาจารย์ให้หน่วยกิตสำหรับการทัศนศึกษา"}
{"word": "credit", "english": "I got a store credit for the wrong item.", "thai": "ฉันได้รับเครดิตร้านค้าสำหรับสินค้าผิด"}
{"word": "credit", "english": "The course counts for general education credit.", "thai": "วิชานี้นับเป็นหน่วยกิตการศึกษาทั่วไป"}
{"word": "credit", "english": "Her credit application was denied.", "thai": "ใบสมัครเครดิตของเธอถูกปฏิเสธ"}
{"word": "credit", "english": "I gave credit to my partner for the idea.", "thai": "ฉันให้เครดิตแก่คู่หูสำหรับแนวคิด"}
{"word": "credit", "english": "I’m taking a two-credit lab course.", "thai": "ฉันกำลังเรียนวิชาห้องปฏิบัติการสองหน่วยกิต"}
{"word": "credit", "english": "He’s consolidating his credit card debt.", "thai": "เขากำลังรวมหนี้บัตรเครดิต"}
{"word": "credit", "english": "The professor gave me credit for my effort.", "thai": "อาจารย์ให้เครดิตฉันสำหรับความพยายาม"}
{"word": "deadline", "english": "The deadline for the project is next Friday.", "thai": "กำหนดส่งโครงการคือวันศุกร์หน้า"}
{"word": "deadline", "english": "I need to finish this paper before the deadline.", "thai": "ฉันต้องเขียนเอกสารนี้ให้เสร็จก่อนกำหนดส่ง"}
{"word": "deadline", "english": "She missed the deadline for the application.", "thai": "เธอพลาดกำหนดส่งใบสมัคร"}
{"word": "deadline", "english": "The professor extended the homework deadline.", "thai": "อาจารย์ขยายกำหนดส่งการบ้าน"}
{"word": "deadline", "english": "We’re working hard to meet the deadline.", "thai": "เรากำลังทำงานหนักเพื่อให้ทันกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for registration is tomorrow.", "thai": "กำหนดลงทะเบียนคือวันพรุ่งนี้"}
{"word": "deadline", "english": "He submitted his report just before the deadline.", "thai": "เขายื่นรายงานก่อนกำหนดส่งเพียงเล็กน้อย"}
{"word": "deadline", "english": "I’m stressed about the grant deadline.", "thai": "ฉันเครียดเกี่ยวกับกำหนดส่งขอทุน"}
{"word": "deadline", "english": "The deadline for the contest is next month.", "thai": "กำหนดส่งสำหรับการแข่งขันคือเดือนหน้า"}
{"word": "deadline", "english": "She’s rushing to meet the manuscript deadline.", "thai": "เธอกำลังรีบเพื่อให้ทันกำหนดส่งต้นฉบับ"}
{"word": "deadline", "english": "The deadline for tuition payment is today.", "thai": "กำหนดชำระค่าเล่าเรียนคือวันนี้"}
{"word": "deadline", "english": "I need to check the deadline for the scholarship.", "thai": "ฉันต้องตรวจสอบกำหนดส่งสำหรับทุนการศึกษา"}
{"word": "deadline", "english": "The team worked overtime to meet the deadline.", "thai": "ทีมทำงานล่วงเวลาเพื่อให้ทันกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for proposals is this Friday.", "thai": "กำหนดส่งข้อเสนอคือวันศุกร์นี้"}
{"word": "deadline", "english": "He asked for an extension on the deadline.", "thai": "เขาขอขยายกำหนดส่ง"}
{"word": "deadline", "english": "The application deadline is approaching fast.", "thai": "กำหนดส่งใบสมัครกำลังใกล้เข้ามาเร็ว"}
{"word": "deadline", "english": "I submitted my essay right at the deadline.", "thai": "ฉันยื่นเรียงความตรงกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for the report is midnight.", "thai": "กำหนดส่งรายงานคือเที่ยงคืน"}
{"word": "deadline", "english": "She’s worried about missing the deadline.", "thai": "เธอกังวลเกี่ยวกับการพลาดกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for the project was extended.", "thai": "กำหนดส่งโครงการถูกขยายเวลา"}
{"word": "deadline", "english": "I need to finish this before the deadline.", "thai": "ฉันต้องทำให้เสร็จก่อนกำหนดส่ง"}
{"word": "deadline", "english": "The conference abstract deadline is next week.", "thai": "กำหนดส่งบทคัดย่อการประชุมคือสัปดาห์หน้า"}
{"word": "deadline", "english": "He’s racing to meet the funding deadline.", "thai": "เขากำลังรีบเพื่อให้ทันกำหนดส่งขอเงินทุน"}
{"word": "deadline", "english": "The deadline for applications is tomorrow.", "thai": "กำหนดส่งใบสมัครคือวันพรุ่งนี้"}
{"word": "deadline", "english": "I forgot about the assignment deadline.", "thai": "ฉันลืมกำหนดส่งงานที่ได้รับมอบหมาย"}
{"word": "deadline", "english": "The deadline for the job posting is today.", "thai": "กำหนดส่งสำหรับประกาศรับสมัครงานคือวันนี้"}
{"word": "deadline", "english": "She’s working late to meet the deadline.", "thai": "เธอกำลังทำงานดึกเพื่อให้ทันกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for the grant is next month.", "thai": "กำหนดส่งขอทุนคือเดือนหน้า"}
{"word": "deadline", "english": "I need to submit this by the deadline.", "thai": "ฉันต้องยื่นสิ่งนี้ภายในกำหนดส่ง"}
{"word": "deadline", "english": "The professor reminded us about the deadline.", "thai": "อาจารย์เตือนเราเกี่ยวกับกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for the form is this afternoon.", "thai": "กำหนดส่งแบบฟอร์มคือบ่ายนี้"}
{"word": "deadline", "english": "He missed the deadline for the internship.", "thai": "เขาพลาดกำหนดส่งสำหรับการฝึกงาน"}
{"word": "deadline", "english": "The deadline for the project is tight.", "thai": "กำหนดส่งสำหรับโครงการนี้ค่อนข้างกระชั้นชิด"}
{"word": "deadline", "english": "I’m working hard to meet the deadline.", "thai": "ฉันกำลังทำงานหนักเพื่อให้ทันกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for registration was yesterday.", "thai": "กำหนดลงทะเบียนคือเมื่อวานนี้"}
{"word": "deadline", "english": "She submitted her work before the deadline.", "thai": "เธอยื่นงานก่อนกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for the essay is next Monday.", "thai": "กำหนดส่งเรียงความคือวันจันทร์หน้า"}
{"word": "deadline", "english": "I need an extension on the deadline.", "thai": "ฉันต้องการขยายกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for the application is tonight.", "thai": "กำหนดส่งใบสมัครคือคืนนี้"}
{"word": "deadline", "english": "He’s stressed about the project deadline.", "thai": "เขากดดันเกี่ยวกับกำหนดส่งโครงการ"}
{"word": "deadline", "english": "The deadline for submissions is next week.", "thai": "กำหนดส่งผลงานคือสัปดาห์หน้า"}
{"word": "deadline", "english": "I finished my work just before the deadline.", "thai": "ฉันทำงานเสร็จก่อนกำหนดส่งเพียงเล็กน้อย"}
{"word": "deadline", "english": "The deadline for the proposal is tomorrow.", "thai": "กำหนดส่งข้อเสนอคือวันพรุ่งนี้"}
{"word": "deadline", "english": "She’s rushing to meet the application deadline.", "thai": "เธอกำลังรีบเพื่อให้ทันกำหนดส่งใบสมัคร"}
{"word": "deadline", "english": "The deadline for the report was extended.", "thai": "กำหนดส่งรายงานถูกขยายเวลา"}
{"word": "deadline", "english": "I need to check the deadline for the contest.", "thai": "ฉันต้องตรวจสอบกำหนดส่งสำหรับการแข่งขัน"}
{"word": "deadline", "english": "The team met the deadline for the project.", "thai": "ทีมสามารถทำตามกำหนดส่งของโครงการ"}
{"word": "deadline", "english": "The deadline for the form is this Friday.", "thai": "กำหนดส่งแบบฟอร์มคือวันศุกร์นี้"}
{"word": "deadline", "english": "He’s worried about missing the deadline.", "thai": "เขากังวลเกี่ยวกับการพลาดกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for the grant application is soon.", "thai": "กำหนดส่งใบสมัครขอทุนใกล้เข้ามาแล้ว"}
{"word": "deadline", "english": "I submitted my work right at the deadline.", "thai": "ฉันยื่นงานตรงกำหนดส่ง"}
{"word": "deadline", "english": "The professor set a strict deadline.", "thai": "อาจารย์กำหนดกำหนดส่งที่เข้มงวด"}
{"word": "deadline", "english": "The deadline for the job application is today.", "thai": "กำหนดส่งใบสมัครงานคือวันนี้"}
{"word": "deadline", "english": "She’s working overtime to meet the deadline.", "thai": "เธอกำลังทำงานล่วงเวลาเพื่อให้ทันกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for the scholarship is next month.", "thai": "กำหนดส่งสำหรับทุนการศึกษาคือเดือนหน้า"}
{"word": "deadline", "english": "I need to finish this before the deadline.", "thai": "ฉันต้องทำให้เสร็จก่อนกำหนดส่ง"}
{"word": "deadline", "english": "The conference paper deadline is approaching.", "thai": "กำหนดส่งเอกสารการประชุมกำลังใกล้เข้ามา"}
{"word": "deadline", "english": "He’s racing to meet the funding deadline.", "thai": "เขากำลังรีบเพื่อให้ทันกำหนดส่งขอเงินทุน"}
{"word": "deadline", "english": "The deadline for entries is tomorrow.", "thai": "กำหนดส่งผลงานคือวันพรุ่งนี้"}
{"word": "deadline", "english": "I forgot the deadline for the assignment.", "thai": "ฉันลืมกำหนดส่งงานที่ได้รับมอบหมาย"}
{"word": "deadline", "english": "The deadline for the application was yesterday.", "thai": "กำหนดส่งใบสมัครคือเมื่อวานนี้"}
{"word": "deadline", "english": "She submitted her project before the deadline.", "thai": "เธอยื่นโครงการก่อนกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for the essay is this Thursday.", "thai": "กำหนดส่งเรียงความคือวันพฤหัสบดีนี้"}
{"word": "deadline", "english": "I need to request a deadline extension.", "thai": "ฉันต้องขอขยายกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for the form is tonight.", "thai": "กำหนดส่งแบบฟอร์มคือคืนนี้"}
{"word": "deadline", "english": "He’s stressed about the report deadline.", "thai": "เขากดดันเกี่ยวกับกำหนดส่งรายงาน"}
{"word": "deadline", "english": "The deadline for submissions is next Friday.", "thai": "กำหนดส่งผลงานคือวันศุกร์หน้า"}
{"word": "deadline", "english": "I finished my task just before the deadline.", "thai": "ฉันทำงานเสร็จก่อนกำหนดส่งเพียงเล็กน้อย"}
{"word": "deadline", "english": "The deadline for the proposal is next week.", "thai": "กำหนดส่งข้อเสนอคือสัปดาห์หน้า"}
{"word": "deadline", "english": "She’s rushing to meet the contest deadline.", "thai": "เธอกำลังรีบเพื่อให้ทันกำหนดส่งการแข่งขัน"}
{"word": "deadline", "english": "The deadline for the project was moved up.", "thai": "กำหนดส่งโครงการถูกเลื่อนให้เร็วขึ้น"}
{"word": "deadline", "english": "I need to confirm the deadline for the application.", "thai": "ฉันต้องยืนยันกำหนดส่งสำหรับใบสมัคร"}
{"word": "deadline", "english": "The team is working to meet the deadline.", "thai": "ทีมกำลังทำงานเพื่อให้ทันกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for the form is next Monday.", "thai": "กำหนดส่งแบบฟอร์มคือวันจันทร์หน้า"}
{"word": "deadline", "english": "He missed the deadline for the scholarship.", "thai": "เขาพลาดกำหนดส่งสำหรับทุนการศึกษา"}
{"word": "deadline", "english": "The deadline for the project is very tight.", "thai": "กำหนดส่งสำหรับโครงการนี้ค่อนข้างกระชั้นชิด"}
{"word": "deadline", "english": "I’m trying to meet the deadline for my paper.", "thai": "ฉันกำลังพยายามให้ทันกำหนดส่งเอกสาร"}
{"word": "deadline", "english": "The deadline for registration is this week.", "thai": "กำหนดลงทะเบียนคือสัปดาห์นี้"}
{"word": "deadline", "english": "She submitted her work just before the deadline.", "thai": "เธอยื่นงานก่อนกำหนดส่งเพียงเล็กน้อย"}
{"word": "deadline", "english": "The deadline for the essay is tomorrow.", "thai": "กำหนดส่งเรียงความคือวันพรุ่งนี้"}
{"word": "deadline", "english": "I need to meet the deadline for the grant.", "thai": "ฉันต้องให้ทันกำหนดส่งขอทุน"}
{"word": "deadline", "english": "The professor announced the new deadline.", "thai": "อาจารย์ประกาศกำหนดส่งใหม่"}
{"word": "deadline", "english": "The deadline for the application is next Friday.", "thai": "กำหนดส่งใบสมัครคือวันศุกร์หน้า"}
{"word": "deadline", "english": "He’s working late to meet the deadline.", "thai": "เขากำลังทำงานดึกเพื่อให้ทันกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for the contest is this month.", "thai": "กำหนดส่งสำหรับการแข่งขันคือเดือนนี้"}
{"word": "deadline", "english": "I need to submit my work by the deadline.", "thai": "ฉันต้องยื่นงานภายในกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for the report is next Tuesday.", "thai": "กำหนดส่งรายงานคือวันอังคารหน้า"}
{"word": "deadline", "english": "She’s stressed about the funding deadline.", "thai": "เธอกดดันเกี่ยวกับกำหนดส่งขอเงินทุน"}
{"word": "deadline", "english": "The deadline for submissions was extended.", "thai": "กำหนดส่งผลงานถูกขยายเวลา"}
{"word": "deadline", "english": "I finished my project just before the deadline.", "thai": "ฉันทำโครงการเสร็จก่อนกำหนดส่งเพียงเล็กน้อย"}
{"word": "deadline", "english": "The deadline for the proposal is this week.", "thai": "กำหนดส่งข้อเสนอคือสัปดาห์นี้"}
{"word": "deadline", "english": "He’s rushing to meet the application deadline.", "thai": "เขากำลังรีบเพื่อให้ทันกำหนดส่งใบสมัคร"}
{"word": "deadline", "english": "The deadline for the form was yesterday.", "thai": "กำหนดส่งแบบฟอร์มคือเมื่อวานนี้"}
{"word": "deadline", "english": "She submitted her essay before the deadline.", "thai": "เธอยื่นเรียงความก่อนกำหนดส่ง"}
{"word": "deadline", "english": "The deadline for the project is next month.", "thai": "กำหนดส่งโครงการคือเดือนหน้า"}
{"word": "deadline", "english": "I need to check the deadline for the job posting.", "thai": "ฉันต้องตรวจสอบกำหนดส่งสำหรับประกาศรับสมัครงาน"}
{"word": "deadline", "english": "The team met the deadline for the report.", "thai": "ทีมสามารถทำตามกำหนดส่งของรายงาน"}
{"word": "deadline", "english": "The deadline for the scholarship is this Friday.", "thai": "กำหนดส่งสำหรับทุนการศึกษาคือวันศุกร์นี้"}
{"word": "deadline", "english": "He’s worried about the project deadline.", "thai": "เขากังวลเกี่ยวกับกำหนดส่งโครงการ"}
{"word": "deadline", "english": "The deadline for the contest is next week.", "thai": "กำหนดส่งสำหรับการแข่งขันคือสัปดาห์หน้า"}
{"word": "diploma", "english": "She proudly hung her diploma on the wall.", "thai": "เธอแขวนใบปริญญาของเธอบนผนังอย่างภูมิใจ"}
{"word": "diploma", "english": "I worked hard for four years to earn my diploma.", "thai": "ฉันทำงานหนักสี่ปีเพื่อให้ได้ใบปริญญา"}
{"word": "diploma", "english": "His diploma in engineering opened many doors.", "thai": "ใบปริญญาด้านวิศวกรรมของเขาทำให้มีโอกาสมากมาย"}
{"word": "diploma", "english": "Do you need a diploma to apply for this job?", "thai": "คุณจำเป็นต้องมีใบปริญญาเพื่อสมัครงานนี้หรือไม่?"}
{"word": "diploma", "english": "She received her diploma with honors.", "thai": "เธอได้รับใบปริญญาด้วยเกียรตินิยม"}
{"word": "diploma", "english": "The diploma ceremony was held outdoors.", "thai": "พิธีมอบใบปริญญาจัดขึ้นกลางแจ้ง"}
{"word": "diploma", "english": "He misplaced his diploma during the move.", "thai": "เขาทำใบปริญญาหายระหว่างย้ายบ้าน"}
{"word": "diploma", "english": "A diploma doesn’t guarantee success.", "thai": "ใบปริญญาไม่รับประกันความสำเร็จ"}
{"word": "diploma", "english": "I’m one semester away from getting my diploma.", "thai": "ฉันเหลืออีกหนึ่งภาคเรียนก็จะได้ใบปริญญา"}
{"word": "diploma", "english": "Her parents framed her diploma for her.", "thai": "พ่อแม่ของเธอใส่กรอบใบปริญญาให้เธอ"}
{"word": "diploma", "english": "He showed me his shiny new diploma.", "thai": "เขาโชว์ใบปริญญาใหม่เอี่ยมให้ฉันดู"}
{"word": "diploma", "english": "The diploma program takes two years.", "thai": "หลักสูตรอนุปริญญาใช้เวลาสองปี"}
{"word": "diploma", "english": "She earned a diploma in graphic design.", "thai": "เธอได้รับใบปริญญาด้านการออกแบบกราฟิก"}
{"word": "diploma", "english": "Is your diploma from an accredited school?", "thai": "ใบปริญญาของคุณมาจากโรงเรียนที่ได้รับการรับรองหรือไม่?"}
{"word": "diploma", "english": "I need to order a copy of my diploma.", "thai": "ฉันต้องสั่งสำเนาใบปริญญาของฉัน"}
{"word": "diploma", "english": "His diploma is in computer science.", "thai": "ใบปริญญาของเขาคือด้านวิทยาการคอมพิวเตอร์"}
{"word": "diploma", "english": "The diploma was handed out by the dean.", "thai": "ใบปริญญาถูกมอบโดยคณบดี"}
{"word": "diploma", "english": "She’s studying to get her diploma online.", "thai": "เธอกำลังเรียนออนไลน์เพื่อรับใบปริญญา"}
{"word": "diploma", "english": "My diploma is my ticket to a better future.", "thai": "ใบปริญญาคือตั๋วสู่ชีวิตที่ดีกว่าของฉัน"}
{"word": "diploma", "english": "He didn’t finish high school but got a diploma later.", "thai": "เขาไม่จบมัธยมปลายแต่ได้รับใบปริญญาในภายหลัง"}
{"word": "diploma", "english": "The diploma arrived in the mail today.", "thai": "ใบปริญญามาถึงทางไปรษณีย์วันนี้"}
{"word": "diploma", "english": "I’m so excited to finally have my diploma!", "thai": "ฉันตื่นเต้นมากที่ในที่สุดก็ได้ใบปริญญา!"}
{"word": "diploma", "english": "Her diploma is from a prestigious university.", "thai": "ใบปริญญาของเธอมาจากมหาวิทยาลัยที่มีชื่อเสียง"}
{"word": "diploma", "english": "He’s framing his diploma for his office.", "thai": "เขากำลังใส่กรอบใบปริญญาสำหรับสำนักงานของเขา"}
{"word": "diploma", "english": "A diploma in nursing is highly valued.", "thai": "ใบปริญญาด้านพยาบาลมีคุณค่าสูง"}
{"word": "diploma", "english": "She cried when she received her diploma.", "thai": "เธอร้องไห้เมื่อได้รับใบปริญญา"}
{"word": "diploma", "english": "The diploma course was very challenging.", "thai": "หลักสูตรอนุปริญญานั้นท้าทายมาก"}
{"word": "diploma", "english": "I lost my diploma in a house fire.", "thai": "ฉันสูญเสียใบปริญญาในเหตุไฟไหม้บ้าน"}
{"word": "diploma", "english": "His diploma helped him land a great job.", "thai": "ใบปริญญาของเขาช่วยให้เขาได้งานดี"}
{"word": "diploma", "english": "She’s pursuing a diploma in business.", "thai": "เธอกำลังเรียนเพื่อรับใบปริญญาด้านธุรกิจ"}
{"word": "diploma", "english": "The diploma was printed with gold lettering.", "thai": "ใบปริญญาถูกพิมพ์ด้วยตัวอักษรสีทอง"}
{"word": "diploma", "english": "I’ll get my diploma next spring.", "thai": "ฉันจะได้รับใบปริญญาในฤดูใบไม้ผลิหน้า"}
{"word": "diploma", "english": "He’s proud of his high school diploma.", "thai": "เขาภูมิใจในใบปริญญามัธยมปลายของเขา"}
{"word": "diploma", "english": "Her diploma is in environmental science.", "thai": "ใบปริญญาของเธอคือด้านวิทยาศาสตร์สิ่งแวดล้อม"}
{"word": "diploma", "english": "The diploma ceremony was unforgettable.", "thai": "พิธีมอบใบปริญญานั้นน่าจดจำ"}
{"word": "diploma", "english": "I need my diploma for the job application.", "thai": "ฉันต้องการใบปริญญาสำหรับการสมัครงาน"}
{"word": "diploma", "english": "She earned her diploma while working full-time.", "thai": "เธอได้รับใบปริญญาขณะทำงานเต็มเวลา"}
{"word": "diploma", "english": "His diploma is displayed in his study.", "thai": "ใบปริญญาของเขาถูกแสดงในห้องทำงาน"}
{"word": "diploma", "english": "The diploma program includes an internship.", "thai": "หลักสูตรอนุปริญญารวมถึงการฝึกงาน"}
{"word": "diploma", "english": "I’m saving up to frame my diploma.", "thai": "ฉันกำลังเก็บเงินเพื่อใส่กรอบใบปริญญา"}
{"word": "diploma", "english": "She showed her diploma to her grandparents.", "thai": "เธอโชว์ใบปริญญาให้ปู่ย่าตายายดู"}
{"word": "diploma", "english": "A diploma is just the beginning.", "thai": "ใบปริญญาเป็นเพียงจุดเริ่มต้น"}
{"word": "diploma", "english": "He received his diploma in the mail.", "thai": "เขาได้รับใบปริญญาทางไปรษณีย์"}
{"word": "diploma", "english": "Her diploma is from a community college.", "thai": "ใบปริญญาของเธอมาจากวิทยาลัยชุมชน"}
{"word": "diploma", "english": "The diploma was awarded posthumously.", "thai": "ใบปริญญาถูกมอบให้หลังมรณกรรม"}
{"word": "diploma", "english": "I’m halfway through my diploma program.", "thai": "ฉันเรียนหลักสูตรอนุปริญญามาครึ่งทางแล้ว"}
{"word": "diploma", "english": "His diploma is in mechanical engineering.", "thai": "ใบปริญญาของเขาคือด้านวิศวกรรมเครื่องกล"}
{"word": "diploma", "english": "She’s excited to walk for her diploma.", "thai": "เธอตื่นเต้นที่จะเดินรับใบปริญญา"}
{"word": "diploma", "english": "The diploma was signed by the president.", "thai": "ใบปริญญาถูกเซ็นโดยประธาน"}
{"word": "diploma", "english": "I need to verify my diploma for the employer.", "thai": "ฉันต้องยืนยันใบปริญญาสำหรับนายจ้าง"}
{"word": "diploma", "english": "Her diploma is in early childhood education.", "thai": "ใบปริญญาของเธอคือด้านการศึกษาปฐมวัย"}
{"word": "diploma", "english": "He earned a diploma in culinary arts.", "thai": "เขาได้รับใบปริญญาด้านศิลปะการทำอาหาร"}
{"word": "diploma", "english": "The diploma came with a fancy case.", "thai": "ใบปริญญามาพร้อมกล่องสวยงาม"}
{"word": "diploma", "english": "She’s applying for jobs with her diploma.", "thai": "เธอกำลังสมัครงานด้วยใบปริญญาของเธอ"}
{"word": "diploma", "english": "His diploma is from an Ivy League school.", "thai": "ใบปริญญาของเขามาจากโรงเรียนในกลุ่มไอวีลีก"}
{"word": "diploma", "english": "I’m proud of my associate’s diploma.", "thai": "ฉันภูมิใจในใบปริญญาอนุปริญญาของฉัน"}
{"word": "diploma", "english": "The diploma was delayed due to paperwork.", "thai": "ใบปริญญาล่าช้าเพราะเอกสาร"}
{"word": "diploma", "english": "She’s studying for a postgraduate diploma.", "thai": "เธอกำลังเรียนเพื่อรับใบปริญญาโท"}
{"word": "diploma", "english": "His diploma hangs above his desk.", "thai": "ใบปริญญาของเขแขวนอยู่เหนือโต๊ะทำงาน"}
{"word": "diploma", "english": "I’m enrolling in a diploma course.", "thai": "ฉันกำลังสมัครเรียนหลักสูตรอนุปริญญา"}
{"word": "diploma", "english": "The diploma is proof of her hard work.", "thai": "ใบปริญญาคือหลักฐานของความพยายามของเธอ"}
{"word": "diploma", "english": "He’s getting his diploma this weekend.", "thai": "เขาจะได้รับใบปริญญาในสุดสัปดาห์นี้"}
{"word": "diploma", "english": "Her diploma is in public health.", "thai": "ใบปริญญาของเธอคือด้านสาธารณสุข"}
{"word": "diploma", "english": "I need to scan my diploma for the application.", "thai": "ฉันต้องสแกนใบปริญญาสำหรับการสมัคร"}
{"word": "diploma", "english": "The diploma was earned through night classes.", "thai": "ใบปริญญาได้มาจากการเรียนตอนกลางคืน"}
{"word": "diploma", "english": "His diploma is in electrical engineering.", "thai": "ใบปริญญาของเขาคือด้านวิศวกรรมไฟฟ้า"}
{"word": "diploma", "english": "She’s framing her diploma with a custom mat.", "thai": "เธอกำลังใส่กรอบใบปริญญาด้วยแผ่นรองที่สั่งทำ"}
{"word": "diploma", "english": "The diploma program was fully funded.", "thai": "หลักสูตรอนุปริญญาได้รับทุนเต็มจำนวน"}
{"word": "diploma", "english": "I’m waiting for my diploma to arrive.", "thai": "ฉันกำลังรอใบปริญญามาถึง"}
{"word": "diploma", "english": "Her diploma is in fashion design.", "thai": "ใบปริญญาของเธอคือด้านการออกแบบแฟชั่น"}
{"word": "diploma", "english": "He’s applying for a master’s with his diploma.", "thai": "เขากำลังสมัครเรียนปริญญาโทด้วยใบปริญญาของเขา"}
{"word": "diploma", "english": "The diploma was presented at commencement.", "thai": "ใบปริญญาถูกมอบในพิธีจบการศึกษา"}
{"word": "diploma", "english": "I earned my diploma in record time.", "thai": "ฉันได้รับใบปริญญาในเวลาที่เร็วมาก"}
{"word": "diploma", "english": "Her diploma is from a trade school.", "thai": "ใบปริญญาของเธอมาจากโรงเรียนฝึกอาชีพ"}
{"word": "diploma", "english": "The diploma is a symbol of achievement.", "thai": "ใบปริญญาคือสัญลักษณ์ของความสำเร็จ"}
{"word": "diploma", "english": "He’s laminating his diploma for protection.", "thai": "เขากำลังเคลือบใบปริญญาเพื่อป้องกัน"}
{"word": "diploma", "english": "She’s pursuing a diploma in psychology.", "thai": "เธอกำลังเรียนเพื่อรับใบปริญญาด้านจิตวิทยา"}
{"word": "diploma", "english": "The diploma was earned with sacrifices.", "thai": "ใบปริญญาได้มาด้วยการเสียสละ"}
{"word": "diploma", "english": "I’m picking up my diploma tomorrow.", "thai": "ฉันจะไปรับใบปริญญาพรุ่งนี้"}
{"word": "diploma", "english": "His diploma is in civil engineering.", "thai": "ใบปริญญาของเขาคือด้านวิศวกรรมโยธา"}
{"word": "diploma", "english": "She’s proud of her vocational diploma.", "thai": "เธอภูมิใจในใบปริญญาอาชีวศึกษาของเธอ"}
{"word": "diploma", "english": "The diploma was mailed to the wrong address.", "thai": "ใบปริญญาถูกส่งไปยังที่อยู่ผิด"}
{"word": "diploma", "english": "I’m upgrading my diploma to a degree.", "thai": "ฉันกำลังอัพเกรดใบปริญญาอนุปริญญาเป็นปริญญาตรี"}
{"word": "diploma", "english": "Her diploma is in hospitality management.", "thai": "ใบปริญญาของเธอคือด้านการจัดการโรงแรม"}
{"word": "diploma", "english": "He’s displaying his diploma at work.", "thai": "เขาแสดงใบปริญญาที่ทำงาน"}
{"word": "diploma", "english": "The diploma program was hands-on.", "thai": "หลักสูตรอนุปริญญาเน้นปฏิบัติ"}
{"word": "diploma", "english": "I’m thrilled to have my diploma!", "thai": "ฉันดีใจมากที่มีใบปริญญา!"}
{"word": "diploma", "english": "Her diploma is in interior design.", "thai": "ใบปริญญาของเธอคือด้านการออกแบบภายใน"}
{"word": "diploma", "english": "He’s using his diploma to start a business.", "thai": "เขาใช้ใบปริญญาเพื่อเริ่มต้นธุรกิจ"}
{"word": "diploma", "english": "The diploma was a family milestone.", "thai": "ใบปริญญาคือก้าวสำคัญของครอบครัว"}
{"word": "diploma", "english": "She’s translating her diploma for overseas work.", "thai": "เธอกำลังแปลใบปริญญาสำหรับงานต่างประเทศ"}
{"word": "diploma", "english": "His diploma is in data science.", "thai": "ใบปริญญาของเขาคือด้านวิทยาศาสตร์ข้อมูล"}
{"word": "diploma", "english": "I’m celebrating my diploma with friends.", "thai": "ฉันกำลังฉลองใบปริญญากับเพื่อนๆ"}
{"word": "diploma", "english": "The diploma was hard-earned.", "thai": "ใบปริญญานั้นได้มาด้วยความยากลำบาก"}
{"word": "diploma", "english": "She’s adding her diploma to her resume.", "thai": "เธอกำลังเพิ่มใบปริญญาลงในเรซูเม่"}
{"word": "diploma", "english": "His diploma is from a technical institute.", "thai": "ใบปริญญาของเขามาจากสถาบันเทคนิค"}
{"word": "diploma", "english": "I’m framing my diploma this weekend.", "thai": "ฉันจะใส่กรอบใบปริญญาในสุดสัปดาห์นี้"}
{"word": "diploma", "english": "Her diploma is in social work.", "thai": "ใบปริญญาของเธอคือด้านงานสังคมสงเคราะห์"}
{"word": "diploma", "english": "The diploma marked a new chapter.", "thai": "ใบปริญญาคือจุดเริ่มต้นของบทใหม่"}
{"word": "discipline", "english": "She showed great discipline in her studies.", "thai": "เธอแสดงวินัยที่ยอดเยี่ยมในการเรียน"}
{"word": "discipline", "english": "Discipline is key to achieving your goals.", "thai": "วินัยคือกุญแจสู่ความสำเร็จของเป้าหมาย"}
{"word": "discipline", "english": "He lacks the discipline to stick to a diet.", "thai": "เขาขาดวินัยในการยึดมั่นกับการควบคุมอาหาร"}
{"word": "discipline", "english": "The coach demands discipline from the team.", "thai": "โค้ชเรียกร้องวินัยจากทีม"}
{"word": "discipline", "english": "Her discipline helped her finish the project early.", "thai": "วินัยของเธอช่วยให้เธอทำโปรเจกต์เสร็จก่อนกำหนด"}
{"word": "discipline", "english": "I need more discipline to wake up early.", "thai": "ฉันต้องการวินัยมากขึ้นเพื่อตื่นเช้า"}
{"word": "discipline", "english": "Discipline in the classroom is essential.", "thai": "วินัยในห้องเรียนเป็นสิ่งจำเป็น"}
{"word": "discipline", "english": "He’s studying the discipline of psychology.", "thai": "เขากำลังเรียนสาขาวิชาจิตวิทยา"}
{"word": "discipline", "english": "The military teaches strict discipline.", "thai": "กองทัพสอนวินัยที่เข้มงวด"}
{"word": "discipline", "english": "She’s trying to discipline her spending habits.", "thai": "เธอกำลังพยายามควบคุมวินัยในการใช้จ่าย"}
{"word": "discipline", "english": "Discipline is what separates winners from losers.", "thai": "วินัยคือสิ่งที่แยกผู้ชนะออกจากผู้แพ้"}
{"word": "discipline", "english": "The teacher used discipline to manage the class.", "thai": "ครูใช้วินัยในการจัดการชั้นเรียน"}
{"word": "discipline", "english": "He’s known for his discipline at work.", "thai": "เขามีชื่อเสียงด้านวินัยในการทำงาน"}
{"word": "discipline", "english": "Discipline helped her master the piano.", "thai": "วินัยช่วยให้เธอเชี่ยวชาญเปียโน"}
{"word": "discipline", "english": "I admire her discipline in exercising daily.", "thai": "ฉันชื่นชมวินัยของเธอในการออกกำลังกายทุกวัน"}
{"word": "discipline", "english": "The discipline of meditation changed his life.", "thai": "วินัยในการนั่งสมาธิเปลี่ยนชีวิตของเขา"}
{"word": "discipline", "english": "They enforce discipline in the workplace.", "thai": "พวกเขาบังคับใช้วินัยในที่ทำงาน"}
{"word": "discipline", "english": "She’s teaching her kids the value of discipline.", "thai": "เธอกำลังสอนลูกๆ ถึงคุณค่าของวินัย"}
{"word": "discipline", "english": "His discipline in training paid off.", "thai": "วินัยในการฝึกซ้อมของเขาคุ้มค่า"}
{"word": "discipline", "english": "Discipline is hard but worth it.", "thai": "วินัยนั้นยากแต่คุ้มค่า"}
{"word": "discipline", "english": "The school has a strict discipline policy.", "thai": "โรงเรียนมีนโยบายวินัยที่เข้มงวด"}
{"word": "discipline", "english": "He’s exploring the discipline of data science.", "thai": "เขากำลังสำรวจสาขาวิชาวิทยาศาสตร์ข้อมูล"}
{"word": "discipline", "english": "Discipline kept her focused during exams.", "thai": "วินัยทำให้เธอมีสมาธิระหว่างสอบ"}
{"word": "discipline", "english": "I need to discipline myself to save money.", "thai": "ฉันต้องควบคุมตัวเองให้มีวินัยในการออมเงิน"}
{"word": "discipline", "english": "Her discipline in time management is impressive.", "thai": "วินัยในการบริหารเวลาของเธอน่าประทับใจ"}
{"word": "discipline", "english": "The martial arts class teaches discipline.", "thai": "ชั้นเรียนศิลปะการต่อสู้สอนวินัย"}
{"word": "discipline", "english": "Discipline is the foundation of success.", "thai": "วินัยคือรากฐานของความสำเร็จ"}
{"word": "discipline", "english": "He struggled with discipline as a teenager.", "thai": "เขามีปัญหากับวินัยเมื่อเป็นวัยรุ่น"}
{"word": "discipline", "english": "The discipline of writing requires consistency.", "thai": "วินัยในการเขียนต้องมีความสม่ำเสมอ"}
{"word": "discipline", "english": "She’s known for her academic discipline.", "thai": "เธอมีชื่อเสียงด้านวินัยทางการศึกษา"}
{"word": "discipline", "english": "Discipline helped him overcome challenges.", "thai": "วินัยช่วยให้เขาผ่านพ้นความท้าทาย"}
{"word": "discipline", "english": "The team needs more discipline to win.", "thai": "ทีมต้องการวินัยมากขึ้นเพื่อชนะ"}
{"word": "discipline", "english": "I’m learning the discipline of coding.", "thai": "ฉันกำลังเรียนรู้วินัยในการเขียนโค้ด"}
{"word": "discipline", "english": "Her discipline in studying earned her a scholarship.", "thai": "วินัยในการเรียนของเธอทำให้ได้ทุนการศึกษา"}
{"word": "discipline", "english": "Discipline is crucial in professional sports.", "thai": "วินัยเป็นสิ่งสำคัญในกีฬาอาชีพ"}
{"word": "discipline", "english": "He’s working on his self-discipline.", "thai": "เขากำลังพัฒนาวินัยในตนเอง"}
{"word": "discipline", "english": "The discipline of yoga improved her focus.", "thai": "วินัยในการฝึกโยคะช่วยเพิ่มสมาธิของเธอ"}
{"word": "discipline", "english": "They discussed discipline at the parent meeting.", "thai": "พวกเขาคุยเรื่องวินัยในการประชุมผู้ปกครอง"}
{"word": "discipline", "english": "Discipline is what drives progress.", "thai": "วินัยคือสิ่งที่ขับเคลื่อนความก้าวหน้า"}
{"word": "discipline", "english": "She’s mastering the discipline of public speaking.", "thai": "เธอกำลังเชี่ยวชาญวินัยในการพูดในที่สาธารณะ"}
{"word": "discipline", "english": "The manager enforces workplace discipline.", "thai": "ผู้จัดการบังคับใช้วินัยในที่ทำงาน"}
{"word": "discipline", "english": "Discipline helped her stay calm under pressure.", "thai": "วินัยช่วยให้เธอสงบภายใต้ความกดดัน"}
{"word": "discipline", "english": "He’s teaching his dog some discipline.", "thai": "เขากำลังสอนวินัยให้สุนัขของเขา"}
{"word": "discipline", "english": "The discipline of science fascinates her.", "thai": "วินัยทางวิทยาศาสตร์ทำให้เธอหลงใหล"}
{"word": "discipline", "english": "I need discipline to finish this book.", "thai": "ฉันต้องการวินัยเพื่ออ่านหนังสือเล่มนี้ให้จบ"}
{"word": "discipline", "english": "Her discipline in budgeting saved her money.", "thai": "วินัยในการจัดงบประมาณช่วยเธอประหยัดเงิน"}
{"word": "discipline", "english": "Discipline is taught through routine.", "thai": "วินัยถูกสอนผ่านกิจวัตร"}
{"word": "discipline", "english": "He’s studying the discipline of economics.", "thai": "เขากำลังเรียนสาขาวิชาเศรษฐศาสตร์"}
{"word": "discipline", "english": "The kids need more discipline at home.", "thai": "เด็กๆ ต้องการวินัยมากขึ้นที่บ้าน"}
{"word": "discipline", "english": "Discipline made her a better athlete.", "thai": "วินัยทำให้เธอเป็นนักกีฬาที่ดีขึ้น"}
{"word": "discipline", "english": "I’m trying to instill discipline in my routine.", "thai": "ฉันพยายามปลูกฝังวินัยในกิจวัตรของฉัน"}
{"word": "discipline", "english": "The discipline of history requires research.", "thai": "วินัยทางประวัติศาสตร์ต้องมีการวิจัย"}
{"word": "discipline", "english": "She’s admired for her mental discipline.", "thai": "เธอได้รับการชื่นชมในวินัยทางจิตใจ"}
{"word": "discipline", "english": "Discipline is vital in emergency situations.", "thai": "วินัยสำคัญมากในสถานการณ์ฉุกเฉิน"}
{"word": "discipline", "english": "He’s learning discipline through martial arts.", "thai": "เขากำลังเรียนรู้วินัยผ่านศิลปะการต่อสู้"}
{"word": "discipline", "english": "The discipline of engineering is rigorous.", "thai": "วินัยทางวิศวกรรมนั้นเข้มงวด"}
{"word": "discipline", "english": "Her discipline in saving paid off.", "thai": "วินัยในการออมเงินของเธอได้ผล"}
{"word": "discipline", "english": "Discipline is the backbone of any organization.", "thai": "วินัยคือกระดูกสันหลังขององค์กรใดๆ"}
{"word": "discipline", "english": "I need to work on my discipline with social media.", "thai": "ฉันต้องพัฒนาวินัยในการใช้โซเชียลมีเดีย"}
{"word": "discipline", "english": "The discipline of dance requires dedication.", "thai": "วินัยในการเต้นต้องมีความทุ่มเท"}
{"word": "discipline", "english": "He’s known for his financial discipline.", "thai": "เขามีชื่อเสียงด้านวินัยทางการเงิน"}
{"word": "discipline", "english": "Discipline helped her pass the bar exam.", "thai": "วินัยช่วยให้เธอสอบผ่านเนติบัณฑิต"}
{"word": "discipline", "english": "The team showed discipline during practice.", "thai": "ทีมแสดงวินัยระหว่างการฝึกซ้อม"}
{"word": "discipline", "english": "She’s exploring the discipline of sociology.", "thai": "เธอกำลังสำรวจสาขาวิชาสังคมวิทยา"}
{"word": "discipline", "english": "Discipline is what builds character.", "thai": "วินัยคือสิ่งที่สร้างตัวตน"}
{"word": "discipline", "english": "I’m working on my discipline with deadlines.", "thai": "ฉันกำลังพัฒนาวินัยเกี่ยวกับกำหนดเวลา"}
{"word": "discipline", "english": "The discipline of medicine is demanding.", "thai": "วินัยทางการแพทย์นั้นต้องใช้ความพยายาม"}
{"word": "discipline", "english": "Her discipline in studying inspired others.", "thai": "วินัยในการเรียนของเธอสร้างแรงบันดาลใจให้ผู้อื่น"}
{"word": "discipline", "english": "Discipline is taught through example.", "thai": "วินัยถูกสอนผ่านตัวอย่าง"}
{"word": "discipline", "english": "He needs more discipline with his schedule.", "thai": "เขาต้องการวินัยมากขึ้นกับตารางเวลา"}
{"word": "discipline", "english": "The discipline of art requires creativity.", "thai": "วินัยทางศิลปะต้องใช้ความคิดสร้างสรรค์"}
{"word": "discipline", "english": "She’s building discipline through daily habits.", "thai": "เธอกำลังสร้างวินัยผ่านนิสัยประจำวัน"}
{"word": "discipline", "english": "Discipline is essential for long-term goals.", "thai": "วินัยจำเป็นสำหรับเป้าหมายระยะยาว"}
{"word": "discipline", "english": "He’s learning discipline in the gym.", "thai": "เขากำลังเรียนรู้วินัยในยิม"}
{"word": "discipline", "english": "The discipline of law requires precision.", "thai": "วินัยทางกฎหมายต้องใช้ความแม่นยำ"}
{"word": "discipline", "english": "Her discipline in parenting is admirable.", "thai": "วินัยในการเลี้ยงลูกของเธอน่าชื่นชม"}
{"word": "discipline", "english": "Discipline helped him stay productive.", "thai": "วินัยช่วยให้เขามีประสิทธิผล"}
{"word": "discipline", "english": "The school emphasizes academic discipline.", "thai": "โรงเรียนเน้นวินัยทางการศึกษา"}
{"word": "discipline", "english": "I’m struggling with discipline in my diet.", "thai": "ฉันกำลังมีปัญหากับวินัยในเรื่องอาหาร"}
{"word": "discipline", "english": "The discipline of philosophy is thought-provoking.", "thai": "วินัยทางปรัชญานั้นกระตุ้นความคิด"}
{"word": "discipline", "english": "She’s teaching discipline through sports.", "thai": "เธอกำลังสอนวินัยผ่านกีฬา"}
{"word": "discipline", "english": "Discipline is what keeps us on track.", "thai": "วินัยคือสิ่งที่ทำให้เราอยู่ในร่องในรอย"}
{"word": "discipline", "english": "He’s improving his discipline with meditation.", "thai": "เขากำลังพัฒนาวินัยด้วยการนั่งสมาธิ"}
{"word": "discipline", "english": "The discipline of physics is fascinating.", "thai": "วินัยทางฟิสิกส์นั้นน่าสนใจ"}
{"word": "discipline", "english": "Her discipline in saving is inspiring.", "thai": "วินัยในการออมเงินของเธอน่าแรงบันดาลใจ"}
{"word": "discipline", "english": "Discipline is the key to consistency.", "thai": "วินัยคือกุญแจสู่ความสม่ำเสมอ"}
{"word": "discipline", "english": "He’s working on discipline in his studies.", "thai": "เขากำลังพัฒนาวินัยในการเรียน"}
{"word": "discipline", "english": "The discipline of music requires practice.", "thai": "วินัยทางดนตรีต้องมีการฝึกฝน"}
{"word": "discipline", "english": "She’s known for her strict discipline.", "thai": "เธอมีชื่อเสียงด้านวินัยที่เข้มงวด"}
{"word": "discipline", "english": "Discipline helps you stay focused.", "thai": "วินัยช่วยให้คุณมีสมาธิ"}
{"word": "discipline", "english": "I need discipline to avoid distractions.", "thai": "ฉันต้องการวินัยเพื่อหลีกเลี่ยงสิ่งรบกวน"}
{"word": "discipline", "english": "The discipline of architecture is complex.", "thai": "วินัยทางสถาปัตยกรรมนั้นซับซ้อน"}
{"word": "discipline", "english": "Her discipline in running is amazing.", "thai": "วินัยในการวิ่งของเธอน่าทึ่ง"}
{"word": "discipline", "english": "Discipline is learned through effort.", "thai": "วินัยถูกเรียนรู้ผ่านความพยายาม"}
{"word": "discipline", "english": "He’s building discipline in his work ethic.", "thai": "เขากำลังสร้างวินัยในจรรยาบรรณการทำงาน"}
{"word": "discipline", "english": "The discipline of biology is her passion.", "thai": "วินัยทางชีววิทยาคือความหลงใหลของเธอ"}
{"word": "discipline", "english": "Discipline is what makes habits stick.", "thai": "วินัยคือสิ่งที่ทำให้เกิดนิสัย"}
{"word": "discipline", "english": "She’s instilling discipline in her students.", "thai": "เธอกำลังปลูกฝังวินัยในนักเรียนของเธอ"}
{"word": "discipline", "english": "The discipline of coding takes patience.", "thai": "วินัยในการเขียนโค้ดต้องใช้ความอดทน"}
{"word": "discipline", "english": "His discipline in fitness is inspiring.", "thai": "วินัยด้านฟิตเนสของเขาน่าแรงบันดาลใจ"}
{"word": "discussion", "english": "The meeting ended with a heated discussion.", "thai": "การประชุมจบลงด้วยการถกเถียงอย่างเผ็ดร้อน"}
{"word": "discussion", "english": "Let’s have a discussion about your project.", "thai": "มาคุยกันเกี่ยวกับโปรเจกต์ของคุณเถอะ"}
{"word": "discussion", "english": "The discussion in class was very engaging.", "thai": "การสนทนาในชั้นเรียนน่าสนใจมาก"}
{"word": "discussion", "english": "She led the discussion on climate change.", "thai": "เธอนำการสนทนาเกี่ยวกับการเปลี่ยนแปลงสภาพภูมิอากาศ"}
{"word": "discussion", "english": "We need a discussion to resolve this issue.", "thai": "เราต้องการการสนทนาเพื่อแก้ไขปัญหานี้"}
{"word": "discussion", "english": "The discussion lasted over two hours.", "thai": "การสนทนาดำเนินไปกว่าสองชั่วโมง"}
{"word": "discussion", "english": "He avoided the discussion about his grades.", "thai": "เขาเลี่ยงการสนทนาเกี่ยวกับเกรดของเขา"}
{"word": "discussion", "english": "The discussion was about budget cuts.", "thai": "การสนทนาเกี่ยวกับการตัดงบประมาณ"}
{"word": "discussion", "english": "I enjoyed the discussion at the book club.", "thai": "ฉันสนุกกับการสนทนาที่ชมรมหนังสือ"}
{"word": "discussion", "english": "The discussion got a bit off-topic.", "thai": "การสนทนาเริ่มออกนอกประเด็น"}
{"word": "discussion", "english": "She initiated a discussion on diversity.", "thai": "เธอเริ่มการสนทนาเกี่ยวกับความหลากหลาย"}
{"word": "discussion", "english": "The discussion helped clarify our goals.", "thai": "การสนทนาช่วยให้เป้าหมายของเราชัดเจนขึ้น"}
{"word": "discussion", "english": "We had a discussion about the new policy.", "thai": "เราคุยกันเกี่ยวกับนโยบายใหม่"}
{"word": "discussion", "english": "The discussion was productive and insightful.", "thai": "การสนทนามีประสิทธิผลและให้มุมมองใหม่"}
{"word": "discussion", "english": "He joined the discussion late but contributed well.", "thai": "เขาเข้าร่วมการสนทนาช้าแต่มีส่วนร่วมได้ดี"}
{"word": "discussion", "english": "The discussion focused on team dynamics.", "thai": "การสนทนาเน้นเรื่องพลวัตของทีม"}
{"word": "discussion", "english": "I’m looking forward to our discussion tomorrow.", "thai": "ฉันตั้งตารอการสนทนาของเราพรุ่งนี้"}
{"word": "discussion", "english": "The discussion turned into an argument.", "thai": "การสนทนากลายเป็นการโต้แย้ง"}
{"word": "discussion", "english": "She summarized the discussion for the group.", "thai": "เธอสรุปการสนทนาให้กลุ่มฟัง"}
{"word": "discussion", "english": "The discussion was open and honest.", "thai": "การสนทนาเป็นไปอย่างเปิดเผยและซื่อสัตย์"}
{"word": "discussion", "english": "We need to schedule a discussion soon.", "thai": "เราต้องกำหนดเวลาการสนทนาเร็วๆ นี้"}
{"word": "discussion", "english": "The discussion covered several key points.", "thai": "การสนทนาครอบคลุมประเด็นสำคัญหลายข้อ"}
{"word": "discussion", "english": "He dominated the discussion with his ideas.", "thai": "เขาครอบงำการสนทนาด้วยความคิดของเขา"}
{"word": "discussion", "english": "The discussion was recorded for reference.", "thai": "การสนทนาถูกบันทึกไว้เพื่ออ้างอิง"}
{"word": "discussion", "english": "She prepared notes for the discussion.", "thai": "เธอเตรียมบันทึกสำหรับการสนทนา"}
{"word": "discussion", "english": "The discussion sparked new ideas.", "thai": "การสนทนาก่อให้เกิดแนวคิดใหม่"}
{"word": "discussion", "english": "I wasn’t part of that discussion.", "thai": "ฉันไม่ได้เข้าร่วมการสนทนานั้น"}
{"word": "discussion", "english": "The discussion was about workplace safety.", "thai": "การสนทนาเกี่ยวกับความปลอดภัยในที่ทำงาน"}
{"word": "discussion", "english": "He raised a point during the discussion.", "thai": "เขาเสนอประเด็นหนึ่งในระหว่างการสนทนา"}
{"word": "discussion", "english": "The discussion helped us reach a consensus.", "thai": "การสนทนาช่วยให้เราบรรลุข้อตกลง"}
{"word": "discussion", "english": "She facilitated the discussion smoothly.", "thai": "เธอจัดการการสนทนาได้อย่างราบรื่น"}
{"word": "discussion", "english": "The discussion was held over Zoom.", "thai": "การสนทนาจัดขึ้นผ่าน Zoom"}
{"word": "discussion", "english": "We had a lively discussion about politics.", "thai": "เรามีการสนทนาที่มีชีวิตชีวาเกี่ยวกับการเมือง"}
{"word": "discussion", "english": "The discussion went longer than expected.", "thai": "การสนทนาดำเนินไปนานกว่าที่คาด"}
{"word": "discussion", "english": "He contributed little to the discussion.", "thai": "เขามีส่วนร่วมน้อยในการสนทนา"}
{"word": "discussion", "english": "The discussion was about future plans.", "thai": "การสนทนาเกี่ยวกับแผนการในอนาคต"}
{"word": "discussion", "english": "I missed the discussion due to a conflict.", "thai": "ฉันพลาดการสนทนาเพราะตารางขัดแย้ง"}
{"word": "discussion", "english": "The discussion centered on budget allocation.", "thai": "การสนทนาเน้นเรื่องการจัดสรรงบประมาณ"}
{"word": "discussion", "english": "She encouraged open discussion in the meeting.", "thai": "เธอส่งเสริมการสนทนาแบบเปิดในที่ประชุม"}
{"word": "discussion", "english": "The discussion was very thought-provoking.", "thai": "การสนทนานั้นกระตุ้นความคิดมาก"}
{"word": "discussion", "english": "We had a discussion about the new schedule.", "thai": "เราคุยกันเกี่ยวกับตารางเวลาใหม่"}
{"word": "discussion", "english": "The discussion included diverse perspectives.", "thai": "การสนทนารวมมุมมองที่หลากหลาย"}
{"word": "discussion", "english": "He steered the discussion back on track.", "thai": "เขานำการสนทนากลับมาในประเด็น"}
{"word": "discussion", "english": "The discussion was about employee benefits.", "thai": "การสนทนาเกี่ยวกับสวัสดิการพนักงาน"}
{"word": "discussion", "english": "She took notes during the discussion.", "thai": "เธอบันทึกในระหว่างการสนทนา"}
{"word": "discussion", "english": "The discussion led to a breakthrough.", "thai": "การสนทนานำไปสู่ความก้าวหน้า"}
{"word": "discussion", "english": "I’m preparing for tomorrow’s discussion.", "thai": "ฉันกำลังเตรียมตัวสำหรับการสนทนาพรุ่งนี้"}
{"word": "discussion", "english": "The discussion was interrupted by a call.", "thai": "การสนทนาถูกขัดจังหวะด้วยโทรศัพท์"}
{"word": "discussion", "english": "We need a discussion on project timelines.", "thai": "เราต้องการการสนทนาเกี่ยวกับไทม์ไลน์ของโปรเจกต์"}
{"word": "discussion", "english": "The discussion was about ethical practices.", "thai": "การสนทนาเกี่ยวกับแนวปฏิบัติด้านจริยธรรม"}
{"word": "discussion", "english": "He left the discussion feeling frustrated.", "thai": "เขาออกจากการสนทนาด้วยความหงุดหงิด"}
{"word": "discussion", "english": "The discussion was part of the workshop.", "thai": "การสนทนาเป็นส่วนหนึ่งของเวิร์กช็อป"}
{"word": "discussion", "english": "She brought data to the discussion.", "thai": "เธอนำข้อมูลมาในการสนทนา"}
{"word": "discussion", "english": "The discussion helped us understand the issue.", "thai": "การสนทนาช่วยให้เราเข้าใจปัญหา"}
{"word": "discussion", "english": "We had a discussion about remote work.", "thai": "เราคุยกันเกี่ยวกับการทำงานจากระยะไกล"}
{"word": "discussion", "english": "The discussion was lively and productive.", "thai": "การสนทนามีชีวิตชีวาและมีประสิทธิผล"}
{"word": "discussion", "english": "He avoided joining the discussion.", "thai": "เขาเลี่ยงการเข้าร่วมการสนทนา"}
{"word": "discussion", "english": "The discussion was about sustainability.", "thai": "การสนทนาเกี่ยวกับความยั่งยืน"}
{"word": "discussion", "english": "She moderated the discussion effectively.", "thai": "เธอดำเนินการสนทนาได้อย่างมีประสิทธิภาพ"}
{"word": "discussion", "english": "The discussion took place in the boardroom.", "thai": "การสนทนาจัดขึ้นในห้องประชุม"}
{"word": "discussion", "english": "I contributed to the discussion on strategy.", "thai": "ฉันมีส่วนร่วมในการสนทนาเกี่ยวกับกลยุทธ์"}
{"word": "discussion", "english": "The discussion was about team collaboration.", "thai": "การสนทนาเกี่ยวกับการทำงานร่วมกันของทีม"}
{"word": "discussion", "english": "We had a discussion over lunch.", "thai": "เราคุยกันระหว่างมื้อเที่ยง"}
{"word": "discussion", "english": "The discussion was about new hires.", "thai": "การสนทนาเกี่ยวกับพนักงานใหม่"}
{"word": "discussion", "english": "She closed the discussion with key points.", "thai": "เธอปิดการสนทนาด้วยประเด็นสำคัญ"}
{"word": "discussion", "english": "The discussion was held in private.", "thai": "การสนทนาจัดขึ้นแบบส่วนตัว"}
{"word": "discussion", "english": "I enjoyed the discussion on technology.", "thai": "ฉันสนุกกับการสนทนาเกี่ยวกับเทคโนโลยี"}
{"word": "discussion", "english": "The discussion resolved our concerns.", "thai": "การสนทนาแก้ไขข้อกังวลของเรา"}
{"word": "discussion", "english": "He led the discussion on marketing.", "thai": "เขานำการสนทนาเกี่ยวกับการตลาด"}
{"word": "discussion", "english": "The discussion was about cost savings.", "thai": "การสนทนาเกี่ยวกับการประหยัดค่าใช้จ่าย"}
{"word": "discussion", "english": "She participated actively in the discussion.", "thai": "เธอมีส่วนร่วมอย่างแข็งขันในการสนทนา"}
{"word": "discussion", "english": "The discussion was about innovation.", "thai": "การสนทนาเกี่ยวกับนวัตกรรม"}
{"word": "discussion", "english": "We need a discussion on resource allocation.", "thai": "เราต้องการการสนทนาเกี่ยวกับการจัดสรรทรัพยากร"}
{"word": "discussion", "english": "The discussion inspired new solutions.", "thai": "การสนทนากระตุ้นแนวทางแก้ไขใหม่"}
{"word": "discussion", "english": "He recorded the discussion for the team.", "thai": "เขาบันทึกการสนทนาสำหรับทีม"}
{"word": "discussion", "english": "The discussion was about project risks.", "thai": "การสนทนาเกี่ยวกับความเสี่ยงของโปรเจกต์"}
{"word": "discussion", "english": "She opened the discussion with a question.", "thai": "เธอเริ่มการสนทนาด้วยคำถาม"}
{"word": "discussion", "english": "The discussion was about employee morale.", "thai": "การสนทนาเกี่ยวกับขวัญกำลังใจของพนักงาน"}
{"word": "discussion", "english": "We had a discussion on social media trends.", "thai": "เราคุยกันเกี่ยวกับแนวโน้มโซเชียลมีเดีย"}
{"word": "discussion", "english": "The discussion was about customer feedback.", "thai": "การสนทนาเกี่ยวกับข้อเสนอแนะจากลูกค้า"}
{"word": "discussion", "english": "He summarized the discussion in an email.", "thai": "เขาสรุปการสนทนาในอีเมล"}
{"word": "discussion", "english": "The discussion was about data privacy.", "thai": "การสนทนาเกี่ยวกับความเป็นส่วนตัวของข้อมูล"}
{"word": "discussion", "english": "She guided the discussion toward solutions.", "thai": "เธอนำการสนทนาไปสู่แนวทางแก้ไข"}
{"word": "discussion", "english": "The discussion was about workplace culture.", "thai": "การสนทนาเกี่ยวกับวัฒนธรรมในที่ทำงาน"}
{"word": "discussion", "english": "I learned a lot from the discussion.", "thai": "ฉันเรียนรู้มากจากการสนทนา"}
{"word": "discussion", "english": "The discussion was about training programs.", "thai": "การสนทนาเกี่ยวกับโปรแกรมการฝึกอบรม"}
{"word": "discussion", "english": "He avoided the discussion on budgets.", "thai": "เขาเลี่ยงการสนทนาเกี่ยวกับงบประมาณ"}
{"word": "discussion", "english": "The discussion was about product development.", "thai": "การสนทนาเกี่ยวกับการพัฒนาผลิตภัณฑ์"}
{"word": "discussion", "english": "She contributed valuable ideas to the discussion.", "thai": "เธอมีส่วนร่วมด้วยแนวคิดที่มีค่าในการสนทนา"}
{"word": "discussion", "english": "The discussion was about risk management.", "thai": "การสนทนาเกี่ยวกับการบริหารความเสี่ยง"}
{"word": "discussion", "english": "We had a discussion about team goals.", "thai": "เราคุยกันเกี่ยวกับเป้าหมายของทีม"}
{"word": "discussion", "english": "The discussion was about new software.", "thai": "การสนทนาเกี่ยวกับซอฟต์แวร์ใหม่"}
{"word": "discussion", "english": "He brought humor to the discussion.", "thai": "เขานำความตลกมาในการสนทนา"}
{"word": "discussion", "english": "The discussion was about company growth.", "thai": "การสนทนาเกี่ยวกับการเติบโตของบริษัท"}
{"word": "discussion", "english": "She kept the discussion on schedule.", "thai": "เธอรักษาการสนทนาให้อยู่ในกำหนดเวลา"}
{"word": "discussion", "english": "The discussion was about performance reviews.", "thai": "การสนทนาเกี่ยวกับการประเมินผลงาน"}
{"word": "discussion", "english": "I appreciated the open discussion.", "thai": "ฉันชื่นชมการสนทนาแบบเปิดเผย"}
{"word": "discussion", "english": "The discussion was about market trends.", "thai": "การสนทนาเกี่ยวกับแนวโน้มของตลาด"}
{"word": "discussion", "english": "He led a discussion on leadership.", "thai": "เขานำการสนทนาเกี่ยวกับภาวะผู้นำ"}
{"word": "discussion", "english": "The discussion was about safety protocols.", "thai": "การสนทนาเกี่ยวกับระเบียบความปลอดภัย"}
{"word": "discussion", "english": "She wrapped up the discussion nicely.", "thai": "เธอสรุปการสนทนาได้อย่างดี"}
{"word": "endowment", "english": "The university received a large endowment for research.", "thai": "มหาวิทยาลัยได้รับเงินบริจาคก้อนใหญ่สำหรับการวิจัย"}
{"word": "endowment", "english": "Her family established an endowment for scholarships.", "thai": "ครอบครัวของเธอก่อตั้งกองทุนเพื่อมอบทุนการศึกษา"}
{"word": "endowment", "english": "The endowment supports the library’s expansion.", "thai": "กองทุนนี้สนับสนุนการขยายห้องสมุด"}
{"word": "endowment", "english": "He contributed to the endowment for the arts program.", "thai": "เขาบริจาคให้กับกองทุนสำหรับโปรแกรมศิลปะ"}
{"word": "endowment", "english": "The endowment ensures the school’s financial stability.", "thai": "กองทุนนี้ช่วยให้โรงเรียนมีเสถียรภาพทางการเงิน"}
{"word": "endowment", "english": "She’s managing the university’s endowment fund.", "thai": "เธอกำลังจัดการกองทุนบริจาคของมหาวิทยาลัย"}
{"word": "endowment", "english": "The endowment grew significantly this year.", "thai": "กองทุนเติบโตอย่างมากในปีนี้"}
{"word": "endowment", "english": "They created an endowment for medical research.", "thai": "พวกเขาสร้างกองทุนสำหรับการวิจัยทางการแพทย์"}
{"word": "endowment", "english": "The endowment provides annual grants to students.", "thai": "กองทุนนี้ให้เงินช่วยเหลือรายปีแก่นักเรียน"}
{"word": "endowment", "english": "His donation boosted the college’s endowment.", "thai": "การบริจาคของเขาช่วยเพิ่มกองทุนของวิทยาลัย"}
{"word": "endowment", "english": "The endowment covers faculty salaries.", "thai": "กองทุนนี้ครอบคลุมเงินเดือนคณาจารย์"}
{"word": "endowment", "english": "She’s researching how to invest the endowment.", "thai": "เธอกำลังวิจัยวิธีลงทุนกองทุน"}
{"word": "endowment", "english": "The endowment funds new campus buildings.", "thai": "กองทุนนี้สนับสนุนการสร้างอาคารในมหาวิทยาลัย"}
{"word": "endowment", "english": "He left an endowment in his will.", "thai": "เขาทิ้งกองทุนไว้ในพินัยกรรม"}
{"word": "endowment", "english": "The endowment supports international programs.", "thai": "กองทุนนี้สนับสนุนโปรแกรมระหว่างประเทศ"}
{"word": "endowment", "english": "They’re seeking donors for the endowment.", "thai": "พวกเขากำลังหาผู้บริจาคสำหรับกองทุน"}
{"word": "endowment", "english": "The endowment was established in 1990.", "thai": "กองทุนนี้ก่อตั้งขึ้นในปี 1990"}
{"word": "endowment", "english": "Her gift created a permanent endowment.", "thai": "ของขวัญของเธอสร้างกองทุนถาวร"}
{"word": "endowment", "english": "The endowment helps low-income students.", "thai": "กองทุนนี้ช่วยนักเรียนที่มีรายได้ต่ำ"}
{"word": "endowment", "english": "He’s on the endowment committee.", "thai": "เขาอยู่ในคณะกรรมการกองทุน"}
{"word": "endowment", "english": "The endowment pays for guest lecturers.", "thai": "กองทุนนี้จ่ายค่าตอบแทนให้วิทยากรรับเชิญ"}
{"word": "endowment", "english": "She’s proud of her alma mater’s endowment.", "thai": "เธอภูมิใจในกองทุนของมหาวิทยาลัยเก่าของเธอ"}
{"word": "endowment", "english": "The endowment is managed by professionals.", "thai": "กองทุนนี้ได้รับการจัดการโดยมืออาชีพ"}
{"word": "endowment", "english": "The endowment funds science labs.", "thai": "กองทุนนี้สนับสนุนห้องปฏิบัติการวิทยาศาสตร์"}
{"word": "endowment", "english": "They’re discussing the endowment’s growth.", "thai": "พวกเขากำลังคุยกันเรื่องการเติบโตของกองทุน"}
{"word": "endowment", "english": "The endowment supports cultural events.", "thai": "กองทุนนี้สนับสนุนงานวัฒนธรรม"}
{"word": "endowment", "english": "He donated to the endowment anonymously.", "thai": "เขาบริจาคให้กองทุนโดยไม่เปิดเผยชื่อ"}
{"word": "endowment", "english": "The endowment ensures long-term funding.", "thai": "กองทุนนี้รับประกันการเงินในระยะยาว"}
{"word": "endowment", "english": "She’s writing a report on the endowment.", "thai": "เธอกำลังเขียนรายงานเกี่ยวกับกองทุน"}
{"word": "endowment", "english": "The endowment was named after a donor.", "thai": "กองทุนนี้ตั้งชื่อตามผู้บริจาค"}
{"word": "endowment", "english": "The endowment covers tuition for some students.", "thai": "กองทุนนี้ครอบคลุมค่าเล่าเรียนสำหรับนักเรียนบางคน"}
{"word": "endowment", "english": "He’s studying the endowment’s investments.", "thai": "เขากำลังศึกษาการลงทุนของกองทุน"}
{"word": "endowment", "english": "The endowment supports the music department.", "thai": "กองทุนนี้สนับสนุนภาควิชาดนตรี"}
{"word": "endowment", "english": "They’re expanding the endowment this year.", "thai": "พวกเขากำลังขยายกองทุนในปีนี้"}
{"word": "endowment", "english": "The endowment helped renovate the auditorium.", "thai": "กองทุนนี้ช่วยปรับปรุงหอประชุม"}
{"word": "endowment", "english": "She’s fundraising for the endowment.", "thai": "เธอกำลังระดมทุนสำหรับกองทุน"}
{"word": "endowment", "english": "The endowment benefits future generations.", "thai": "กองทุนนี้เป็นประโยชน์ต่อคนรุ่นต่อไป"}
{"word": "endowment", "english": "He’s auditing the endowment’s accounts.", "thai": "เขากำลังตรวจสอบบัญชีกองทุน"}
{"word": "endowment", "english": "The endowment funds study abroad programs.", "thai": "กองทุนนี้สนับสนุนโปรแกรมการศึกษาในต่างประเทศ"}
{"word": "endowment", "english": "The endowment was created by alumni.", "thai": "กองทุนนี้ถูกสร้างโดยศิษย์เก่า"}
{"word": "endowment", "english": "She’s grateful for the endowment’s support.", "thai": "เธอรู้สึกขอบคุณสำหรับการสนับสนุนจากกองทุน"}
{"word": "endowment", "english": "The endowment is critical for operations.", "thai": "กองทุนนี้สำคัญต่อการดำเนินงาน"}
{"word": "endowment", "english": "He’s reviewing the endowment’s portfolio.", "thai": "เขากำลังทบทวนพอร์ตการลงทุนของกองทุน"}
{"word": "endowment", "english": "The endowment sponsors annual lectures.", "thai": "กองทุนนี้สนับสนุนการบรรยายประจำปี"}
{"word": "endowment", "english": "They’re building the endowment through donations.", "thai": "พวกเขากำลังสร้างกองทุนผ่านการบริจาค"}
{"word": "endowment", "english": "The endowment supports environmental research.", "thai": "กองทุนนี้สนับสนุนการวิจัยด้านสิ่งแวดล้อม"}
{"word": "endowment", "english": "She’s applying for an endowment grant.", "thai": "เธอกำลังสมัครขอทุนจากกองทุน"}
{"word": "endowment", "english": "The endowment was set up for athletics.", "thai": "กองทุนนี้ถูกตั้งขึ้นเพื่อกีฬา"}
{"word": "endowment", "english": "He’s proud of the endowment’s impact.", "thai": "เขาภูมิใจในผลกระทบของกองทุน"}
{"word": "endowment", "english": "The endowment funds faculty positions.", "thai": "กองทุนนี้สนับสนุนตำแหน่งคณาจารย์"}
{"word": "endowment", "english": "She’s working to grow the endowment.", "thai": "เธอกำลังทำงานเพื่อขยายกองทุน"}
{"word": "endowment", "english": "The endowment supports community outreach.", "thai": "กองทุนนี้สนับสนุนการเข้าถึงชุมชน"}
{"word": "endowment", "english": "He’s analyzing the endowment’s returns.", "thai": "เขากำลังวิเคราะห์ผลตอบแทนของกองทุน"}
{"word": "endowment", "english": "The endowment was created for innovation.", "thai": "กองทุนนี้ถูกสร้างเพื่อนวัตกรรม"}
{"word": "endowment", "english": "She’s promoting the endowment campaign.", "thai": "เธอกำลังส่งเสริมแคมเปญกองทุน"}
{"word": "endowment", "english": "The endowment helps fund new technology.", "thai": "กองทุนนี้ช่วยสนับสนุนเทคโนโลยีใหม่"}
{"word": "endowment", "english": "He’s a trustee for the endowment.", "thai": "เขาเป็นผู้ดูแลกองทุน"}
{"word": "endowment", "english": "The endowment supports diversity initiatives.", "thai": "กองทุนนี้สนับสนุนโครงการความหลากหลาย"}
{"word": "endowment", "english": "She’s studying the endowment’s history.", "thai": "เธอกำลังศึกษาประวัติของกองทุน"}
{"word": "endowment", "english": "The endowment funds graduate fellowships.", "thai": "กองทุนนี้สนับสนุนทุนการศึกษาระดับบัณฑิตศึกษา"}
{"word": "endowment", "english": "He’s discussing the endowment’s strategy.", "thai": "เขากำลังคุยเรื่องกลยุทธ์ของกองทุน"}
{"word": "endowment", "english": "The endowment supports the arts center.", "thai": "กองทุนนี้สนับสนุนศูนย์ศิลปะ"}
{"word": "endowment", "english": "She’s thankful for the endowment’s aid.", "thai": "เธอขอบคุณสำหรับความช่วยเหลือจากกองทุน"}
{"word": "endowment", "english": "The endowment was doubled last year.", "thai": "กองทุนนี้เพิ่มขึ้นสองเท่าเมื่อปีที่แล้ว"}
{"word": "endowment", "english": "He’s managing the endowment’s assets.", "thai": "เขากำลังจัดการสินทรัพย์ของกองทุน"}
{"word": "endowment", "english": "The endowment funds student internships.", "thai": "กองทุนนี้สนับสนุนการฝึกงานของนักเรียน"}
{"word": "endowment", "english": "She’s launching an endowment initiative.", "thai": "เธอกำลังเริ่มโครงการกองทุน"}
{"word": "endowment", "english": "The endowment supports academic programs.", "thai": "กองทุนนี้สนับสนุนโปรแกรมการศึกษา"}
{"word": "endowment", "english": "He’s reviewing the endowment’s policies.", "thai": "เขากำลังทบทวนนโยบายของกองทุน"}
{"word": "endowment", "english": "The endowment funds research grants.", "thai": "กองทุนนี้สนับสนุนทุนวิจัย"}
{"word": "endowment", "english": "She’s excited about the endowment’s growth.", "thai": "เธอตื่นเต้นกับการเติบโตของกองทุน"}
{"word": "endowment", "english": "The endowment was created by a philanthropist.", "thai": "กองทุนนี้ถูกสร้างโดยผู้ใจบุญ"}
{"word": "endowment", "english": "He’s overseeing the endowment’s budget.", "thai": "เขากำลังดูแลงบประมาณของกองทุน"}
{"word": "endowment", "english": "The endowment supports the history department.", "thai": "กองทุนนี้สนับสนุนภาควิชาประวัติศาสตร์"}
{"word": "endowment", "english": "She’s writing about the endowment’s impact.", "thai": "เธอกำลังเขียนเกี่ยวกับผลกระทบของกองทุน"}
{"word": "endowment", "english": "The endowment funds campus renovations.", "thai": "กองทุนนี้สนับสนุนการปรับปรุงวิทยาเขต"}
{"word": "endowment", "english": "He’s grateful for the endowment’s support.", "thai": "เขารู้สึกขอบคุณสำหรับการสนับสนุนจากกองทุน"}
{"word": "endowment", "english": "The endowment helps with financial aid.", "thai": "กองทุนนี้ช่วยเรื่องความช่วยเหลือทางการเงิน"}
{"word": "endowment", "english": "She’s on the endowment advisory board.", "thai": "เธออยู่ในคณะที่ปรึกษากองทุน"}
{"word": "endowment", "english": "The endowment funds library resources.", "thai": "กองทุนนี้สนับสนุนทรัพยากรห้องสมุด"}
{"word": "endowment", "english": "He’s researching the endowment’s investments.", "thai": "เขากำลังวิจัยการลงทุนของกองทุน"}
{"word": "endowment", "english": "The endowment supports student organizations.", "thai": "กองทุนนี้สนับสนุนองค์กรนักศึกษา"}
{"word": "endowment", "english": "She’s promoting the endowment’s mission.", "thai": "เธอกำลังส่งเสริมภารกิจของกองทุน"}
{"word": "endowment", "english": "The endowment was created for sustainability.", "thai": "กองทุนนี้ถูกสร้างเพื่อความยั่งยืน"}
{"word": "endowment", "english": "He’s analyzing the endowment’s performance.", "thai": "เขากำลังวิเคราะห์ผลการดำเนินงานของกองทุน"}
{"word": "endowment", "english": "The endowment funds new scholarships.", "thai": "กองทุนนี้สนับสนุนทุนการศึกษาใหม่"}
{"word": "endowment", "english": "She’s thankful for the endowment’s grants.", "thai": "เธอขอบคุณสำหรับทุนจากกองทุน"}
{"word": "endowment", "english": "The endowment supports faculty research.", "thai": "กองทุนนี้สนับสนุนการวิจัยของคณาจารย์"}
{"word": "endowment", "english": "He’s working on the endowment’s strategy.", "thai": "เขากำลังทำงานเกี่ยวกับกลยุทธ์ของกองทุน"}
{"word": "endowment", "english": "The endowment funds technology upgrades.", "thai": "กองทุนนี้สนับสนุนการอัพเกรดเทคโนโลยี"}
{"word": "endowment", "english": "She’s documenting the endowment’s history.", "thai": "เธอกำลังบันทึกประวัติของกองทุน"}
{"word": "endowment", "english": "The endowment supports mental health programs.", "thai": "กองทุนนี้สนับสนุนโปรแกรมสุขภาพจิต"}
{"word": "endowment", "english": "He’s a donor to the university’s endowment.", "thai": "เขาเป็นผู้บริจาคให้กับกองทุนของมหาวิทยาลัย"}
{"word": "endowment", "english": "The endowment funds international exchanges.", "thai": "กองทุนนี้สนับสนุนการแลกเปลี่ยนระหว่างประเทศ"}
{"word": "endowment", "english": "She’s managing the endowment’s grants.", "thai": "เธอกำลังจัดการทุนของกองทุน"}
{"word": "endowment", "english": "The endowment supports the engineering school.", "thai": "กองทุนนี้สนับสนุนคณะวิศวกรรมศาสตร์"}
{"word": "endowment", "english": "He’s excited about the endowment’s future.", "thai": "เขาตื่นเต้นกับอนาคตของกองทุน"}
{"word": "endowment", "english": "The endowment funds public lectures.", "thai": "กองทุนนี้สนับสนุนการบรรยายสาธารณะ"}
{"word": "endowment", "english": "She’s advocating for the endowment’s growth.", "thai": "เธอกำลังสนับสนุนการเติบโตของกองทุน"}
{"word": "endowment", "english": "The endowment supports the biology department.", "thai": "กองทุนนี้สนับสนุนภาควิชาชีววิทยา"}
{"word": "endowment", "english": "He’s reviewing the endowment’s financials.", "thai": "เขากำลังทบทวนการเงินของกองทุน"}
{"word": "endowment", "english": "The endowment was created for scholarships.", "thai": "กองทุนนี้ถูกสร้างเพื่อทุนการศึกษา"}
{"word": "endowment", "english": "She’s proud of the endowment’s legacy.", "thai": "เธอภูมิใจในมรดกของกองทุน"}
{"word": "equipment", "english": "The lab needs new equipment for experiments.", "thai": "ห้องปฏิบัติการต้องการอุปกรณ์ใหม่สำหรับการทดลอง"}
{"word": "equipment", "english": "We bought expensive equipment for the gym.", "thai": "เราซื้ออุปกรณ์ราคาแพงสำหรับยิม"}
{"word": "equipment", "english": "The team is checking the equipment before the game.", "thai": "ทีมกำลังตรวจสอบอุปกรณ์ก่อนการแข่งขัน"}
{"word": "equipment", "english": "She donated equipment to the science department.", "thai": "เธอบริจาคอุปกรณ์ให้กับภาควิชาวิทยาศาสตร์"}
{"word": "equipment", "english": "The equipment broke down during the experiment.", "thai": "อุปกรณ์เสียระหว่างการทดลอง"}
{"word": "equipment", "english": "He’s training on the new equipment today.", "thai": "เขากำลังฝึกกับอุปกรณ์ใหม่วันนี้"}
{"word": "equipment", "english": "The school upgraded its computer equipment.", "thai": "โรงเรียนอัพเกรดอุปกรณ์คอมพิวเตอร์"}
{"word": "equipment", "english": "We need better equipment for this project.", "thai": "เราต้องการอุปกรณ์ที่ดีกว่าสำหรับโปรเจกต์นี้"}
{"word": "equipment", "english": "The equipment is stored in the warehouse.", "thai": "อุปกรณ์ถูกเก็บไว้ในโกดัง"}
{"word": "equipment", "english": "She’s calibrating the lab equipment now.", "thai": "เธอกำลังปรับเทียบอุปกรณ์ในห้องปฏิบัติการ"}
{"word": "equipment", "english": "The company invested in new equipment.", "thai": "บริษัทลงทุนในอุปกรณ์ใหม่"}
{"word": "equipment", "english": "I’m learning how to use this equipment.", "thai": "ฉันกำลังเรียนรู้วิธีใช้อุปกรณ์นี้"}
{"word": "equipment", "english": "The equipment requires regular maintenance.", "thai": "อุปกรณ์ต้องการการบำรุงรักษาเป็นประจำ"}
{"word": "equipment", "english": "He’s responsible for the equipment inventory.", "thai": "เขารับผิดชอบคลังอุปกรณ์"}
{"word": "equipment", "english": "The equipment was donated by a sponsor.", "thai": "อุปกรณ์ถูกบริจาคโดยผู้สนับสนุน"}
{"word": "equipment", "english": "We’re testing the new medical equipment.", "thai": "เรากำลังทดสอบอุปกรณ์ทางการแพทย์ใหม่"}
{"word": "equipment", "english": "The equipment is outdated and needs replacing.", "thai": "อุปกรณ์ล้าสมัยและต้องเปลี่ยน"}
{"word": "equipment", "english": "She’s ordering equipment for the classroom.", "thai": "เธอกำลังสั่งอุปกรณ์สำหรับห้องเรียน"}
{"word": "equipment", "english": "The equipment was shipped last week.", "thai": "อุปกรณ์ถูกส่งเมื่อสัปดาห์ที่แล้ว"}
{"word": "equipment", "english": "He’s trained to handle heavy equipment.", "thai": "เขาได้รับการฝึกให้จัดการอุปกรณ์หนัก"}
{"word": "equipment", "english": "The lab’s equipment is state-of-the-art.", "thai": "อุปกรณ์ในห้องปฏิบัติการเป็นเทคโนโลยีล่าสุด"}
{"word": "equipment", "english": "We need funding to buy new equipment.", "thai": "เราต้องการเงินทุนเพื่อซื้ออุปกรณ์ใหม่"}
{"word": "equipment", "english": "The equipment is essential for safety.", "thai": "อุปกรณ์จำเป็นสำหรับความปลอดภัย"}
{"word": "equipment", "english": "She’s inspecting the equipment for defects.", "thai": "เธอกำลังตรวจสอบอุปกรณ์เพื่อหาข้อบกพร่อง"}
{"word": "equipment", "english": "The equipment was installed yesterday.", "thai": "อุปกรณ์ถูกติดตั้งเมื่อวานนี้"}
{"word": "equipment", "english": "He’s repairing the broken equipment.", "thai": "เขากำลังซ่อมอุปกรณ์ที่เสีย"}
{"word": "equipment", "english": "The equipment is covered by a warranty.", "thai": "อุปกรณ์นี้อยู่ภายใต้การรับประกัน"}
{"word": "equipment", "english": "We’re renting equipment for the event.", "thai": "เรากำลังเช่าอุปกรณ์สำหรับงาน"}
{"word": "equipment", "english": "The equipment needs to be cleaned daily.", "thai": "อุปกรณ์ต้องทำความสะอาดทุกวัน"}
{"word": "equipment", "english": "She’s updating the equipment manual.", "thai": "เธอกำลังอัพเดทคู่มืออุปกรณ์"}
{"word": "equipment", "english": "The equipment is shared between departments.", "thai": "อุปกรณ์นี้ใช้ร่วมกันระหว่างแผนก"}
{"word": "equipment", "english": "He’s learning to operate the new equipment.", "thai": "เขากำลังเรียนรู้การใช้งานอุปกรณ์ใหม่"}
{"word": "equipment", "english": "The equipment was funded by a grant.", "thai": "อุปกรณ์นี้ได้รับทุนสนับสนุน"}
{"word": "equipment", "english": "We’re upgrading the lab’s equipment.", "thai": "เรากำลังอัพเกรดอุปกรณ์ในห้องปฏิบัติการ"}
{"word": "equipment", "english": "The equipment is critical for research.", "thai": "อุปกรณ์นี้สำคัญต่อการวิจัย"}
{"word": "equipment", "english": "She’s responsible for equipment maintenance.", "thai": "เธอรับผิดชอบการบำรุงรักษาอุปกรณ์"}
{"word": "equipment", "english": "The equipment arrived in perfect condition.", "thai": "อุปgrณ์มาถึงในสภาพสมบูรณ์"}
{"word": "equipment", "english": "He’s troubleshooting the equipment issues.", "thai": "เขากำลังแก้ปัญหาอุปกรณ์"}
{"word": "equipment", "english": "The equipment is designed for precision.", "thai": "อุปกรณ์นี้ถูกออกแบบเพื่อความแม่นยำ"}
{"word": "equipment", "english": "We’re leasing new equipment this month.", "thai": "เราเช่าอุปกรณ์ใหม่ในเดือนนี้"}
{"word": "equipment", "english": "The equipment was tested before use.", "thai": "อุปกรณ์ถูกทดสอบก่อนใช้งาน"}
{"word": "equipment", "english": "She’s cataloging the lab’s equipment.", "thai": "เธอกำลังจัดทำรายการอุปกรณ์ในห้องปฏิบัติการ"}
{"word": "equipment", "english": "The equipment supports advanced experiments.", "thai": "อุปกรณ์นี้สนับสนุนการทดลองขั้นสูง"}
{"word": "equipment", "english": "He’s trained on all the equipment.", "thai": "เขาได้รับการฝึกอบรมเกี่ยวกับอุปกรณ์ทั้งหมด"}
{"word": "equipment", "english": "The equipment is stored securely.", "thai": "อุปกรณ์ถูกเก็บไว้อย่างปลอดภัย"}
{"word": "equipment", "english": "We need more equipment for the workshop.", "thai": "เราต้องการอุปกรณ์เพิ่มสำหรับเวิร์กช็อป"}
{"word": "equipment", "english": "The equipment was damaged during transport.", "thai": "อุปกรณ์เสียหายระหว่างการขนส่ง"}
{"word": "equipment", "english": "She’s researching new equipment options.", "thai": "เธอกำลังวิจัยตัวเลือกอุปกรณ์ใหม่"}
{"word": "equipment", "english": "The equipment is vital for production.", "thai": "อุปกรณ์นี้สำคัญต่อการผลิต"}
{"word": "equipment", "english": "He’s upgrading the equipment software.", "thai": "เขากำลังอัพเกรดซอฟต์แวร์ของอุปกรณ์"}
{"word": "equipment", "english": "The equipment was purchased last year.", "thai": "อุปกรณ์นี้ถูกซื้อเมื่อปีที่แล้ว"}
{"word": "equipment", "english": "She’s organizing the equipment storage.", "thai": "เธอกำลังจัดระเบียบการเก็บอุปกรณ์"}
{"word": "equipment", "english": "The equipment is user-friendly.", "thai": "อุปกรณ์นี้ใช้งานง่าย"}
{"word": "equipment", "english": "We’re training staff on the equipment.", "thai": "เรากำลังฝึกอบรมพนักงานเกี่ยวกับอุปกรณ์"}
{"word": "equipment", "english": "The equipment supports multiple functions.", "thai": "อุปกรณ์นี้รองรับหลายฟังก์ชัน"}
{"word": "equipment", "english": "He’s inspecting the equipment daily.", "thai": "เขาตรวจสอบอุปกรณ์ทุกวัน"}
{"word": "equipment", "english": "The equipment was imported from Germany.", "thai": "อุปกรณ์นี้ถูกนำเข้าจากเยอรมนี"}
{"word": "equipment", "english": "She’s budgeting for new equipment.", "thai": "เธอกำลังจัดงบประมาณสำหรับอุปกรณ์ใหม่"}
{"word": "equipment", "english": "The equipment is under warranty.", "thai": "อุปกรณ์นี้อยู่ภายใต้การรับประกัน"}
{"word": "equipment", "english": "He’s maintaining the lab’s equipment.", "thai": "เขากำลังบำรุงรักษาอุปกรณ์ในห้องปฏิบัติการ"}
{"word": "equipment", "english": "The equipment enhances our productivity.", "thai": "อุปกรณ์นี้เพิ่มประสิทธิภาพการทำงานของเรา"}
{"word": "equipment", "english": "She’s learning to use the equipment safely.", "thai": "เธอกำลังเรียนรู้การใช้อุปกรณ์อย่างปลอดภัย"}
{"word": "equipment", "english": "The equipment was funded by donors.", "thai": "อุปกรณ์นี้ได้รับทุนจากผู้บริจาค"}
{"word": "equipment", "english": "He’s installing new equipment tomorrow.", "thai": "เขาจะติดตั้งอุปกรณ์ใหม่พรุ่งนี้"}
{"word": "equipment", "english": "The equipment is essential for fieldwork.", "thai": "อุปกรณ์นี้จำเป็นสำหรับงานภาคสนาม"}
{"word": "equipment", "english": "She’s troubleshooting the equipment’s issues.", "thai": "เธอกำลังแก้ไขปัญหาของอุปกรณ์"}
{"word": "equipment", "english": "The equipment was delivered on time.", "thai": "อุปกรณ์ถูกส่งมอบตรงเวลา"}
{"word": "equipment", "english": "He’s responsible for equipment safety.", "thai": "เขารับผิดชอบความปลอดภัยของอุปกรณ์"}
{"word": "equipment", "english": "The equipment supports cutting-edge research.", "thai": "อุปกรณ์นี้สนับสนุนการวิจัยล้ำสมัย"}
{"word": "equipment", "english": "She’s ordering spare parts for the equipment.", "thai": "เธอกำลังสั่งอะไหล่สำหรับอุปกรณ์"}
{"word": "equipment", "english": "The equipment is calibrated weekly.", "thai": "อุปกรณ์นี้ถูกปรับเทียบทุกสัปดาห์"}
{"word": "equipment", "english": "He’s testing the equipment’s performance.", "thai": "เขากำลังทดสอบประสิทธิภาพของอุปกรณ์"}
{"word": "equipment", "english": "The equipment was a major investment.", "thai": "อุปกรณ์นี้เป็นการลงทุนครั้งใหญ่"}
{"word": "equipment", "english": "She’s documenting the equipment usage.", "thai": "เธอกำลังบันทึกการใช้อุปกรณ์"}
{"word": "equipment", "english": "The equipment is shared across labs.", "thai": "อุปกรณ์นี้ใช้ร่วมกันในหลายห้องปฏิบัติการ"}
{"word": "equipment", "english": "He’s trained to repair the equipment.", "thai": "เขาได้รับการฝึกอบรมให้ซ่อมอุปกรณ์"}
{"word": "equipment", "english": "The equipment is critical for experiments.", "thai": "อุปกรณ์นี้สำคัญต่อการทดลอง"}
{"word": "equipment", "english": "She’s updating the equipment inventory.", "thai": "เธอกำลังอัพเดทคลังอุปกรณ์"}
{"word": "equipment", "english": "The equipment was donated to the school.", "thai": "อุปกรณ์นี้ถูกบริจาคให้โรงเรียน"}
{"word": "equipment", "english": "He’s learning about the equipment’s features.", "thai": "เขากำลังเรียนรู้เกี่ยวกับคุณสมบัติของอุปกรณ์"}
{"word": "equipment", "english": "The equipment supports high-precision work.", "thai": "อุปกรณ์นี้สนับสนุนงานที่มีความแม่นยำสูง"}
{"word": "equipment", "english": "She’s cleaning the equipment after use.", "thai": "เธอกำลังทำความสะอาดอุปกรณ์หลังใช้งาน"}
{"word": "equipment", "english": "The equipment was upgraded last month.", "thai": "อุปกรณ์นี้ถูกอัพเกรดเมื่อเดือนที่แล้ว"}
{"word": "equipment", "english": "He’s managing the equipment budget.", "thai": "เขากำลังจัดการงบประมาณอุปกรณ์"}
{"word": "equipment", "english": "The equipment is stored in a secure room.", "thai": "อุปกรณ์ถูกเก็บไว้ในห้องที่ปลอดภัย"}
{"word": "equipment", "english": "She’s researching equipment vendors.", "thai": "เธอกำลังวิจัยผู้จำหน่ายอุปกรณ์"}
{"word": "equipment", "english": "The equipment is vital for the lab.", "thai": "อุปกรณ์นี้สำคัญต่อห้องปฏิบัติการ"}
{"word": "equipment", "english": "He’s calibrating the equipment for accuracy.", "thai": "เขากำลังปรับเทียบอุปกรณ์เพื่อความแม่นยำ"}
{"word": "equipment", "english": "The equipment was purchased with a grant.", "thai": "อุปกรณ์นี้ถูกซื้อด้วยเงินทุน"}
{"word": "equipment", "english": "She’s training students on the equipment.", "thai": "เธอกำลังฝึกอบรมนักเรียนเกี่ยวกับอุปกรณ์"}
{"word": "equipment", "english": "The equipment is designed for durability.", "thai": "อุปกรณ์นี้ถูกออกแบบเพื่อความทนทาน"}
{"word": "equipment", "english": "He’s inspecting the equipment for safety.", "thai": "เขากำลังตรวจสอบอุปกรณ์เพื่อความปลอดภัย"}
{"word": "equipment", "english": "The equipment supports multiple experiments.", "thai": "อุปกรณ์นี้สนับสนุนการทดลองหลายอย่าง"}
{"word": "equipment", "english": "She’s responsible for equipment upgrades.", "thai": "เธอรับผิดชอบการอัพเกรดอุปกรณ์"}
{"word": "equipment", "english": "The equipment was tested for reliability.", "thai": "อุปกรณ์นี้ถูกทดสอบเพื่อความน่าเชื่อถือ"}
{"word": "equipment", "english": "He’s ordering new equipment for the team.", "thai": "เขากำลังสั่งอุปกรณ์ใหม่สำหรับทีม"}
{"word": "equipment", "english": "The equipment is critical for data collection.", "thai": "อุปกรณ์นี้สำคัญต่อการเก็บข้อมูล"}
{"word": "equipment", "english": "She’s maintaining the equipment schedule.", "thai": "เธอกำลังดูแลตารางการบำรุงรักษาอุปกรณ์"}
{"word": "equipment", "english": "The equipment was donated by a company.", "thai": "อุปกรณ์นี้ถูกบริจาคโดยบริษัท"}
{"word": "equipment", "english": "He’s troubleshooting the equipment’s software.", "thai": "เขากำลังแก้ไขปัญหาซอฟต์แวร์ของอุปกรณ์"}
{"word": "equipment", "english": "The equipment is ready for the experiment.", "thai": "อุปกรณ์พร้อมสำหรับการทดลอง"}
