{"word": "write down", "english": "Please write down your name on the form.", "thai": "กรุณาเขียนชื่อของคุณลงในแบบฟอร์ม"}
{"word": "write down", "english": "Can you write down the address for me?", "thai": "คุณช่วยเขียนที่อยู่ให้ฉันได้ไหม?"}
{"word": "write down", "english": "I need to write down this phone number before I forget.", "thai": "ฉันต้องเขียนเบอร์โทรนี้ลงก่อนที่ฉันจะลืม"}
{"word": "write down", "english": "Write down the recipe so we can make it later.", "thai": "เขียนสูตรอาหารลงเพื่อที่เราจะได้ทำมันทีหลัง"}
{"word": "write down", "english": "Let me write down what you just said.", "thai": "ให้ฉันเขียนสิ่งที่คุณเพิ่งพูดลง"}
{"word": "write down", "english": "The teacher asked us to write down the homework assignment.", "thai": "ครูขอให้เราเขียนการบ้านลง"}
{"word": "write down", "english": "Write down your goals for the new year.", "thai": "เขียนเป้าหมายของคุณสำหรับปีใหม่ลง"}
{"word": "write down", "english": "I always write down my dreams when I wake up.", "thai": "ฉันมักจะเขียนความฝันของฉันลงเมื่อตื่นนอน"}
{"word": "write down", "english": "Can you write down the time of the meeting?", "thai": "คุณช่วยเขียนเวลาการประชุมลงได้ไหม?"}
{"word": "write down", "english": "She told me to write down the instructions carefully.", "thai": "เธอบอกให้ฉันเขียนคำแนะนำลงอย่างระมัดระวัง"}
{"word": "write down", "english": "I’ll write down the directions to the restaurant.", "thai": "ฉันจะเขียนเส้นทางไปร้านอาหารลง"}
{"word": "write down", "english": "Write down everything you remember from the conversation.", "thai": "เขียนทุกสิ่งที่คุณจำได้จากการสนทนาลง"}
{"word": "write down", "english": "He forgot to write down the password.", "thai": "เขาลืมเขียนรหัสผ่านลง"}
{"word": "write down", "english": "Let’s write down some ideas for the project.", "thai": "มาเขียนไอเดียสำหรับโปรเจกต์ลงกันเถอะ"}
{"word": "write down", "english": "You should write down your thoughts in a journal.", "thai": "คุณควรเขียนความคิดของคุณลงในสมุดบันทึก"}
{"word": "write down", "english": "Write down the ingredients we need for dinner.", "thai": "เขียนส่วนผสมที่เราต้องการสำหรับมื้อเย็นลง"}
{"word": "write down", "english": "I’m going to write down his contact information.", "thai": "ฉันจะเขียนข้อมูลติดต่อของเขาลง"}
{"word": "write down", "english": "The doctor told me to write down my symptoms.", "thai": "หมอบอกให้ฉันเขียนอาการของฉันลง"}
{"word": "write down", "english": "Write down the code before you lose it.", "thai": "เขียนรหัสลงก่อนที่คุณจะทำหาย"}
{"word": "write down", "english": "Can you write down what she said word for word?", "thai": "คุณช่วยเขียนสิ่งที่เธอพูดลงทุกคำได้ไหม?"}
{"word": "write down", "english": "I need to write down the schedule for next week.", "thai": "ฉันต้องเขียนตารางสำหรับสัปดาห์หน้าลง"}
{"word": "write down", "english": "Write down your answers on the sheet.", "thai": "เขียนคำตอบของคุณลงในกระดาษ"}
{"word": "write down", "english": "She likes to write down quotes from books.", "thai": "เธอชอบเขียนคำพูดจากหนังสือลง"}
{"word": "write down", "english": "Let’s write down the pros and cons of this plan.", "thai": "มาเขียนข้อดีข้อเสียของแผนนี้ลงกัน"}
{"word": "write down", "english": "I forgot to write down what time the movie starts.", "thai": "ฉันลืมเขียนเวลาที่หนังเริ่มลง"}
{"word": "write down", "english": "Write down the names of everyone attending.", "thai": "เขียนชื่อของทุกคนที่เข้าร่วมลง"}
{"word": "write down", "english": "He asked me to write down the serial number.", "thai": "เขาขอให้ฉันเขียนหมายเลขซีเรียลลง"}
{"word": "write down", "english": "I’ll write down the details of the agreement.", "thai": "ฉันจะเขียนรายละเอียดของข้อตกลงลง"}
{"word": "write down", "english": "Write down what you need from the store.", "thai": "เขียนสิ่งที่คุณต้องการจากร้านค้าลง"}
{"word": "write down", "english": "The coach told us to write down our training times.", "thai": "โค้ชบอกให้เราเขียนเวลาการฝึกซ้อมลง"}
{"word": "write down", "english": "Can you write down the rules of the game?", "thai": "คุณช่วยเขียนกติกาของเกมลงได้ไหม?"}
{"word": "write down", "english": "I need to write down my password somewhere safe.", "thai": "ฉันต้องเขียนรหัสผ่านลงที่ไหนสักแห่งที่ปลอดภัย"}
{"word": "write down", "english": "Write down the steps for this experiment.", "thai": "เขียนขั้นตอนสำหรับการทดลองนี้ลง"}
{"word": "write down", "english": "She told me to write down my feelings.", "thai": "เธอบอกให้ฉันเขียนความรู้สึกของฉันลง"}
{"word": "write down", "english": "Let’s write down the budget for the trip.", "thai": "มาเขียนงบประมาณสำหรับการเดินทางลงกัน"}
{"word": "write down", "english": "Write down the key points from the lecture.", "thai": "เขียนประเด็นสำคัญจากบรรยายลง"}
{"word": "write down", "english": "I’ll write down the meeting notes for you.", "thai": "ฉันจะเขียนบันทึกการประชุมให้คุณ"}
{"word": "write down", "english": "He needs to write down his speech for tomorrow.", "thai": "เขาต้องเขียนสุนทรพจน์สำหรับพรุ่งนี้ลง"}
{"word": "write down", "english": "Write down the title of that book for me.", "thai": "เขียนชื่อหนังสือเล่มนั้นให้ฉัน"}
{"word": "write down", "english": "Can you write down the lyrics to that song?", "thai": "คุณช่วยเขียนเนื้อเพลงนั้นลงได้ไหม?"}
{"word": "write down", "english": "I’m going to write down all my expenses.", "thai": "ฉันจะเขียนค่าใช้จ่ายทั้งหมดของฉันลง"}
{"word": "write down", "english": "Write down the date of the event.", "thai": "เขียนวันที่ของงานลง"}
{"word": "write down", "english": "She forgot to write down the appointment time.", "thai": "เธอลืมเขียนเวลานัดลง"}
{"word": "write down", "english": "Let me write down your order real quick.", "thai": "ให้ฉันเขียนคำสั่งซื้อของคุณลงอย่างเร็ว"}
{"word": "write down", "english": "Write down the names of the team members.", "thai": "เขียนชื่อของสมาชิกทีมลง"}
{"word": "write down", "english": "I need to write down the PIN for my card.", "thai": "ฉันต้องเขียนรหัส PIN ของบัตรลง"}
{"word": "write down", "english": "Can you write down the steps to reset the device?", "thai": "คุณช่วยเขียนขั้นตอนการรีเซ็ตอุปกรณ์ลงได้ไหม?"}
{"word": "write down", "english": "Write down what you want to say in the email.", "thai": "เขียนสิ่งที่คุณต้องการพูดในอีเมลลง"}
{"word": "write down", "english": "He told me to write down the product codes.", "thai": "เขาบอกให้ฉันเขียนรหัสสินค้าลง"}
{"word": "write down", "english": "I’ll write down the feedback from the meeting.", "thai": "ฉันจะเขียนความคิดเห็นจากประชุมลง"}
{"word": "write down", "english": "Write down the score of the game.", "thai": "เขียนคะแนนของเกมลง"}
{"word": "write down", "english": "She likes to write down her daily tasks.", "thai": "เธอชอบเขียนงานประจำวันของเธอลง"}
{"word": "write down", "english": "Can you write down the model number of the car?", "thai": "คุณช่วยเขียนหมายเลขรุ่นของรถลงได้ไหม?"}
{"word": "write down", "english": "I need to write down the Wi-Fi password.", "thai": "ฉันต้องเขียนรหัสผ่าน Wi-Fi ลง"}
{"word": "write down", "english": "Write down the main points of the article.", "thai": "เขียนประเด็นหลักของบทความลง"}
{"word": "write down", "english": "Let’s write down the rules for the competition.", "thai": "มาเขียนกติกาการแข่งขันลงกัน"}
{"word": "write down", "english": "I forgot to write down the flight details.", "thai": "ฉันลืมเขียนรายละเอียดเที่ยวบินลง"}
{"word": "write down", "english": "Write down the names of the new employees.", "thai": "เขียนชื่อของพนักงานใหม่ลง"}
{"word": "write down", "english": "Can you write down the doctor’s recommendations?", "thai": "คุณช่วยเขียนคำแนะนำของหมอลงได้ไหม?"}
{"word": "write down", "english": "I’ll write down the times for the appointments.", "thai": "ฉันจะเขียนเวลาสำหรับการนัดลง"}
{"word": "write down", "english": "Write down the answers to the quiz.", "thai": "เขียนคำตอบของแบบทดสอบลง"}
{"word": "write down", "english": "She told me to write down the grocery list.", "thai": "เธอบอกให้ฉันเขียนรายการของชำลง"}
{"word": "write down", "english": "Let me write down the instructions for the game.", "thai": "ให้ฉันเขียนคำแนะนำสำหรับเกมลง"}
{"word": "write down", "english": "Write down the contact details for the client.", "thai": "เขียนข้อมูลติดต่อของลูกค้าลง"}
{"word": "write down", "english": "I need to write down the math formula.", "thai": "ฉันต้องเขียนสูตรคณิตศาสตร์ลง"}
{"word": "write down", "english": "Can you write down what the boss said?", "thai": "คุณช่วยเขียนสิ่งที่เจ้านายพูดลงได้ไหม?"}
{"word": "write down", "english": "Write down the schedule for the conference.", "thai": "เขียนตารางสำหรับการประชุมลง"}
{"word": "write down", "english": "I’ll write down the details of the reservation.", "thai": "ฉันจะเขียนรายละเอียดของการจองลง"}
{"word": "write down", "english": "She forgot to write down the meeting agenda.", "thai": "เธอลืมเขียนวาระการประชุมลง"}
{"word": "write down", "english": "Write down the steps to solve the problem.", "thai": "เขียนขั้นตอนในการแก้ปัญหาลง"}
{"word": "write down", "english": "Can you write down the directions to the park?", "thai": "คุณช่วยเขียนเส้นทางไปสวนสาธารณะลงได้ไหม?"}
{"word": "write down", "english": "I need to write down my New Year’s resolutions.", "thai": "ฉันต้องเขียนปณิธานปีใหม่ของฉันลง"}
{"word": "write down", "english": "Write down the key terms from the chapter.", "thai": "เขียนคำศัพท์สำคัญจากบทลง"}
{"word": "write down", "english": "Let’s write down the plan for the weekend.", "thai": "มาเขียนแผนสำหรับวันหยุดสุดสัปดาห์ลงกัน"}
{"word": "write down", "english": "He asked me to write down the error code.", "thai": "เขาขอให้ฉันเขียนรหัสข้อผิดพลาดลง"}
{"word": "write down", "english": "Write down the names of the books you want.", "thai": "เขียนชื่อหนังสือที่คุณต้องการลง"}
{"word": "write down", "english": "I’ll write down the recipe for the cake.", "thai": "ฉันจะเขียนสูตรเค้กลง"}
{"word": "write down", "english": "Can you write down the time of the train?", "thai": "คุณช่วยเขียนเวลาของรถไฟลงได้ไหม?"}
{"word": "write down", "english": "Write down what you learned today.", "thai": "เขียนสิ่งที่คุณเรียนรู้วันนี้ลง"}
{"word": "write down", "english": "She told me to write down my questions.", "thai": "เธอบอกให้ฉันเขียนคำถามของฉันลง"}
{"word": "write down", "english": "I need to write down the license plate number.", "thai": "ฉันต้องเขียนหมายเลขป้ายทะเบียนลง"}
{"word": "write down", "english": "Write down the details of the accident.", "thai": "เขียนรายละเอียดของอุบัติเหตุลง"}
{"word": "write down", "english": "Let me write down the quote from the movie.", "thai": "ให้ฉันเขียนคำพูดจากภาพยนตร์ลง"}
{"word": "write down", "english": "Can you write down the address of the hotel?", "thai": "คุณช่วยเขียนที่อยู่ของโรงแรมลงได้ไหม?"}
{"word": "write down", "english": "Write down the steps for the dance routine.", "thai": "เขียนขั้นตอนสำหรับท่าเต้นลง"}
{"word": "write down", "english": "I’ll write down the scores for the team.", "thai": "ฉันจะเขียนคะแนนสำหรับทีมลง"}
{"word": "write down", "english": "She forgot to write down the recipe.", "thai": "เธอลืมเขียนสูตรอาหารลง"}
{"word": "write down", "english": "Write down the instructions for the software.", "thai": "เขียนคำแนะนำสำหรับซอฟต์แวร์ลง"}
{"word": "write down", "english": "Can you write down the names of the guests?", "thai": "คุณช่วยเขียนชื่อของแขกลงได้ไหม?"}
{"word": "write down", "english": "I need to write down the doctor’s orders.", "thai": "ฉันต้องเขียนคำสั่งของหมอลง"}
{"word": "write down", "english": "Write down the list of supplies we need.", "thai": "เขียนรายการอุปกรณ์ที่เราต้องการลง"}
{"word": "write down", "english": "Let’s write down the ideas for the party.", "thai": "มาเขียนไอเดียสำหรับงานปาร์ตี้ลงกัน"}
{"word": "write down", "english": "He told me to write down the safety rules.", "thai": "เขาบอกให้ฉันเขียนกฎความปลอดภัยลง"}
{"word": "write down", "english": "Write down the password somewhere secure.", "thai": "เขียนรหัสผ่านลงที่ที่ปลอดภัย"}
{"word": "write down", "english": "I’ll write down the directions to the office.", "thai": "ฉันจะเขียนเส้นทางไปสำนักงานลง"}
{"word": "write down", "english": "Can you write down the names of the winners?", "thai": "คุณช่วยเขียนชื่อของผู้ชนะลงได้ไหม?"}
{"word": "write down", "english": "Write down the ingredients for the smoothie.", "thai": "เขียนส่วนผสมสำหรับสมูทตี้ลง"}
{"word": "write down", "english": "I need to write down the meeting location.", "thai": "ฉันต้องเขียนสถานที่ประชุมลง"}
{"word": "write down", "english": "Write down the steps to fix the issue.", "thai": "เขียนขั้นตอนในการแก้ไขปัญหาลง"}
{"word": "back down", "english": "He refused to back down from the argument.", "thai": "เขาปฏิเสธที่จะยอมถอยจากการโต้แย้ง"}
{"word": "back down", "english": "Don’t back down just because they disagree.", "thai": "อย่ายอมถอยเพียงเพราะพวกเขาไม่เห็นด้วย"}
{"word": "back down", "english": "She’s too stubborn to back down easily.", "thai": "เธอดื้อเกินกว่าจะยอมถอยง่าย ๆ"}
{"word": "back down", "english": "I won’t back down from this challenge.", "thai": "ฉันจะไม่ยอมถอยจากความท้าทายนี้"}
{"word": "back down", "english": "They told him to back down, but he kept going.", "thai": "พวกเขาบอกให้เขายอมถอย แต่เขายังคงเดินหน้าต่อ"}
{"word": "back down", "english": "You need to back down before things get worse.", "thai": "คุณต้องยอมถอยก่อนที่เรื่องจะแย่ลง"}
{"word": "back down", "english": "He finally backed down after hours of debate.", "thai": "ในที่สุดเขาก็ยอมถอยหลังจากการโต้วาทีหลายชั่วโมง"}
{"word": "back down", "english": "She never backs down from a fight.", "thai": "เธอไม่เคยยอมถอยจากการต่อสู้"}
{"word": "back down", "english": "Why did you back down so quickly?", "thai": "ทำไมคุณยอมถอยเร็วขนาดนั้น?"}
{"word": "back down", "english": "The team refused to back down despite the odds.", "thai": "ทีมปฏิเสธที่จะยอมถอยแม้จะมีโอกาสน้อย"}
{"word": "back down", "english": "I’m not going to back down on this issue.", "thai": "ฉันจะไม่ยอมถอยในประเด็นนี้"}
{"word": "back down", "english": "He backed down when he saw he was wrong.", "thai": "เขายอมถอยเมื่อเห็นว่าเขาผิด"}
{"word": "back down", "english": "Don’t expect her to back down; she’s determined.", "thai": "อย่าคาดหวังว่าเธอจะยอมถอย เธอมุ่งมั่นมาก"}
{"word": "back down", "english": "They pressured him to back down, but he stood firm.", "thai": "พวกเขากดดันให้เขายอมถอย แต่เขายังยืนหยัด"}
{"word": "back down", "english": "She backed down to avoid a bigger conflict.", "thai": "เธอยอมถอยเพื่อหลีกเลี่ยงความขัดแย้งที่ใหญ่ขึ้น"}
{"word": "back down", "english": "You can’t always back down when things get tough.", "thai": "คุณไม่สามารถยอมถอยทุกครั้งที่เรื่องยากลำบาก"}
{"word": "back down", "english": "He’s too proud to back down in public.", "thai": "เขาภูมิใจเกินกว่าจะยอมถอยต่อหน้าคนอื่น"}
{"word": "back down", "english": "The company refused to back down on their demands.", "thai": "บริษัทปฏิเสธที่จะยอมถอยจากข้อเรียกร้องของพวกเขา"}
{"word": "back down", "english": "I had to back down to keep the peace.", "thai": "ฉันต้องยอมถอยเพื่อรักษาความสงบ"}
{"word": "back down", "english": "She told him to back down or face the consequences.", "thai": "เธอบอกให้เขายอมถอยไม่งั้นจะต้องเผชิญผลที่ตามมา"}
{"word": "back down", "english": "He won’t back down from his principles.", "thai": "เขาจะไม่ยอมถอยจากหลักการของเขา"}
{"word": "back down", "english": "The protesters refused to back down.", "thai": "ผู้ประท้วงปฏิเสธที่จะยอมถอย"}
{"word": "back down", "english": "I’ll never back down from what I believe in.", "thai": "ฉันจะไม่ยอมถอยจากสิ่งที่ฉันเชื่อ"}
{"word": "back down", "english": "She backed down after realizing she was mistaken.", "thai": "เธอยอมถอยหลังจากรู้ว่าเธอเข้าใจผิด"}
{"word": "back down", "english": "Don’t back down; you’re in the right.", "thai": "อย่ายอมถอย คุณถูกต้องแล้ว"}
{"word": "back down", "english": "He backed down when the evidence was clear.", "thai": "เขายอมถอยเมื่อหลักฐานชัดเจน"}
{"word": "back down", "english": "The coach told the team not to back down.", "thai": "โค้ชบอกทีมว่าอย่ายอมถอย"}
{"word": "back down", "english": "She’s not the type to back down from a challenge.", "thai": "เธอไม่ใช่คนที่จะยอมถอยจากความท้าทาย"}
{"word": "back down", "english": "They tried to intimidate him, but he didn’t back down.", "thai": "พวกเขาพยายามข่มขู่เขา แต่เขาไม่ยอมถอย"}
{"word": "back down", "english": "I had to back down to avoid an argument.", "thai": "ฉันต้องยอมถอยเพื่อหลีกเลี่ยงการโต้แย้ง"}
{"word": "back down", "english": "He refused to back down during the negotiation.", "thai": "เขาปฏิเสธที่จะยอมถอยระหว่างการเจรจา"}
{"word": "back down", "english": "She backed down when she saw his determination.", "thai": "เธอยอมถอยเมื่อเห็นความมุ่งมั่นของเขา"}
{"word": "back down", "english": "Don’t back down just to please others.", "thai": "อย่ายอมถอยเพียงเพื่อเอาใจคนอื่น"}
{"word": "back down", "english": "The union won’t back down on their demands.", "thai": "สหภาพจะไม่ยอมถอยจากข้อเรียกร้องของพวกเขา"}
{"word": "back down", "english": "He backed down to prevent further trouble.", "thai": "เขายอมถอยเพื่อป้องกันปัญหาเพิ่มเติม"}
{"word": "back down", "english": "She’s too fierce to back down in a debate.", "thai": "เธอดุร้ายเกินกว่าจะยอมถอยในการโต้วาที"}
{"word": "back down", "english": "I’m not going to back down this time.", "thai": "ครั้งนี้ฉันจะไม่ยอมถอย"}
{"word": "back down", "english": "They pressured her to back down, but she refused.", "thai": "พวกเขากดดันให้เธอยอมถอย แต่เธอปฏิเสธ"}
{"word": "back down", "english": "He backed down after the heated discussion.", "thai": "เขายอมถอยหลังจากการถกเถียงอย่างดุเดือด"}
{"word": "back down", "english": "You shouldn’t back down when you’re right.", "thai": "คุณไม่ควรถอยเมื่อคุณถูกต้อง"}
{"word": "back down", "english": "She refused to back down from her stance.", "thai": "เธอปฏิเสธที่จะยอมถอยจากจุดยืนของเธอ"}
{"word": "back down", "english": "The team didn’t back down despite the pressure.", "thai": "ทีมไม่ยอมถอยแม้จะมีแรงกดดัน"}
{"word": "back down", "english": "He backed down to avoid escalating the situation.", "thai": "เขายอมถอยเพื่อหลีกเลี่ยงการทำให้สถานการณ์รุนแรงขึ้น"}
{"word": "back down", "english": "Don’t back down; stand up for yourself.", "thai": "อย่ายอมถอย ยืนหยัดเพื่อตัวเอง"}
{"word": "back down", "english": "She backed down when the facts were presented.", "thai": "เธอยอมถอยเมื่อมีการนำเสนอข้อเท็จจริง"}
{"word": "back down", "english": "He’s not one to back down from a dare.", "thai": "เขาไม่ใช่คนที่จะยอมถอยจากคำท้า"}
{"word": "back down", "english": "The company backed down after public backlash.", "thai": "บริษัทถอยหลังจากกระแสต่อต้านของสาธารณะ"}
{"word": "back down", "english": "I won’t back down until I get an apology.", "thai": "ฉันจะไม่ยอมถอยจนกว่าจะได้คำขอโทษ"}
{"word": "back down", "english": "She backed down to keep things civil.", "thai": "เธอยอมถอยเพื่อรักษาความสุภาพ"}
{"word": "back down", "english": "He refused to back down in the face of criticism.", "thai": "เขาปฏิเสธที่จะยอมถอยเมื่อเผชิญกับคำวิจารณ์"}
{"word": "back down", "english": "The politician backed down after the controversy.", "thai": "นักการเมืองยอมถอยหลังจากเกิดความขัดแย้ง"}
{"word": "back down", "english": "Don’t back down; you’ve got this.", "thai": "อย่ายอมถอย คุณทำได้"}
{"word": "back down", "english": "She backed down when she realized her mistake.", "thai": "เธอยอมถอยเมื่อรู้ว่าตัวเองผิด"}
{"word": "back down", "english": "He’s too stubborn to back down now.", "thai": "เขาดื้อเกินกว่าจะยอมถอยตอนนี้"}
{"word": "back down", "english": "They refused to back down from their position.", "thai": "พวกเขาปฏิเสธที่จะยอมถอยจากจุดยืนของพวกเขา"}
{"word": "back down", "english": "I had to back down to avoid a fight.", "thai": "ฉันต้องยอมถอยเพื่อหลีกเลี่ยงการต่อสู้"}
{"word": "back down", "english": "She won’t back down until she gets justice.", "thai": "เธอจะไม่ยอมถอยจนกว่าจะได้ความยุติธรรม"}
{"word": "back down", "english": "He backed down after seeing the evidence.", "thai": "เขายอมถอยหลังจากเห็นหลักฐาน"}
{"word": "back down", "english": "The team backed down under intense pressure.", "thai": "ทีมยอมถอยภายใต้แรงกดดันอย่างหนัก"}
{"word": "back down", "english": "Don’t back down from your dreams.", "thai": "อย่ายอมถอยจากความฝันของคุณ"}
{"word": "back down", "english": "She backed down to avoid hurting his feelings.", "thai": "เธอยอมถอยเพื่อหลีกเลี่ยงการทำร้ายความรู้สึกของเขา"}
{"word": "back down", "english": "He refused to back down during the standoff.", "thai": "เขาปฏิเสธที่จะยอมถอยระหว่างการเผชิญหน้า"}
{"word": "back down", "english": "I’m not going to back down from this fight.", "thai": "ฉันจะไม่ยอมถอยจากการต่อสู้ครั้งนี้"}
{"word": "back down", "english": "She backed down after a long argument.", "thai": "เธอยอมถอยหลังจากการโต้แย้งยาวนาน"}
{"word": "back down", "english": "The company didn’t back down on their policy.", "thai": "บริษัทไม่ยอมถอยจากนโยบายของพวกเขา"}
{"word": "back down", "english": "He backed down when confronted with the truth.", "thai": "เขายอมถอยเมื่อเผชิญหน้ากับความจริง"}
{"word": "back down", "english": "Don’t back down; you’re stronger than that.", "thai": "อย่ายอมถอย คุณแข็งแกร่งกว่านั้น"}
{"word": "back down", "english": "She refused to back down from her beliefs.", "thai": "เธอปฏิเสธที่จะยอมถอยจากความเชื่อของเธอ"}
{"word": "back down", "english": "He backed down to de-escalate the tension.", "thai": "เขายอมถอยเพื่อลดความตึงเครียด"}
{"word": "back down", "english": "The workers won’t back down until they get a raise.", "thai": "คนงานจะไม่ยอมถอยจนกว่าจะได้ขึ้นเงินเดือน"}
{"word": "back down", "english": "I had to back down to keep things friendly.", "thai": "ฉันต้องยอมถอยเพื่อรักษาความเป็นมิตร"}
{"word": "back down", "english": "She backed down when she saw she couldn’t win.", "thai": "เธอยอมถอยเมื่อเห็นว่าเธอไม่สามารถชนะได้"}
{"word": "back down", "english": "He’s not going to back down from this decision.", "thai": "เขาจะไม่ยอมถอยจากคำตัดสินนี้"}
{"word": "back down", "english": "They refused to back down despite the threats.", "thai": "พวกเขาปฏิเสธที่จะยอมถอยแม้จะมีคำขู่"}
{"word": "back down", "english": "I won’t back down until I get what’s fair.", "thai": "ฉันจะไม่ยอมถอยจนกว่าจะได้สิ่งที่ยุติธรรม"}
{"word": "back down", "english": "She backed down to avoid a scene.", "thai": "เธอยอมถอยเพื่อหลีกเลี่ยงการสร้างสถานการณ์"}
{"word": "back down", "english": "He refused to back down in the face of danger.", "thai": "เขาปฏิเสธที่จะยอมถอยเมื่อเผชิญกับอันตราย"}
{"word": "back down", "english": "The team backed down after the tough loss.", "thai": "ทีมยอมถอยหลังจากความพ่ายแพ้ที่หนักหน่วง"}
{"word": "back down", "english": "Don’t back down from standing up for what’s right.", "thai": "อย่ายอมถอยจากการยืนหยัดเพื่อสิ่งที่ถูกต้อง"}
{"word": "back down", "english": "She backed down when the argument got heated.", "thai": "เธอยอมถอยเมื่อการโต้แย้งเริ่มรุนแรง"}
{"word": "back down", "english": "He’s too competitive to back down easily.", "thai": "เขาแข่งขันเกินกว่าจะยอมถอยง่าย ๆ"}
{"word": "back down", "english": "They backed down after public criticism.", "thai": "พวกเขายอมถอยหลังจากถูกวิจารณ์โดยสาธารณะ"}
{"word": "back down", "english": "I’m not going to back down from my opinion.", "thai": "ฉันจะไม่ยอมถอยจากความคิดเห็นของฉัน"}
{"word": "back down", "english": "She refused to back down during the debate.", "thai": "เธอปฏิเสธที่จะยอมถอยระหว่างการโต้วาที"}
{"word": "back down", "english": "He backed down to avoid further conflict.", "thai": "เขายอมถอยเพื่อหลีกเลี่ยงความขัดแย้งเพิ่มเติม"}
{"word": "back down", "english": "Don’t back down; you’ve worked too hard for this.", "thai": "อย่ายอมถอย คุณทำงานหนักเกินไปเพื่อสิ่งนี้"}
{"word": "back down", "english": "The company backed down after the lawsuit threats.", "thai": "บริษัทยอมถอยหลังจากถูกขู่ด้วยคดีความ"}
{"word": "back down", "english": "She backed down when she saw no support.", "thai": "เธอยอมถอยเมื่อเห็นว่าไม่มีคนสนับสนุน"}
{"word": "back down", "english": "He refused to back down from his promise.", "thai": "เขาปฏิเสธที่จะยอมถอยจากคำสัญญาของเขา"}
{"word": "back down", "english": "I had to back down to keep the team united.", "thai": "ฉันต้องยอมถอยเพื่อรักษาความสามัคคีของทีม"}
{"word": "back down", "english": "She’s not going to back down from her goal.", "thai": "เธอจะไม่ยอมถอยจากเป้าหมายของเธอ"}
{"word": "back down", "english": "He backed down when the boss stepped in.", "thai": "เขายอมถอยเมื่อเจ้านายเข้ามาแทรกแซง"}
{"word": "back down", "english": "They refused to back down on their rights.", "thai": "พวกเขาปฏิเสธที่จะยอมถอยจากสิทธิของพวกเขา"}
{"word": "back down", "english": "I won’t back down until we reach an agreement.", "thai": "ฉันจะไม่ยอมถอยจนกว่าเราจะบรรลุข้อตกลง"}
{"word": "back down", "english": "She backed down to avoid embarrassing him.", "thai": "เธอยอมถอยเพื่อหลีกเลี่ยงการทำให้เขาอับอาย"}
{"word": "back down", "english": "He refused to back down despite the pressure.", "thai": "เขาปฏิเสธที่จะยอมถอยแม้จะมีแรงกดดัน"}
{"word": "back down", "english": "The team didn’t back down from the challenge.", "thai": "ทีมไม่ยอมถอยจากความท้าทาย"}
{"word": "back down", "english": "Don’t back down; you’re almost there.", "thai": "อย่ายอมถอย คุณใกล้ถึงเป้าหมายแล้ว"}
{"word": "back down", "english": "She backed down after the long discussion.", "thai": "เธอยอมถอยหลังจากการสนทนายาวนาน"}
{"word": "back down", "english": "He’s not going to back down from his plan.", "thai": "เขาจะไม่ยอมถอยจากแผนของเขา"}
{"word": "blow off", "english": "I decided to blow off the meeting today.", "thai": "ฉันตัดสินใจไม่ไปประชุมวันนี้"}
{"word": "blow off", "english": "She blew off his invitation to the party.", "thai": "เธอปฏิเสธคำเชิญไปงานปาร์ตี้ของเขา"}
{"word": "blow off", "english": "Don’t blow off your homework again.", "thai": "อย่าละเลยการบ้านอีกนะ"}
{"word": "blow off", "english": "He blew off my advice and regretted it.", "thai": "เขาไม่สนใจคำแนะนำของฉันแล้วก็เสียใจ"}
{"word": "blow off", "english": "Why did you blow off our plans?", "thai": "ทำไมคุณถึงยกเลิกแผนของเรา?"}
{"word": "blow off", "english": "She’s always blowing off her responsibilities.", "thai": "เธอมักจะละเลยความรับผิดชอบของตัวเอง"}
{"word": "blow off", "english": "I’m tempted to blow off class this afternoon.", "thai": "ฉันอยากขาดเรียนบ่ายนี้"}
{"word": "blow off", "english": "He blew off the warning and got in trouble.", "thai": "เขาไม่สนใจคำเตือนแล้วก็เดือดร้อน"}
{"word": "blow off", "english": "Don’t blow off his feelings; he’s upset.", "thai": "อย่ามองข้ามความรู้สึกของเขา เขากำลังเสียใจ"}
{"word": "blow off", "english": "They blew off the deadline and faced consequences.", "thai": "พวกเขาไม่สนใจกำหนดเวลาแล้วต้องเจอผลที่ตามมา"}
{"word": "blow off", "english": "I can’t believe you blew off the concert!", "thai": "ไม่น่าเชื่อว่าคุณจะไม่ไปคอนเสิร์ต!"}
{"word": "blow off", "english": "She blew off his text messages all day.", "thai": "เธอไม่ตอบข้อความของเขาทั้งวัน"}
{"word": "blow off", "english": "He’s trying to blow off some steam after work.", "thai": "เขากำลังระบายความเครียดหลังเลิกงาน"}
{"word": "blow off", "english": "Don’t blow off the chance to apologize.", "thai": "อย่าปล่อยโอกาสขอโทษให้หลุดไป"}
{"word": "blow off", "english": "I blew off the gym today; I’m too tired.", "thai": "วันนี้ฉันขาดยิมไป ฉันเหนื่อยเกินไป"}
{"word": "blow off", "english": "She blew off his call and went to bed.", "thai": "เธอไม่รับโทรศัพท์ของเขาแล้วเข้านอน"}
{"word": "blow off", "english": "He keeps blowing off his chores.", "thai": "เขายังคงละเลยงานบ้านของตัวเอง"}
{"word": "blow off", "english": "I’m not going to blow off this opportunity.", "thai": "ฉันจะไม่ปล่อยโอกาสนี้หลุดไป"}
{"word": "blow off", "english": "They blew off the rules and got caught.", "thai": "พวกเขาไม่สนใจกฎแล้วถูกจับได้"}
{"word": "blow off", "english": "She blew off the study group to hang out.", "thai": "เธอขาดกลุ่มเรียนเพื่อไปเที่ยว"}
{"word": "blow off", "english": "He blew off my suggestion without thinking.", "thai": "เขาไม่สนใจข้อเสนอของฉันโดยไม่คิด"}
{"word": "blow off", "english": "Don’t blow off your doctor’s appointment.", "thai": "อย่าขาดนัดหมอของเธอนะ"}
{"word": "blow off", "english": "I blew off the party to finish my project.", "thai": "ฉันไม่ไปงานปาร์ตี้เพื่อทำโปรเจกต์ให้เสร็จ"}
{"word": "blow off", "english": "She’s always blowing off her friends’ plans.", "thai": "เธอมักจะไม่ไปตามแผนของเพื่อน"}
{"word": "blow off", "english": "He blew off the feedback and didn’t improve.", "thai": "เขาไม่สนใจคำติชมและไม่พัฒนา"}
{"word": "blow off", "english": "I can’t just blow off my boss’s request.", "thai": "ฉันไม่สามารถเพิกเฉยคำขอของเจ้านายได้"}
{"word": "blow off", "english": "They blew off the safety instructions.", "thai": "พวกเขาไม่สนใจคำแนะนำด้านความปลอดภัย"}
{"word": "blow off", "english": "She blew off his apology and walked away.", "thai": "เธอไม่สนใจคำขอโทษของเขาแล้วเดินจากไป"}
{"word": "blow off", "english": "He’s planning to blow off work tomorrow.", "thai": "เขาวางแผนจะหยุดงานพรุ่งนี้"}
{"word": "blow off", "english": "Don’t blow off her concerns; they’re valid.", "thai": "อย่ามองข้ามความกังวลของเธอ มันมีเหตุผล"}
{"word": "blow off", "english": "I blew off the movie to stay home.", "thai": "ฉันไม่ไปดูหนังเพื่ออยู่บ้าน"}
{"word": "blow off", "english": "She blew off the email and missed the deadline.", "thai": "เธอไม่สนใจอีเมลแล้วพลาดกำหนดเวลา"}
{"word": "blow off", "english": "He keeps blowing off his diet plan.", "thai": "เขายังคงละเลยแผนควบคุมอาหาร"}
{"word": "blow off", "english": "I’m not going to blow off this interview.", "thai": "ฉันจะไม่พลาดการสัมภาษณ์นี้"}
{"word": "blow off", "english": "They blew off the training session.", "thai": "พวกเขาไม่ไปเซสชันฝึกอบรม"}
{"word": "blow off", "english": "She blew off his question with a laugh.", "thai": "เธอหัวเราะกลบเกลื่อนคำถามของเขา"}
{"word": "blow off", "english": "He blew off the exam review and failed.", "thai": "เขาไม่สนใจการทบทวนสอบแล้วสอบตก"}
{"word": "blow off", "english": "Don’t blow off your chance to speak up.", "thai": "อย่าปล่อยโอกาสพูดออกไปให้เสีย"}
{"word": "blow off", "english": "I blew off the event to catch up on sleep.", "thai": "ฉันขาดงานนั้นเพื่อนอนชดเชย"}
{"word": "blow off", "english": "She’s always blowing off her family’s calls.", "thai": "เธอมักจะไม่รับโทรศัพท์จากครอบครัว"}
{"word": "blow off", "english": "He blew off the meeting to go golfing.", "thai": "เขาไม่ไปประชุมเพื่อไปตีกอล์ฟ"}
{"word": "blow off", "english": "I can’t blow off this project; it’s too important.", "thai": "ฉันไม่สามารถละเลยโปรเจกต์นี้ได้ มันสำคัญเกินไป"}
{"word": "blow off", "english": "They blew off the complaints and lost customers.", "thai": "พวกเขาไม่สนใจคำร้องเรียนแล้วเสียลูกค้า"}
{"word": "blow off", "english": "She blew off his message and went out.", "thai": "เธอไม่สนใจข้อความของเขาแล้วออกไปข้างนอก"}
{"word": "blow off", "english": "He’s blowing off his workout routine again.", "thai": "เขาละเลยตารางออกกำลังกายอีกแล้ว"}
{"word": "blow off", "english": "Don’t blow off the chance to network.", "thai": "อย่าปล่อยโอกาสสร้างเครือข่ายให้หลุดไป"}
{"word": "blow off", "english": "I blew off the lecture to meet friends.", "thai": "ฉันขาดบรรยายเพื่อไปเจอเพื่อน"}
{"word": "blow off", "english": "She blew off his concerns as unimportant.", "thai": "เธอมองข้ามความกังวลของเขาเหมือนไม่สำคัญ"}
{"word": "blow off", "english": "He blew off the rehearsal and messed up.", "thai": "เขาไม่ไปซ้อมแล้วทำพลาด"}
{"word": "blow off", "english": "I’m not going to blow off this deadline.", "thai": "ฉันจะไม่ปล่อยให้กำหนดเวลานี้หลุดไป"}
{"word": "blow off", "english": "They blew off the instructions and got lost.", "thai": "พวกเขาไม่สนใจคำแนะนำแล้วหลงทาง"}
{"word": "blow off", "english": "She blew off his offer to help.", "thai": "เธอปฏิเสธข้อเสนอช่วยเหลือของเขา"}
{"word": "blow off", "english": "He keeps blowing off his therapy sessions.", "thai": "เขายังคงขาดเซสชันบำบัด"}
{"word": "blow off", "english": "Don’t blow off her advice; she’s experienced.", "thai": "อย่ามองข้ามคำแนะนำของเธอ เธอมีประสบการณ์"}
{"word": "blow off", "english": "I blew off the party to study instead.", "thai": "ฉันไม่ไปงานปาร์ตี้เพื่ออ่านหนังสือแทน"}
{"word": "blow off", "english": "She blew off the call and went shopping.", "thai": "เธอไม่รับโทรศัพท์แล้วไปช้อปปิ้ง"}
{"word": "blow off", "english": "He blew off the warning signs and crashed.", "thai": "เขาไม่สนใจสัญญาณเตือนแล้วเกิดอุบัติเหตุ"}
{"word": "blow off", "english": "I can’t blow off my responsibilities anymore.", "thai": "ฉันไม่สามารถละเลยความรับผิดชอบได้อีกต่อไป"}
{"word": "blow off", "english": "They blew off the feedback and didn’t improve.", "thai": "พวกเขาไม่สนใจคำติชมและไม่พัฒนา"}
{"word": "blow off", "english": "She’s always blowing off his suggestions.", "thai": "เธอมักจะไม่สนใจข้อเสนอของเขา"}
{"word": "blow off", "english": "He blew off the team meeting to relax.", "thai": "เขาไม่ไปประชุมทีมเพื่อไปพักผ่อน"}
{"word": "blow off", "english": "Don’t blow off the chance to learn something new.", "thai": "อย่าปล่อยโอกาสเรียนรู้สิ่งใหม่ให้หลุดไป"}
{"word": "blow off", "english": "I blew off the webinar to finish my work.", "thai": "ฉันขาดเว็บบินาร์เพื่อทำงานให้เสร็จ"}
{"word": "blow off", "english": "She blew off his email and missed the update.", "thai": "เธอไม่สนใจอีเมลของเขาแล้วพลาดการอัปเดต"}
{"word": "blow off", "english": "He keeps blowing off his doctor’s advice.", "thai": "เขายังคงไม่สนใจคำแนะนำของหมอ"}
{"word": "blow off", "english": "I’m not going to blow off this presentation.", "thai": "ฉันจะไม่พลาดการนำเสนอนี้"}
{"word": "blow off", "english": "They blew off the guidelines and got in trouble.", "thai": "พวกเขาไม่สนใจแนวทางแล้วเจอปัญหา"}
{"word": "blow off", "english": "She blew off his request for a meeting.", "thai": "เธอปฏิเสธคำขอประชุมของเขา"}
{"word": "blow off", "english": "He blew off the study session and failed the test.", "thai": "เขาไม่ไปเซสชันเรียนแล้วสอบตก"}
{"word": "blow off", "english": "Don’t blow off your chance to shine.", "thai": "อย่าปล่อยโอกาสที่คุณจะได้โดดเด่นให้หลุดไป"}
{"word": "blow off", "english": "I blew off the dinner to catch up on emails.", "thai": "ฉันไม่ไปกินข้าวเย็นเพื่อเคลียร์อีเมล"}
{"word": "blow off", "english": "She’s always blowing off her workout plans.", "thai": "เธอมักจะละเลยแผนออกกำลังกาย"}
{"word": "blow off", "english": "He blew off the advice and made a mistake.", "thai": "เขาไม่สนใจคำแนะนำแล้วทำผิด"}
{"word": "blow off", "english": "I can’t blow off this family event.", "thai": "ฉันไม่สามารถขาดงานครอบครัวนี้ได้"}
{"word": "blow off", "english": "They blew off the rules and got disqualified.", "thai": "พวกเขาไม่สนใจกฎแล้วถูกตัดสิทธิ์"}
{"word": "blow off", "english": "She blew off his call to focus on work.", "thai": "เธอไม่รับโทรศัพท์ของเขาเพื่อโฟกัสที่งาน"}
{"word": "blow off", "english": "He keeps blowing off his budget goals.", "thai": "เขายังคงละเลยเป้าหมายงบประมาณ"}
{"word": "blow off", "english": "Don’t blow off her invitation; it’s important.", "thai": "อย่าปฏิเสธคำเชิญของเธอ มันสำคัญ"}
{"word": "blow off", "english": "I blew off the seminar to help a friend.", "thai": "ฉันขาดสัมมนาเพื่อช่วยเพื่อน"}
{"word": "blow off", "english": "She blew off his comment with a shrug.", "thai": "เธอยักไหล่ไม่สนใจความคิดเห็นของเขา"}
{"word": "blow off", "english": "He blew off the practice and underperformed.", "thai": "เขาไม่ไปซ้อมแล้วทำได้ไม่ดี"}
{"word": "blow off", "english": "I’m not going to blow off this job offer.", "thai": "ฉันจะไม่ปล่อยข้อเสนองานนี้ให้หลุดไป"}
{"word": "blow off", "english": "They blew off the warning and got fined.", "thai": "พวกเขาไม่สนใจคำเตือนแล้วถูกปรับ"}
{"word": "blow off", "english": "She blew off his message and forgot to reply.", "thai": "เธอไม่สนใจข้อความของเขาแล้วลืมตอบ"}
{"word": "blow off", "english": "He keeps blowing off his study schedule.", "thai": "เขายังคงละเลยตารางเรียนของตัวเอง"}
{"word": "blow off", "english": "Don’t blow off the chance to meet the CEO.", "thai": "อย่าปล่อยโอกาสเจอ CEO ให้หลุดไป"}
{"word": "blow off", "english": "I blew off the event to finish my book.", "thai": "ฉันไม่ไปงานนั้นเพื่ออ่านหนังสือให้จบ"}
{"word": "blow off", "english": "She’s always blowing off her coach’s advice.", "thai": "เธอมักจะไม่สนใจคำแนะนำของโค้ช"}
{"word": "blow off", "english": "He blew off the call to go hiking.", "thai": "เขาไม่รับโทรศัพท์เพื่อไปเดินป่า"}
{"word": "blow off", "english": "I can’t blow off this exam review.", "thai": "ฉันไม่สามารถขาดการทบทวนสอบนี้ได้"}
{"word": "blow off", "english": "They blew off the instructions and failed.", "thai": "พวกเขาไม่สนใจคำแนะนำแล้วล้มเหลว"}
{"word": "blow off", "english": "She blew off his suggestion and went her own way.", "thai": "เธอไม่สนใจข้อเสนอของเขาแล้วทำตามใจตัวเอง"}
{"word": "blow off", "english": "He keeps blowing off his morning routine.", "thai": "เขายังคงละเลยกิจวัตรตอนเช้า"}
{"word": "blow off", "english": "Don’t blow off the chance to travel.", "thai": "อย่าปล่อยโอกาสเดินทางให้หลุดไป"}
{"word": "blow off", "english": "I blew off the meeting to deal with an emergency.", "thai": "ฉันไม่ไปประชุมเพื่อจัดการกับเหตุฉุกเฉิน"}
{"word": "blow off", "english": "She blew off his email and missed the news.", "thai": "เธอไม่สนใจอีเมลของเขาแล้วพลาดข่าว"}
{"word": "blow off", "english": "He blew off the workshop to relax.", "thai": "เขาไม่ไปเวิร์กช็อปเพื่อพักผ่อน"}
{"word": "blow off", "english": "I’m not going to blow off this opportunity again.", "thai": "ฉันจะไม่ปล่อยโอกาสนี้หลุดไปอีก"}
{"word": "blow off", "english": "They blew off the advice and made errors.", "thai": "พวกเขาไม่สนใจคำแนะนำแล้วทำผิดพลาด"}
{"word": "blow off", "english": "She blew off his call and went to the beach.", "thai": "เธอไม่รับโทรศัพท์ของเขาแล้วไปชายหาด"}
{"word": "bring back", "english": "Can you bring back my book tomorrow?", "thai": "คุณช่วยเอานิยายคืนมาให้ฉันพรุ่งนี้ได้ไหม?"}
{"word": "bring back", "english": "This song brings back so many memories.", "thai": "เพลงนี้ทำให้ฉันนึกถึงความทรงจำมากมาย"}
{"word": "bring back", "english": "They should bring back that old TV show.", "thai": "พวกเขาควรนำรายการทีวีเก่านั้นกลับมา"}
{"word": "bring back", "english": "I forgot to bring back her jacket.", "thai": "ฉันลืมเอาแจ็คเก็ตของเธอคืน"}
{"word": "bring back", "english": "This smell brings back my childhood.", "thai": "กลิ่นนี้ทำให้ฉันนึกถึงวัยเด็ก"}
{"word": "bring back", "english": "Please bring back the tools you borrowed.", "thai": "กรุณาเอาเครื่องมือที่ยืมไปคืนด้วย"}
{"word": "bring back", "english": "They’re trying to bring back retro fashion.", "thai": "พวกเขากำลังพยายามนำแฟชั่นย้อนยุคกลับมา"}
{"word": "bring back", "english": "I’ll bring back the dishes after dinner.", "thai": "ฉันจะเอาน้ำยาล้างจานคืนหลังอาหารเย็น"}
{"word": "bring back", "english": "That movie brings back good times.", "thai": "ภาพยนตร์เรื่องนั้นทำให้ฉันนึกถึงช่วงเวลาดีๆ"}
{"word": "bring back", "english": "Can you bring back some milk from the store?", "thai": "คุณช่วยซื้อนมจากร้านแล้วเอากลับมาให้หน่อยได้ไหม?"}
{"word": "bring back", "english": "Let’s bring back the old traditions.", "thai": "มานำประเพณีเก่ากลับมากันเถอะ"}
{"word": "bring back", "english": "He didn’t bring back my headphones.", "thai": "เขาไม่ได้เอาเครื่องเสียงของฉันคืน"}
{"word": "bring back", "english": "This place brings back memories of our trip.", "thai": "สถานที่นี้ทำให้ฉันนึกถึงการเดินทางของเรา"}
{"word": "bring back", "english": "They want to bring back the old menu.", "thai": "พวกเขาต้องการนำเมนูเก่ากลับมา"}
{"word": "bring back", "english": "I’ll bring back your charger tomorrow.", "thai": "ฉันจะเอาเครื่องชาร์จของเธอคืนพรุ่งนี้"}
{"word": "bring back", "english": "This photo brings back our summer vacation.", "thai": "ภาพนี้ทำให้ฉันนึกถึงวันหยุดฤดูร้อนของเรา"}
{"word": "bring back", "english": "Can you bring back the library books?", "thai": "คุณช่วยเอานิยายห้องสมุดคืนได้ไหม?"}
{"word": "bring back", "english": "They’re planning to bring back the festival.", "thai": "พวกเขาวางแผนจะนำงานเทศกาลนั้นกลับมา"}
{"word": "bring back", "english": "She forgot to bring back my scarf.", "thai": "เธอลืมเอาน้ำยาคล้องคอของฉันคืน"}
{"word": "bring back", "english": "This song brings back my high school days.", "thai": "เพลงนี้ทำให้ฉันนึกถึงสมัยมัธยม"}
{"word": "bring back", "english": "Please bring back the keys you took.", "thai": "กรุณาเอากุญแจที่คุณยืมไปคืนด้วย"}
{"word": "bring back", "english": "They should bring back those classic games.", "thai": "พวกเขาควรนำเกมคลาสสิกเหล่านั้นกลับมา"}
{"word": "bring back", "english": "This smell brings back memories of my grandma.", "thai": "กลิ่นนี้ทำให้ฉันนึกถึงคุณย่า"}
{"word": "bring back", "english": "I’ll bring back the money I owe you.", "thai": "ฉันจะเอาเงินที่ฉันเป็นหนี้คุณคืน"}
{"word": "bring back", "english": "They’re trying to bring back vinyl records.", "thai": "พวกเขากำลังพยายามนำแผ่นเสียงไวนิลกลับมา"}
{"word": "bring back", "english": "Can you bring back some snacks from the kitchen?", "thai": "คุณช่วยเอาขนมจากครัวมาให้หน่อยได้ไหม?"}
{"word": "bring back", "english": "This place brings back our first date.", "thai": "สถานที่นี้ทำให้ฉันนึกถึงเดตแรกของเรา"}
{"word": "bring back", "english": "He needs to bring back the borrowed laptop.", "thai": "เขาต้องเอาแล็ปท็อปที่ยืมไปคืน"}
{"word": "bring back", "english": "Let’s bring back the family game night.", "thai": "มานำค่ำคืนเกมครอบครัวกลับมากันเถอะ"}
{"word": "bring back", "english": "This movie brings back so much nostalgia.", "thai": "ภาพยนตร์เรื่องนี้ทำให้ฉันรู้สึกคิดถึงวันเก่าๆ"}
{"word": "bring back", "english": "Please bring back the documents you took.", "thai": "กรุณาเอาเอกสารที่คุณยืมไปคืนด้วย"}
{"word": "bring back", "english": "They want to bring back the old logo.", "thai": "พวกเขาต้องการนำโลโก้เก่ากลับมา"}
{"word": "bring back", "english": "I forgot to bring back her umbrella.", "thai": "ฉันลืมเอาน้ำยาร่มของเธอคืน"}
{"word": "bring back", "english": "This song brings back our road trip.", "thai": "เพลงนี้ทำให้ฉันนึกถึงการเดินทางของเรา"}
{"word": "bring back", "english": "Can you bring back some coffee from the shop?", "thai": "คุณช่วยซื้อกาแฟจากร้านมาให้หน่อยได้ไหม?"}
{"word": "bring back", "english": "They’re trying to bring back bell-bottom jeans.", "thai": "พวกเขากำลังพยายามนำกางเกงขามากลับมา"}
{"word": "bring back", "english": "I’ll bring back the tools after I’m done.", "thai": "ฉันจะเอาเครื่องมือคืนหลังจากใช้เสร็จ"}
{"word": "bring back", "english": "This smell brings back my old hometown.", "thai": "กลิ่นนี้ทำให้ฉันนึกถึงบ้านเกิดเก่า"}
{"word": "bring back", "english": "She didn’t bring back my headphones yet.", "thai": "เธอยังไม่ได้เอาเครื่องเสียงของฉันคืน"}
{"word": "bring back", "english": "Let’s bring back the weekly book club.", "thai": "มานำคลับหนังสือประจำสัปดาห์กลับมากันเถอะ"}
{"word": "bring back", "english": "This photo brings back our wedding day.", "thai": "ภาพนี้ทำให้ฉันนึกถึงวันแต่งงานของเรา"}
{"word": "bring back", "english": "Can you bring back the receipt from the store?", "thai": "คุณช่วยเอาใบเสร็จจากร้านคืนมาได้ไหม?"}
{"word": "bring back", "english": "They should bring back the old school uniforms.", "thai": "พวกเขาควรนำชุดนักเรียนเก่ากลับมา"}
{"word": "bring back", "english": "I’ll bring back your book next week.", "thai": "ฉันจะเอานิยายของคุณคืนสัปดาห์หน้า"}
{"word": "bring back", "english": "This song brings back my college years.", "thai": "เพลงนี้ทำให้ฉันนึกถึงสมัยเรียนมหาวิทยาลัย"}
{"word": "bring back", "english": "Please bring back the plates after the party.", "thai": "กรุณาเอาน้ำยาแผ่นจานคืนหลังงานปาร์ตี้"}
{"word": "bring back", "english": "They’re trying to bring back flip phones.", "thai": "พวกเขากำลังพยายามนำโทรศัพท์ฝาพับกลับมา"}
{"word": "bring back", "english": "This place brings back memories of our hike.", "thai": "สถานที่นี้ทำให้ฉันนึกถึงการเดินป่าของเรา"}
{"word": "bring back", "english": "He forgot to bring back my camera.", "thai": "เขาลืมเอากล้องของฉันคืน"}
{"word": "bring back", "english": "Let’s bring back the old movie nights.", "thai": "มานำค่ำคืนดูหนังเก่ากลับมากันเถอะ"}
{"word": "bring back", "english": "This smell brings back my summer camp.", "thai": "กลิ่นนี้ทำให้ฉันนึกถึงค่ายฤดูร้อน"}
{"word": "bring back", "english": "Can you bring back some water from the kitchen?", "thai": "คุณช่วยเอาขวดน้ำจากครัวมาให้หน่อยได้ไหม?"}
{"word": "bring back", "english": "They want to bring back the old recipes.", "thai": "พวกเขาต้องการนำสูตรอาหารเก่ากลับมา"}
{"word": "bring back", "english": "I’ll bring back the keys after the trip.", "thai": "ฉันจะเอากุญแจคืนหลังจากทริป"}
{"word": "bring back", "english": "This song brings back our first dance.", "thai": "เพลงนี้ทำให้ฉันนึกถึงการเต้นครั้งแรกของเรา"}
{"word": "bring back", "english": "Please bring back the borrowed chair.", "thai": "กรุณาเอาเก้าอี้ที่ยืมไปคืนด้วย"}
{"word": "bring back", "english": "They’re trying to bring back 80s music.", "thai": "พวกเขากำลังพยายามนำเพลงยุค 80 กลับมา"}
{"word": "bring back", "english": "I forgot to bring back her notebook.", "thai": "ฉันลืมเอาน้ำยาสมุดบันทึกของเธอคืน"}
{"word": "bring back", "english": "This place brings back our family reunion.", "thai": "สถานที่นี้ทำให้ฉันนึกถึงงานรวมญาติของเรา"}
{"word": "bring back", "english": "Can you bring back some ice from the store?", "thai": "คุณช่วยซื้อน้ำแข็งจากร้านมาให้หน่อยได้ไหม?"}
{"word": "bring back", "english": "They should bring back the old park rules.", "thai": "พวกเขาควรนำกฎสวนสาธารณะเก่ากลับมา"}
{"word": "bring back", "english": "I’ll bring back your pen tomorrow.", "thai": "ฉันจะเอาน้ำยาปากกาของคุณคืนพรุ่งนี้"}
{"word": "bring back", "english": "This movie brings back my teenage years.", "thai": "ภาพยนตร์เรื่องนี้ทำให้ฉันนึกถึงวัยรุ่น"}
{"word": "bring back", "english": "Please bring back the borrowed blanket.", "thai": "กรุณาเอาน้ำยาผ้าห่มที่ยืมไปคืนด้วย"}
{"word": "bring back", "english": "They’re trying to bring back the old gameshow.", "thai": "พวกเขากำลังพยายามนำเกมโชว์เก่ากลับมา"}
{"word": "bring back", "english": "This smell brings back our beach vacation.", "thai": "กลิ่นนี้ทำให้ฉันนึกถึงวันหยุดที่ชายหาด"}
{"word": "bring back", "english": "He didn’t bring back my phone charger.", "thai": "เขาไม่ได้เอาเครื่องชาร์จโทรศัพท์ของฉันคืน"}
{"word": "bring back", "english": "Let’s bring back the monthly potluck.", "thai": "มานำงานเลี้ยงแบบทุกคนนำอาหารมาแบ่งปันประจำเดือนกลับมากันเถอะ"}
{"word": "bring back", "english": "This song brings back our prom night.", "thai": "เพลงนี้ทำให้ฉันนึกถึงคืนงานพรอม"}
{"word": "bring back", "english": "Can you bring back some bread from the bakery?", "thai": "คุณช่วยซื้อขนมปังจากร้านเบเกอรี่มาให้หน่อยได้ไหม?"}
{"word": "bring back", "english": "They want to bring back the old uniforms.", "thai": "พวกเขาต้องการนำชุดยูนิฟอร์มเก่ากลับมา"}
{"word": "bring back", "english": "I’ll bring back the book after I finish it.", "thai": "ฉันจะเอานิยายคืนหลังจากอ่านจบ"}
{"word": "bring back", "english": "This place brings back our camping trip.", "thai": "สถานที่นี้ทำให้ฉันนึกถึงทริปแคมป์ปิ้งของเรา"}
{"word": "bring back", "english": "Please bring back the borrowed headphones.", "thai": "กรุณาเอาเครื่องเสียงที่ยืมไปคืนด้วย"}
{"word": "bring back", "english": "They’re trying to bring back typewriters.", "thai": "พวกเขากำลังพยายามนำเครื่องพิมพ์ดีดกลับมา"}
{"word": "bring back", "english": "This photo brings back our graduation day.", "thai": "ภาพนี้ทำให้ฉันนึกถึงวันรับปริญญาของเรา"}
{"word": "bring back", "english": "Can you bring back some juice from the store?", "thai": "คุณช่วยซื้อน้ำผลไม้จากร้านมาให้หน่อยได้ไหม?"}
{"word": "bring back", "english": "They should bring back the old playground.", "thai": "พวกเขาควรนำสนามเด็กเล่นเก่ากลับมา"}
{"word": "bring back", "english": "I forgot to bring back his jacket.", "thai": "ฉันลืมเอาน้ำยาแจ็คเก็ตของเขาคืน"}
{"word": "bring back", "english": "This song brings back our old road trips.", "thai": "เพลงนี้ทำให้ฉันนึกถึงทริปถนนเก่าๆ ของเรา"}
{"word": "bring back", "english": "Please bring back the tools after you’re done.", "thai": "กรุณาเอาเครื่องมือคืนหลังจากใช้เสร็จ"}
{"word": "bring back", "english": "They’re trying to bring back silent films.", "thai": "พวกเขากำลังพยายามนำภาพยนตร์เงียบกลับมา"}
{"word": "bring back", "english": "This smell brings back my old neighborhood.", "thai": "กลิ่นนี้ทำให้ฉันนึกถึงย่านเก่าของฉัน"}
{"word": "bring back", "english": "I’ll bring back your scarf tomorrow.", "thai": "ฉันจะเอาน้ำยาคล้องคอของคุณคืนพรุ่งนี้"}
{"word": "bring back", "english": "This movie brings back our first date night.", "thai": "ภาพยนตร์เรื่องนี้ทำให้ฉันนึกถึงคืนเดตแรกของเรา"}
{"word": "bring back", "english": "Can you bring back some fruit from the market?", "thai": "คุณช่วยซื้อผลไม้จากตลาดมาให้หน่อยได้ไหม?"}
{"word": "bring back", "english": "They want to bring back the old school dances.", "thai": "พวกเขาต้องการนำงานเต้นรำโรงเรียนเก่ากลับมา"}
{"word": "bring back", "english": "I forgot to bring back her sunglasses.", "thai": "ฉันลืมเอาน้ำยาแว่นกันแดดของเธอคืน"}
{"word": "bring back", "english": "This place brings back our summer camp.", "thai": "สถานที่นี้ทำให้ฉันนึกถึงค่ายฤดูร้อนของเรา"}
{"word": "bring back", "english": "Please bring back the borrowed textbook.", "thai": "กรุณาเอานิยายเรียนที่ยืมไปคืนด้วย"}
{"word": "bring back", "english": "They’re trying to bring back cassette tapes.", "thai": "พวกเขากำลังพยายามนำเทปคาสเซ็ตต์กลับมา"}
{"word": "bring back", "english": "This song brings back our old hangouts.", "thai": "เพลงนี้ทำให้ฉันนึกถึงสถานที่ที่เราเคยไปเที่ยวด้วยกัน"}
{"word": "bring back", "english": "Can you bring back some napkins from the kitchen?", "thai": "คุณช่วยเอาผ้าเช็ดปากจากครัวมาให้หน่อยได้ไหม?"}
{"word": "bring back", "english": "They should bring back the old team mascot.", "thai": "พวกเขาควรนำมาสคอตทีมเก่ากลับมา"}
{"word": "bring back", "english": "I’ll bring back the money by next week.", "thai": "ฉันจะเอาเงินคืนภายในสัปดาห์หน้า"}
{"word": "bring back", "english": "This photo brings back our family vacation.", "thai": "ภาพนี้ทำให้ฉันนึกถึงวันหยุดครอบครัวของเรา"}
{"word": "bring back", "english": "Please bring back the borrowed pen.", "thai": "กรุณาเอาน้ำยาปากกาที่ยืมไปคืนด้วย"}
{"word": "bring back", "english": "They’re trying to bring back the old arcade.", "thai": "พวกเขากำลังพยายามนำตู้เกมเก่ากลับมา"}
{"word": "bring back", "english": "This smell brings back my old school days.", "thai": "กลิ่นนี้ทำให้ฉันนึกถึงสมัยเรียน"}
{"word": "bring back", "english": "I forgot to bring back his book.", "thai": "ฉันลืมเอานิยายของเขาคืน"}
{"word": "bring back", "english": "Let’s bring back the weekly movie night.", "thai": "มานำค่ำคืนดูหนังประจำสัปดาห์กลับมากันเถอะ"}
{"word": "bring back", "english": "This song brings back our old adventures.", "thai": "เพลงนี้ทำให้ฉันนึกถึงการผจญภัยเก่าๆ ของเรา"}
{"word": "call up", "english": "I’ll call up Sarah to confirm the plans.", "thai": "ฉันจะโทรหาซาร่าห์เพื่อยืนยันแผน"}
{"word": "call up", "english": "This song calls up memories of my childhood.", "thai": "เพลงนี้ทำให้ฉันนึกถึงวัยเด็ก"}
{"word": "call up", "english": "Can you call up the restaurant to reserve a table?", "thai": "คุณช่วยโทรไปร้านอาหารเพื่อจองโต๊ะได้ไหม?"}
{"word": "call up", "english": "They called up all the reserves for duty.", "thai": "พวกเขาเรียกตัวสำรองทั้งหมดมาปฏิบัติหน้าที่"}
{"word": "call up", "english": "I need to call up my mom tonight.", "thai": "ฉันต้องโทรหาแม่คืนนี้"}
{"word": "call up", "english": "This photo calls up our summer vacation.", "thai": "ภาพนี้ทำให้ฉันนึกถึงวันหยุดฤดูร้อนของเรา"}
{"word": "call up", "english": "He called up his friend to catch up.", "thai": "เขาโทรหาเพื่อนเพื่อคุยอัปเดต"}
{"word": "call up", "english": "The army might call up more soldiers.", "thai": "กองทัพอาจเรียกทหารเพิ่ม"}
{"word": "call up", "english": "Let’s call up the pizza place for delivery.", "thai": "มาโทรสั่งพิซซ่าส่งถึงบ้านกันเถอะ"}
{"word": "call up", "english": "This smell calls up memories of my grandma’s cooking.", "thai": "กลิ่นนี้ทำให้ฉันนึกถึงอาหารที่คุณย่าทำ"}
{"word": "call up", "english": "I forgot to call up the doctor’s office.", "thai": "ฉันลืมโทรไปที่สำนักงานหมอ"}
{"word": "call up", "english": "They called up the team for an emergency meeting.", "thai": "พวกเขาเรียกทีมมาประชุมฉุกเฉิน"}
{"word": "call up", "english": "She called up her cousin to chat.", "thai": "เธอโทรหาพี่น้องของเธอเพื่อคุย"}
{"word": "call up", "english": "This movie calls up my high school days.", "thai": "ภาพยนตร์เรื่องนี้ทำให้ฉันนึกถึงสมัยมัธยม"}
{"word": "call up", "english": "Can you call up the hotel to check availability?", "thai": "คุณช่วยโทรไปโรงแรมเพื่อเช็คห้องว่างได้ไหม?"}
{"word": "call up", "english": "The coach called up the new players.", "thai": "โค้ชเรียกนักกีฬาใหม่เข้ามา"}
{"word": "call up", "english": "I’ll call up John to ask about the project.", "thai": "ฉันจะโทรหาจอห์นเพื่อถามเกี่ยวกับโปรเจกต์"}
{"word": "call up", "english": "This place calls up our first date.", "thai": "สถานที่นี้ทำให้ฉันนึกถึงเดตแรกของเรา"}
{"word": "call up", "english": "She called up the store to complain.", "thai": "เธอโทรไปร้านค้าเพื่อร้องเรียน"}
{"word": "call up", "english": "They called up volunteers for the event.", "thai": "พวกเขาเรียกอาสาสมัครสำหรับงานนี้"}
{"word": "call up", "english": "I need to call up my boss about tomorrow.", "thai": "ฉันต้องโทรหาเจ้านายเกี่ยวกับวันพรุ่งนี้"}
{"word": "call up", "english": "This song calls up our road trip memories.", "thai": "เพลงนี้ทำให้ฉันนึกถึงความทรงจำจากทริปถนน"}
{"word": "call up", "english": "Can you call up the airline to change the flight?", "thai": "คุณช่วยโทรไปสายการบินเพื่อเปลี่ยนเที่ยวบินได้ไหม?"}
{"word": "call up", "english": "They called up the manager to resolve the issue.", "thai": "พวกเขาเรียกผู้จัดการมาแก้ปัญหา"}
{"word": "call up", "english": "He called up his sister to wish her luck.", "thai": "เขาโทรหาน้องสาวเพื่ออวยพรให้โชคดี"}
{"word": "call up", "english": "This photo calls up our family reunion.", "thai": "ภาพนี้ทำให้ฉันนึกถึงงานรวมญาติของเรา"}
{"word": "call up", "english": "I’ll call up the mechanic to check my car.", "thai": "ฉันจะโทรหาช่างเพื่อตรวจรถของฉัน"}
{"word": "call up", "english": "The team called up a rookie for the game.", "thai": "ทีมเรียกนักกีฬาหน้าใหม่มาแข่ง"}
{"word": "call up", "english": "She called up her friend to apologize.", "thai": "เธอโทรหาเพื่อนเพื่อขอโทษ"}
{"word": "call up", "english": "This smell calls up my old neighborhood.", "thai": "กลิ่นนี้ทำให้ฉันนึกถึงย่านเก่าของฉัน"}
{"word": "call up", "english": "Can you call up the caterer to confirm?", "thai": "คุณช่วยโทรไปยืนยันกับผู้จัดเลี้ยงได้ไหม?"}
{"word": "call up", "english": "They called up extra staff for the holiday.", "thai": "พวกเขาเรียกพนักงานเพิ่มสำหรับวันหยุด"}
{"word": "call up", "english": "I forgot to call up my dentist yesterday.", "thai": "ฉันลืมโทรหาหมอฟันเมื่อวาน"}
{"word": "call up", "english": "This movie calls up our college days.", "thai": "ภาพยนตร์เรื่องนี้ทำให้ฉันนึกถึงสมัยเรียนมหาวิทยาลัย"}
{"word": "call up", "english": "He called up the support line for help.", "thai": "เขาโทรไปสายสนับสนุนเพื่อขอความช่วยเหลือ"}
{"word": "call up", "english": "They called up the substitutes for the match.", "thai": "พวกเขาเรียกตัวสำรองสำหรับการแข่งขัน"}
{"word": "call up", "english": "I’ll call up my brother to check in.", "thai": "ฉันจะโทรหาน้องชายเพื่อดูว่าเป็นยังไง"}
{"word": "call up", "english": "This song calls up our summer camp.", "thai": "เพลงนี้ทำให้ฉันนึกถึงค่ายฤดูร้อน"}
{"word": "call up", "english": "Can you call up the vet for an appointment?", "thai": "คุณช่วยโทรหาสัตวแพทย์เพื่อนัดหมายได้ไหม?"}
{"word": "call up", "english": "They called up the interns for training.", "thai": "พวกเขาเรียกนักศึกษาฝึกงานมาอบรม"}
{"word": "call up", "english": "She called up her aunt to share the news.", "thai": "เธอโทรหาป้าเพื่อบอกข่าว"}
{"word": "call up", "english": "This place calls up our old adventures.", "thai": "สถานที่นี้ทำให้ฉันนึกถึงการผจญภัยเก่าๆ"}
{"word": "call up", "english": "I need to call up the bank about my account.", "thai": "ฉันต้องโทรหาธนาคารเกี่ยวกับบัญชีของฉัน"}
{"word": "call up", "english": "They called up the backup team for support.", "thai": "พวกเขาเรียกทีมสำรองมาช่วย"}
{"word": "call up", "english": "He called up his old coach for advice.", "thai": "เขาโทรหาโค้ชเก่าเพื่อขอคำแนะนำ"}
{"word": "call up", "english": "This photo calls up our prom night.", "thai": "ภาพนี้ทำให้ฉันนึกถึงคืนงานพรอม"}
{"word": "call up", "english": "Can you call up the florist for the order?", "thai": "คุณช่วยโทรไปร้านดอกไม้เพื่อสั่งซื้อได้ไหม?"}
{"word": "call up", "english": "They called up the volunteers for cleanup.", "thai": "พวกเขาเรียกอาสาสมัครมาทำความสะอาด"}
{"word": "call up", "english": "I’ll call up my teacher about the assignment.", "thai": "ฉันจะโทรหาครูเกี่ยวกับการบ้าน"}
{"word": "call up", "english": "This smell calls up my old school days.", "thai": "กลิ่นนี้ทำให้ฉันนึกถึงสมัยเรียน"}
{"word": "call up", "english": "She called up the travel agency to book.", "thai": "เธอโทรไปบริษัทท่องเที่ยวเพื่อจอง"}
{"word": "call up", "english": "They called up the crew for the project.", "thai": "พวกเขาเรียกลูกเรือมาทำโปรเจกต์"}
{"word": "call up", "english": "He called up his neighbor to borrow a tool.", "thai": "เขาโทรหาเพื่อนบ้านเพื่อยืมเครื่องมือ"}
{"word": "call up", "english": "This movie calls up our beach trip.", "thai": "ภาพยนตร์เรื่องนี้ทำให้ฉันนึกถึงทริปชายหาด"}
{"word": "call up", "english": "Can you call up the bakery for the cake?", "thai": "คุณช่วยโทรไปร้านเบเกอรี่เพื่อสั่งเค้กได้ไหม?"}
{"word": "call up", "english": "They called up the recruits for training.", "thai": "พวกเขาเรียกทหารใหม่มาฝึก"}
{"word": "call up", "english": "I forgot to call up my lawyer yesterday.", "thai": "ฉันลืมโทรหาทนายเมื่อวาน"}
{"word": "call up", "english": "This song calls up our first concert.", "thai": "เพลงนี้ทำให้ฉันนึกถึงคอนเสิร์ตครั้งแรกของเรา"}
{"word": "call up", "english": "She called up the salon to reschedule.", "thai": "เธอโทรไปร้านทำผมเพื่อเลื่อนนัด"}
{"word": "call up", "english": "They called up the staff for a briefing.", "thai": "พวกเขาเรียกพนักงานมาประชุมสรุป"}
{"word": "call up", "english": "I’ll call up my friend to plan the party.", "thai": "ฉันจะโทรหาเพื่อนเพื่อวางแผนงานปาร์ตี้"}
{"word": "call up", "english": "This place calls up our camping memories.", "thai": "สถานที่นี้ทำให้ฉันนึกถึงความทรงจำจากการแคมป์"}
{"word": "call up", "english": "Can you call up the plumber for the leak?", "thai": "คุณช่วยโทรหาช่างประปาเรื่องท่อรั่วได้ไหม?"}
{"word": "call up", "english": "They called up the players for practice.", "thai": "พวกเขาเรียกนักกีฬามาซ้อม"}
{"word": "call up", "english": "He called up his dad to ask for advice.", "thai": "เขาโทรหาพ่อเพื่อขอคำแนะนำ"}
{"word": "call up", "english": "This photo calls up our old hangouts.", "thai": "ภาพนี้ทำให้ฉันนึกถึงสถานที่ที่เราเคยไปเที่ยว"}
{"word": "call up", "english": "I need to call up the insurance company.", "thai": "ฉันต้องโทรหาบริษัทประกัน"}
{"word": "call up", "english": "They called up the committee for a vote.", "thai": "พวกเขาเรียกคณะกรรมการมาลงคะแนน"}
{"word": "call up", "english": "She called up her colleague to collaborate.", "thai": "เธอโทรหาเพื่อนร่วมงานเพื่อทำงานร่วมกัน"}
{"word": "call up", "english": "This smell calls up our family dinners.", "thai": "กลิ่นนี้ทำให้ฉันนึกถึงอาหารเย็นของครอบครัว"}
{"word": "call up", "english": "Can you call up the car rental agency?", "thai": "คุณช่วยโทรไปบริษัทเช่ารถได้ไหม?"}
{"word": "call up", "english": "They called up the trainees for orientation.", "thai": "พวกเขาเรียกผู้ฝึกงานมาปฐมนิเทศ"}
{"word": "call up", "english": "I’ll call up my cousin to invite her over.", "thai": "ฉันจะโทรหาพี่น้องเพื่อชวนมาเยี่ยม"}
{"word": "call up", "english": "This movie calls up our old vacations.", "thai": "ภาพยนตร์เรื่องนี้ทำให้ฉันนึกถึงวันหยุดเก่าๆ"}
{"word": "call up", "english": "He called up the tech support for help.", "thai": "เขาโทรหาฝ่ายสนับสนุนเทคนิคเพื่อขอความช่วยเหลือ"}
{"word": "call up", "english": "They called up the backups for the mission.", "thai": "พวกเขาเรียกทีมสำรองสำหรับภารกิจ"}
{"word": "call up", "english": "She called up her friend to vent.", "thai": "เธอโทรหาเพื่อนเพื่อระบาย"}
{"word": "call up", "english": "This song calls up our teenage years.", "thai": "เพลงนี้ทำให้ฉันนึกถึงวัยรุ่นของเรา"}
{"word": "call up", "english": "Can you call up the electrician for repairs?", "thai": "คุณช่วยโทรหาช่างไฟเพื่อซ่อมได้ไหม?"}
{"word": "call up", "english": "They called up the cast for rehearsals.", "thai": "พวกเขาเรียกนักแสดงมาซ้อม"}
{"word": "call up", "english": "I forgot to call up my accountant today.", "thai": "ฉันลืมโทรหานักบัญชีวันนี้"}
{"word": "call up", "english": "This place calls up our old road trips.", "thai": "สถานที่นี้ทำให้ฉันนึกถึงทริปถนนเก่าๆ"}
{"word": "call up", "english": "She called up the customer service line.", "thai": "เธอโทรไปสายบริการลูกค้า"}
{"word": "call up", "english": "They called up the team for a strategy meeting.", "thai": "พวกเขาเรียกทีมมาประชุมกลยุทธ์"}
{"word": "call up", "english": "He called up his mentor for guidance.", "thai": "เขาโทรหาพี่เลี้ยงเพื่อขอคำแนะนำ"}
{"word": "call up", "english": "This photo calls up our wedding day.", "thai": "ภาพนี้ทำให้ฉันนึกถึงวันแต่งงานของเรา"}
{"word": "call up", "english": "Can you call up the gym to cancel?", "thai": "คุณช่วยโทรไปยิมเพื่อยกเลิกได้ไหม?"}
{"word": "call up", "english": "They called up the reserves for the emergency.", "thai": "พวกเขาเรียกตัวสำรองมาในสถานการณ์ฉุกเฉิน"}
{"word": "call up", "english": "I’ll call up my friend to join us.", "thai": "ฉันจะโทรหาเพื่อนเพื่อชวนมาร่วม"}
{"word": "call up", "english": "This smell calls up our old picnics.", "thai": "กลิ่นนี้ทำให้ฉันนึกถึงปิกนิกเก่าๆ"}
{"word": "call up", "english": "She called up the pharmacy for a refill.", "thai": "เธอโทรไปร้านขายยาเพื่อขอเติมยา"}
{"word": "call up", "english": "They called up the volunteers for the fundraiser.", "thai": "พวกเขาเรียกอาสาสมัครมาระดมทุน"}
{"word": "call up", "english": "He called up his teammate to discuss the game.", "thai": "เขาโทรหาเพื่อนร่วมทีมเพื่อคุยเรื่องเกม"}
{"word": "call up", "english": "This movie calls up our first date night.", "thai": "ภาพยนตร์เรื่องนี้ทำให้ฉันนึกถึงคืนเดตแรกของเรา"}
{"word": "call up", "english": "Can you call up the tailor for alterations?", "thai": "คุณช่วยโทรหาช่างตัดเสื้อเพื่อแก้ไขเสื้อผ้าได้ไหม?"}
{"word": "call up", "english": "They called up the staff for an announcement.", "thai": "พวกเขาเรียกพนักงานมาประกาศ"}
{"word": "call up", "english": "I need to call up my advisor about my schedule.", "thai": "ฉันต้องโทรหาที่ปรึกษาเกี่ยวกับตารางของฉัน"}
{"word": "call up", "english": "This song calls up our old dance parties.", "thai": "เพลงนี้ทำให้ฉันนึกถึงงานเต้นรำเก่าๆ"}
{"word": "call up", "english": "She called up her boss to discuss the raise.", "thai": "เธอโทรหาเจ้านายเพื่อคุยเรื่องขึ้นเงินเดือน"}
{"word": "call up", "english": "They called up the players for the playoffs.", "thai": "พวกเขาเรียกนักกีฬามาสำหรับรอบเพลย์ออฟ"}
{"word": "call up", "english": "I’ll call up the store to check the price.", "thai": "ฉันจะโทรไปร้านค้าเพื่อเช็คราคา"}
{"word": "call up", "english": "This photo calls up our family vacation.", "thai": "ภาพนี้ทำให้ฉันนึกถึงวันหยุดครอบครัวของเรา"}
{"word": "show up", "english": "I wasn’t sure if he would show up to the party on time.", "thai": "ฉันไม่แน่ใจว่าเขาจะมาปาร์ตี้ตรงเวลาหรือเปล่า"}
{"word": "show up", "english": "She didn’t show up for work yesterday, which was unusual.", "thai": "เมื่อวานเธอไม่มาทำงาน ซึ่งมันผิดปกติ"}
{"word": "show up", "english": "He always shows up late to our meetings.", "thai": "เขามักจะมาประชุมของเราสายเสมอ"}
{"word": "show up", "english": "I hope my package shows up before the weekend.", "thai": "ฉันหวังว่าพัสดุของฉันจะมาถึงก่อนสุดสัปดาห์"}
{"word": "show up", "english": "They didn’t show up for the dinner reservation.", "thai": "พวกเขาไม่มาสำหรับการจองมื้อค่ำ"}
{"word": "show up", "english": "She showed up at my house unannounced last night.", "thai": "เมื่อคืนเธอโผล่มาที่บ้านฉันโดยไม่ได้บอกล่วงหน้า"}
{"word": "show up", "english": "Why do you always show up without calling first?", "thai": "ทำไมคุณถึงโผล่มาโดยไม่โทรบอกก่อนทุกครั้ง?"}
{"word": "show up", "english": "He showed up to the wedding in a casual t-shirt.", "thai": "เขามางานแต่งงานโดยใส่เสื้อยืดลำลอง"}
{"word": "show up", "english": "The repair guy finally showed up after two hours.", "thai": "ช่างซ่อมโผล่มาหลังจากรอสองชั่วโมง"}
{"word": "show up", "english": "She showed up with a new haircut and looked amazing.", "thai": "เธอมาพร้อมทรงผมใหม่และดูสวยมาก"}
{"word": "show up", "english": "I waited all day, but the delivery didn’t show up.", "thai": "ฉันรอทั้งวัน แต่ของที่สั่งไม่มาส่ง"}
{"word": "show up", "english": "He showed up to the game with his whole family.", "thai": "เขามาที่เกมพร้อมครอบครัวทั้งหมด"}
{"word": "show up", "english": "Nobody expected her to show up at the reunion.", "thai": "ไม่มีใครคาดว่าเธาจะปรากฏตัวในงานคืนสู่เหย้า"}
{"word": "show up", "english": "The boss showed up early to check on our progress.", "thai": "เจ้านายมาถึงแต่เช้าเพื่อตรวจงานของเรา"}
{"word": "show up", "english": "She didn’t show up to the study group last night.", "thai": "เมื่อคืนเธอไม่มาที่กลุ่มติว"}
{"word": "show up", "english": "He showed up at the bar with a big smile.", "thai": "เขาโผล่มาที่บาร์พร้อมรอยยิ้มกว้าง"}
{"word": "show up", "english": "I’m worried my date won’t show up tonight.", "thai": "ฉันกังวลว่าเดทของฉันจะไม่มาคืนนี้"}
{"word": "show up", "english": "The band didn’t show up for their scheduled performance.", "thai": "วงดนตรีไม่มาสำหรับการแสดงที่กำหนดไว้"}
{"word": "show up", "english": "She showed up to the interview looking nervous.", "thai": "เธอมาสัมภาษณ์งานด้วยท่าทางประหม่า"}
{"word": "show up", "english": "He showed up at the gym after months of absence.", "thai": "เขาโผล่มาที่ยิมหลังจากหายไปหลายเดือน"}
{"word": "show up", "english": "The pizza guy showed up right when we were starving.", "thai": "คนส่งพิซซ่ามาถึงตอนที่เราหิวมาก"}
{"word": "show up", "english": "She showed up to the picnic with homemade cookies.", "thai": "เธอมาปิกนิกพร้อมคุกกี้ทำเอง"}
{"word": "show up", "english": "He never shows up when he’s supposed to.", "thai": "เขาไม่เคยมาตรงเวลาตามที่ควร"}
{"word": "show up", "english": "The client showed up late and seemed distracted.", "thai": "ลูกค้ามาสายและดูเหมือนใจลอย"}
{"word": "show up", "english": "I didn’t think you’d show up after that argument.", "thai": "ฉันไม่คิดว่าคุณจะโผล่มา بعدจากนั้นการโต้แย้ง"}
{"word": "show up", "english": "She showed up at the concert in a fancy dress.", "thai": "เธอมาคอนเสิร์ตด้วยชุดเดรสหรู"}
{"word": "show up", "english": "The package showed up damaged, which was frustrating.", "thai": "พัสดุมาถึงในสภาพเสียหาย ซึ่งน่าหงุดหงิด"}
{"word": "show up", "english": "He showed up to the meeting with no preparation.", "thai": "เขามาประชุมโดยไม่มีการเตรียมตัว"}
{"word": "show up", "english": "They showed up at the beach with a cooler full of drinks.", "thai": "พวกเขามาที่ชายหาดพร้อมกล่องเย็นที่เต็มไปด้วยเครื่องดื่ม"}
{"word": "show up", "english": "She didn’t show up for her doctor’s appointment.", "thai": "เธอไม่มานัดหมอ"}
{"word": "show up", "english": "He showed up at the party with his new girlfriend.", "thai": "เขาโผล่มาที่ปาร์ตี้พร้อมแฟนใหม่"}
{"word": "show up", "english": "The plumber showed up but forgot his tools.", "thai": "ช่างประปามาถึงแต่ลืมเครื่องมือ"}
{"word": "show up", "english": "She showed up to class with her homework unfinished.", "thai": "เธอมาชั้นเรียนโดยที่การบ้านยังไม่เสร็จ"}
{"word": "show up", "english": "He showed up at the airport just as the plane boarded.", "thai": "เขาโผล่มาที่สนามบินตอนเครื่องบินกำลังขึ้น"}
{"word": "show up", "english": "They didn’t show up for the team practice yesterday.", "thai": "เมื่อวานพวกเขาไม่มาซ้อมทีม"}
{"word": "show up", "english": "She showed up at my door with a surprise gift.", "thai": "เธอโผล่มาที่หน้าประตูฉันพร้อมของขวัญเซอร์ไพรส์"}
{"word": "show up", "english": "He showed up to the barbecue in his old truck.", "thai": "เขามางานบาร์บีคิวด้วยรถกระบะเก่าของเขา"}
{"word": "show up", "english": "The guest speaker didn’t show up for the event.", "thai": "วิทยากรรับเชิญไม่มาสำหรับงานนี้"}
{"word": "show up", "english": "She showed up at the cafe looking exhausted.", "thai": "เธอมาที่ร้านกาแฟด้วยท่าทางเหนื่อยล้า"}
{"word": "show up", "english": "He showed up to the audition unprepared.", "thai": "เขามาการออดิชันโดยไม่เตรียมตัว"}
{"word": "show up", "english": "The delivery showed up earlier than expected.", "thai": "ของส่งมาถึงเร็วกว่าที่คาด"}
{"word": "show up", "english": "They showed up to the movie night with popcorn.", "thai": "พวกเขามาคืนดูหนังพร้อมป๊อปคอร์น"}
{"word": "show up", "english": "She didn’t show up for the group project meeting.", "thai": "เธอไม่มานัดประชุมโปรเจกต์กลุ่ม"}
{"word": "show up", "english": "He showed up at the club with a group of friends.", "thai": "เขาโผล่มาที่คลับพร้อมกลุ่มเพื่อน"}
{"word": "show up", "english": "The repairman showed up but couldn’t fix the issue.", "thai": "ช่างซ่อมมาถึงแต่แก้ปัญหาไม่ได้"}
{"word": "show up", "english": "She showed up to the wedding with a huge bouquet.", "thai": "เธอมางานแต่งงานพร้อมช่อดอกไม้ขนาดใหญ่"}
{"word": "show up", "english": "He didn’t show up for his shift at the store.", "thai": "เขาไม่มาทำงานกะที่ร้าน"}
{"word": "show up", "english": "They showed up at the park with a new puppy.", "thai": "พวกเขาโผล่มาที่สวนสาธารณะพร้อมลูกสุนัขตัวใหม่"}
{"word": "show up", "english": "She showed up to the reunion after ten years.", "thai": "เธอปรากฏตัวในงานคืนสู่เหย้าหลังจากสิบปี"}
{"word": "show up", "english": "He showed up at the office with coffee for everyone.", "thai": "เขามาที่ออฟฟิศพร้อมกาแฟสำหรับทุกคน"}
{"word": "show up", "english": "The caterer didn’t show up for the event.", "thai": "คนจัดเลี้ยงไม่มาสำหรับงานนี้"}
{"word": "show up", "english": "She showed up to the dance class in sneakers.", "thai": "เธอมาคลาสเต้นด้วยรองเท้าผ้าใบ"}
{"word": "show up", "english": "He showed up late to the family dinner.", "thai": "เขามาสายสำหรับมื้อค่ำครอบครัว"}
{"word": "show up", "english": "The package showed up at my neighbor’s house by mistake.", "thai": "พัสดุมาถึงบ้านเพื่อนบ้านโดยผิดพลาด"}
{"word": "show up", "english": "They showed up to the camping trip unprepared.", "thai": "พวกเขามาทริปแคมปิ้งโดยไม่เตรียมตัว"}
{"word": "show up", "english": "She showed up at the library with a stack of books.", "thai": "เธอมาที่ห้องสมุดพร้อมกองหนังสือ"}
{"word": "show up", "english": "He didn’t show up for his court date.", "thai": "เขาไม่มานัดศาล"}
{"word": "show up", "english": "They showed up to the festival with face paint.", "thai": "พวกเขามางานเทศกาลพร้อมสีทาหน้า"}
{"word": "show up", "english": "She showed up at the meeting with new ideas.", "thai": "เธอมาประชุมพร้อมไอเดียใหม่"}
{"word": "show up", "english": "He showed up to the gym with a new trainer.", "thai": "เขามาที่ยิมพร้อมเทรนเนอร์ใหม่"}
{"word": "show up", "english": "The band showed up late for their soundcheck.", "thai": "วงดนตรีมาสายสำหรับการเช็คเสียง"}
{"word": "show up", "english": "She showed up at the potluck with a casserole.", "thai": "เธอมาที่งานเลี้ยงแบบทุกคนนำอาหารมาด้วยหม้ออบ"}
{"word": "show up", "english": "He didn’t show up for his volunteer shift.", "thai": "เขาไม่มาร่วมกะอาสาสมัคร"}
{"word": "show up", "english": "They showed up to the concert in matching outfits.", "thai": "พวกเขามาคอนเสิร์ตด้วยชุดที่เข้าคู่กัน"}
{"word": "show up", "english": "She showed up at the office with a cold.", "thai": "เธอมาที่ออฟฟิศพร้อมอาการหวัด"}
{"word": "show up", "english": "He showed up to the game with a sprained ankle.", "thai": "เขามาเกมด้วยข้อเท้าแพลง"}
{"word": "show up", "english": "The delivery guy showed up during the rainstorm.", "thai": "คนส่งของมาถึงระหว่างพายุฝน"}
{"word": "show up", "english": "She didn’t show up for the yoga class.", "thai": "เธอไม่มาคลาสโยคะ"}
{"word": "show up", "english": "He showed up at the bar with a bad attitude.", "thai": "เขาโผล่มาที่บาร์ด้วยทัศนคติแย่"}
{"word": "show up", "english": "They showed up to the picnic with a frisbee.", "thai": "พวกเขามาปิกนิกพร้อมจานร่อน"}
{"word": "show up", "english": "She showed up late to the book club meeting.", "thai": "เธอมาสายสำหรับการประชุมชมรมหนังสือ"}
{"word": "show up", "english": "He showed up at the party with no invitation.", "thai": "เขาโผล่มาที่ปาร์ตี้โดยไม่มีคำเชิญ"}
{"word": "show up", "english": "The technician didn’t show up to fix the internet.", "thai": "ช่างเทคนิคไม่มาซ่อมอินเทอร์เน็ต"}
{"word": "show up", "english": "She showed up to the audition with confidence.", "thai": "เธอมาออดิชันด้วยความมั่นใจ"}
{"word": "show up", "english": "He showed up at the reunion with old photos.", "thai": "เขามางานคืนสู่เหย้าพร้อมรูปเก่า"}
{"word": "show up", "english": "They didn’t show up for the charity event.", "thai": "พวกเขาไม่มางานการกุศล"}
{"word": "show up", "english": "She showed up to the beach with sunscreen.", "thai": "เธอมาที่ชายหาดพร้อมครีมกันแดด"}
{"word": "show up", "english": "He showed up to the interview in a suit.", "thai": "เขามาสัมภาษณ์งานด้วยชุดสูท"}
{"word": "show up", "english": "The mail showed up late because of the holiday.", "thai": "จดหมายมาถึงช้าเพราะวันหยุด"}
{"word": "show up", "english": "She showed up at the cafe with her laptop.", "thai": "เธอมาที่ร้านกาแฟพร้อมแล็ปท็อป"}
{"word": "show up", "english": "He didn’t show up for the parent-teacher meeting.", "thai": "เขาไม่มานัดประชุมผู้ปกครอง-ครู"}
{"word": "show up", "english": "They showed up to the hike with water bottles.", "thai": "พวกเขามาเดินป่าพร้อมขวดน้ำ"}
{"word": "show up", "english": "She showed up at the party with her famous dip.", "thai": "เธอมาปาร์ตี้พร้อมน้ำจิ้มสูตรเด็ดของเธอ"}
{"word": "show up", "english": "He showed up to the meeting with a broken phone.", "thai": "เขามาประชุมพร้อมโทรศัพท์ที่พัง"}
{"word": "show up", "english": "The electrician showed up but left early.", "thai": "ช่างไฟฟ้ามาถึงแต่กลับก่อน"}
{"word": "show up", "english": "She showed up to the gym in new workout gear.", "thai": "เธอมาที่ยิมด้วยชุดออกกำลังกายใหม่"}
{"word": "show up", "english": "He showed up at the bar with a guitar.", "thai": "เขาโผล่มาที่บาร์พร้อมกีตาร์"}
{"word": "show up", "english": "They didn’t show up for the community cleanup.", "thai": "พวกเขาไม่มางานทำความสะอาดชุมชน"}
{"word": "show up", "english": "She showed up to the class with a new notebook.", "thai": "เธอมาชั้นเรียนพร้อมสมุดบันทึกใหม่"}
{"word": "show up", "english": "He showed up at the wedding with a speech prepared.", "thai": "เขามางานแต่งงานพร้อมสุนทรพจน์ที่เตรียมmediatime": "เขามางานแต่งงานพร้อมสุนทรพจน์ที่เตรียมไว้"}
{"word": "show up", "english": "The pizza delivery showed up just in time.", "thai": "พิซซ่ามาส่งได้ทันเวลา"}
{"word": "show up", "english": "She showed up at the gallery with her artwork.", "thai": "เธอมาที่แกลเลอรี่พร้อมผลงานศิลปะของเธอ"}
{"word": "show up", "english": "He showed up to the potluck with a homemade pie.", "thai": "เขามางานเลี้ยงพร้อมพายทำเอง"}
{"word": "show up", "english": THEY didn’t show up for the rehearsal.", "thai": "พวกเขาไม่มาซ้อม"}
{"word": "show up", "english": "She showed up at the park with her dog.", "thai": "เธอมาที่สวนสาธารณะพร้อมสุนัขของเธอ"}
{"word": "show up", "english": "He showed up to the barbecue with a cooler.", "thai": "เขามางานบาร์บีคิวพร้อมกล่องเย็น"}
{"word": "show up", "english": "The flowers showed up wilted, which was disappointing.", "thai": "ดอกไม้มาถึงในสภาพเหี่ยว ซึ่งน่าผ disappointed"}
{"word": "show up", "english": "She showed up at the club with VIP passes.", "thai": "เธอมาที่คลับพร้อมบัตรวีไอพี"}
{"word": "show up", "english": "He showed up to the game with team spirit.", "thai": "เขามาเกมพร้อมจิตวิญญาณของทีม"}
{"word": "hang up", "english": "I forgot to hang up the phone after our call.", "thai": "ฉันลืมวางสายหลังจากที่เราคุยกัน"}
{"word": "hang up", "english": "She always hangs up without saying goodbye.", "thai": "เธอมักจะวางสายโดยไม่บอกลา"}
{"word": "hang up", "english": "Don’t hang up; I need to tell you something important!", "thai": "อย่าวางสาย ฉันมีเรื่องสำคัญจะบอก!"}
{"word": "hang up", "english": "He hung up the phone in anger during the argument.", "thai": "เขาโกรธวางสายระหว่างการโต้แย้ง"}
{"word": "hang up", "english": "I’ll hang up now; talk to you tomorrow.", "thai": "ฉันจะวางสายแล้ว คุยกันพรุ่งนี้"}
{"word": "hang up", "english": "She hung up before I could explain myself.", "thai": "เธอวางสายก่อนที่ฉันจะอธิบายได้"}
{"word": "hang up", "english": "Can you hang up the clothes after doing laundry?", "thai": "คุณช่วยแขวนเสื้อผ้าหลังซักผ้าได้ไหม?"}
{"word": "hang up", "english": "He didn’t want to hang up because he missed her voice.", "thai": "เขาไม่อยากวางสายเพราะเขาคิดถึงเสียงของเธอ"}
{"word": "hang up", "english": "I accidentally hung up on my boss during our call.", "thai": "ฉันเผลอวางสายเจ้านายระหว่างการโทร"}
{"word": "hang up", "english": "Let’s hang up the decorations for the party tonight.", "thai": "มาแขวนของตกแต่งสำหรับปาร์ตี้คืนนี้กันเถอะ"}
{"word": "hang up", "english": "She hung up the phone and started crying.", "thai": "เธอวางสายแล้วเริ่มร้องไห้"}
{"word": "hang up", "english": "Don’t hang up yet; I’m not done talking!", "thai": "อย่าวางสายเดี๋ยวนี้ ฉันยังคุยไม่จบ!"}
{"word": "hang up", "english": "He hung up his coat on the rack by the door.", "thai": "เขาแขวนเสื้อโค้ทไว้ที่ราวข้างประตู"}
{"word": "hang up", "english": "I hate when people hang up without warning.", "thai": "ฉันเกลียดเมื่อคนวางสายโดยไม่บอกกล่าว"}
{"word": "hang up", "english": "We got hung up in traffic and missed the meeting.", "thai": "เราติดขัดในจราจรและพลาดการประชุม"}
{"word": "hang up", "english": "She hung up after hearing the bad news.", "thai": "เธอวางสายหลังจากได้ยินข่าวร้าย"}
{"word": "hang up", "english": "Can you hang up the picture frame on the wall?", "thai": "คุณช่วยแขวนกรอบรูปบนผนังได้ไหม?"}
{"word": "hang up", "english": "He hung up on me because he was upset.", "thai": "เขาวางสายใส่ฉันเพราะเขาไม่พอใจ"}
{"word": "hang up", "english": "I need to hang up; my battery is dying.", "thai": "ฉันต้องวางสาย แบตเตอรี่กำลังจะหมด"}
{"word": "hang up", "english": "She hung up the phone and went back to work.", "thai": "เธอวางสายแล้วกลับไปทำงาน"}
{"word": "hang up", "english": "Let’s hang up some fairy lights for the patio.", "thai": "มาแขวนไฟประดับที่ระเบียงกันเถอะ"}
{"word": "hang up", "english": "He hung up before I could ask for his number.", "thai": "เขาวางสายก่อนที่ฉันจะขอเบอร์เขา"}
{"word": "hang up", "english": "I got hung up at the store and lost track of time.", "thai": "ฉันติดขัดที่ร้านค้าและลืมเวลา"}
{"word": "hang up", "english": "She always hangs up when she’s mad at me.", "thai": "เธอมักจะวางสายเมื่อโกรธฉัน"}
{"word": "hang up", "english": "Can you hang up the towels in the bathroom?", "thai": "คุณช่วยแขวนผ้าเช็ดตัวในห้องน้ำได้ไหม?"}
{"word": "hang up", "english": "He hung up the call and sighed in relief.", "thai": "เขาวางสายแล้วถอนหายใจด้วยความโล่งอก"}
{"word": "hang up", "english": "I didn’t mean to hang up on you earlier.", "thai": "ฉันไม่ได้ตั้งใจวางสายใส่คุณเมื่อกี้"}
{"word": "hang up", "english": "We should hang up some posters in the club room.", "thai": "เราควรแขวนโปสเตอร์ในห้องคลับ"}
{"word": "hang up", "english": "She hung up after a long chat with her friend.", "thai": "เธอวางสายหลังจากคุยกับเพื่อนอยู่นาน"}
{"word": "hang up", "english": "He got hung up on a work issue and couldn’t leave.", "thai": "เขาติดขัดกับปัญหางานและออกไม่ได้"}
{"word": "hang up", "english": "Don’t hang up; I’m putting you on speaker.", "thai": "อย่าวางสาย ฉันกำลังเปิดลำโพง"}
{"word": "hang up", "english": "She hung up her jacket in the closet.", "thai": "เธอแขวนแจ็คเก็ตไว้ในตู้เสื้อผ้า"}
{"word": "hang up", "english": "He hung up the phone and stormed out.", "thai": "เขาวางสายแล้วเดินออกไปอย่างโมโห"}
{"word": "hang up", "english": "I’ll hang up now; see you at the party.", "thai": "ฉันจะวางสายแล้ว เจอกันที่ปาร์ตี้"}
{"word": "hang up", "english": "Can you hang up the curtains in the living room?", "thai": "คุณช่วยแขวนผ้าม่านในห้องนั่งเล่นได้ไหม?"}
{"word": "hang up", "english": "She hung up on him after their fight.", "thai": "เธอวางสายใส่เขาหลังจากทะเลาะกัน"}
{"word": "hang up", "english": "We got hung up at the airport due to delays.", "thai": "เราติดขัดที่สนามบินเพราะความล่าช้า"}
{"word": "hang up", "english": "He hung up the phone and started laughing.", "thai": "เขาวางสายแล้วเริ่มหัวเราะ"}
{"word": "hang up", "english": "I need to hang up my wet clothes to dry.", "thai": "ฉันต้องแขวนเสื้อผ้าเปียกให้แห้ง"}
{"word": "hang up", "english": "She hung up after leaving a voicemail.", "thai": "เธอวางสายหลังจากฝากข้อความเสียง"}
{"word": "hang up", "english": "Don’t hang up; I’m almost done talking.", "thai": "อย่าวางสาย ฉันใกล้จะคุยจบแล้ว"}
{"word": "hang up", "english": "He hung up his keys on the hook by the door.", "thai": "เขาแขวนกุญแจไว้ที่ตะขอข้างประตู"}
{"word": "hang up", "english": "She hung up on me because she was busy.", "thai": "เธอวางสายใส่ฉันเพราะเธอยุ่ง"}
{"word": "hang up", "english": "Let’s hang up some holiday decorations this weekend.", "thai": "มาแขวนของตกแต่งวันหยุดสุดสัปดาห์นี้กัน"}
{"word": "hang up", "english": "He hung up the call and went to bed.", "thai": "เขาวางสายแล้วเข้านอน"}
{"word": "hang up", "english": "I got hung up at work and couldn’t make it.", "thai": "ฉันติดขัดที่ทำงานและมาไม่ได้"}
{"word": "hang up", "english": "She hung up her scarf on the coat rack.", "thai": "เธอแขวนผ้าพันคอไว้ที่ราวแขวนเสื้อ"}
{"word": "hang up", "english": "He hung up before I could say thank you.", "thai": "เขาวางสายก่อนที่ฉันจะพูดขอบคุณ"}
{"word": "hang up", "english": "Can you hang up the laundry outside?", "thai": "คุณช่วยแขวนผ้าซักไว้ข้างนอกได้ไหม?"}
{"word": "hang up", "english": "She hung up the phone and shook her head.", "thai": "เธอวางสายแล้วส่ายหัว"}
{"word": "hang up", "english": "We got hung up in a long line at the store.", "thai": "เราติดขัดในแถวยาวที่ร้าน"}
{"word": "hang up", "english": "He hung up on his mom by accident.", "thai": "เขาเผลอวางสายใส่แม่ของเขา"}
{"word": "hang up", "english": "I’ll hang up now; my food is getting cold.", "thai": "ฉันจะวางสายแล้ว อาหารของฉันกำลังเย็น"}
{"word": "hang up", "english": "She hung up her painting in the living room.", "thai": "เธอแขวนภาพวาดไว้ในห้องนั่งเล่น"}
{"word": "hang up", "english": "Don’t hang up; I need your advice.", "thai": "อย่าวางสาย ฉันต้องการคำแนะนำจากคุณ"}
{"word": "hang up", "english": "He hung up the phone and left for work.", "thai": "เขาวางสายแล้วออกไปทำงาน"}
{"word": "hang up", "english": "Can you hang up the mirror in the hallway?", "thai": "คุณช่วยแขวนกระจกในโถงทางเดินได้ไหม?"}
{"word": "hang up", "english": "She hung up after a quick chat.", "thai": "เธอวางสายหลังจากคุยสั้น ๆ"}
{"word": "hang up", "english": "We got hung up on a technical issue at work.", "thai": "เราติดขัดกับปัญหาทางเทคนิคที่ทำงาน"}
{"word": "hang up", "english": "He hung up his backpack on the hook.", "thai": "เขาแขวนกระเป๋าเป้ไว้ที่ตะขอ"}
{"word": "hang up", "english": "She hung up on me when I asked about her day.", "thai": "เธอวางสายใส่ฉันเมื่อฉันถามถึงวันของเธอ"}
{"word": "hang up", "english": "Let’s hang up some photos from the trip.", "thai": "มาแขวนรูปจากทริปกันเถอะ"}
{"word": "hang up", "english": "He hung up the call and smiled to himself.", "thai": "เขาวางสายแล้วยิ้มคนเดียว"}
{"word": "hang up", "english": "I got hung up in a meeting and ran late.", "thai": "ฉันติดขัดในประชุมและมาสาย"}
{"word": "hang up", "english": "She hung up her apron after cooking.", "thai": "เธอแขวนผ้ากันเปื้อนหลังทำอาหาร"}
{"word": "hang up", "english": "Don’t hang up; I’m still here!", "thai": "อย่าวางสาย ฉันยังอยู่ตรงนี้!"}
{"word": "hang up", "english": "He hung up the phone and started texting.", "thai": "เขาวางสายแล้วเริ่มส่งข้อความ"}
{"word": "hang up", "english": "Can you hang up the Christmas lights outside?", "thai": "คุณช่วยแขวนไฟคริสต์มาสข้างนอกได้ไหม?"}
{"word": "hang up", "english": "She hung up after hearing his excuse.", "thai": "เธอวางสายหลังจากได้ยินข้อแก้ตัวของเขา"}
{"word": "hang up", "english": "We got hung up at the bank this morning.", "thai": "เราติดขัดที่ธนาคารเช้านี้"}
{"word": "hang up", "english": "He hung up his hat on the wall hook.", "thai": "เขาแขวนหมวกไว้ที่ตะขอผนัง"}
{"word": "hang up", "english": "She hung up on her friend by mistake.", "thai": "เธอเผลอวางสายใส่เพื่อน"}
{"word": "hang up", "english": "I’ll hang up now; I’ve got to run.", "thai": "ฉันจะวางสายแล้ว ฉันต้องรีบไป"}
{"word": "hang up", "english": "Can you hang up the wet towels to dry?", "thai": "คุณช่วยแขวนผ้าเช็ดตัวเปียกให้แห้งได้ไหม?"}
{"word": "hang up", "english": "He hung up the phone and looked confused.", "thai": "เขาวางสายแล้วดูสับสน"}
{"word": "hang up", "english": "She hung up her diploma on the office wall.", "thai": "เธอแขวนวุฒิบัตรไว้บนผนังสำนักงาน"}
{"word": "hang up", "english": "Don’t hang up; I need to check something.", "thai": "อย่าวางสาย ฉันต้องเช็คอะไรบางอย่าง"}
{"word": "hang up", "english": "He hung up after a long argument.", "thai": "เขาวางสายหลังจากโต้แย้งอยู่นาน"}
{"word": "hang up", "english": "We got hung up on a project deadline.", "thai": "เราติดขัดกับกำหนดส่งโปรเจกต์"}
{"word": "hang up", "english": "She hung up her purse on the chair.", "thai": "เธอแขวนกระเป๋าไว้ที่เก้าอี้"}
{"word": "hang up", "english": "He hung up on the telemarketer right away.", "thai": "เขาวางสายใส่นักการตลาดทางโทรศัพท์ทันที"}
{"word": "hang up", "english": "Let’s hang up some banners for the event.", "thai": "มาแขวนป้ายสำหรับงานนี้กัน"}
{"word": "hang up", "english": "She hung up the phone and started cooking.", "thai": "เธอวางสายแล้วเริ่มทำอาหาร"}
{"word": "hang up", "english": "I got hung up in a conversation at the store.", "thai": "ฉันติดขัดในบทสนทนาที่ร้าน"}
{"word": "hang up", "english": "He hung up his jacket and sat down.", "thai": "เขาแขวนแจ็คเก็ตแล้วนั่งลง"}
{"word": "hang up", "english": "She hung up after leaving a quick message.", "thai": "เธอวางสายหลังจากฝากข้อความสั้น ๆ"}
{"word": "hang up", "english": "Can you hang up the new shelves in the garage?", "thai": "คุณช่วยแขวนชั้นวางใหม่ในโรงรถได้ไหม?"}
{"word": "hang up", "english": "He hung up the call and went for a walk.", "thai": "เขาวางสายแล้วออกไปเดินเล่น"}
{"word": "hang up", "english": "Don’t hang up; I’m still figuring this out.", "thai": "อย่าวางสาย ฉันยังคิดเรื่องนี้อยู่"}
{"word": "hang up", "english": "She hung up her scarf on the rack.", "thai": "เธอแขวนผ้าพันคอไว้ที่ราว"}
{"word": "hang up", "english": "We got hung up on a paperwork issue.", "thai": "เราติดขัดกับปัญหาเอกสาร"}
{"word": "hang up", "english": "He hung up the phone and laughed out loud.", "thai": "เขาวางสายแล้วหัวเราะดัง ๆ"}
{"word": "hang up", "english": "I’ll hang up now; I’ve got a meeting.", "thai": "ฉันจะวางสายแล้ว ฉันมีประชุม"}
{"word": "hang up", "english": "She hung up on her ex during the call.", "thai": "เธอวางสายใส่แฟนเก่าระหว่างโทร"}
{"word": "hang up", "english": "Can you hang up the garland for the holiday?", "thai": "คุณช่วยแขวนพวงมาลัยสำหรับวันหยุดได้ไหม?"}
{"word": "hang up", "english": "He hung up after a brief conversation.", "thai": "เขาวางสายหลังจากคุยสั้น ๆ"}
{"word": "hang up", "english": "I got hung up at the post office today.", "thai": "ฉันติดขัดที่ไปรษณีย์วันนี้"}
{"word": "hang up", "english": "She hung up her keys on the wall hook.", "thai": "เธอแขวนกุญแจไว้ที่ตะขอผนัง"}
{"word": "hang up", "english": "Don’t hang up; I’m almost done.", "thai": "อย่าวางสาย ฉันใกล้จะเสร็จแล้ว"}
{"word": "drop out", "english": "He decided to drop out of college to start his own business.", "thai": "เขาตัดสินใจลาออกจากมหาวิทยาลัยเพื่อเริ่มธุรกิจของตัวเอง"}
{"word": "drop out", "english": "She dropped out of the race because of an injury.", "thai": "เธอถอนตัวจากการแข่งขันเพราะบาดเจ็บ"}
{"word": "drop out", "english": "I can’t believe you’re going to drop out of the project now!", "thai": "ฉันไม่เชื่อว่าคุณจะถอนตัวจากโปรเจกต์ตอนนี้!"}
{"word": "drop out", "english": "He dropped out of high school but later got his GED.", "thai": "เขาลาออกจากมัธยมปลายแต่ต่อมาได้วุฒิ GED"}
{"word": "drop out", "english": "She was tempted to drop out of the competition after losing the first round.", "thai": "เธออยากถอนตัวจากการแข่งขันหลังจากแพ้รอบแรก"}
{"word": "drop out", "english": "Why did you drop out of the book club?", "thai": "ทำไมคุณถึงเลิกเข้าร่วมชมรมหนังสือ?"}
{"word": "drop out", "english": "He dropped out of the band to focus on his studies.", "thai": "เขาลาออกจากวงดนตรีเพื่อโฟกัสที่การเรียน"}
{"word": "drop out", "english": "Some coins dropped out of his pocket while he was running.", "thai": "เหรียญบางส่วนหล่นออกจากกระเป๋าขณะที่เขาวิ่ง"}
{"word": "drop out", "english": "She dropped out of the cooking class because it was too hard.", "thai": "เธอลาออกจากคลาสทำอาหารเพราะมันยากเกินไป"}
{"word": "drop out", "english": "He’s thinking about dropping out of the tournament due to stress.", "thai": "เขากำลังคิดที่จะถอนตัวจากการแข่งขันเพราะความเครียด"}
{"word": "drop out", "english": "I don’t want to drop out, but I’m struggling with the workload.", "thai": "ฉันไม่อยากลาออก แต่ฉันกำลังมีปัญหากับปริมาณงาน"}
{"word": "drop out", "english": "She dropped out of the choir after moving to a new city.", "thai": "เธอลาออกจากคณะนักร้องประสานเสียงหลังจากย้ายไปเมืองใหม่"}
{"word": "drop out", "english": "He dropped out of the debate team to join the soccer team.", "thai": "เขาลาออกจากทีมโต้วาทีเพื่อเข้าร่วมทีมฟุตบอล"}
{"word": "drop out", "english": "The keys dropped out of her bag onto the floor.", "thai": "กุญแจหล่นออกจากกระเป๋าของเธอลงพื้น"}
{"word": "drop out", "english": "She dropped out of the art program because of financial issues.", "thai": "เธอลาออกจากหลักสูตรศิลปะเพราะปัญหาการเงิน"}
{"word": "drop out", "english": "He was forced to drop out of the marathon due to exhaustion.", "thai": "เขาถูกบังคับให้ถอนตัวจากมาราธอนเพราะความเหนื่อยล้า"}
{"word": "drop out", "english": "Why do so many students drop out before graduation?", "thai": "ทำไมนักเรียนถึงลาออกก่อนจบการศึกษามากขนาดนี้?"}
{"word": "drop out", "english": "She dropped out of the dance class after a few weeks.", "thai": "เธอลาออกจากคลาสเต้นหลังจากไม่กี่สัปดาห์"}
{"word": "drop out", "english": "He dropped out of the meeting to take an urgent call.", "thai": "เขาออกจากการประชุมเพื่อรับโทรศัพท์ด่วน"}
{"word": "drop out", "english": "Some papers dropped out of the folder during the move.", "thai": "เอกสารบางส่วนหล่นออกจากแฟ้มระหว่างการย้าย"}
{"word": "drop out", "english": "She’s planning to drop out of the volunteer program.", "thai": "เธอกำลังวางแผนถอนตัวจากโปรแกรมอาสาสมัคร"}
{"word": "drop out", "english": "He dropped out of the chess club to focus on work.", "thai": "เขาลาออกจากชมรมหมากรุกเพื่อโฟกัสที่งาน"}
{"word": "drop out", "english": "I might drop out of this course; it’s too intense.", "thai": "ฉันอาจจะลาออกจากคอร์สนี้ มันเข้มข้นเกินไป"}
{"word": "drop out", "english": "She dropped out of the talent show at the last minute.", "thai": "เธอถอนตัวจากงานแสดงความสามารถในนาทีสุดท้าย"}
{"word": "drop out", "english": "He dropped out of the startup because of disagreements.", "thai": "เขาลาออกจากสตาร์ทอัพเพราะความไม่ลงรอย"}
{"word": "drop out", "english": "The candy dropped out of the piñata when it broke.", "thai": "ลูกกวาดหล่นออกจากพินยาต้าเมื่อมันแตก"}
{"word": "drop out", "english": "She dropped out of the internship to travel abroad.", "thai": "เธอลาออกจากการฝึกงานเพื่อไปเที่ยวต่างประเทศ"}
{"word": "drop out", "english": "He dropped out of the campaign due to health issues.", "thai": "เขาถอนตัวจากแคมเปญเพราะปัญหาสุขภาพ"}
{"word": "drop out", "english": "I don’t want to drop out, but I’m falling behind.", "thai": "ฉันไม่อยากลาออก แต่ฉันกำลังตามไม่ทัน"}
{"word": "drop out", "english": "She dropped out of the yoga class because of scheduling conflicts.", "thai": "เธอลาออกจากคลาสโยคะเพราะตารางเวลาขัดแย้ง"}
{"word": "drop out", "english": "He dropped out of the play after missing rehearsals.", "thai": "เขาลาออกจากการแสดงหลังจากขาดซ้อม"}
{"word": "drop out", "english": "Some beads dropped out of the necklace when it broke.", "thai": "ลูกปัดบางส่วนหล่นออกจากสร้อยคอเมื่อมันขาด"}
{"word": "drop out", "english": "She dropped out of the coding bootcamp because it was too tough.", "thai": "เธอลาออกจากค่ายฝึกโค้ดเพราะมันยากเกินไป"}
{"word": "drop out", "english": "He dropped out of the team after a fight with the coach.", "thai": "เขาลาออกจากทีมหลังจากทะเลาะกับโค้ช"}
{"word": "drop out", "english": "Why did you drop out of the photography club?", "thai": "ทำไมคุณถึงลาออกจากชมรมถ่ายภาพ?"}
{"word": "drop out", "english": "She dropped out of the election race due to low support.", "thai": "เธอถอนตัวจากการเลือกตั้งเพราะได้รับการสนับสนุนน้อย"}
{"word": "drop out", "english": "He dropped out of the music program to pursue acting.", "thai": "เขาลาออกจากหลักสูตรดนตรีเพื่อไปเป็นนักแสดง"}
{"word": "drop out", "english": "Some items dropped out of the box during shipping.", "thai": "ของบางชิ้นหล่นออกจากกล่องระหว่างการขนส่ง"}
{"word": "drop out", "english": "She’s afraid she’ll have to drop out of school to work.", "thai": "เธอกลัวว่าจะต้องลาออกจากโรงเรียนเพื่อทำงาน"}
{"word": "drop out", "english": "He dropped out of the hiking trip because of bad weather.", "thai": "เขาถอนตัวจากทริปเดินป่าเพราะสภาพอากาศไม่ดี"}
{"word": "drop out", "english": "I don’t want to drop out, but I’m overwhelmed.", "thai": "ฉันไม่อยากลาออก แต่ฉันรู้สึกหนักใจ"}
{"word": "drop out", "english": "She dropped out of the sewing class after losing interest.", "thai": "เธอลาออกจากคลาสเย็บผ้าเพราะหมดความสนใจ"}
{"word": "drop out", "english": "He dropped out of the debate competition due to nerves.", "thai": "เขาถอนตัวจากการแข่งขันโต้วาทีเพราะความประหม่ามา"}
{"word": "drop out", "english": "Some marbles dropped out of the bag onto the ground.", "thai": "ลูกหินบางส่วนหล่นออกจากถุงลงพื้น"}
{"word": "drop out", "english": "She dropped out of the volunteer group to focus on family.", "thai": "เธอลาออกจากกลุ่มอาสาสมัครเพื่อโฟกัสที่ครอบครัว"}
{"word": "drop out", "english": "He dropped out of the science fair to join a sports team.", "thai": "เขาลาออกจากงานนิทรรศการวิทยาศาสตร์เพื่อเข้าร่วมทีมกีฬา"}
{"word": "drop out", "english": "Why did you drop out of the writing workshop?", "thai": "ทำไมคุณถึงลาออกจากเวิร์กช็อปการเขียน?"}
{"word": "drop out", "english": "She dropped out of the fitness challenge after a week.", "thai": "เธอถอนตัวจากความท้าทายด้านฟิตเนสหลังจากหนึ่งสัปดาห์"}
{"word": "drop out", "english": "He dropped out of the startup team due to creative differences.", "thai": "เขาลาออกจากทีมสตาร์ทอัพเพราะความเห็นไม่ลงรอย"}
{"word": "drop out", "english": "Some cards dropped out of the deck during the game.", "thai": "ไพ่บางใบหล่นออกจากสำรับระหว่างเกม"}
{"word": "drop out", "english": "She dropped out of the language course because it was too fast-paced.", "thai": "เธอลาออกจากคอร์สภาษาเพราะมันเร็วเกินไป"}
{"word": "drop out", "english": "He dropped out of the swim team to focus on academics.", "thai": "เขาลาออกจากทีมว่ายน้ำเพื่อโฟกัสที่การเรียน"}
{"word": "drop out", "english": "I might drop out of this club; it’s not fun anymore.", "thai": "ฉันอาจจะลาออกจากคลับนี้ มันไม่สนุกอีกต่อไป"}
{"word": "drop out", "english": "She dropped out of the baking contest due to time constraints.", "thai": "เธอถอนตัวจากการแข่งขันทำขนมเพราะข้อจำกัดด้านเวลา"}
{"word": "drop out", "english": "He dropped out of the mentorship program to start a job.", "thai": "เขาลาออกจากโปรแกรมพี่เลี้ยงเพื่อเริ่มงาน"}
{"word": "drop out", "english": "Some pens dropped out of the pencil case.", "thai": "ปากกาบางด้ามหล่นออกจากกล่องดินสอ"}
{"word": "drop out", "english": "She dropped out of the drama club after a scheduling issue.", "thai": "เธอลาออกจากชมรมละครเพราะปัญหาตารางเวลา"}
{"word": "drop out", "english": "He dropped out of the robotics team to focus on music.", "thai": "เขาลาออกจากทีมหุ่นยนต์เพื่อโฟกัสที่ดนตรี"}
{"word": "drop out", "english": "Why did you drop out of the gardening club?", "thai": "ทำไมคุณถึงลาออกจากชมรมทำสวน?"}
{"word": "drop out", "english": "She dropped out of the charity run due to a cold.", "thai": "เธอถอนตัวจากการวิ่งการกุศลเพราะเป็นหวัด"}
{"word": "drop out", "english": "He dropped out of the online course after losing motivation.", "thai": "เขาลาออกจากคอร์สออนไลน์หลังจากหมดแรงจูงใจ"}
{"word": "drop out", "english": "Some books dropped out of the shelf during the earthquake.", "thai": "หนังสือบางเล่มหล่นออกจากชั้นระหว่างแผ่นดินไหว"}
{"word": "drop out", "english": "She dropped out of the internship program to study abroad.", "thai": "เธอลาออกจากโปรแกรมฝึกงานเพื่อไปเรียนต่างประเทศ"}
{"word": "drop out", "english": "He dropped out of the cycling race after a flat tire.", "thai": "เขาถอนตัวจากการแข่งขันปั่นจักรยานหลังจากยางแบน"}
{"word": "drop out", "english": "I don’t want to drop out, but the pressure is too much.", "thai": "ฉันไม่อยากลาออก แต่ความกดดันมันมากเกินไป"}
{"word": "drop out", "english": "She dropped out of the knitting group because of boredom.", "thai": "เธอลาออกจากกลุ่มถักนิตติ้งเพราะเบื่อ"}
{"word": "drop out", "english": "He dropped out of the spelling bee after the first round.", "thai": "เขาถอนตัวจากการแข่งขันสะกดคำหลังจากรอบแรก"}
{"word": "drop out", "english": "Some toys dropped out of the box during the move.", "thai": "ของเล่นบางชิ้นหล่นออกจากกล่องระหว่างการย้าย"}
{"word": "drop out", "english": "She dropped out of the study group to work part-time.", "thai": "เธอลาออกจากกลุ่มเรียนเพื่อทำงานพาร์ทไทม์"}
{"word": "drop out", "english": "He dropped out of the fitness program after a month.", "thai": "เขาลาออกจากโปรแกรมฟิตเนสหลังจากหนึ่งเดือน"}
{"word": "drop out", "english": "Why did you drop out of the chess tournament?", "thai": "ทำไมคุณถึงถอนตัวจากการแข่งขันหมากรุก?"}
{"word": "drop out", "english": "She dropped out of the pottery class due to cost.", "thai": "เธอลาออกจากคลาสปั้นดินเผาเพราะค่าใช้จ่าย"}
{"word": "drop out", "english": "He dropped out of the band competition to focus on school.", "thai": "เขาถอนตัวจากการแข่งขันวงดนตรีเพื่อโฟกัสที่โรงเรียน"}
{"word": "drop out", "english": "Some papers dropped out of the briefcase on the bus.", "thai": "เอกสารบางส่วนหล่นออกจากกระเป๋าเอกสารบนรถบัส"}
{"word": "drop out", "english": "She dropped out of the writing group because of criticism.", "thai": "เธอลาออกจากกลุ่มเขียนเพราะการวิจารณ์"}
{"word": "drop out", "english": "He dropped out of the soccer league due to injury.", "thai": "เขาถอนตัวจากลีกฟุตบอลเพราะบาดเจ็บ"}
{"word": "drop out", "english": "I might drop out of this seminar; it’s not helpful.", "thai": "ฉันอาจจะลาออกจากสัมมนานี้ มันไม่ช่วยอะไร"}
{"word": "drop out", "english": "She dropped out of the marathon training program.", "thai": "เธอถอนตัวจากโปรแกรมฝึกมาราธอน"}
{"word": "drop out", "english": "He dropped out of the film club to join a band.", "thai": "เขาลาออกจากชมรมภาพยนตร์เพื่อเข้าร่วมวงดนตรี"}
{"word": "drop out", "english": "Some coins dropped out of the jar when it tipped.", "thai": "เหรียญบางส่วนหล่นออกจากโหลเมื่อมันล้ม"}
{"word": "drop out", "english": "She dropped out of the debate team due to stress.", "thai": "เธอลาออกจากทีมโต้วาทีเพราะความเครียด"}
{"word": "drop out", "english": "He dropped out of the cooking competition after a bad round.", "thai": "เขาถอนตัวจากการแข่งขันทำอาหารหลังจากรอบที่แย่"}
{"word": "drop out", "english": "Why did you drop out of the volunteer project?", "thai": "ทำไมคุณถึงลาออกจากโปรเจกต์อาสาสมัคร?"}
{"word": "drop out", "english": "She dropped out of the online class due to technical issues.", "thai": "เธอลาออกจากคลาสออนไลน์เพราะปัญหาทางเทคนิค"}
{"word": "drop out", "english": "He dropped out of the hiking club to focus on work.", "thai": "เขาลาออกจากชมรมเดินป่าเพื่อโฟกัสที่งาน"}
{"word": "drop out", "english": "Some candy dropped out of the bag during the party.", "thai": "ลูกกวาดบางส่วนหล่นออกจากถุงในงานปาร์ตี้"}
{"word": "drop out", "english": "She dropped out of the theater group after a conflict.", "thai": "เธอลาออกจากกลุ่มละครหลังจากความขัดแย้ง"}
{"word": "drop out", "english": "He dropped out of the tennis tournament due to fatigue.", "thai": "เขาถอนตัวจากการแข่งขันเทนนิสเพราะความเหนื่อยล้า"}
{"word": "drop out", "english": "I don’t want to drop out, but I’m not keeping up.", "thai": "ฉันไม่อยากลาออก แต่ฉันตามไม่ทัน"}
{"word": "drop out", "english": "She dropped out of the art contest because of nerves.", "thai": "เธอถอนตัวจากการแข่งขันศิลปะเพราะความประหม่า"}
{"word": "drop out", "english": "He dropped out of the choir to join a dance team.", "thai": "เขาลาออกจากคณะนักร้องประสานเสียงเพื่อเข้าร่วมทีมเต้น"}
{"word": "drop out", "english": "Some notes dropped out of the binder on the way.", "thai": "โน้ตบางส่วนหล่นออกจากแฟ้มระหว่างทาง"}
{"word": "drop out", "english": "She dropped out of the leadership program due to time.", "thai": "เธอลาออกจากโปรแกรมผู้นำเพราะไม่มีเวลา"}
{"word": "drop out", "english": "He dropped out of the math competition after a mistake.", "thai": "เขาถอนตัวจากการแข่งขันคณิตศาสตร์หลังจากทำผิด"}
{"word": "drop out", "english": "Why did you drop out of the running club?", "thai": "ทำไมคุณถึงลาออกจากชมรมวิ่ง?"}
{"word": "drop out", "english": "She dropped out of the science program to pursue art.", "thai": "เธอลาออกจากหลักสูตรวิทยาศาสตร์เพื่อไปเรียนศิลปะ"}
{"word": "drop out", "english": "He dropped out of the talent competition due to stage fright.", "thai": "เขาถอนตัวจากการแข่งขันความสามารถเพราะกลัวเวที"}
{"word": "drop out", "english": "Some tools dropped out of the toolbox during transport.", "thai": "เครื่องมือบางชิ้นหล่นออกจากกล่องเครื่องมือระหว่างขนส่ง"}
{"word": "drop out", "english": "She dropped out of the dance team to focus on school.", "thai": "เธอลาออกจากทีมเต้นเพื่อโฟกัสที่โรงเรียน"}
{"word": "drop out", "english": "He dropped out of the photography contest due to equipment issues.", "thai": "เขาถอนตัวจากการแข่งขันถ่ายภาพเพราะปัญหาอุปกรณ์"}
{"word": "drop out", "english": "I might drop out of this workshop; it’s not what I expected.", "thai": "ฉันอาจจะลาออกจากเวิร์กช็อปนี้ มันไม่ใช่อย่างที่คาด"}
{"word": "cut down", "english": "I need to cut down on sugar to stay healthy.", "thai": "ฉันต้องลดการกินน้ำตาลเพื่อสุขภาพที่ดี"}
{"word": "cut down", "english": "He cut down the old tree in his backyard.", "thai": "เขาโค่นต้นไม้เก่าในสวนหลังบ้าน"}
{"word": "cut down", "english": "We should cut down on expenses this month.", "thai": "เราควรลดค่าใช้จ่ายในเดือนนี้"}
{"word": "cut down", "english": "She’s trying to cut down on screen time before bed.", "thai": "เธอกำลังพยายามลดเวลาการใช้หน้าจอก่อนนอน"}
{"word": "cut down", "english": "They cut down the bushes to clear the path.", "thai": "พวกเขาตัดพุ่มไม้เพื่อเคลียร์ทางเดิน"}
{"word": "cut down", "english": "I’m going to cut down on coffee; it’s making me jittery.", "thai": "ฉันจะลดการดื่มกาแฟ มันทำให้ฉันกระสับกระส่าย"}
{"word": "cut down", "english": "He was cut down by the coach’s harsh words.", "thai": "เขาถูกทำให้เสียหน้าด้วยคำพูดรุนแรงของโค้ช"}
{"word": "cut down", "english": "We need to cut down on plastic use to help the environment.", "thai": "เราต้องลดการใช้พลาสติกเพื่อช่วยสิ่งแวดล้อม"}
{"word": "cut down", "english": "She cut down the weeds in the garden yesterday.", "thai": "เมื่อวานเธอตัดวัชพืชในสวน"}
{"word": "cut down", "english": "He’s trying to cut down on his gaming time.", "thai": "เขากำลังพยายามลดเวลาเล่นเกม"}
{"word": "cut down", "english": "They cut down the forest to build a new road.", "thai": "พวกเขาโค่นป่าเพื่อสร้างถนนใหม่"}
{"word": "cut down", "english": "I should cut down on junk food to lose weight.", "thai": "ฉันควรลดการกินอาหารขยะเพื่อลดน้ำหนัก"}
{"word": "cut down", "english": "She felt cut down by her coworker’s criticism.", "thai": "เธอรู้สึกเสียหน้าจากการวิจารณ์ของเพื่อนร่วมงาน"}
{"word": "cut down", "english": "We’re trying to cut down on electricity usage.", "thai": "เรากำลังพยายามลดการใช้ไฟฟ้า"}
{"word": "cut down", "english": "He cut down the tall grass around the house.", "thai": "เขาตัดหญ้าสูงรอบบ้าน"}
{"word": "cut down", "english": "She’s decided to cut down on alcohol this year.", "thai": "เธอตัดสินใจลดการดื่มแอลกอฮอล์ในปีนี้"}
{"word": "cut down", "english": "They cut down an oak tree to make space for the garage.", "thai": "พวกเขาโค่นต้นโอ๊กเพื่อสร้างที่ว่างสำหรับโรงรถ"}
{"word": "cut down", "english": "I need to cut down on my work hours to relax.", "thai": "ฉันต้องลดชั่วโมงทำงานเพื่อพักผ่อน"}
{"word": "cut down", "english": "He was cut down by the judge’s sharp comments.", "thai": "เขาถูกทำให้เสียหน้าด้วยคำวิจารณ์รุนแรงของผู้พิพากษา"}
{"word": "cut down", "english": "We should cut down on takeout to save money.", "thai": "เราควรลดการสั่งอาหารเดลิเวอรี่เพื่อประหยัดเงิน"}
{"word": "cut down", "english": "She cut down the vines growing on the fence.", "thai": "เธอตัดเถาวัลย์ที่ขึ้นบนรั้ว"}
{"word": "cut down", "english": "He’s trying to cut down on smoking this month.", "thai": "เขากำลังพยายามลดการสูบบุหรี่ในเดือนนี้"}
{"word": "cut down", "english": "They cut down the dead tree to prevent accidents.", "thai": "พวกเขาโค่นต้นไม้ที่ตายแล้วเพื่อป้องกันอุบัติเหตุ"}
{"word": "cut down", "english": "I’m going to cut down on social media use.", "thai": "ฉันจะลดการใช้โซเชียลมีเดีย"}
{"word": "cut down", "english": "She cut down the overgrown shrubs in the yard.", "thai": "เธอตัดพุ่มไม้ที่รกในสวน"}
{"word": "cut down", "english": "We need to cut down on water waste at home.", "thai": "เราต้องลดการสิ้นเปลืองน้ำที่บ้าน"}
{"word": "cut down", "english": "He cut down the branches blocking the view.", "thai": "เขาตัดกิ่งไม้ที่บังวิว"}
{"word": "cut down", "english": "She’s trying to cut down on fast food meals.", "thai": "เธอกำลังพยายามลดการกินอาหารฟาสต์ฟู้ด"}
{"word": "cut down", "english": "They cut down the pine tree for the Christmas market.", "thai": "พวกเขาโค่นต้นสนสำหรับตลาดคริสต์มาส"}
{"word": "cut down", "english": "I should cut down on late-night snacking.", "thai": "ฉันควรลดการกินของว่างตอนดึก"}
{"word": "cut down", "english": "He felt cut down by her sarcastic remarks.", "thai": "เขารู้สึกเสียหน้าจากคำพูดประชดประชันของเธอ"}
{"word": "cut down", "english": "We’re trying to cut down on car trips to save gas.", "thai": "เรากำลังพยายามลดการเดินทางด้วยรถเพื่อประหยัดน้ำมัน"}
{"word": "cut down", "english": "She cut down the tall weeds near the driveway.", "thai": "เธอตัดวัชพืชสูงใกล้ถนนรถแล่น"}
{"word": "cut down", "english": "He’s decided to cut down on soda to feel better.", "thai": "เขาตัดสินใจลดการดื่มน้ำอัดลมเพื่อรู้สึกดีขึ้น"}
{"word": "cut down", "english": "They cut down the old apple tree in the orchard.", "thai": "พวกเขาโค่นต้นแอปเปิ้ลเก่าในสวนผลไม้"}
{"word": "cut down", "english": "I need to cut down on my phone use at work.", "thai": "ฉันต้องลดการใช้โทรศัพท์ที่ทำงาน"}
{"word": "cut down", "english": "She cut down the ivy climbing up the wall.", "thai": "เธอตัดเถาไอวี่ที่เลื้อยขึ้นกำแพง"}
{"word": "cut down", "english": "We should cut down on paper waste in the office.", "thai": "เราควรลดการสิ้นเปลืองกระดาษในสำนักงาน"}
{"word": "cut down", "english": "He cut down the bamboo stalks for the project.", "thai": "เขาตัดลำไผ่สำหรับโปรเจกต์"}
{"word": "cut down", "english": "She’s trying to cut down on her shopping sprees.", "thai": "เธอกำลังพยายามลดการช็อปปิ้งอย่างสนุกสนาน"}
{"word": "cut down", "english": "They cut down the damaged tree after the storm.", "thai": "พวกเขาโค่นต้นไม้ที่เสียหายหลังจากพายุ"}
{"word": "cut down", "english": "I’m going to cut down on desserts this week.", "thai": "ฉันจะลดการกินของหวานในสัปดาห์นี้"}
{"word": "cut down", "english": "He was cut down by the teacher’s harsh feedback.", "thai": "เขาถูกทำให้เสียหน้าด้วยคำติชมรุนแรงของครู"}
{"word": "cut down", "english": "We need to cut down on our energy consumption.", "thai": "เราต้องลดการใช้พลังงาน"}
{"word": "cut down", "english": "She cut down the tall grass in the backyard.", "thai": "เธอตัดหญ้าสูงในสวนหลังบ้าน"}
{"word": "cut down", "english": "He’s trying to cut down on his commute time.", "thai": "เขากำลังพยายามลดเวลาเดินทางไปทำงาน"}
{"word": "cut down", "english": "They cut down the cedar tree for firewood.", "thai": "พวกเขาโค่นต้นซีดาร์เพื่อทำฟืน"}
{"word": "cut down", "english": "I should cut down on my late-night Netflix binges.", "thai": "ฉันควรลดการดูเน็ตฟลิกซ์ดึกดื่น"}
{"word": "cut down", "english": "She cut down the overgrown branches in the park.", "thai": "เธอตัดกิ่งไม้ที่รกในสวนสาธารณะ"}
{"word": "cut down", "english": "We’re trying to cut down on food waste at home.", "thai": "เรากำลังพยายามลดการทิ้งอาหารที่บ้าน"}
{"word": "cut down", "english": "He cut down the hedge to improve visibility.", "thai": "เขาตัดรั้วต้นไม้เพื่อเพิ่มทัศนวิสัย"}
{"word": "cut down", "english": "She’s decided to cut down on her social commitments.", "thai": "เธอตัดสินใจลดภาระผูกพันทางสังคม"}
{"word": "cut down", "english": "They cut down the palm tree to clear the lot.", "thai": "พวกเขาโค่นต้นปาล์มเพื่อเคลียร์พื้นที่"}
{"word": "cut down", "english": "I need to cut down on my spending this month.", "thai": "ฉันต้องลดการใช้จ่ายในเดือนนี้"}
{"word": "cut down", "english": "She felt cut down by his mean-spirited comments.", "thai": "เธอรู้สึกเสียหน้าจากคำพูดใจร้ายของเขา"}
{"word": "cut down", "english": "We should cut down on our water usage.", "thai": "เราควรลดการใช้น้ำ"}
{"word": "cut down", "english": "He cut down the rose bushes to redesign the garden.", "thai": "เขาตัดพุ่มกุหลาบเพื่อออกแบบสวนใหม่"}
{"word": "cut down", "english": "She’s trying to cut down on her caffeine intake.", "thai": "เธอกำลังพยายามลดการบริโภคคาเฟอีน"}
{"word": "cut down", "english": "They cut down the maple tree for safety reasons.", "thai": "พวกเขาโค่นต้นเมเปิ้ลเพื่อความปลอดภัย"}
{"word": "cut down", "english": "I’m going to cut down on my gym time to rest.", "thai": "ฉันจะลดเวลาการไปยิมเพื่อพักผ่อน"}
{"word": "cut down", "english": "She cut down the overgrown plants in the greenhouse.", "thai": "เธอตัดพืชที่รกในเรือนกระจก"}
{"word": "cut down", "english": "We need to cut down on our internet usage.", "thai": "เราต้องลดการใช้อินเทอร์เน็ต"}
{"word": "cut down", "english": "He cut down the vines blocking the window.", "thai": "เขาตัดเถาวัลย์ที่บังหน้าต่าง"}
{"word": "cut down", "english": "She’s trying to cut down on her stress levels.", "thai": "เธอกำลังพยายามลดระดับความเครียด"}
{"word": "cut down", "english": "They cut down the old fence to build a new one.", "thai": "พวกเขาตัดรั้วเก่าเพื่อสร้างใหม่"}
{"word": "cut down", "english": "I should cut down on my online shopping.", "thai": "ฉันควรลดการช็อปปิ้งออนไลน์"}
{"word": "cut down", "english": "He was cut down by the boss’s blunt critique.", "thai": "เขาถูกทำให้เสียหน้าด้วยคำวิจารณ์ตรงไปตรงมาของเจ้านาย"}
{"word": "cut down", "english": "We’re trying to cut down on packaging waste.", "thai": "เรากำลังพยายามลดขยะจากบรรจุภัณฑ์"}
{"word": "cut down", "english": "She cut down the dead branches from the tree.", "thai": "เธอตัดกิ่งไม้ที่ตายแล้วจากต้นไม้"}
{"word": "cut down", "english": "He’s decided to cut down on his overtime hours.", "thai": "เขาตัดสินใจลดชั่วโมงทำงานล่วงเวลา"}
{"word": "cut down", "english": "They cut down the willow tree to widen the path.", "thai": "พวกเขาโค่นต้นวิลโลว์เพื่อขยายทางเดิน"}
{"word": "cut down", "english": "I need to cut down on my snacking habits.", "thai": "ฉันต้องลดนิสัยการกินของว่าง"}
{"word": "cut down", "english": "She cut down the tall reeds by the pond.", "thai": "เธอตัดกกสูงข้างบ่อน้ำ"}
{"word": "cut down", "english": "We should cut down on our reliance on cars.", "thai": "เราควรลดการพึ่งพารถยนต์"}
{"word": "cut down", "english": "He cut down the shrubbery to clear the view.", "thai": "เขาตัดพุ่มไม้เพื่อเคลียร์วิว"}
{"word": "cut down", "english": "She’s trying to cut down on her sugar intake.", "thai": "เธอกำลังพยายามลดการบริโภคน้ำตาล"}
{"word": "cut down", "english": "They cut down the old barn to build a house.", "thai": "พวกเขาโค่นโรงนาเก่าเพื่อสร้างบ้าน"}
{"word": "cut down", "english": "I’m going to cut down on my TV time.", "thai": "ฉันจะลดเวลาดูทีวี"}
{"word": "cut down", "english": "She felt cut down by their unfair judgment.", "thai": "เธอรู้สึกเสียหน้าจากการตัดสินที่ไม่ยุติธรรมของพวกเขา"}
{"word": "cut down", "english": "We need to cut down on our grocery budget.", "thai": "เราต้องลดงบซื้อของชำ"}
{"word": "cut down", "english": "He cut down the overgrown grass in the field.", "thai": "เขาตัดหญ้าที่รกในท้องทุ่ง"}
{"word": "cut down", "english": "She’s decided to cut down on her late nights.", "thai": "เธอตัดสินใจลดการนอนดึก"}
{"word": "cut down", "english": "They cut down the cherry tree to expand the yard.", "thai": "พวกเขาโค่นต้นเชอร์รี่เพื่อขยายสนาม"}
{"word": "cut down", "english": "I should cut down on my soda consumption.", "thai": "ฉันควรลดการดื่มน้ำอัดลม"}
{"word": "cut down", "english": "She cut down the branches hanging over the roof.", "thai": "เธอตัดกิ่งไม้ที่ห้อยเหนือหลังคา"}
{"word": "cut down", "english": "We’re trying to cut down on our travel expenses.", "thai": "เรากำลังพยายามลดค่าใช้จ่ายในการเดินทาง"}
{"word": "cut down", "english": "He cut down the tall plants blocking the gate.", "thai": "เขาตัดพืชสูงที่บังประตู"}
{"word": "cut down", "english": "She’s trying to cut down on her work stress.", "thai": "เธอกำลังพยายามลดความเครียดจากงาน"}
{"word": "cut down", "english": "They cut down the eucalyptus tree for safety.", "thai": "พวกเขาโค่นต้นยูคาลิปตัสเพื่อความปลอดภัย"}
{"word": "cut down", "english": "I need to cut down on my gaming hours.", "thai": "ฉันต้องลดชั่วโมงเล่นเกม"}
{"word": "cut down", "english": "She cut down the old vines around the shed.", "thai": "เธอตัดเถาวัลย์เก่ารอบโรงเก็บของ"}
{"word": "cut down", "english": "We should cut down on our use of single-use plastics.", "thai": "เราควรลดการใช้พลาสติกแบบใช้ครั้งเดียว"}
{"word": "cut down", "english": "He cut down the dead tree in the front yard.", "thai": "เขาตัดต้นไม้ที่ตายแล้วในสนามหน้าบ้าน"}
{"word": "cut down", "english": "She’s trying to cut down on her fast food runs.", "thai": "เธอกำลังพยายามลดการกินฟาสต์ฟู้ด"}
{"word": "cut down", "english": "They cut down the old fence to replace it.", "thai": "พวกเขาตัดรั้วเก่าเพื่อเปลี่ยนใหม่"}
{"word": "cut down", "english": "I’m going to cut down on my online purchases.", "thai": "ฉันจะลดการซื้อของออนไลน์"}
{"word": "cut down", "english": "He was cut down by the reviewer’s harsh words.", "thai": "เขาถูกทำให้เสียหน้าด้วยคำวิจารณ์รุนแรงของผู้รีวิว"}
{"word": "cut down", "english": "We need to cut down on our household expenses.", "thai": "เราต้องลดค่าใช้จ่ายในครัวเรือน"}
{"word": "cut down", "english": "She cut down the tall grass near the pond.", "thai": "เธอตัดหญ้าสูงใกล้บ่อน้ำ"}
{"word": "cut down", "english": "He’s decided to cut down on his alcohol consumption.", "thai": "เขาตัดสินใจลดการดื่มแอลกอฮอล์"}
{"word": "cut down", "english": "They cut down the old oak for construction.", "thai": "พวกเขาโค่นต้นโอ๊กเก่าเพื่อการก่อสร้าง"}
{"word": "come back", "english": "I hope you come back to visit us soon.", "thai": "ฉันหวังว่าคุณจะกลับมาเยี่ยมเราเร็ว ๆ นี้"}
{"word": "come back", "english": "She didn’t come back to work after her vacation.", "thai": "เธอไม่กลับมาทำงานหลังจากวันหยุด"}
{"word": "come back", "english": "When are you going to come back from your trip?", "thai": "คุณจะกลับมาจากทริปเมื่อไหร่?"}
{"word": "come back", "english": "He came back with a great story from his adventure.", "thai": "เขากลับมาพร้อมเรื่องราวดี ๆ จากการผจญภัย"}
{"word": "come back", "english": "I’ll come back to the store if I forgot something.", "thai": "ฉันจะกลับมาร้านถ้าลืมอะไรบางอย่าง"}
{"word": "come back", "english": "Her headache came back after a few hours.", "thai": "อาการปวดหัวของเธอกลับมาหลังจากไม่กี่ชั่วโมง"}
{"word": "come back", "english": "He always comes back with a witty reply.", "thai": "เขามักจะตอบกลับด้วยคำพูดที่เฉลียวฉลาด"}
{"word": "come back", "english": "Can you come back later? I’m busy now.", "thai": "คุณกลับมาทีหลังได้ไหม? ตอนนี้ฉันยุ่ง"}
{"word": "come back", "english": "The old fashion trends are starting to come back.", "thai": "เทรนด์แฟชันเก่าเริ่มกลับมาฮิต"}
{"word": "come back", "english": "She came back to the team after taking a break.", "thai": "เธอกลับมาเข้าร่วมทีมหลังจากพักไป"}
{"word": "come back", "english": "I’ll come back to that question in a minute.", "thai": "ฉันจะกลับมาที่คำถามนั้นในอีกสักครู่"}
{"word": "come back", "english": "He came back home after years abroad.", "thai": "เขากลับมาบ้านหลังจากอยู่ต่างประเทศหลายปี"}
{"word": "come back", "english": "The memories of that day came back to me.", "thai": "ความทรงจำของวันนั้นกลับมาหาฉัน"}
{"word": "come back", "english": "She came back with a new perspective on life.", "thai": "เธอกลับมาพร้อมมุมมองใหม่ต่อชีวิต"}
{"word": "come back", "english": "Why don’t you come back for the party tonight?", "thai": "ทำไมคุณไม่กลับมางานปาร์ตี้คืนนี้?"}
{"word": "come back", "english": "His confidence came back after the win.", "thai": "ความมั่นใจของเขากลับมาหลังจากชนะ"}
{"word": "come back", "english": "She came back to the meeting with fresh ideas.", "thai": "เธอกลับมาประชุมพร้อมไอเดียใหม่ ๆ"}
{"word": "come back", "english": "The band is trying to come back with a new album.", "thai": "วงดนตรีกำลังพยายามกลับมาด้วยอัลบั้มใหม่"}
{"word": "come back", "english": "I’ll come back to check on you later.", "thai": "ฉันจะกลับมาเช็คคุณทีหลัง"}
{"word": "come back", "english": "He came back to the gym after a long break.", "thai": "เขากลับมาที่ยิมหลังจากหยุดไปนาน"}
{"word": "come back", "english": "That song from the 90s is starting to come back.", "thai": "เพลงจากยุค 90 เริ่มกลับมาฮิต"}
{"word": "come back", "english": "She came back to the conversation with a sharp comment.", "thai": "เธอกลับมาสนทนาด้วยคำพูดที่เฉียบคม"}
{"word": "come back", "english": "He didn’t come back after the argument.", "thai": "เขาไม่กลับมาหลังจากการโต้แย้ง"}
{"word": "come back", "english": "The pain in my knee came back after the run.", "thai": "อาการปวดเข่าของฉันกลับมาหลังจากวิ่ง"}
{"word": "come back", "english": "I hope you come back to the club next week.", "thai": "ฉันหวังว่าคุณจะกลับมาที่คลับสัปดาห์หน้า"}
{"word": "come back", "english": "She came back to school after recovering from illness.", "thai": "เธอกลับมาโรงเรียนหลังจากหายป่วย"}
{"word": "come back", "english": "He came back with a gift from his trip.", "thai": "เขากลับมาพร้อมของขวัญจากทริป"}
{"word": "come back", "english": "The old TV show might come back for a reboot.", "thai": "รายการทีวีเก่าอาจจะกลับมาทำใหม่"}
{"word": "come back", "english": "I’ll come back to the office after lunch.", "thai": "ฉันจะกลับมาที่ออฟฟิศหลังอาหารกลางวัน"}
{"word": "come back", "english": "Her smile came back when she heard the good news.", "thai": "รอยยิ้มของเธอกลับมาเมื่อได้ยินข่าวดี"}
{"word": "come back", "english": "He came back to the party after grabbing a drink.", "thai": "เขากลับมาที่ปาร์ตี้หลังจากไปหยิบเครื่องดื่ม"}
{"word": "come back", "english": "Why don’t you come back to the team? We need you.", "thai": "ทำไมคุณไม่กลับมาทีม? เราต้องการคุณ"}
{"word": "come back", "english": "The feeling of excitement came back during the game.", "thai": "ความรู้สึกตื่นเต้นกลับมาระหว่างเกม"}
{"word": "come back", "english": "She came back to the project with renewed energy.", "thai": "เธอกลับมาที่โปรเจกต์ด้วยพลังใหม่"}
{"word": "come back", "english": "He came back to the bar with his friends.", "thai": "เขากลับมาที่บาร์พร้อมเพื่อน ๆ"}
{"word": "come back", "english": "That fashion style is starting to come back in stores.", "thai": "สไตล์แฟชันนั้นเริ่มกลับมาฮิตในร้านค้า"}
{"word": "come back", "english": "I’ll come back to that topic in our next meeting.", "thai": "ฉันจะกลับมาที่หัวข้อนั้นในการประชุมครั้งหน้า"}
{"word": "come back", "english": "She came back home after a long day at work.", "thai": "เธอกลับบ้านหลังจากทำงานมาทั้งวัน"}
{"word": "come back", "english": "His energy came back after a good night’s sleep.", "thai": "พลังของเขากลับมาหลังจากนอนหลับดี"}
{"word": "come back", "english": "Can you come back to the shop tomorrow?", "thai": "คุณกลับมาร้านพรุ่งนี้ได้ไหม?"}
{"word": "come back", "english": "The team came back stronger in the second half.", "thai": "ทีมกลับมาแข็งแกร่งในครึ่งหลัง"}
{"word": "come back", "english": "He came back with a funny joke to lighten the mood.", "thai": "เขากลับมาพร้อมมุกตลกเพื่อผ่อนคลายบรรยากาศ"}
{"word": "come back", "english": "Her old fears came back during the storm.", "thai": "ความกลัวเก่าของเธอกลับมาระหว่างพายุ"}
{"word": "come back", "english": "I’ll come back to the park after I grab my jacket.", "thai": "ฉันจะกลับมาที่สวนหลังจากไปหยิบแจ็คเก็ต"}
{"word": "come back", "english": "She came back to the choir after a year off.", "thai": "เธอกลับมาเข้าร่วมคณะนักร้องประสานเสียงหลังจากหยุดไปหนึ่งปี"}
{"word": "come back", "english": "The 80s music vibe is starting to come back.", "thai": "กลิ่นอายดนตรียุค 80 เริ่มกลับมา"}
{"word": "come back", "english": "He came back to the conversation with a bold statement.", "thai": "เขากลับมาสนทนาด้วยคำพูดที่กล้าหาญ"}
{"word": "come back", "english": "I hope you come back for the next game night.", "thai": "ฉันหวังว่าคุณจะกลับมาคืนเกมครั้งหน้า"}
{"word": "come back", "english": "She came back to the city after living in the countryside.", "thai": "เธอกลับมาเมืองหลังจากอยู่ในชนบท"}
{"word": "come back", "english": "His strength came back after weeks of recovery.", "thai": "ความแข็งแรงของเขากลับมาหลังจากฟื้นตัวหลายสัปดาห์"}
{"word": "come back", "english": "Can you come back to the cafe later?", "thai": "คุณกลับมาร้านกาแฟทีหลังได้ไหม?"}
{"word": "come back", "english": "The show came back for a second season.", "thai": "รายการนั้นกลับมาฉายซีซันที่สอง"}
{"word": "come back", "english": "He came back to the meeting after a quick break.", "thai": "เขากลับมาประชุมหลังจากพักสั้น ๆ"}
{"word": "come back", "english": "Her enthusiasm came back after the encouragement.", "thai": "ความกระตือรือร้นของเธอกลับมาหลังจากได้รับการสนับสนุน"}
{"word": "come back", "english": "I’ll come back to the gym after work.", "thai": "ฉันจะกลับมาที่ยิมหลังเลิกงาน"}
{"word": "come back", "english": "She came back with a new hairstyle that looked amazing.", "thai": "เธอกลับมาพร้อมทรงผมใหม่ที่ดูสวยมาก"}
{"word": "come back", "english": "The old game is starting to come back in popularity.", "thai": "เกมเก่าเริ่มกลับมาได้รับความนิยม"}
{"word": "come back", "english": "He came back to the team with a better attitude.", "thai": "เขากลับมาที่ทีมด้วยทัศนคติที่ดีขึ้น"}
{"word": "come back", "english": "I’ll come back to that idea in our discussion.", "thai": "ฉันจะกลับมาที่ไอเดียนั้นในการสนทนา"}
{"word": "come back", "english": "She came back to the office after maternity leave.", "thai": "เธอกลับมาที่ออฟฟิศหลังจากลาคลอด"}
{"word": "come back", "english": "His old habits came back under stress.", "thai": "นิสัยเก่าของเขากลับมาเมื่ออยู่ภายใต้ความเครียด"}
{"word": "come back", "english": "Can you come back to the store with the receipt?", "thai": "คุณกลับมาร้านพร้อมใบเสร็จได้ไหม?"}
{"word": "come back", "english": "The team came back from a big deficit to win.", "thai": "ทีมกลับมาจากการตามหลังมากเพื่อชนะ"}
{"word": "come back", "english": "She came back with a clever response to his comment.", "thai": "เธอตอบกลับด้วยคำพูดที่ฉลาดต่อความเห็นของเขา"}
{"word": "come back", "english": "I hope you come back for the next workshop.", "thai": "ฉันหวังว่าคุณจะกลับมาในเวิร์กช็อปครั้งหน้า"}
{"word": "come back", "english": "He came back to the club after a long absence.", "thai": "เขากลับมาที่คลับหลังจากหายไปนาน"}
{"word": "come back", "english": "Her energy came back after a short nap.", "thai": "พลังของเธอกลับมาหลังจากงีบสั้น ๆ"}
{"word": "come back", "english": "I’ll come back to the library after class.", "thai": "ฉันจะกลับมาที่ห้องสมุดหลังเลิกเรียน"}
{"word": "come back", "english": "The trend for vinyl records is starting to come back.", "thai": "เทรนด์แผ่นเสียงเริ่มกลับมา"}
{"word": "come back", "english": "She came back to the group with a new plan.", "thai": "เธอกลับมาที่กลุ่มพร้อมแผนใหม่"}
{"word": "come back", "english": "He came back home with a big smile.", "thai": "เขากลับบ้านพร้อมรอยยิ้มกว้าง"}
{"word": "come back", "english": "Her old fears came back during the presentation.", "thai": "ความกลัวเก่าของเธอกลับมาระหว่างการนำเสนอ"}
{"word": "come back", "english": "Can you come back to the office tomorrow?", "thai": "คุณกลับมาที่ออฟฟิศพรุ่งนี้ได้ไหม?"}
{"word": "come back", "english": "The team came back to win in overtime.", "thai": "ทีมกลับมาชนะในช่วงต่อเวลา"}
{"word": "come back", "english": "He came back with a sarcastic remark.", "thai": "เขาตอบกลับด้วยคำพูดประชด"}
{"word": "come back", "english": "I’ll come back to the restaurant for dinner.", "thai": "ฉันจะกลับมาร้านอาหารเพื่อกินมื้อค่ำ"}
{"word": "come back", "english": "She came back to the book club after a break.", "thai": "เธอกลับมาชมรมหนังสือหลังจากพักไป"}
{"word": "come back", "english": "His enthusiasm came back after the pep talk.", "thai": "ความกระตือรือร้นของเขากลับมาหลังจากการพูดให้กำลังใจ"}
{"word": "come back", "english": "The old movie is starting to come back on streaming.", "thai": "ภาพยนตร์เก่าเริ่มกลับมาบนสตรีมมิ่ง"}
{"word": "come back", "english": "I’ll come back to the park with my dog later.", "thai": "ฉันจะกลับมาที่สวนพร้อมสุนัขของฉันทีหลัง"}
{"word": "come back", "english": "She came back to the project after rethinking her role.", "thai": "เธอกลับมาที่โปรเจกต์หลังจากทบทวนบทบาทของตัวเอง"}
{"word": "come back", "english": "He came back to the bar with a round of drinks.", "thai": "เขากลับมาที่บาร์พร้อมเครื่องดื่มหนึ่งรอบ"}
{"word": "come back", "english": "Her old symptoms came back after the stress.", "thai": "อาการเก่าของเธอกลับมาหลังจากความเครียด"}
{"word": "come back", "english": "Can you come back to the meeting with your notes?", "thai": "คุณกลับมาประชุมพร้อมโน้ตของคุณได้ไหม?"}
{"word": "come back", "english": "The team came back from behind to tie the game.", "thai": "ทีมกลับมาจากการตามหลังเพื่อเสมอเกม"}
{"word": "come back", "english": "She came back with a quick comeback to his joke.", "thai": "เธอตอบกลับด้วยคำโต้ตอบเร็ว ๆ ต่อมุกของเขา"}
{"word": "come back", "english": "I hope you come back for the next event.", "thai": "ฉันหวังว่าคุณจะกลับมางานครั้งหน้า"}
{"word": "come back", "english": "He came back to the city after a year away.", "thai": "เขากลับมาเมืองหลังจากหายไปหนึ่งปี"}
{"word": "come back", "english": "Her confidence came back after the training.", "thai": "ความมั่นใจของเธอกลับมาหลังจากการฝึกอบรม"}
{"word": "come back", "english": "I’ll come back to the store after I check my list.", "thai": "ฉันจะกลับมาร้านหลังจากเช็ครายการ"}
{"word": "come back", "english": "The old cartoon is starting to come back on TV.", "thai": "การ์ตูนเก่าเริ่มกลับมาฉายทางทีวี"}
{"word": "come back", "english": "She came back to the team with new skills.", "thai": "เธอกลับมาที่ทีมพร้อมทักษะใหม่"}
{"word": "come back", "english": "He came back home with a new pet.", "thai": "เขากลับบ้านพร้อมสัตว์เลี้ยงตัวใหม่"}
{"word": "come back", "english": "The memories of summer came back to her.", "thai": "ความทรงจำของหน้าร้อนกลับมาหาเธอ"}
{"word": "come back", "english": "Can you come back to the class next week?", "thai": "คุณกลับมาคลาสสัปดาห์หน้าได้ไหม?"}
{"word": "come back", "english": "The team came back to win the championship.", "thai": "ทีมกลับมาชนะแชมป์"}
{"word": "come back", "english": "She came back with a hilarious response.", "thai": "เธอตอบกลับด้วยคำตอบที่ตลกมาก"}
{"word": "come back", "english": "I’ll come back to the cafe after my meeting.", "thai": "ฉันจะกลับมาร้านกาแฟหลังจากการประชุม"}
{"word": "come back", "english": "He came back to the band after a solo project.", "thai": "เขากลับมาที่วงหลังจากโปรเจกต์เดี่ยว"}
{"word": "come back", "english": "Her strength came back after months of therapy.", "thai": "ความแข็งแรงของเธอกลับมาหลังจากการบำบัดหลายเดือน"}
{"word": "come back", "english": "The old dance moves are starting to come back.", "thai": "ท่าเต้นเก่าเริ่มกลับมา"}
