{"word":"bold","english":"Her bold attitude inspires everyone around her.","thai":"ทัศนคติที่กล้าหาญของเธอสร้างแรงบันดาลใจให้ทุกคนรอบตัว"}
{"word":"inspires","english":"His speech inspires young minds to dream big.","thai":"คำพูดของเขาสร้างแรงบันดาลใจให้เยาวชนฝันใหญ่"}
{"word":"dream","english":"Chasing a dream takes courage and persistence.","thai":"การไล่ตามความฝันต้องใช้ความกล้าและความพากเพียร"}
{"word":"courage","english":"She faced the challenge with unwavering courage.","thai":"เธอเผชิญหน้ากับความท้าทายด้วยความกล้าที่ไม่หวั่นไหว"}
{"word":"challenge","english":"The coding challenge pushed his skills to the limit.","thai":"ความท้าทายในการเขียนโค้ดผลักดันทักษะของเขาให้ถึงขีดสุด"}
{"word":"skills","english":"Her culinary skills turned dinner into a feast.","thai":"ทักษะการทำอาหารของเธอเปลี่ยนมื้อเย็นให้เป็นงานเลี้ยง"}
{"word":"dinner","english":"They planned a cozy dinner by the fireplace.","thai":"พวกเขาวางแผนมื้อเย็นแสนอบอุ่นข้างเตาผิง"}
{"word":"cozy","english":"The cozy cabin was perfect for a winter escape.","thai":"กระท่อมแสนอบอุ่นเหมาะสำหรับการพักผ่อนในฤดูหนาว"}
{"word":"escape","english":"A weekend trip is the perfect escape from routine.","thai":"การเดินทางช่วงสุดสัปดาห์เป็นการหลบหนีจากความจำเจที่สมบูรณ์แบบ"}
{"word":"trip","english":"Their road trip across the country was unforgettable.","thai":"การเดินทางข้ามประเทศของพวกเขาเป็นที่น่าจดจำ"}
{"word":"unforgettable","english":"The concert was an unforgettable experience for fans.","thai":"คอนเสิร์ตเป็นประสบการณ์ที่น่าจดจำสำหรับแฟนๆ"}
{"word":"experience","english":"Her experience in design landed her the job.","thai":"ประสบการณ์ด้านการออกแบบของเธอทำให้ได้งาน"}
{"word":"job","english":"His new job requires working late hours.","thai":"งานใหม่ของเขาต้องทำงานจนดึก"}
{"word":"hours","english":"She spent hours perfecting her dance routine.","thai":"เธอใช้เวลาหลายชั่วโมงเพื่อฝึกซ้อมท่าเต้นให้สมบูรณ์แบบ"}
{"word":"dance","english":"The dance floor was packed with energetic movers.","thai":"ฟลอร์เต้นรำเต็มไปด้วยนักเต้นที่เปี่ยมพลัง"}
{"word":"energetic","english":"His energetic vibe lights up any room.","thai":"พลังอันเปี่ยมล้นของเขาทำให้ทุกห้องสว่างไสว"}
{"word":"room","english":"The room buzzed with creative ideas during the meeting.","thai":"ห้องนั้นเต็มไปด้วยความคิดสร้างสรรค์ระหว่างการประชุม"}
{"word":"ideas","english":"Her innovative ideas transformed the company’s strategy.","thai":"แนวคิดนวัตกรรมของเธอเปลี่ยนกลยุทธ์ของบริษัท"}
{"word":"strategy","english":"A solid strategy helped them win the game.","thai":"กลยุทธ์ที่แข็งแกร่งช่วยให้พวกเขาชนะเกม"}
{"word":"game","english":"The chess game tested their patience and wit.","thai":"เกมหมากรุกทดสอบความอดทนและไหวพริบของพวกเขา"}
{"word":"patience","english":"Teaching kids requires endless patience and care.","thai":"การสอนเด็กต้องใช้ความอดทนและความเอาใจใส่อย่างไม่สิ้นสุด"}
{"word":"care","english":"She handled the project with utmost care.","thai":"เธอจัดการโปรเจกต์ด้วยความระมัดระวังอย่างที่สุด"}
{"word":"project","english":"The science project won first place at the fair.","thai":"โครงงานวิทยาศาสตร์ชนะรางวัลที่หนึ่งในงานนิทรรศการ"}
{"word":"place","english":"They found a quiet place to study for exams.","thai":"พวกเขาหาสถานที่เงียบสงบเพื่ออ่านหนังสือสอบ"}
{"word":"study","english":"Her study of ancient history fascinated the class.","thai":"การศึกษาประวัติศาสตร์โบราณของเธอทำให้นักเรียนหลงใหล"}
{"word":"history","english":"The museum showcased the history of local tribes.","thai":"พิพิธภัณฑ์จัดแสดงประวัติศาสตร์ของชนเผ่าท้องถิ่น"}
{"word":"museum","english":"A visit to the museum sparked his curiosity.","thai":"การเยี่ยมชมพิพิธภัณฑ์จุดประกายความอยากรู้อยากเห็นของเขา"}
{"word":"curiosity","english":"Her curiosity about space led to a science career.","thai":"ความอยากรู้อยากเห็นเกี่ยวกับอวกาศนำเธอไปสู่อาชีพด้านวิทยาศาสตร์"}
{"word":"career","english":"His career in music took off after the tour.","thai":"อาชีพด้านดนตรีของเขาพุ่งแรงหลังจากการทัวร์"}
{"word":"music","english":"The music at the festival was absolutely electric.","thai":"ดนตรีในงานเทศกาลนั้นเร้าใจสุดๆ"}
{"word":"festival","english":"The food festival drew crowds from all over.","thai":"งานเทศกาลอาหารดึงดูดผู้คนจากทุกที่"}
{"word":"food","english":"Her love for spicy food surprised her friends.","thai":"ความรักในอาหารรสเผ็ดของเธอทำให้เพื่อนๆ ประหลาดใจ"}
{"word":"friends","english":"Good friends make every adventure more fun.","thai":"เพื่อนที่ดีทำให้ทุกการผจญภัยสนุกยิ่งขึ้น"}
{"word":"adventure","english":"Their hiking adventure revealed stunning views.","thai":"การผจญภัยเดินป่าของพวกเขาเผยให้เห็นวิวที่สวยงาม"}
{"word":"views","english":"The mountain views left them speechless.","thai":"วิวภูเขาทำให้พวกเขาพูดไม่ออก"}
{"word":"mountain","english":"Climbing the mountain was a life-changing feat.","thai":"การปีนเขาคือความสำเร็จที่เปลี่ยนชีวิต"}
{"word":"feat","english":"Her feat of juggling work and school amazed everyone.","thai":"ความสามารถในการจัดการงานและการเรียนของเธอทำให้ทุกคนทึ่ง"}
{"word":"school","english":"The school talent show was a huge hit.","thai":"การแสดงความสามารถของโรงเรียนได้รับความนิยมอย่างมาก"}
{"word":"talent","english":"His talent for painting earned him a scholarship.","thai":"พรสวรรค์ด้านการวาดภาพทำให้เขาได้รับทุนการศึกษา"}
{"word":"painting","english":"The painting in the gallery told a powerful story.","thai":"ภาพวาดในแกลเลอรีบอกเล่าเรื่องราวอันทรงพลัง"}
{"word":"story","english":"Her bedtime story calmed the restless kids.","thai":"นิทานก่อนนอนของเธอทำให้เด็กๆ ที่กระสับกระส่ายสงบลง"}
{"word":"kids","english":"The kids built a fort out of blankets.","thai":"เด็กๆ สร้างป้อมจากผ้าห่ม"}
{"word":"blankets","english":"Warm blankets made the chilly night cozy.","thai":"ผ้าห่มอุ่นๆ ทำให้คืนที่หนาวเย็นอบอุ่น"}
{"word":"night","english":"The starry night inspired a romantic walk.","thai":"คืนที่เต็มไปด้วยดวงดาวสร้างแรงบันดาลใจให้เดินเล่นอย่างโรแมนติก"}
{"word":"walk","english":"A morning walk boosts her energy for the day.","thai":"การเดินยามเช้าช่วยเพิ่มพลังให้เธอตลอดวัน"}
{"word":"energy","english":"His boundless energy kept the party alive.","thai":"พลังที่ไร้ขีดจำกัดของเขาทำให้งานปาร์ตี้คึกคัก"}
{"word":"party","english":"The surprise party was planned in secret.","thai":"งานปาร์ตี้เซอร์ไพรส์ถูกวางแผนอย่างลับๆ"}
{"word":"secret","english":"She kept her recipe a closely guarded secret.","thai":"เธอเก็บสูตรอาหารไว้เป็นความลับอย่างดี"}
{"word":"recipe","english":"His family recipe for soup warmed everyone’s hearts.","thai":"สูตรอาหารครอบครัวของเขาสำหรับซุปทำให้ทุกคนอบอุ่นใจ"}
{"word":"soup","english":"A bowl of hot soup comforted her cold.","thai":"ชามซุปร้อนๆ ช่วยบรรเทาอาการหวัดของเธอ"}
{"word":"cold","english":"The cold weather called for thick sweaters.","thai":"สภาพอากาศหนาวเย็นเรียกร้องให้ใส่เสื้อกันหนาวหนาๆ"}
{"word":"sweaters","english":"Knitting sweaters became her favorite hobby.","thai":"การถักเสื้อกันหนาวกลายเป็นงานอดิเรกที่เธอชื่นชอบ"}
{"word":"hobby","english":"His hobby of collecting coins fascinated visitors.","thai":"งานอดิเรกสะสมเหรียญของเขาทำให้ผู้มาเยือนหลงใหล"}
{"word":"coins","english":"Old coins revealed stories of forgotten eras.","thai":"เหรียญเก่าเล่าเรื่องราวของยุคที่ถูกลืม"}
{"word":"stories","english":"Grandma’s stories about her youth were captivating.","thai":"เรื่องเล่าของคุณยายเกี่ยวกับวัยเด็กของเธอน่าหลงใหล"}
{"word":"youth","english":"The youth group organized a charity run.","thai":"กลุ่มเยาวชนจัดการวิ่งการกุศล"}
{"word":"charity","english":"Her charity work uplifted the entire community.","thai":"งานการกุศลของเธอยกระดับชุมชนทั้งหมด"}
{"word":"community","english":"The community rallied to clean the park.","thai":"ชุมชนรวมตัวกันเพื่อทำความสะอาดสวนสาธารณะ"}
{"word":"park","english":"Kids played tag in the sunny park.","thai":"เด็กๆ เล่นวิ่งไล่จับในสวนสาธารณะที่แดดจ้า"}
{"word":"sunny","english":"A sunny day lifted everyone’s spirits.","thai":"วันที่แดดจ้าทำให้ทุกคนอารมณ์ดี"}
{"word":"spirits","english":"High spirits fueled their late-night chats.","thai":"จิตใจที่เบิกบานขับเคลื่อนการพูดคุยยามดึกของพวกเขา"}
{"word":"chats","english":"Online chats connected friends across continents.","thai":"การแชทออนไลน์เชื่อมโยงเพื่อนข้ามทวีป"}
{"word":"friends","english":"Close friends share secrets without fear.","thai":"เพื่อนสนิทแบ่งปันความลับโดยไม่กลัว"}
{"word":"secrets","english":"Uncovering secrets in the old diary was thrilling.","thai":"การค้นพบความลับในไดอารี่เก่าน่าตื่นเต้น"}
{"word":"diary","english":"Her diary held thoughts too personal to share.","thai":"ไดอารี่ของเธอเก็บความคิดที่เป็นส่วนตัวเกินกว่าจะแบ่งปัน"}
{"word":"thoughts","english":"His thoughts wandered during the boring lecture.","thai":"ความคิดของเขาเร่ร่อนระหว่างการบรรยายที่น่าเบื่อ"}
{"word":"lecture","english":"The professor’s lecture sparked lively debates.","thai":"การบรรยายของศาสตราจารย์จุดประกายการถกเถียงอย่างคึกคัก"}
{"word":"debates","english":"Political debates heated up the election season.","thai":"การถกเถียงทางการเมืองทำให้ฤดูการเลือกตั้งร้อนแรง"}
{"word":"election","english":"The election results shocked the entire nation.","thai":"ผลการเลือกตั้งทำให้ทั้งชาติตกตะลึง"}
{"word":"nation","english":"The nation celebrated its independence with pride.","thai":"ชาติเฉลิมฉลองความเป็นอิสระด้วยความภาคภูมิใจ"}
{"word":"pride","english":"Her pride in her work shone through.","thai":"ความภูมิใจในงานของเธอเปล่งประกายออกมา"}
{"word":"work","english":"Hard work earned him a well-deserved promotion.","thai":"การทำงานหนักทำให้เขาได้รับการเลื่อนตำแหน่งที่สมควร"}
{"word":"promotion","english":"The promotion came with a corner office.","thai":"การเลื่อนตำแหน่งมาพร้อมกับห้องทำงานมุม"}
{"word":"office","english":"The office buzzed with deadline-driven energy.","thai":"สำนักงานเต็มไปด้วยพลังที่ขับเคลื่อนด้วยกำหนดเวลา"}
{"word":"deadline","english":"Meeting the deadline required all-night effort.","thai":"การทำตามกำหนดเวลาต้องใช้ความพยายามทั้งคืน"}
{"word":"effort","english":"Her effort in training paid off big time.","thai":"ความพยายามในการฝึกซ้อมของเธอได้ผลตอบแทนมหาศาล"}
{"word":"training","english":"The training session improved their teamwork skills.","thai":"เซสชันการฝึกอบรมปรับปรุงทักษะการทำงานเป็นทีมของพวกเขา"}
{"word":"teamwork","english":"Teamwork made the project a huge success.","thai":"การทำงานเป็นทีมทำให้โปรเจกต์ประสบความสำเร็จอย่างมาก"}
{"word":"success","english":"Her success story motivated aspiring entrepreneurs.","thai":"เรื่องราวความสำเร็จของเธอสร้างแรงบันดาลใจให้ผู้ประกอบการหน้าใหม่"}
{"word":"entrepreneurs","english":"Young entrepreneurs pitched bold ideas to investors.","thai":"ผู้ประกอบการหนุ่มสาวนำเสนอแนวคิดที่กล้าหาญต่อนักลงทุน"}
{"word":"investors","english":"Investors were impressed by her startup’s growth.","thai":"นักลงทุนประทับใจกับการเติบโตของสตาร์ทอัพของเธอ"}
{"word":"growth","english":"The garden’s growth amazed the new gardener.","thai":"การเติบโตของสวนทำให้ชาวสวนใหม่ประหลาดใจ"}
{"word":"garden","english":"Her garden bloomed with vibrant flowers.","thai":"สวนของเธอเบ่งบานด้วยดอกไม้สีสันสดใส"}
{"word":"flowers","english":"Fresh flowers brightened the dull room.","thai":"ดอกไม้สดทำให้ห้องที่ทึบทมัยสว่างไสว"}
{"word":"room","english":"The cozy room invited hours of relaxation.","thai":"ห้องแสนอบอุ่นเชิญชวนให้พักผ่อนเป็นชั่วโมง"}
{"word":"relaxation","english":"Yoga brought her a sense of relaxation.","thai":"โยคะนำความรู้สึกผ่อนคลายมาให้เธอ"}
{"word":"sense","english":"His keen sense of humor won her over.","thai":"อารมณ์ขันที่เฉียบแหลมของเขาทำให้เธอหลงใหล"}
{"word":"humor","english":"Her humor kept the team in high spirits.","thai":"อารมณ์ขันของเธอทำให้ทีมมีจิตใจที่เบิกบาน"}
{"word":"team","english":"The team collaborated to solve the puzzle.","thai":"ทีมทำงานร่วมกันเพื่อแก้ปริศนา"}
{"word":"puzzle","english":"The crossword puzzle stumped even the experts.","thai":"ปริศนาอักษรไขว้ทำให้แม้แต่ผู้เชี่ยวชาญยังงง"}
{"word":"experts","english":"Experts predicted a rise in tech stocks.","thai":"ผู้เชี่ยวชาญคาดการณ์ว่าหุ้นเทคโนโลยีจะพุ่งสูง"}
{"word":"tech","english":"The tech conference showcased cutting-edge gadgets.","thai":"การประชุมเทคโนโลยีจัดแสดงอุปกรณ์ล้ำสมัย"}
{"word":"gadgets","english":"New gadgets made her kitchen more efficient.","thai":"อุปกรณ์ใหม่ทำให้ครัวของเธอมีประสิทธิภาพมากขึ้น"}
{"word":"kitchen","english":"The kitchen smelled of freshly baked bread.","thai":"ครัวมีกลิ่นหอมของขนมปังอบใหม่"}
{"word":"bread","english":"Homemade bread paired perfectly with soup.","thai":"ขนมปังทำเองเข้ากันได้อย่างลงตัวกับซุป"}
{"word":"soup","english":"Spicy soup warmed them on a chilly evening.","thai":"ซุปรสเผ็ดทำให้พวกเขาอบอุ่นในเย็นที่หนาวเย็น"}
{"word":"evening","english":"The evening breeze carried scents of jasmine.","thai":"สายลมยามเย็นพัดพากลิ่นมะลิมา"}
{"word":"breeze","english":"A cool breeze refreshed the hiking group.","thai":"สายลมเย็นๆ ทำให้กลุ่มเดินป่าสดชื่น"}
{"word":"cool","english":"The cool air from the fan was a relief.","thai":"อากาศเย็นจากพัดลมช่วยให้รู้สึกโล่งใจ"}
{"word":"fan","english":"The old fan rattled but still worked fine.","thai":"พัดลมเก่าร้องดังแต่ยังทำงานได้ดี"}
{"word":"worked","english":"She worked tirelessly to meet the tight deadline.","thai":"เธอทำงานอย่างไม่รู้จักเหน็ดเหนื่อยเพื่อให้ทันกำหนดเวลา"}
{"word":"deadline","english":"Missing the deadline cost them the contract.","thai":"การพลาดกำหนดเวลาทำให้พวกเขาเสียสัญญา"}
{"word":"contract","english":"The contract negotiation dragged on for weeks.","thai":"การเจรจาสัญญายืดเยื้อไปหลายสัปดาห์"}
{"word":"negotiation","english":"His negotiation skills sealed the business deal.","thai":"ทักษะการเจรจาของเขาทำให้ข้อตกลงทางธุรกิจสำเร็จ"}
{"word":"deal","english":"They struck a deal to share the profits.","thai":"พวกเขาตกลงแบ่งปันผลกำไร"}
{"word":"profits","english":"The startup’s profits soared after the launch.","thai":"กำไรของสตาร์ทอัพพุ่งสูงหลังการเปิดตัว"}
{"word":"launch","english":"The product launch drew a huge crowd.","thai":"การเปิดตัวผลิตภัณฑ์ดึงดูดฝูงชนจำนวนมาก"}
{"word":"crowd","english":"The crowd cheered loudly at the game’s end.","thai":"ฝูงชนส่งเสียงเชียร์ดังลั่นเมื่อเกมจบ"}
{"word":"cheered","english":"Fans cheered as the band took the stage.","thai":"แฟนๆ ส่งเสียงเชียร์เมื่อวงดนตรีขึ้นเวที"}
{"word":"stage","english":"Her performance on stage left everyone speechless.","thai":"การแสดงบนเวทีของเธอทำให้ทุกคนตะลึง"}
{"word":"performance","english":"His performance in the play earned rave reviews.","thai":"การแสดงในละครของเขาได้รับคำวิจารณ์ชื่นชม"}
{"word":"reviews","english":"Online reviews helped her choose the best restaurant.","thai":"รีวิวออนไลน์ช่วยให้เธอเลือกร้านอาหารที่ดีที่สุด"}
{"word":"restaurant","english":"The new restaurant serves authentic Thai cuisine.","thai":"ร้านอาหารใหม่เสิร์ฟอาหารไทยแท้"}
{"word":"cuisine","english":"Her love for Italian cuisine inspired her cooking.","thai":"ความรักในอาหารอิตาเลียนสร้างแรงบันดาลใจให้เธอทำอาหาร"}
{"word":"cooking","english":"Cooking together brought the family closer.","thai":"การทำอาหารด้วยกันทำให้ครอบครัวใกล้ชิดกันมากขึ้น"}
{"word":"family","english":"The family reunion was filled with laughter.","thai":"การรวมตัวของครอบครัวเต็มไปด้วยเสียงหัวเราะ"}
{"word":"laughter","english":"Her infectious laughter brightened the gloomy day.","thai":"เสียงหัวเราะที่ติดต่อของเธอทำให้วันอันหม่นหมองสว่างขึ้น"}
{"word":"day","english":"A sunny day called for a beach trip.","thai":"วันที่แดดจ้าชวนให้ไปเที่ยวชายหาด"}
{"word":"beach","english":"The beach was perfect for a sunset stroll.","thai":"ชายหาดเหมาะสำหรับการเดินเล่นยามพระอาทิตย์ตก"}
{"word":"sunset","english":"The sunset painted the sky in vibrant hues.","thai":"พระอาทิตย์ตกแต่งท้องฟ้าด้วยสีสันสดใส"}
{"word":"sky","english":"Stars twinkled in the clear night sky.","thai":"ดวงดาวระยิบระยับในท้องฟ้ายามค่ำคืนที่แจ่มใส"}
{"word":"night","english":"The night market buzzed with excited shoppers.","thai":"ตลาดกลางคืนคึกคักไปด้วยนักช้อปที่ตื่นเต้น"}
{"word":"shoppers","english":"Shoppers hunted for deals during the sale.","thai":"นักช้อปตามล่าหาดีลในช่วงลดราคา"}
{"word":"sale","english":"The big sale attracted bargain hunters citywide.","thai":"การลดราคาครั้งใหญ่ดึงดูดนักล่าดีลทั่วเมือง"}
{"word":"bargain","english":"She found a bargain on vintage clothes.","thai":"เธอเจอของถูกสำหรับเสื้อผ้าวินเทจ"}
{"word":"clothes","english":"New clothes boosted her confidence for the interview.","thai":"เสื้อผ้าใหม่เพิ่มความมั่นใจให้เธอสำหรับการสัมภาษณ์"}
{"word":"interview","english":"The job interview went better than expected.","thai":"การสัมภาษณ์งานดีเกินกว่าที่คาดไว้"}
{"word":"job","english":"His dream job involved traveling the world.","thai":"งานในฝันของเขาคือการเดินทางรอบโลก"}
{"word":"traveling","english":"Traveling abroad opened her eyes to new cultures.","thai":"การเดินทางไปต่างประเทศเปิดโลกทัศน์ของเธอต่อวัฒนธรรมใหม่"}
{"word":"cultures","english":"Learning about different cultures enriched her perspective.","thai":"การเรียนรู้เกี่ยวกับวัฒนธรรมที่แตกต่างทำให้มุมมองของเธอกว้างขึ้น"}
{"word":"perspective","english":"His perspective on life changed after volunteering.","thai":"มุมมองต่อชีวิตของเขาเปลี่ยนไปหลังจากเป็นอาสาสมัคร"}
{"word":"volunteering","english":"Volunteering at the shelter taught her compassion.","thai":"การเป็นอาสาสมัครที่ศูนย์พักพิงสอนให้เธอมีความเห็นอกเห็นใจ"}
{"word":"compassion","english":"Her compassion for animals led to rescue efforts.","thai":"ความเห็นอกเห็นใจต่อสัตว์ทำให้เธอเริ่มช่วยเหลือสัตว์"}
{"word":"animals","english":"The farm animals roamed freely in the fields.","thai":"สัตว์ในฟาร์มเดินเตร่อย่างอิสระในท้องทุ่ง"}
{"word":"fields","english":"Golden fields stretched as far as the eye could see.","thai":"ทุ่งสีทองทอดยาวไกลสุดสายตา"}
{"word":"eye","english":"Her sharp eye caught every detail in the design.","thai":"สายตาอันเฉียบคมของเธอจับทุกรายละเอียดในงานออกแบบ"}
{"word":"design","english":"The sleek design of the car turned heads.","thai":"การออกแบบที่โฉบเฉี่ยวของรถทำให้ทุกคนหันมอง"}
{"word":"car","english":"The car raced down the highway at dusk.","thai":"รถพุ่งไปบนทางหลวงยามพลบค่ำ"}
{"word":"highway","english":"The highway was jammed with rush-hour traffic.","thai":"ทางหลวงติดขัดด้วยการจราจรในชั่วโมงเร่งด่วน"}
{"word":"traffic","english":"Navigating city traffic requires patience and skill.","thai":"การขับรถในเมืองต้องใช้ความอดทนและทักษะ"}
{"word":"patience","english":"Patience is key when teaching young kids.","thai":"ความอดทนคือกุญแจสำคัญในการสอนเด็กเล็ก"}
{"word":"kids","english":"The kids giggled during the silly puppet show.","thai":"เด็กๆ หัวเราะคิกคักระหว่างการแสดงหุ่นเชิดสุดฮา"}
{"word":"show","english":"The comedy show had everyone in stitches.","thai":"การแสดงตลกทำให้ทุกคนขำจนท้องแข็ง"}
{"word":"comedy","english":"Her comedy routine poked fun at daily life.","thai":"การแสดงตลกของเธอล้อเลียนชีวิตประจำวัน"}
{"word":"life","english":"A balanced life keeps stress at bay.","thai":"ชีวิตที่สมดุลช่วยลดความเครียด"}
{"word":"stress","english":"Work stress pushed him to try meditation.","thai":"ความเครียดจากงานผลักดันให้เขาลองนั่งสมาธิ"}
{"word":"meditation","english":"Meditation brought calm to her busy mornings.","thai":"การนั่งสมาธินำความสงบมาสู่เช้าที่วุ่นวายของเธอ"}
{"word":"mornings","english":"Crisp fall mornings called for hot coffee.","thai":"เช้าฤดูใบไม้ร่วงที่สดชื่นชวนให้ดื่มกาแฟร้อน"}
{"word":"coffee","english":"The coffee shop was a hub for creatives.","thai":"ร้านกาแฟเป็นศูนย์รวมของคนสร้างสรรค์"}
{"word":"creatives","english":"Creatives brainstormed ideas for the ad campaign.","thai":"คนสร้างสรรค์ระดมความคิดสำหรับแคมเปญโฆษณา"}
{"word":"campaign","english":"The election campaign energized young voters.","thai":"แคมเปญเลือกตั้งสร้างพลังให้ผู้มีสิทธิเลือกตั้งรุ่นเยาว์"}
{"word":"voters","english":"Voters lined up early to cast their ballots.","thai":"ผู้มีสิทธิเลือกตั้งต่อแถวแต่เช้าเพื่อลงคะแนน"}
{"word":"ballots","english":"Counting ballots took longer than expected.","thai":"การนับคะแนนใช้เวลานานกว่าที่คาด"}
{"word":"time","english":"Time flew by during the lively party.","thai":"เวลาผ่านไปเร็วมากในงานปาร์ตี้ที่คึกคัก"}
{"word":"party","english":"The costume party was a spooky success.","thai":"งานปาร์ตี้ชุดแฟนซีประสบความสำเร็จอย่างน่าขนลุก"}
{"word":"success","english":"Her success in debate won her a scholarship.","thai":"ความสำเร็จในการโต้วาทีทำให้เธอได้ทุนการศึกษา"}
{"word":"scholarship","english":"The scholarship covered her college tuition costs.","thai":"ทุนการศึกษาครอบคลุมค่าเล่าเรียนในวิทยาลัยของเธอ"}
{"word":"college","english":"College life taught him independence and grit.","thai":"ชีวิตในวิทยาลัยสอนให้เขาเป็นอิสระและเข้มแข็ง"}
{"word":"independence","english":"Financial independence gave her freedom to explore.","thai":"อิสรภาพทางการเงินให้อิสระแก่เธอในการสำรวจ"}
{"word":"freedom","english":"Freedom to create fueled his artistic passion.","thai":"อิสรภาพในการสร้างสรรค์จุดไฟให้กับความหลงใหลในศิลปะของเขา"}
{"word":"passion","english":"Her passion for music shone in every note.","thai":"ความหลงใหลในดนตรีของเธอเปล่งประกายในทุกโน้ต"}
{"word":"music","english":"Live music filled the festival with energy.","thai":"ดนตรีสดทำให้งานเทศกาลเต็มไปด้วยพลัง"}
{"word":"festival","english":"The film festival showcased indie gems.","thai":"เทศกาลภาพยนตร์จัดแสดงผลงานอินดี้ที่น่าประทับใจ"}
{"word":"film","english":"The old film captured the charm of the 80s.","thai":"ภาพยนตร์เก่าจับเสน่ห์ของยุค 80 ได้"}
{"word":"charm","english":"Her charm won over even the toughest critics.","thai":"เสน่ห์ของเธอชนะใจแม้แต่นักวิจารณ์ที่เข้มงวดที่สุด"}
{"word":"critics","english":"Critics praised the novel’s bold narrative.","thai":"นักวิจารณ์ชื่นชมการเล่าเรื่องที่กล้าหาญของนิยาย"}
{"word":"novel","english":"The novel kept her up past midnight.","thai":"นิยายทำให้นอนดึกเกินเที่ยงคืน"}
{"word":"midnight","english":"Midnight snacks fueled their late-night study session.","thai":"ของว่างเที่ยงคืนช่วยเติมพลังให้เซสชันเรียนดึก"}
{"word":"study","english":"Her study of marine life inspired conservation efforts.","thai":"การศึกษาชีวิตในทะเลของเธอสร้างแรงบันดาลใจให้การอนุรักษ์"}
{"word":"conservation","english":"Conservation programs saved the endangered species.","thai":"โปรแกรมอนุรักษ์ช่วยรักษาสายพันธุ์ที่ใกล้สูญพันธุ์"}
{"word":"species","english":"Rare species thrived in the protected forest.","thai":"สายพันธุ์หายากเจริญเติบโตในป่าที่ได้รับการคุ้มครอง"}
{"word":"forest","english":"The forest trail led to a hidden waterfall.","thai":"เส้นทางในป่านำไปสู่น้ำตกที่ซ่อนอยู่"}
{"word":"waterfall","english":"The waterfall’s roar echoed through the valley.","thai":"เสียงคำรามของน้ำตกดังก้องไปทั่วหุบเขา"}
{"word":"valley","english":"The valley bloomed with wildflowers in spring.","thai":"หุบเขาเบ่งบานด้วยดอกไม้ป่าในฤดูใบไม้ผลิ"}
{"word":"wildflowers","english":"Wildflowers added color to the hiking path.","thai":"ดอกไม้ป่านำสีสันมาสู่เส้นทางเดินป่า"}
{"word":"path","english":"The narrow path wound through ancient ruins.","thai":"เส้นทางแคบคดเคี้ยวผ่านซากปรักหักพังโบราณ"}
{"word":"ruins","english":"Exploring the ruins felt like stepping into history.","thai":"การสำรวจซากปรักหักพังเหมือนก้าวเข้าสู่ประวัติศาสตร์"}
{"word":"history","english":"History lessons sparked his curiosity about the past.","thai":"บทเรียนประวัติศาสตร์จุดประกายความอยากรู้เกี่ยวกับอดีต"}
{"word":"curiosity","english":"Her curiosity led to unexpected discoveries.","thai":"ความอยากรู้ของเธอนำไปสู่การค้นพบที่ไม่คาดคิด"}
{"word":"discoveries","english":"Scientific discoveries reshaped our understanding of space.","thai":"การค้นพบทางวิทยาศาสตร์เปลี่ยนความเข้าใจของเราเกี่ยวกับอวกาศ"}
{"word":"space","english":"The vast space of the desert felt endless.","thai":"พื้นที่อันกว้างใหญ่ของทะเลทรายเหมือนไม่มีที่สิ้นสุด"}
{"word":"desert","english":"The desert bloomed after rare rainfall.","thai":"ทะเลทรายเบ่งบานหลังฝนตกที่หายาก"}
{"word":"rainfall","english":"Heavy rainfall delayed the outdoor wedding.","thai":"ฝนตกหนักทำให้งานแต่งงานกลางแจ้งล่าช้า"}
{"word":"wedding","english":"The wedding cake was a sugary masterpiece.","thai":"เค้กแต่งงานเป็นผลงานชิ้นเอกหวานฉ่ำ"}
{"word":"cake","english":"Baking a cake filled the house with sweetness.","thai":"การอบเค้กทำให้บ้านเต็มไปด้วยกลิ่นหอมหวาน"}
{"word":"house","english":"The old house creaked with every step.","thai":"บ้านเก่าเอี๊ยดทุกครั้งที่ก้าวเดิน"}
{"word":"step","english":"Each step up the mountain tested their endurance.","thai":"ทุกย่างก้าวขึ้นเขาทดสอบความอดทนของพวกเขา"}
{"word":"endurance","english":"Her endurance in the marathon amazed spectators.","thai":"ความอดทนของเธอในมาราธอนทำให้ผู้ชมทึ่ง"}
{"word":"marathon","english":"Training for the marathon took months of dedication.","thai":"การฝึกซ้อมสำหรับมาราธอนใช้เวลาหลายเดือนแห่งความทุ่มเท"}
{"word":"dedication","english":"His dedication to art produced stunning works.","thai":"ความทุ่มเทในศิลปะของเขาสร้างผลงานที่น่าทึ่ง"}
{"word":"art","english":"Street art transformed the city’s dull walls.","thai":"ศิลปะข้างถนนเปลี่ยนกำแพงเมืองที่ทึบให้มีชีวิต"}
{"word":"city","english":"The city skyline glowed under the moonlight.","thai":"เส้นขอบฟ้าของเมืองส่องสว่างภายใต้แสงจันทร์"}
{"word":"moonlight","english":"Moonlight danced on the calm lake’s surface.","thai":"แสงจันทร์เต้นระยิบระยับบนผิวน้ำทะเลสาบที่สงบ"}
{"word":"lake","english":"The lake reflected the vibrant autumn trees.","thai":"ทะเลสาบสะท้อนต้นไม้ฤดูใบไม้ร่วงที่สดใส"}
{"word":"trees","english":"Tall trees shaded the quiet picnic spot.","thai":"ต้นไม้สูงให้ร่มเงาแก่จุดปิกนิกที่เงียบสงบ"}
{"word":"picnic","english":"The picnic was packed with homemade treats.","thai":"ปิกนิกเต็มไปด้วยของว่างทำเอง"}
{"word":"treats","english":"Halloween treats delighted the neighborhood kids.","thai":"ของว่างวันฮาโลวีนทำให้เด็กๆ ในละแวกนั้นดีใจ"}
{"word":"kids","english":"Kids raced to collect the most candy.","thai":"เด็กๆ แข่งกันเก็บลูกอมให้ได้มากที่สุด"}
{"word":"candy","english":"The candy store offered a rainbow of flavors.","thai":"ร้านลูกอมมีรสชาติหลากหลายเหมือนรุ้งกินน้ำ"}
{"word":"store","english":"The vintage store sold rare vinyl records.","thai":"ร้านวินเทจขายแผ่นเสียงหายาก"}
{"word":"records","english":"Her collection of records impressed music buffs.","thai":"คอลเลกชันแผ่นเสียงของเธอทำให้คอเพลงประทับใจ"}
{"word":"music","english":"Live music echoed through the bustling festival.","thai":"ดนตรีสดดังก้องในงานเทศกาลที่คึกคัก"}
{"word":"festival","english":"The harvest festival celebrated local traditions.","thai":"เทศกาลเก็บเกี่ยวเฉลิมฉลองประเพณีท้องถิ่น"}
{"word":"traditions","english":"Family traditions shaped her holiday memories.","thai":"ประเพณีครอบครัวหล่อหลอมความทรงจำวันหยุดของเธอ"}
{"word":"memories","english":"Old memories flooded back at the reunion.","thai":"ความทรงจำเก่าๆ ท่วมท้นกลับมาในงานรวมตัว"}
{"word":"reunion","english":"The class reunion sparked nostalgic conversations.","thai":"งานรวมรุ่นจุดประกายการสนทนาที่เต็มไปด้วยความหลัง"}
{"word":"conversations","english":"Late-night conversations deepened their friendship.","thai":"การสนทนาดึกดื่นทำให้มิตรภาพของพวกเขาแน่นแฟ้นยิ่งขึ้น"}
{"word":"friendship","english":"Their friendship grew stronger through shared adventures.","thai":"มิตรภาพของพวกเขาแข็งแกร่งขึ้นผ่านการผจญภัยร่วมกัน"}
{"word":"adventures","english":"Outdoor adventures filled their summer with excitement.","thai":"การผจญภัยกลางแจ้งทำให้ฤดูร้อนของพวกเขาเต็มไปด้วยความตื่นเต้น"}
{"word":"summer","english":"Summer camp taught kids teamwork and resilience.","thai":"ค่ายฤดูร้อนสอนเด็กๆ เรื่องการทำงานเป็นทีมและความยืดหยุ่น"}
{"word":"teamwork","english":"Teamwork turned their project into a masterpiece.","thai":"การทำงานเป็นทีมเปลี่ยนโปรเจกต์ของพวกเขาให้เป็นผลงานชิ้นเอก"}
{"word":"project","english":"The science project amazed the school fair.","thai":"โครงงานวิทยาศาสตร์ทำให้งานนิทรรศการโรงเรียนน่าทึ่ง"}
{"word":"school","english":"School debates honed her public speaking skills.","thai":"การโต้วาทีในโรงเรียนฝึกฝนทักษะการพูดในที่สาธารณะของเธอ"}
{"word":"skills","english":"Her coding skills landed her a tech internship.","thai":"ทักษะการเขียนโค้ดทำให้เธอได้ฝึกงานด้านเทคโนโลยี"}
{"word":"internship","english":"The internship offered hands-on industry experience.","thai":"การฝึกงานมอบประสบการณ์ปฏิบัติจริงในอุตสาหกรรม"}
{"word":"experience","english":"Traveling abroad was a life-changing experience.","thai":"การเดินทางไปต่างประเทศเป็นประสบการณ์ที่เปลี่ยนชีวิต"}
{"word":"traveling","english":"Traveling by train revealed stunning countryside views.","thai":"การเดินทางโดยรถไฟเผยให้เห็นวิวชนบทที่สวยงาม"}
{"word":"views","english":"The rooftop views took their breath away.","thai":"วิวจากดาดฟ้าทำให้พวกเขาตะลึง"}
{"word":"rooftop","english":"The rooftop party buzzed with vibrant energy.","thai":"งานปาร์ตี้บนดาดฟ้าเต็มไปด้วยพลังอันคึกคัก"}
{"word":"energy","english":"Her boundless energy inspired the whole team.","thai":"พลังที่ไร้ขีดจำกัดของเธอสร้างแรงบันดาลใจให้ทั้งทีม"}
{"word":"team","english":"The soccer team celebrated their hard-fought victory.","thai":"ทีมฟุตบอลเฉลิมฉลองชัยชนะที่ได้มาด้วยความยากลำบาก"}
{"word":"victory","english":"The sweet taste of victory fueled their ambition.","thai":"รสชาติอันหอมหวานของชัยชนะกระตุ้นความทะเยอทะยานของพวกเขา"}
{"word":"ambition","english":"Her ambition drove her to start a business.","thai":"ความทะเยอทะยานผลักดันให้เธอเริ่มต้นธุรกิจ"}
{"word":"business","english":"The small business thrived despite tough competition.","thai":"ธุรกิจขนาดเล็กเจริญรุ่งเรืองแม้มีการแข่งขันที่ดุเดือด"}
{"word":"competition","english":"The dance competition showcased incredible talent.","thai":"การแข่งขันเต้นรำแสดงให้เห็นถึงพรสวรรค์ที่น่าทึ่ง"}
{"word":"talent","english":"Her talent for storytelling captivated the audience.","thai":"พรสวรรค์ในการเล่าเรื่องของเธอดึงดูดผู้ฟัง"}
{"word":"audience","english":"The audience roared with applause after the show.","thai":"ผู้ชมส่งเสียงปรบมือดังลั่นหลังการแสดง"}
{"word":"show","english":"The magic show left kids wide-eyed with wonder.","thai":"การแสดงมายากลทำให้เด็กๆ ตื่นตาตื่นใจ"}
{"word":"wonder","english":"A sense of wonder filled her at the museum.","thai":"ความรู้สึกประหลาดใจเต็มเปี่ยมในตัวเธอที่พิพิธภัณฑ์"}
{"word":"museum","english":"The museum’s artifacts told stories of ancient times.","thai":"โบราณวัตถุของพิพิธภัณฑ์เล่าเรื่องราวของยุคโบราณ"}
{"word":"stories","english":"Bedtime stories sparked her imagination every night.","thai":"นิทานก่อนนอนจุดประกายจินตนาการของเธอทุกคืน"}
{"word":"imagination","english":"His vivid imagination created fantastical worlds.","thai":"จินตนาการอันสดใสของเขาสร้างโลกแห่งแฟนตาซี"}
{"word":"worlds","english":"Exploring new worlds through books was her passion.","thai":"การสำรวจโลกใหม่ผ่านหนังสือคือความหลงใหลของเธอ"}
{"word":"passion","english":"Her passion for baking produced delicious cakes.","thai":"ความหลงใหลในการอบขนมของเธอสร้างเค้กแสนอร่อย"}
{"word":"cakes","english":"The bakery’s cakes were the talk of the town.","thai":"เค้กของร้านเบเกอรี่กลายเป็นที่พูดถึงทั่วเมือง"}
{"word":"town","english":"The quiet town welcomed tourists with open arms.","thai":"เมืองเล็กๆ ที่เงียบสงบต้อนรับนักท่องเที่ยวด้วยความอบอุ่น"}
{"word":"tourists","english":"Tourists flocked to the ancient temple ruins.","thai":"นักท่องเที่ยวแห่กันไปที่ซากปรักหักพังของวัดโบราณ"}
{"word":"temple","english":"The temple’s serene atmosphere calmed her mind.","thai":"บรรยากาศอันเงียบสงบของวัดทำให้จิตใจของเธอสงบ"}
{"word":"mind","english":"A clear mind helped him solve the puzzle.","thai":"จิตใจที่ปลอดโปร่งช่วยให้เขาแก้ปริศนาได้"}
{"word":"puzzle","english":"The crossword puzzle stumped even the sharpest minds.","thai":"ปริศนาอักษรไขว้ทำให้แม้แต่คนที่เฉียบแหลมที่สุดยังงง"}
{"word":"minds","english":"Great minds collaborated on the innovative project.","thai":"มันสมองชั้นยอดร่วมมือกันในโปรเจกต์นวัตกรรม"}
{"word":"project","english":"The art project transformed the community center.","thai":"โปรเจกต์ศิลปะเปลี่ยนศูนย์ชุมชนให้ดีขึ้น"}
{"word":"community","english":"The community rallied to support the local charity.","thai":"ชุมชนรวมตัวกันเพื่อสนับสนุนการกุศลท้องถิ่น"}
{"word":"charity","english":"Her charity event raised funds for homeless shelters.","thai":"งานการกุศลของเธอระดมทุนให้ศูนย์พักพิงคนไร้บ้าน"}
{"word":"funds","english":"The funds secured new equipment for the school.","thai":"เงินทุนที่ได้มาซื้ออุปกรณ์ใหม่ให้โรงเรียน"}
{"word":"equipment","english":"Camping equipment made their trip more comfortable.","thai":"อุปกรณ์แคมป์ปิ้งทำให้การเดินทางของพวกเขาสะดวกสบายยิ่งขึ้น"}
{"word":"trip","english":"The road trip across the coast was unforgettable.","thai":"การเดินทางข้ามชายฝั่งเป็นที่น่าจดจำ"}
{"word":"coast","english":"The rugged coast offered breathtaking hiking trails.","thai":"ชายฝั่งที่ขรุขระมีเส้นทางเดินป่าที่น่าทึ่ง"}
{"word":"trails","english":"Mountain trails challenged even seasoned hikers.","thai":"เส้นทางบนเขาท้าทายแม้แต่นักเดินป่าที่ช่ำชอง"}
{"word":"hikers","english":"Hikers paused to admire the vibrant wildflowers.","thai":"นักเดินป่าหยุดเพื่อชื่นชมดอกไม้ป่าสีสันสดใส"}
{"word":"wildflowers","english":"Wildflowers dotted the meadow in early spring.","thai":"ดอกไม้ป่าประดับทุ่งหญ้าในต้นฤดูใบไม้ผลิ"}
{"word":"spring","english":"Spring showers brought life to the dry valley.","thai":"ฝนในฤดูใบไม้ผลินำชีวิตมาสู่หุบเขาแห้งแล้ง"}
{"word":"valley","english":"The valley echoed with the sound of birds.","thai":"หุบเขาดังก้องด้วยเสียงนก"}
{"word":"birds","english":"Colorful birds perched on the ancient oak tree.","thai":"นกสีสันสดใสเกาะอยู่บนต้นโอ๊กโบราณ"}
{"word":"tree","english":"The tree’s shade offered relief from the heat.","thai":"ร่มเงาของต้นไม้ช่วยคลายร้อน"}
{"word":"heat","english":"The summer heat called for ice-cold lemonade.","thai":"ความร้อนในฤดูร้อนชวนให้ดื่มน้ำมะนาวเย็นฉ่ำ"}
{"word":"lemonade","english":"Homemade lemonade refreshed the picnic guests.","thai":"น้ำมะนาวทำเองทำให้แขกในงานปิกนิกสดชื่น"}
{"word":"picnic","english":"The picnic by the lake was pure bliss.","thai":"ปิกนิกข้างทะเลสาบคือความสุขล้วนๆ"}
{"word":"lake","english":"The calm lake mirrored the starry night sky.","thai":"ทะเลสาบที่สงบสะท้อนท้องฟ้ายามค่ำคืนที่เต็มไปด้วยดวงดาว"}
{"word":"sky","english":"The clear sky promised perfect weather for hiking.","thai":"ท้องฟ้าแจ่มใสสัญญาถึงสภาพอากาศที่สมบูรณ์แบบสำหรับการเดินป่า"}
{"word":"weather","english":"Stormy weather canceled the outdoor concert.","thai":"สภาพอากาศที่มีพายุยกเลิกคอนเสิร์ตกลางแจ้ง"}
{"word":"concert","english":"The rock concert kept the crowd buzzing.","thai":"คอนเสิร์ตร็อกทำให้ฝูงชนคึกคัก"}
{"word":"crowd","english":"The crowd gathered for the annual parade.","thai":"ฝูงชนรวมตัวกันเพื่อขบวนพาเหรดประจำปี"}
{"word":"parade","english":"The parade featured colorful floats and bands.","thai":"ขบวนพาเหรดมีรถประดับสีสันและวงดนตรี"}
{"word":"bands","english":"Local bands played lively tunes at the fair.","thai":"วงดนตรีท้องถิ่นเล่นเพลงสนุกๆ ในงานเทศกาล"}
{"word":"fair","english":"The county fair offered thrilling rides and games.","thai":"งานเทศกาลประจำเมืองมีเครื่องเล่นและเกมที่น่าตื่นเต้น"}
{"word":"games","english":"Board games brought the family together on weekends.","thai":"เกมกระดานทำให้ครอบครัวใกล้ชิดกันในวันหยุดสุดสัปดาห์"}
{"word":"family","english":"Family dinners were filled with laughter and stories.","thai":"มื้อค่ำของครอบครัวเต็มไปด้วยเสียงหัวเราะและเรื่องเล่า"}
{"word":"laughter","english":"Her infectious laughter lit up the dull room.","thai":"เสียงหัวเราะที่ติดต่อของเธอทำให้ห้องที่ทึบสว่างไสว"}
{"word":"room","english":"The cozy room was perfect for reading novels.","thai":"ห้องแสนอบอุ่นเหมาะสำหรับการอ่านนิยาย"}
{"word":"novels","english":"Mystery novels kept her hooked until dawn.","thai":"นิยายลึกลับทำให้เธอติดหนึบจนถึงรุ่งสาง"}
{"word":"dawn","english":"The dawn hike revealed a stunning sunrise.","thai":"การเดินป่ายามรุ่งสางเผยให้เห็นพระอาทิตย์ขึ้นที่สวยงาม"}
{"word":"sunrise","english":"The sunrise painted the horizon with soft pinks.","thai":"พระอาทิตย์ขึ้นแต่งแต้มขอบฟ้าด้วยสีชมพูอ่อน"}
{"word":"horizon","english":"The endless horizon inspired dreams of adventure.","thai":"ขอบฟ้าที่ไม่มีที่สิ้นสุดจุดประกายฝันถึงการผจญภัย"}
{"word":"adventure","english":"The jungle adventure tested their survival skills.","thai":"การผจญภัยในป่าทดสอบทักษะการเอาชีวิตรอดของพวกเขา"}
{"word":"skills","english":"Her photography skills captured nature’s beauty.","thai":"ทักษะการถ่ายภาพของเธอจับความงามของธรรมชาติ"}
{"word":"nature","english":"Nature walks soothed her restless spirit.","thai":"การเดินในธรรมชาติช่วยปลอบประโลมจิตใจที่กระสับกระส่ายของเธอ"}
{"word":"spirit","english":"Her adventurous spirit led her to new places.","thai":"จิตวิญญาณที่รักการผจญภัยนำเธอไปสู่สถานที่ใหม่ๆ"}
{"word":"places","english":"Hidden places in the city held secret charm.","thai":"สถานที่ซ่อนอยู่ในเมืองมีเสน่ห์ลับ"}
{"word":"charm","english":"The old bookstore’s charm drew curious readers.","thai":"เสน่ห์ของร้านหนังสือเก่าดึงดูดนักอ่านที่อยากรู้อยากเห็น"}
{"word":"readers","english":"Readers gathered for the author’s book signing.","thai":"นักอ่านรวมตัวกันเพื่องานลงนามหนังสือของผู้เขียน"}
{"word":"book","english":"The book club discussed their latest read.","thai":"ชมรมหนังสือหารือเกี่ยวกับหนังสือเล่มล่าสุดที่อ่าน"}
{"word":"club","english":"The jazz club buzzed with soulful melodies.","thai":"คลับแจ๊สคึกคักด้วยทำนองที่เต็มไปด้วยจิตวิญญาณ"}
{"word":"melodies","english":"Soft melodies drifted from the open window.","thai":"ทำนองนุ่มนวลลอยมาจากหน้าต่างที่เปิดอยู่"}
{"word":"window","english":"The window offered a view of bustling streets.","thai":"หน้าต่างเผยให้เห็นถนนที่คึกคัก"}
{"word":"streets","english":"The streets came alive during the night market.","thai":"ถนนมีชีวิตชีวาในช่วงตลาดกลางคืน"}
{"word":"market","english":"The farmer’s market sold fresh organic produce.","thai":"ตลาดเกษตรกรขายผลิตผลออร์แกนิกสดใหม่"}
{"word":"produce","english":"Fresh produce inspired her to cook daily.","thai":"ผลิตผลสดใหม่สร้างแรงบันดาลใจให้เธอทำอาหารทุกวัน"}
{"word":"cook","english":"Learning to cook Thai curry was a delight.","thai":"การเรียนทำแกงกะทิไทยเป็นความสุข"}
{"word":"curry","english":"The spicy curry warmed their chilly evening.","thai":"แกงรสเผ็ดทำให้เย็นที่หนาวเย็นอบอุ่นขึ้น"}
{"word":"evening","english":"The evening breeze carried scents of blooming flowers.","thai":"สายลมยามเย็นพัดพากลิ่นหอมของดอกไม้ที่กำลังบาน"}
{"word":"flowers","english":"Bright flowers decorated the wedding venue.","thai":"ดอกไม้สีสันสดใสประดับสถานที่จัดงานแต่งงาน"}
{"word":"wedding","english":"The wedding vows brought tears to everyone’s eyes.","thai":"คำสาบานในงานแต่งงานทำให้น้ำตาคลอในตาทุกคน"}
{"word":"tears","english":"Tears of joy marked their long-awaited reunion.","thai":"น้ำตาแห่งความสุขบ่งบอกถึงการรวมตัวที่รอคอยมานาน"}
{"word":"reunion","english":"The family reunion sparked heartfelt memories.","thai":"การรวมตัวของครอบครัวจุดประกายความทรงจำอันอบอุ่น"}
{"word":"memories","english":"Childhood memories flooded back during the visit.","thai":"ความทรงจำวัยเด็กท่วมท้นกลับมาระหว่างการเยี่ยมเยือน"}
{"word":"childhood","english":"Childhood games filled their afternoons with joy.","thai":"เกมในวัยเด็กทำให้บ่ายของพวกเขาเต็มไปด้วยความสุข"}
{"word":"games","english":"Board games brought friends together for laughs.","thai":"เกมกระดานทำให้เพื่อนๆ รวมตัวกันเพื่อหัวเราะ"}
{"word":"friends","english":"Close friends shared secrets over coffee.","thai":"เพื่อนสนิทแบ่งปันความลับขณะดื่มกาแฟ"}
{"word":"coffee","english":"Morning coffee fueled her busy workday.","thai":"กาแฟยามเช้าเติมพลังให้วันทำงานที่วุ่นวายของเธอ"}
{"word":"workday","english":"A hectic workday called for a relaxing evening.","thai":"วันทำงานที่วุ่นวายชวนให้มีค่ำคืนที่ผ่อนคลาย"}
{"word":"evening","english":"The evening concert drew a lively crowd.","thai":"คอนเสิร์ตยามเย็นดึงดูดฝูงชนที่คึกคัก"}
{"word":"crowd","english":"The crowd cheered wildly at the soccer match.","thai":"ฝูงชนส่งเสียงเชียร์อย่างเมามันในเกมฟุตบอล"}
{"word":"match","english":"The chess match tested their strategic minds.","thai":"การแข่งขันหมากรุกทดสอบจิตใจที่ชาญฉลาดของพวกเขา"}
{"word":"minds","english":"Creative minds sparked innovation at the workshop.","thai":"จิตใจที่สร้างสรรค์จุดประกายนวัตกรรมในเวิร์กช็อป"}
{"word":"innovation","english":"Her innovation revolutionized the tech industry.","thai":"นวัตกรรมของเธอปฏิวัติวงการเทคโนโลยี"}
{"word":"industry","english":"The fashion industry embraced bold new trends.","thai":"อุตสาหกรรมแฟชั่นยอมรับเทรนด์ใหม่ที่กล้าหาญ"}
{"word":"trends","english":"Social media trends shaped their marketing plan.","thai":"เทรนด์โซเชียลมีเดียกำหนดแผนการตลาดของพวกเขา"}
{"word":"plan","english":"Their vacation plan included a mountain hike.","thai":"แผนวันหยุดของพวกเขารวมถึงการเดินป่าบนเขา"}
{"word":"hike","english":"The sunrise hike offered breathtaking views.","thai":"การเดินป่ายามรุ่งสางมอบวิวที่สวยงามตระการตา"}
{"word":"views","english":"Ocean views calmed her restless spirit.","thai":"วิวทะเลทำให้จิตใจที่กระสับกระส่ายของเธอสงบลง"}
{"word":"spirit","english":"Her adventurous spirit led to epic travels.","thai":"จิตวิญญาณที่รักการผจญภัยนำเธอไปสู่การเดินทางสุดยิ่งใหญ่"}
{"word":"travels","english":"Her travels inspired a bestselling travel blog.","thai":"การเดินทางของเธอสร้างแรงบันดาลใจให้บล็อกท่องเที่ยวขายดี"}
{"word":"blog","english":"The food blog raved about local street eats.","thai":"บล็อกอาหารยกย่องอาหารริมทางท้องถิ่น"}
{"word":"food","english":"Spicy food challenged his taste buds daily.","thai":"อาหารรสเผ็ดท้าทายต่อมรับรสของเขาทุกวัน"}
{"word":"taste","english":"Her refined taste elevated the party’s decor.","thai":"รสนิยมที่ประณีตของเธอยกระดับการตกแต่งงานปาร์ตี้"}
{"word":"party","english":"The costume party was a howling success.","thai":"งานปาร์ตี้ชุดแฟนซีประสบความสำเร็จอย่างยิ่งใหญ่"}
{"word":"success","english":"Her success in coding landed a dream job.","thai":"ความสำเร็จในการเขียนโค้ดทำให้เธอได้งานในฝัน"}
{"word":"job","english":"The new job demanded long hours but paid well.","thai":"งานใหม่ต้องการเวลาทำงานนานแต่ได้ค่าตอบแทนดี"}
{"word":"hours","english":"Hours spent painting produced a stunning canvas.","thai":"ชั่วโมงที่ใช้ในการวาดภาพสร้างผลงานผ้าใบที่น่าทึ่ง"}
{"word":"canvas","english":"The blank canvas awaited her creative brushstrokes.","thai":"ผ้าใบเปล่ารอจังหวะแปรงที่สร้างสรรค์ของเธอ"}
{"word":"creative","english":"Her creative writing won a literary award.","thai":"งานเขียนเชิงสร้างสรรค์ของเธอคว้ารางวัลวรรณกรรม"}
{"word":"award","english":"The award ceremony honored local heroes.","thai":"พิธีมอบรางวัลให้เกียรติแก่ฮีโร่ท้องถิ่น"}
{"word":"heroes","english":"Firefighters are the unsung heroes of our city.","thai":"นักผจญเพลิงคือวีรบุรุษที่ไม่ได้รับการยกย่องของเมืองเรา"}
{"word":"city","english":"The city skyline sparkled under the moonlight.","thai":"เส้นขอบฟ้าของเมืองส่องประกายใต้แสงจันทร์"}
{"word":"moonlight","english":"Moonlight walks by the lake were romantic.","thai":"การเดินเล่นใต้แสงจันทร์ข้างทะเลสาบแสนโรแมนติก"}
{"word":"lake","english":"The lake reflected the vibrant autumn colors.","thai":"ทะเลสาบสะท้อนสีสันฤดูใบไม้ร่วงที่สดใส"}
{"word":"colors","english":"Bright colors adorned the festival’s main stage.","thai":"สีสันสดใสประดับเวทีหลักของงานเทศกาล"}
{"word":"stage","english":"Her solo on stage left the audience speechless.","thai":"การแสดงเดี่ยวบนเวทีของเธอทำให้ผู้ชมตะลึง"}
{"word":"audience","english":"The audience clapped wildly for the comedian.","thai":"ผู้ชมปรบมืออย่างเมามันให้กับนักแสดงตลก"}
{"word":"comedian","english":"The comedian’s jokes hit every punchline perfectly.","thai":"มุกตลกของนักแสดงตลกโดนใจทุกประโยค"}
{"word":"jokes","english":"His silly jokes lightened the tense meeting.","thai":"มุกตลกโง่ๆ ของเขาทำให้การประชุมที่ตึงเครียดผ่อนคลายลง"}
{"word":"meeting","english":"The team meeting sparked fresh project ideas.","thai":"การประชุมทีมจุดประกายไอเดียโปรเจกต์ใหม่ๆ"}
{"word":"ideas","english":"Her bold ideas reshaped the company’s strategy.","thai":"แนวคิดที่กล้าหาญของเธอเปลี่ยนกลยุทธ์ของบริษัท"}
{"word":"strategy","english":"A clever strategy won them the debate.","thai":"กลยุทธ์ที่ชาญฉลาดทำให้พวกเขาชนะการโต้วาที"}
{"word":"debate","english":"The heated debate captivated the entire room.","thai":"การโต้วาทีที่ดุเดือดดึงดูดทุกคนในห้อง"}
{"word":"room","english":"The cozy room was perfect for book club.","thai":"ห้องแสนอบอุ่นเหมาะสำหรับชมรมหนังสือ"}
{"word":"book","english":"The mystery book kept her up all night.","thai":"หนังสือลึกลับทำให้นอนดึกทั้งคืน"}
{"word":"night","english":"The starry night inspired poetic thoughts.","thai":"คืนที่เต็มไปด้วยดวงดาวสร้างแรงบันดาลใจให้ความคิดกวี"}
{"word":"thoughts","english":"Her deep thoughts fueled philosophical discussions.","thai":"ความคิดลึกซึ้งของเธอขับเคลื่อนการสนทนาเชิงปรัชญา"}
{"word":"discussions","english":"Late-night discussions bonded the study group.","thai":"การสนทนาดึกดื่นทำให้กลุ่มเรียนรู้สนิทกัน"}
{"word":"group","english":"The hiking group tackled the steep trail.","thai":"กลุ่มเดินป่าต่อสู้กับเส้นทางชัน"}
{"word":"trail","english":"The forest trail led to a hidden waterfall.","thai":"เส้นทางในป่านำไปสู่น้ำตกที่ซ่อนอยู่"}
{"word":"waterfall","english":"The waterfall’s mist cooled the hot afternoon.","thai":"ละอองน้ำตกทำให้บ่ายที่ร้อนเย็นลง"}
{"word":"afternoon","english":"A lazy afternoon called for iced tea.","thai":"บ่ายที่ขี้เกียจชวนให้ดื่มชาเย็น"}
{"word":"tea","english":"Herbal tea soothed her after a long day.","thai":"ชาสมุนไพรปลอบประโลมเธอหลังจากวันอันยาวนาน"}
{"word":"day","english":"The rainy day kept them indoors with movies.","thai":"วันที่ฝนตกทำให้พวกเขาอยู่ในบ้านดูหนัง"}
{"word":"movies","english":"Classic movies played at the outdoor cinema.","thai":"หนังคลาสสิกฉายที่โรงภาพยนตร์กลางแจ้ง"}
{"word":"cinema","english":"The cinema was packed for the blockbuster premiere.","thai":"โรงภาพยนตร์แน่นขนัดสำหรับรอบปฐมทัศน์ภาพยนตร์ดัง"}
{"word":"premiere","english":"The premiere event glittered with celebrity glamour.","thai":"งานรอบปฐมทัศน์ส่องประกายด้วยความเย้ายวนของคนดัง"}
{"word":"celebrity","english":"A celebrity sighting caused a frenzy downtown.","thai":"การพบเห็นคนดังทำให้เกิดความโกลาหลในเมือง"}
{"word":"downtown","english":"Downtown cafes buzzed with weekend crowds.","thai":"ร้านกาแฟในเมืองคึกคักไปด้วยฝูงชนช่วงสุดสัปดาห์"}
{"word":"crowds","english":"Crowds gathered to watch the street performers.","thai":"ฝูงชนรวมตัวกันเพื่อดูนักแสดงข้างถนน"}
{"word":"performers","english":"Street performers juggled fire with ease.","thai":"นักแสดงข้างถนนเล่นกลกับไฟอย่างง่ายดาย"}
{"word":"fire","english":"The fire crackled warmly in the cozy cabin.","thai":"ไฟลุกโชนอย่างอบอุ่นในกระท่อมแสนสบาย"}
{"word":"cabin","english":"The mountain cabin offered a quiet retreat.","thai":"กระท่อมบนเขามอบสถานที่พักผ่อนอันเงียบสงบ"}
{"word":"retreat","english":"The yoga retreat restored her inner peace.","thai":"การพักผ่อนแบบโยคะฟื้นฟูความสงบภายในของเธอ"}
{"word":"peace","english":"Finding peace in nature healed her stress.","thai":"การพบความสงบในธรรมชาติเยียวยาความเครียดของเธอ"}
{"word":"nature","english":"Nature hikes revealed the forest’s hidden beauty.","thai":"การเดินป่าในธรรมชาติเผยความงามที่ซ่อนอยู่ในป่า"}
{"word":"beauty","english":"Her radiant beauty shone at the gala.","thai":"ความงามที่เปล่งปลั่งของเธอส่องสว่างในงานกาล่า"}
{"word":"gala","english":"The charity gala raised funds for education.","thai":"งานกาล่าการกุศลระดมทุนเพื่อการศึกษา"}
{"word":"education","english":"Quality education opened doors to new opportunities.","thai":"การศึกษาที่มีคุณภาพเปิดประตูสู่โอกาสใหม่"}
{"word":"opportunities","english":"New opportunities fueled his entrepreneurial spirit.","thai":"โอกาสใหม่กระตุ้นจิตวิญญาณผู้ประกอบการของเขา"}
{"word":"spirit","english":"Her free spirit danced to life’s rhythm.","thai":"จิตวิญญาณอิสระของเธอเต้นรำไปตามจังหวะชีวิต"}
{"word":"rhythm","english":"The song’s rhythm got everyone dancing.","thai":"จังหวะของเพลงทำให้ทุกคนเต้นรำ"}
{"word":"dancing","english":"Dancing under the stars felt like magic.","thai":"การเต้นรำใต้ดวงดาวรู้สึกเหมือนเวทมนตร์"}
{"word":"stars","english":"The stars twinkled above the quiet campsite.","thai":"ดวงดาวระยิบระยับเหนือแคมป์ที่เงียบสงบ"}
{"word":"campsite","english":"The campsite buzzed with campfire stories.","thai":"แคมป์เต็มไปด้วยเรื่องเล่าข้างกองไฟ"}
{"word":"stories","english":"Ghost stories spooked the kids at midnight.","thai":"เรื่องผีทำให้เด็กๆ ขนลุกตอนเที่ยงคืน"}
{"word":"midnight","english":"Midnight runs cleared his cluttered mind.","thai":"การวิ่งตอนเที่ยงคืนช่วยให้จิตใจที่วุ่นวายของเขาปลอดโปร่ง"}
{"word":"mind","english":"A focused mind aced the tough exam.","thai":"จิตใจที่จดจ่อทำให้สอบผ่านข้อสอบยาก"}
{"word":"exam","english":"The final exam tested months of preparation.","thai":"ข้อสอบสุดท้ายทดสอบการเตรียมตัวหลายเดือน"}
{"word":"preparation","english":"Careful preparation ensured a flawless presentation.","thai":"การเตรียมตัวอย่างรอบคอบทำให้การนำเสนอไร้ที่ติ"}
{"word":"presentation","english":"Her presentation wowed the corporate board.","thai":"การนำเสนอของเธอทำให้คณะกรรมการบริษัทตื่นเต้น"}
{"word":"board","english":"The board game night sparked friendly rivalries.","thai":"ค่ำคืนเล่นเกมกระดานจุดประกายการแข่งขันที่เป็นมิตร"}
{"word":"night","english":"A quiet night at home felt refreshing.","thai":"คืนที่เงียบสงบที่บ้านรู้สึกสดชื่น"}
{"word":"home","english":"Home cooking filled the kitchen with warmth.","thai":"การทำอาหารที่บ้านทำให้ครัวเต็มไปด้วยความอบอุ่น"}
{"word":"kitchen","english":"The kitchen smelled of freshly baked bread.","thai":"ครัวหอมกลิ่นขนมปังอบใหม่"}
{"word":"bread","english":"Warm bread paired perfectly with homemade soup.","thai":"ขนมปังอุ่นเข้ากันอย่างลงตัวกับซุปทำเอง"}
{"word":"soup","english":"Spicy soup warmed their chilly winter evening.","thai":"ซุปรสเผ็ดทำให้ค่ำคืนฤดูหนาวที่หนาวเย็นอบอุ่นขึ้น"}
{"word":"winter","english":"Winter snow blanketed the sleepy village.","thai":"หิมะฤดูหนาวปกคลุมหมู่บ้านที่เงียบสงบ"}
{"word":"village","english":"The village market bustled with local vendors.","thai":"ตลาดหมู่บ้านคึกคักไปด้วยพ่อค้าแม่ค้าท้องถิ่น"}
{"word":"vendors","english":"Street vendors sold colorful handmade crafts.","thai":"พ่อค้าแม่ค้าข้างถนนขายงานฝีมือสีสันสดใส"}
{"word":"crafts","english":"Her crafts adorned the holiday gift table.","thai":"งานฝีมือของเธอประดับโต๊ะของขวัญวันหยุด"}
{"word":"holiday","english":"The holiday season sparked joy in everyone.","thai":"ช่วงวันหยุดจุดประกายความสุขในทุกคน"}
{"word":"joy","english":"Pure joy lit up her face at the surprise.","thai":"ความสุขล้วนๆ ทำให้หน้าเธอสว่างไสวเมื่อเจอเซอร์ไพรส์"}
{"word":"surprise","english":"The surprise party left him utterly speechless.","thai":"งานปาร์ตี้เซอร์ไพรส์ทำให้เขาพูดไม่ออก"}
{"word":"party","english":"The beach party rocked until dawn.","thai":"ปาร์ตี้ชายหาดสนุกสุดเหวี่ยงจนถึงรุ่งสาง"}
{"word":"dawn","english":"Dawn jogs energized her for the day.","thai":"การวิ่งยามรุ่งสางทำให้เธอมีพลังสำหรับวันใหม่"}
{"word":"day","english":"A sunny day invited outdoor adventures.","thai":"วันที่แดดจ้าชวนให้ออกไปผจญภัยกลางแจ้ง"}
{"word":"adventures","english":"Camping adventures bonded the group tightly.","thai":"การผจญภัยแคมป์ปิ้งทำให้กลุ่มสนิทกันมากขึ้น"}
{"word":"group","english":"The study group aced their final project.","thai":"กลุ่มเรียนรู้ทำโปรเจกต์สุดท้ายได้ยอดเยี่ยม"}
{"word":"project","english":"The art project showcased her unique vision.","thai":"โปรเจกต์ศิลปะแสดงให้เห็นวิสัยทัศน์ที่ไม่เหมือนใครของเธอ"}
{"word":"vision","english":"Her clear vision guided the team’s success.","thai":"วิสัยทัศน์ที่ชัดเจนของเธอนำทีมสู่ความสำเร็จ"}
{"word":"success","english":"Hard-earned success tasted sweeter than expected.","thai":"ความสำเร็จที่ได้มาด้วยความยากลำบากหวานกว่าที่คาด"}
