{"word":"steady","english":"A steady hand picks up the fragile vase.","thai":"มือที่มั่นคงหยิบแจกันที่เปราะบาง"}
{"word":"pick","english":"Pick up your clothes before you head out.","thai":"เก็บเสื้อผ้าของคุณก่อนออกไป"}
{"word":"head","english":"Head out early to beat the traffic.","thai":"ออกไปแต่เช้าเพื่อหลีกเลี่ยงการจราจร"}
{"word":"beat","english":"We beat the odds and turned out fine.","thai":"เราชนะอุปสรรคและกลายเป็นว่าดี"}
{"word":"turn","english":"Turn up the music to set the mood.","thai":"เปิดเพลงดังขึ้นเพื่อสร้างบรรยากาศ"}
{"word":"set","english":"Set aside some time to chill out.","thai":"จัดสรรเวลาเพื่อพักผ่อน"}
{"word":"chill","english":"Chill out with friends at the beach.","thai":"ผ่อนคลายกับเพื่อนที่ชายหาด"}
{"word":"friend","english":"A good friend always shows up on time.","thai":"เพื่อนที่ดีมักจะมาตรงเวลา"}
{"word":"show","english":"Show off your skills at the talent night.","thai":"อวดทักษะของคุณในคืนแสดงความสามารถ"}
{"word":"skill","english":"Honing a skill takes dedication to pull off.","thai":"การฝึกฝนทักษะต้องใช้ความทุ่มเทเพื่อให้สำเร็จ"}
{"word":"pull","english":"Pull over if you feel too tired.","thai":"จอดรถข้างทางถ้าคุณรู้สึกเหนื่อยเกินไป"}
{"word":"feel","english":"Feel free to speak up in class.","thai":"รู้สึกอิสระที่จะพูดในชั้นเรียน"}
{"word":"speak","english":"Speak out when you see something wrong.","thai":"พูดออกมาเมื่อคุณเห็นอะไรผิดปกติ"}
{"word":"see","english":"See through the lies to find the truth.","thai":"มองผ่านคำโกหกเพื่อหาความจริง"}
{"word":"find","english":"Find out the details before you sign up.","thai":"หาข้อมูลก่อนที่คุณจะสมัคร"}
{"word":"sign","english":"Sign off on the project to wrap it up.","thai":"อนุมัติโครงการเพื่อสรุป"}
{"word":"wrap","english":"Wrap up your work before the deadline.","thai":"สรุปงานของคุณก่อนกำหนด"}
{"word":"work","english":"Work hard to stand out in your career.","thai":"ทำงานหนักเพื่อโดดเด่นในอาชีพ"}
{"word":"stand","english":"Stand up for what you believe in.","thai":"ยืนหยัดเพื่อสิ่งที่คุณเชื่อ"}
{"word":"believe","english":"Believe in yourself to get through challenges.","thai":"เชื่อมั่นในตัวเองเพื่อผ่านความท้าทาย"}
{"word":"get","english":"Get over your fears to try something new.","thai":"เอาชนะความกลัวเพื่อลองสิ่งใหม่"}
{"word":"try","english":"Try out the new recipe for dinner tonight.","thai":"ลองสูตรอาหารใหม่สำหรับมื้อเย็นคืนนี้"}
{"word":"dinner","english":"Dinner plans fell through, so we hung out.","thai":"แผนมื้อเย็นล่ม เลยไปนั่งเล่นกัน"}
{"word":"plans","english":"New plans help you catch up with goals.","thai":"แผนใหม่ช่วยให้คุณตามทันเป้าหมาย"}
{"word":"catch","english":"Catch up on emails to stay on track.","thai":"ตามอ่านอีเมลเพื่อให้ทันงาน"}
{"word":"stay","english":"Stay sharp to keep up with the game.","thai":"รักษาความเฉียบคมเพื่อตามเกมให้ทัน"}
{"word":"keep","english":"Keep up the pace to finish on time.","thai":"รักษาความเร็วเพื่อให้เสร็จทันเวลา"}
{"word":"pace","english":"Pick up the pace to go faster.","thai":"เร่งจังหวะเพื่อไปได้เร็วขึ้น"}
{"word":"go","english":"Go all out for the big presentation.","thai":"ทุ่มสุดตัวสำหรับการนำเสนอครั้งใหญ่"}
{"word":"big","english":"Big dreams push you to step up.","thai":"ความฝันใหญ่ผลักดันให้คุณก้าวขึ้น"}
{"word":"step","english":"Step up your game to win big.","thai":"ยกระดับการเล่นเพื่อชัยชนะครั้งใหญ่"}
{"word":"win","english":"Win over the crowd with a killer speech.","thai":"ชนะใจผู้ฟังด้วยคำพูดที่ยอดเยี่ยม"}
{"word":"speech","english":"A great speech can inspire and lift up.","thai":"คำพูดที่ดีสามารถสร้างแรงบันดาลใจและยกระดับ"}
{"word":"lift","english":"Lift up your spirits with some music.","thai":"ปลุกจิตใจด้วยดนตรี"}
{"word":"spirit","english":"The team’s spirit helped us pull through.","thai":"จิตวิญญาณของทีมช่วยให้เราผ่านพ้น"}
{"word":"pull","english":"Pull together resources to kick off the project.","thai":"รวบรวมทรัพยากรเพื่อเริ่มโครงการ"}
{"word":"kick","english":"Kick back and relax after a long day.","thai":"พักผ่อนหลังจากวันที่ยาวนาน"}
{"word":"relax","english":"Relax and take in the beautiful sunset.","thai":"ผ่อนคลายและซึมซับพระอาทิตย์ตกที่สวยงาม"}
{"word":"take","english":"Take on new challenges to grow stronger.","thai":"รับมือความท้าทายใหม่เพื่อเติบโตแข็งแกร่ง"}
{"word":"grow","english":"Grow your skills to branch out professionally.","thai":"พัฒนาทักษะเพื่อขยายโอกาสในสายอาชีพ"}
{"word":"branch","english":"Branch out and explore new hobbies.","thai":"ขยายขอบเขตและสำรวจงานอดิเรกใหม่"}
{"word":"explore","english":"Explore the city to check out hidden gems.","thai":"สำรวจเมืองเพื่อดูสถานที่ลับๆ"}
{"word":"check","english":"Check in with your team to stay updated.","thai":"ติดต่อทีมเพื่ออัพเดทข้อมูล"}
{"word":"update","english":"Update your app to smooth out bugs.","thai":"อัพเดทแอปเพื่อแก้ไขข้อบกพร่อง"}
{"word":"smooth","english":"Smooth out the details before you roll out.","thai":"ปรับรายละเอียดให้เรียบร้อยก่อนเปิดตัว"}
{"word":"roll","english":"Roll up your sleeves and dive in.","thai":"ม้วนแขนเสื้อและลงมือทำ"}
{"word":"dive","english":"Dive into a book to wind down.","thai":"ดำดิ่งสู่หนังสือเพื่อผ่อนคลาย"}
{"word":"wind","english":"Wind up the meeting with a clear plan.","thai":"สรุปการประชุมด้วยแผนที่ชัดเจน"}
{"word":"plan","english":"Plan ahead to avoid last-minute stress.","thai":"วางแผนล่วงหน้าเพื่อหลีกเลี่ยงความเครียดนาทีสุดท้าย"}
{"word":"avoid","english":"Avoid burning out by pacing yourself.","thai":"หลีกเลี่ยงความเหนื่อยล้าโดยควบคุมจังหวะ"}
{"word":"burning","english":"Prevent burning out to maintain your energy.","thai":"ป้องกันความเหนื่อยล้าเพื่อรักษาพลังงานของคุณ"}
{"word":"energy","english":"Channel your energy to power through tasks.","thai":"ใช้พลังงานของคุณเพื่อทำงานให้สำเร็จ"}
{"word":"power","english":"Power up your laptop before the meeting.","thai":"ชาร์จแล็ปท็อปก่อนการประชุม"}
{"word":"meeting","english":"The meeting dragged on, so we zoned out.","thai":"การประชุมยืดเยื้อ เลยเสียสมาธิ"}
{"word":"zone","english":"Zone out with a movie to de-stress.","thai":"ปล่อยใจไปกับหนังเพื่อคลายเครียด"}
{"word":"stress","english":"Stress can sneak up if you overcommit.","thai":"ความเครียดอาจมาเงียบๆ ถ้าคุณรับงานมากเกิน"}
{"word":"sneak","english":"Sneak in a quick nap to recharge.","thai":"แอบงีบสั้นๆ เพื่อเติมพลัง"}
{"word":"recharge","english":"Recharge your mind by stepping away briefly.","thai":"เติมพลังจิตใจด้วยการพักสั้นๆ"}
{"word":"step","english":"Step away from drama to stay calm.","thai":"ถอยห่างจากดราม่าเพื่อรักษาความสงบ"}
{"word":"calm","english":"Stay calm and think through tough choices.","thai":"รักษาความสงบและคิดทบทวนการตัดสินใจยากๆ"}
{"word":"think","english":"Think over the offer before you jump in.","thai":"พิจารณาข้อเสนอก่อนตัดสินใจ"}
{"word":"jump","english":"Jump at the chance to learn something new.","thai":"คว้าโอกาสเพื่อเรียนรู้สิ่งใหม่"}
{"word":"learn","english":"Learn to let go of pointless grudges.","thai":"เรียนรู้ที่จะปล่อยวางความแค้นที่ไร้ประโยชน์"}
{"word":"let","english":"Let loose at the party and have fun.","thai":"ปล่อยตัวที่งานปาร์ตี้และสนุกไป"}
{"word":"fun","english":"Fun times with friends cheer you up.","thai":"ช่วงเวลาสนุกกับเพื่อนทำให้คุณสดชื่น"}
{"word":"cheer","english":"Cheer on your team to boost morale.","thai":"เชียร์ทีมของคุณเพื่อเพิ่มขวัญกำลังใจ"}
{"word":"boost","english":"Boost your confidence to shine at work.","thai":"เพิ่มความมั่นใจเพื่อโดดเด่นในที่ทำงาน"}
{"word":"shine","english":"Shine bright in your moment of glory.","thai":"เปล่งประกายในช่วงเวลาแห่งความสำเร็จ"}
{"word":"moment","english":"Seize the moment to make things happen.","thai":"คว้าโอกาสเพื่อทำให้เกิดขึ้น"}
{"word":"make","english":"Make room for creativity to spark ideas.","thai":"เปิดพื้นที่ให้ความคิดสร้างสรรค์จุดประกายไอเดีย"}
{"word":"spark","english":"Spark excitement with a bold new look.","thai":"จุดประกายความตื่นเต้นด้วยลุคใหม่ที่กล้า"}
{"word":"bold","english":"A bold move can shake up the routine.","thai":"การเคลื่อนไหวที่กล้าสามารถเปลี่ยนแปลงกิจวัตร"}
{"word":"shake","english":"Shake off doubts to push forward confidently.","thai":"สลัดความสงสัยเพื่อก้าวไปข้างหน้าด้วยความมั่นใจ"}
{"word":"push","english":"Push through the pain to reach your goal.","thai":"ฝ่าความเจ็บปวดเพื่อไปถึงเป้าหมาย"}
{"word":"reach","english":"Reach out to mentors for wise advice.","thai":"ติดต่อที่ปรึกษาเพื่อคำแนะนำที่ชาญฉลาด"}
{"word":"wise","english":"Wise choices help you dodge big mistakes.","thai":"การตัดสินใจที่ฉลาดช่วยให้คุณหลีกเลี่ยงข้อผิดพลาดใหญ่"}
{"word":"dodge","english":"Dodge the chaos and focus on priorities.","thai":"หลบความวุ่นวายและจดจ่อกับสิ่งสำคัญ"}
{"word":"focus","english":"Focus hard to nail down the details.","thai":"จดจ่อเพื่อจัดการรายละเอียดให้ดี"}
{"word":"nail","english":"Nail the interview to land the job.","thai":"ทำสัมภาษณ์ให้ดีเพื่อได้งาน"}
{"word":"land","english":"Land a deal to kickstart your business.","thai":"ปิดดีลเพื่อเริ่มต้นธุรกิจ"}
{"word":"kickstart","english":"Kickstart your day with a strong coffee.","thai":"เริ่มวันด้วยกาแฟเข้มๆ"}
{"word":"coffee","english":"Coffee fuels me to crank out work.","thai":"กาแฟเติมพลังให้ฉันทำงานได้"}
{"word":"crank","english":"Crank up the AC to cool off.","thai":"เปิดแอร์ให้เย็นขึ้น"}
{"word":"cool","english":"Cool vibes make the party more fun.","thai":"บรรยากาศเจ๋งๆ ทำให้ปาร์ตี้สนุกยิ่งขึ้น"}
{"word":"party","english":"The party fizzled out after midnight.","thai":"งานปาร์ตี้เงียบลงหลังเที่ยงคืน"}
{"word":"fizzle","english":"Ideas that fizzle out need a fresh spin.","thai":"ไอเดียที่ล้มเหลวต้องการการปรับใหม่"}
{"word":"fresh","english":"Fresh ingredients turn meals into masterpieces.","thai":"วัตถุดิบสดใหม่เปลี่ยนมื้ออาหารให้เป็นผลงานชิ้นเอก"}
{"word":"meal","english":"Share a meal to bond with family.","thai":"แบ่งปันมื้ออาหารเพื่อสานสัมพันธ์กับครอบครัว"}
{"word":"bond","english":"Bond with teammates to build trust.","thai":"สร้างสายสัมพันธ์กับเพื่อนร่วมทีมเพื่อสร้างความไว้วางใจ"}
{"word":"build","english":"Build up courage to face your fears.","thai":"สร้างความกล้าเพื่อเผชิญหน้ากับความกลัว"}
{"word":"face","english":"Face the challenge and don’t back down.","thai":"เผชิญหน้ากับความท้าทายและอย่าถอย"}
{"word":"back","english":"Back off when tensions start to flare.","thai":"ถอยออกมาเมื่อความตึงเครียดเริ่มปะทุ"}
{"word":"flare","english":"Emotions flare up when you least expect.","thai":"อารมณ์ปะทุขึ้นเมื่อคุณคาดไม่ถึง"}
{"word":"expect","english":"Expect delays but plan to push through.","thai":"คาดว่าจะล่าช้าแต่เตรียมพร้อมฝ่าฟัน"}
{"word":"plan","english":"Plan your trip to avoid last-minute hassles.","thai":"วางแผนการเดินทางเพื่อหลีกเลี่ยงปัญหานาทีสุดท้าย"}
{"word":"trip","english":"A road trip can spark new adventures.","thai":"การเดินทางโดยรถยนต์สามารถจุดประกายการผจญภัยใหม่"}
{"word":"adventure","english":"Adventure awaits those who seek it out.","thai":"การผจญภัยรอผู้ที่ออกไปค้นหา"}
{"word":"seek","english":"Seek out new places to broaden your horizons.","thai":"ค้นหาสถานที่ใหม่เพื่อขยายขอบเขตของคุณ"}
{"word":"broaden","english":"Broaden your skills to stand out at work.","thai":"ขยายทักษะของคุณเพื่อโดดเด่นในที่ทำงาน"}
{"word":"stand","english":"Stand up for your ideas during the meeting.","thai":"ยืนหยัดเพื่อแนวคิดของคุณในที่ประชุม"}
{"word":"idea","english":"A great idea can spark a new project.","thai":"แนวคิดดีๆ สามารถจุดประกายโครงการใหม่"}
{"word":"spark","english":"Spark excitement by planning a fun outing.","thai":"จุดประกายความตื่นเต้นด้วยการวางแผนออกไปเที่ยว"}
{"word":"plan","english":"Plan ahead to avoid last-minute stress.","thai":"วางแผนล่วงหน้าเพื่อหลีกเลี่ยงความเครียดนาทีสุดท้าย"}
{"word":"avoid","english":"Avoid rushing to keep your cool under pressure.","thai":"หลีกเลี่ยงการเร่งรีบเพื่อรักษาความสงบภายใต้แรงกดดัน"}
{"word":"cool","english":"Keep your cool when things get tough.","thai":"รักษาความสงบเมื่อสถานการณ์ยากลำบาก"}
{"word":"get","english":"Get through challenges by staying focused.","thai":"ผ่านพ้นความท้าทายด้วยการจดจ่อ"}
{"word":"focus","english":"Focus on the goal to pull off a win.","thai":"จดจ่อกับเป้าหมายเพื่อคว้าชัยชนะ"}
{"word":"pull","english":"Pull together as a team to wrap up the task.","thai":"รวมพลังกันเป็นทีมเพื่อสรุปงาน"}
{"word":"wrap","english":"Wrap up your workout with a good stretch.","thai":"จบการออกกำลังกายด้วยการยืดกล้ามเนื้อที่ดี"}
{"word":"stretch","english":"Stretch your budget to save up for vacation.","thai":"ยืดงบประมาณของคุณเพื่อเก็บเงินไปเที่ยว"}
{"word":"save","english":"Save up for something special this year.","thai":"เก็บเงินเพื่อสิ่งพิเศษในปีนี้"}
{"word":"special","english":"A special moment can lift up your mood.","thai":"ช่วงเวลาพิเศษสามารถยกระดับอารมณ์ของคุณ"}
{"word":"lift","english":"Lift weights to build up your strength.","thai":"ยกน้ำหนักเพื่อเสริมสร้างความแข็งแรง"}
{"word":"build","english":"Build trust by showing up on time.","thai":"สร้างความไว้วางใจด้วยการมาตรงเวลา"}
{"word":"show","english":"Show off your talents at the open mic.","thai":"อวดความสามารถของคุณในงานโอเพ่นไมค์"}
{"word":"talent","english":"Talent shines when you put in effort.","thai":"ความสามารถเปล่งประกายเมื่อคุณทุ่มเท"}
{"word":"put","english":"Put aside distractions to crank out work.","thai":"วางสิ่งรบกวนไว้เพื่อทำงานให้เสร็จ"}
{"word":"crank","english":"Crank up the volume for a dance party.","thai":"เพิ่มเสียงดังเพื่อจัดปาร์ตี้เต้นรำ"}
{"word":"dance","english":"Dance like nobody’s watching to let loose.","thai":"เต้นราวกับไม่มีใครดูเพื่อปล่อยตัว"}
{"word":"let","english":"Let go of worries and chill out.","thai":"ปล่อยวางความกังวลและผ่อนคลาย"}
{"word":"chill","english":"Chill with a book to wind down tonight.","thai":"ผ่อนคลายกับหนังสือเพื่อพักในคืนนี้"}
{"word":"wind","english":"Wind up the day with a cozy dinner.","thai":"ปิดท้ายวันด้วยมื้อเย็นแสนอบอุ่น"}
{"word":"cozy","english":"A cozy blanket helps you drift off easily.","thai":"ผ้าห่มนุ่มๆ ช่วยให้คุณหลับได้ง่าย"}
{"word":"drift","english":"Drift away in thought during a quiet hike.","thai":"ล่องลอยไปกับความคิดระหว่างการเดินป่าที่เงียบสงบ"}
{"word":"quiet","english":"A quiet evening sets up a peaceful mood.","thai":"ค่ำคืนที่เงียบสงบสร้างบรรยากาศที่สงบ"}
{"word":"set","english":"Set out on a road trip for adventure.","thai":"ออกเดินทางท่องเที่ยวเพื่อผจญภัย"}
{"word":"road","english":"A long road trip calls for good music.","thai":"การเดินทางไกลโดยรถยนต์ต้องมีดนตรีดีๆ"}
{"word":"music","english":"Music can cheer you up on tough days.","thai":"ดนตรีสามารถทำให้คุณสดชื่นในวันที่ยากลำบาก"}
{"word":"cheer","english":"Cheer on your friend at their big game.","thai":"เชียร์เพื่อนของคุณในเกมใหญ่"}
{"word":"game","english":"Game night brings out everyone’s competitive side.","thai":"คืนเล่นเกมดึงด้านการแข่งขันของทุกคนออกมา"}
{"word":"bring","english":"Bring your A-game to nail the presentation.","thai":"นำความสามารถที่ดีที่สุดมาเพื่อทำให้การนำเสนอสำเร็จ"}
{"word":"nail","english":"Nail down the details to avoid mistakes.","thai":"จัดการรายละเอียดให้ดีเพื่อหลีกเลี่ยงข้อผิดพลาด"}
{"word":"mistake","english":"Learn from a mistake to grow stronger.","thai":"เรียนรู้จากข้อผิดพลาดเพื่อเติบโตแข็งแกร่ง"}
{"word":"grow","english":"Grow your network by reaching out often.","thai":"ขยายเครือข่ายของคุณด้วยการติดต่อบ่อยๆ"}
{"word":"reach","english":"Reach for your dreams and don’t give up.","thai":"เอื้อมถึงความฝันและอย่ายอมแพ้"}
{"word":"give","english":"Give in to temptation and grab a snack.","thai":"ยอมจำนนต่อสิ่งยั่วใจและหยิบของว่าง"}
{"word":"grab","english":"Grab a coffee to kick off your morning.","thai":"หยิบกาแฟเพื่อเริ่มต้นเช้าของคุณ"}
{"word":"kick","english":"Kick back with friends after a long week.","thai":"พักผ่อนกับเพื่อนหลังจากสัปดาห์ที่ยาวนาน"}
{"word":"friend","english":"A true friend always backs you up.","thai":"เพื่อนแท้มักจะสนับสนุนคุณ"}
{"word":"back","english":"Back off when the argument heats up.","thai":"ถอยออกมาเมื่อการโต้แย้งรุนแรงขึ้น"}
{"word":"heat","english":"The heat can wear you out quickly.","thai":"ความร้อนสามารถทำให้คุณเหนื่อยล้าได้เร็ว"}
{"word":"wear","english":"Wear comfortable shoes to get through the day.","thai":"สวมรองเท้าสบายเพื่อผ่านวันได้"}
{"word":"get","english":"Get over hurdles to chase your goals.","thai":"ก้าวข้ามอุปสรรคเพื่อไล่ตามเป้าหมาย"}
{"word":"chase","english":"Chase down opportunities to level up your career.","thai":"ไล่ตามโอกาสเพื่อยกระดับอาชีพของคุณ"}
{"word":"level","english":"Level up your skills with online courses.","thai":"ยกระดับทักษะด้วยคอร์สออนไลน์"}
{"word":"skill","english":"Skill and patience help you figure out puzzles.","thai":"ทักษะและความอดทนช่วยคุณแก้ปริศนา"}
{"word":"figure","english":"Figure out the problem before you act.","thai":"หาคำตอบของปัญหาก่อนที่คุณจะลงมือ"}
{"word":"act","english":"Act fast to lock in the best deal.","thai":"ลงมือเร็วเพื่อล็อกดีลที่ดีที่สุด"}
{"word":"lock","english":"Lock up your valuables before heading out.","thai":"ล็อกของมีค่าไว้ก่อนออกไป"}
{"word":"head","english":"Head to the gym to work out stress.","thai":"ไปยิมเพื่อออกกำลังกายคลายเครียด"}
{"word":"work","english":"Work through challenges to come out stronger.","thai":"ฝ่าฟันความท้าทายเพื่อออกมาแข็งแกร่ง"}
{"word":"come","english":"Come up with a plan to stay organized.","thai":"คิดแผนเพื่อให้เป็นระเบียบ"}
{"word":"stay","english":"Stay sharp to keep up with trends.","thai":"รักษาความเฉียบคมเพื่อตามเทรนด์"}
{"word":"keep","english":"Keep your cool when negotiations get tricky.","thai":"รักษาความสงบเมื่อการเจรจายากลำบาก"}
{"word":"tricky","english":"Tricky situations call for creative solutions.","thai":"สถานการณ์ที่ซับซ้อนต้องใช้แนวทางแก้ไขที่สร้างสรรค์"}
{"word":"solution","english":"A smart solution can smooth out conflicts.","thai":"แนวทางแก้ไขที่ชาญฉลาดสามารถคลายความขัดแย้ง"}
{"word":"smooth","english":"Smooth out your schedule to make time.","thai":"ปรับตารางให้เรียบร้อยเพื่อหาเวลา"}
{"word":"make","english":"Make a bold move to shake things up.","thai":"ทำการเคลื่อนไหวที่กล้าเพื่อเปลี่ยนแปลงสิ่งต่างๆ"}
{"word":"shake","english":"Shake off nerves before the big speech.","thai":"สลัดความประหม่า передการพูดครั้งใหญ่"}
{"word":"speech","english":"A good speech can fire up the crowd.","thai":"คำพูดที่ดีสามารถปลุกเร้าผู้ฟัง"}
{"word":"fire","english":"Fire up the grill for a summer BBQ.","thai":"จุดเตาย่างสำหรับบาร์บีคิวฤดูร้อน"}
{"word":"summer","english":"Summer vibes make you want to hang out.","thai":"บรรยากาศหน้าร้อนทำให้อยากไปนั่งเล่น"}
{"word":"hang","english":"Hang out at the park to catch up.","thai":"ไปนั่งเล่นที่สวนสาธารณะเพื่อคุยอัพเดท"}
{"word":"catch","english":"Catch a break and enjoy some downtime.","thai":"พักสักหน่อยและเพลิดเพลินกับเวลว่าง"}
{"word":"enjoy","english":"Enjoy the moment before it slips away.","thai":"สนุกกับช่วงเวลาก่อนที่มันจะผ่านไป"}
{"word":"slip","english":"Don’t let opportunities slip through your fingers.","thai":"อย่าปล่อยให้โอกาสหลุดมือ"}
{"word":"finger","english":"Point a finger only when you’re sure.","thai":"ชี้หน้าเฉพาะเมื่อคุณมั่นใจ"}
{"word":"sure","english":"Make sure to check in before the deadline.","thai":"อย่าลืมเช็คอินก่อนถึงกำหนด"}
{"word":"check","english":"Check out the new café for a vibe.","thai":"ลองไปดูร้านกาแฟใหม่เพื่อสัมผัสบรรยากาศ"}
{"word":"vibe","english":"The vibe at the concert was electric.","thai":"บรรยากาศที่คอนเสิร์ตเต็มไปด้วยพลัง"}
{"word":"electric","english":"Electric cars are picking up in popularity.","thai":"รถไฟฟ้ากำลังได้รับความนิยม"}
{"word":"pick","english":"Pick up a hobby to spark creativity.","thai":"เลือกงานอดิเรกเพื่อจุดประกายความคิดสร้างสรรค์"}
{"word":"creativity","english":"Creativity flows when you let go of fear.","thai":"ความคิดสร้างสรรค์ไหลลื่นเมื่อคุณปล่อยวางความกลัว"}
{"word":"let","english":"Let your imagination run wild with art.","thai":"ปล่อยให้จินตนาการของคุณโลดแล่นกับศิลปะ"}
{"word":"run","english":"Run a quick errand before dinner starts.","thai":"ไปทำธุระสั้นๆ ก่อนมื้อเย็นเริ่ม"}
{"word":"dinner","english":"Dinner with friends always lifts your spirits.","thai":"มื้อเย็นกับเพื่อนช่วยยกระดับจิตใจ"}
{"word":"lift","english":"Lift your game to impress the coach.","thai":"ยกระดับการเล่นเพื่อสร้างความประทับใจให้โค้ช"}
{"word":"impress","english":"Impress your boss by showing up prepared.","thai":"สร้างความประทับใจให้เจ้านายด้วยการเตรียมพร้อม"}
{"word":"prepare","english":"Prepare well to ace the final exam.","thai":"เตรียมตัวให้ดีเพื่อสอบปลายภาคให้ผ่าน"}
{"word":"ace","english":"Ace the interview to land your dream job.","thai":"ทำให้สัมภาษณ์ผ่านฉลุยเพื่อได้งานในฝัน"}
{"word":"land","english":"Land a big client to boost your business.","thai":"ได้ลูกค้ารายใหญ่เพื่อเพิ่มพลังให้ธุรกิจ"}
{"word":"boost","english":"Boost your mood with a quick workout.","thai":"เพิ่มอารมณ์ดีด้วยการออกกำลังกายสั้นๆ"}
{"word":"mood","english":"A bad mood can throw off your day.","thai":"อารมณ์ไม่ดีสามารถทำให้วันของคุณแย่"}
{"word":"throw","english":"Throw out old habits to embrace change.","thai":"ทิ้งนิสัยเก่าเพื่อยอมรับการเปลี่ยนแปลง"}
{"word":"embrace","english":"Embrace new challenges to grow as a person.","thai":"ยอมรับความท้าทายใหม่เพื่อเติบโตเป็นคน"}
{"word":"grow","english":"Grow your savings by cutting back on spending.","thai":"เพิ่มเงินออมด้วยการลดการใช้จ่าย"}
{"word":"cut","english":"Cut through the noise to find clarity.","thai":"ตัดผ่านความวุ่นวายเพื่อหาความชัดเจน"}
{"word":"find","english":"Find time to chill with your favorite show.","thai":"หาเวลาเพื่อผ่อนคลายกับรายการโปรด"}
{"word":"chill","english":"Chill vibes make studying more bearable.","thai":"บรรยากาศผ่อนคลายทำให้การเรียนทนได้มากขึ้น"}
{"word":"study","english":"Study hard to pull off great grades.","thai":"เรียนหนักเพื่อได้คะแนนดี"}
{"word":"pull","english":"Pull an all-nighter to finish the project.","thai":"ทำงานทั้งคืนเพื่อจบโครงการ"}
{"word":"finish","english":"Finish up early to catch the sunset.","thai":"จบงาน早くเพื่อไปดูพระอาทิตย์ตก"}
{"word":"catch","english":"Catch up on sleep to recharge your energy.","thai":"นอนชดเชยเพื่อเติมพลัง"}
{"word":"recharge","english":"Re Sustentive your phone to stay connected.","thai":"ชาร์จโทรศัพท์เพื่อให้เชื่อมต่อได้"}
{"word":"connect","english":"Connect with old friends to rekindle memories.","thai":"ติดต่อเพื่อนเก่าเพื่อรื้อฟื้นความทรงจำ"}
{"word":"rekindle","english":"Rekindle your passion by trying new hobbies.","thai":"จุดไฟความหลงใหลด้วยการลองงานอดิเรกใหม่"}
{"word":"passion","english":"Pursue your passion to live a fuller life.","thai":"ตามหาความหลงใหลเพื่อชีวิตที่สมบูรณ์ยิ่งขึ้น"}
{"word":"pursue","english":"Pursue new goals to keep growing.","thai":"ไล่ตามเป้าหมายใหม่เพื่อพัฒนาต่อไป"}
{"word":"grow","english":"Grow your skills to stand out professionally.","thai":"พัฒนาทักษะเพื่อโดดเด่นในสายงาน"}
{"word":"stand","english":"Stand up for yourself in tough situations.","thai":"ยืนหยัดเพื่อตัวเองในสถานการณ์ยากลำบาก"}
{"word":"tough","english":"Tough times call for digging deep.","thai":"ช่วงเวลายากลำบากต้องการความพยายามอย่างมาก"}
{"word":"dig","english":"Dig into a good book to unwind.","thai":"ดำดิ่งสู่หนังสือดีๆ เพื่อผ่อนคลาย"}
{"word":"unwind","english":"Unwind after work with a cold drink.","thai":"ผ่อนคลายหลังเลิกงานด้วยเครื่องดื่มเย็นๆ"}
{"word":"drink","english":"Sip a drink while you catch up with friends.","thai":"จิบเครื่องดื่มขณะคุยอัพเดทกับเพื่อน"}
{"word":"catch","english":"Catch a movie to shake off stress.","thai":"ดูหนังเพื่อสลัดความเครียด"}
{"word":"shake","english":"Shake up your routine with a new hobby.","thai":"เปลี่ยนกิจวัตรด้วยงานอดิเรกใหม่"}
{"word":"hobby","english":"A hobby can spark joy in daily life.","thai":"งานอดิเรกสามารถจุดประกายความสุขในชีวิตประจำวัน"}
{"word":"spark","english":"Spark creativity by trying out new ideas.","thai":"จุดประกายความคิดสร้างสรรค์ด้วยการลองไอเดียใหม่"}
{"word":"try","english":"Try your best to pull off the project.","thai":"พยายามอย่างเต็มที่เพื่อทำให้โครงการสำเร็จ"}
{"word":"pull","english":"Pull together a plan to stay on track.","thai":"รวบรวมแผนเพื่อให้ทุกอย่างราบรื่น"}
{"word":"stay","english":"Stay focused to get through tight deadlines.","thai":"จดจ่อเพื่อผ่านกำหนดเวลาที่คับขัน"}
{"word":"get","english":"Get up early to kick off the day.","thai":"ตื่นเช้าเพื่อเริ่มวันใหม่"}
{"word":"kick","english":"Kick back with a podcast on lazy Sundays.","thai":"พักผ่อนกับพอดแคสต์ในวันอาทิตย์ที่แสนขี้เกียจ"}
{"word":"lazy","english":"Lazy afternoons are perfect for chilling out.","thai":"บ่ายที่ขี้เกียจเหมาะสำหรับการพักผ่อน"}
{"word":"chill","english":"Chill vibes make studying less of a drag.","thai":"บรรยากาศผ่อนคลายทำให้การเรียนไม่น่าเบื่อ"}
{"word":"study","english":"Study hard to ace your next exam.","thai":"เรียนหนักเพื่อสอบครั้งต่อไปให้ผ่านฉลุย"}
{"word":"ace","english":"Ace the interview to land a great job.","thai":"ทำให้สัมภาษณ์ผ่านเพื่อได้งานดีๆ"}
{"word":"land","english":"Land a deal to boost your confidence.","thai":"ปิดดีลเพื่อเพิ่มความมั่นใจ"}
{"word":"boost","english":"Boost your energy with a quick nap.","thai":"เพิ่มพลังด้วยการงีบสั้นๆ"}
{"word":"energy","english":"Channel your energy to power through tasks.","thai":"ใช้พลังของคุณเพื่อทำงานให้สำเร็จ"}
{"word":"power","english":"Power up your phone before heading out.","thai":"ชาร์จโทรศัพท์ก่อนออกไป"}
{"word":"head","english":"Head to the gym to work off stress.","thai":"ไปยิมเพื่อออกกำลังกายคลายเครียด"}
{"word":"work","english":"Work smart to wrap up projects early.","thai":"ทำงานอย่างชาญฉลาดเพื่อจบโครงการเร็ว"}
{"word":"wrap","english":"Wrap up the meeting with clear next steps.","thai":"สรุปการประชุมด้วยขั้นตอนต่อไปที่ชัดเจน"}
{"word":"clear","english":"Clear your mind with a short walk.","thai":"ปลอดโปร่งจิตใจด้วยการเดินสั้นๆ"}
{"word":"walk","english":"Walk the dog to enjoy some fresh air.","thai":"พาสุนัขไปเดินเล่นเพื่อสูดอากาศบริสุทธิ์"}
{"word":"enjoy","english":"Enjoy a cozy evening by the fireplace.","thai":"เพลิดเพลินกับค่ำคืนแสนอบอุ่นข้างเตาผิง"}
{"word":"cozy","english":"A cozy blanket helps you drift off.","thai":"ผ้าห่มนุ่มๆ ช่วยให้คุณหลับง่าย"}
{"word":"drift","english":"Drift into daydreams during a boring lecture.","thai":"ล่องลอยไปในจินตนาการระหว่างการบรรยายที่น่าเบื่อ"}
{"word":"boring","english":"A boring day can turn around with music.","thai":"วันที่น่าเบื่อสามารถเปลี่ยนได้ด้วยดนตรี"}
{"word":"turn","english":"Turn up the heat to stay warm.","thai":"เพิ่มความร้อนเพื่อให้อบอุ่น"}
{"word":"warm","english":"Warm cookies fresh from the oven taste amazing.","thai":"คุกกี้อบใหม่จากเตารสชาติยอดเยี่ยม"}
{"word":"taste","english":"Taste the local cuisine when you travel abroad.","thai":"ลิ้มรสอาหารท้องถิ่นเมื่อคุณไปต่างประเทศ"}
{"word":"travel","english":"Travel light to make your trip easier.","thai":"เดินทางแบบเบาๆ เพื่อให้ทริปง่ายขึ้น"}
{"word":"trip","english":"A road trip can bring out new adventures.","thai":"การเดินทางโดยรถยนต์สามารถนำมาซึ่งการผจญภัยใหม่"}
{"word":"bring","english":"Bring your A-game to win the match.","thai":"นำความสามารถที่ดีที่สุดมาเพื่อชนะการแข่งขัน"}
{"word":"win","english":"Win over clients with a confident pitch.","thai":"ชนะใจลูกค้าด้วยการนำเสนอที่มั่นใจ"}
{"word":"confident","english":"A confident attitude helps you shine bright.","thai":"ทัศนคติที่มั่นใจช่วยให้คุณเปล่งประกาย"}
{"word":"shine","english":"Shine at the party with your dance moves.","thai":"โดดเด่นในงานปาร์ตี้ด้วยท่าเต้นของคุณ"}
{"word":"dance","english":"Dance like nobody’s watching to let loose.","thai":"เต้นราวกับไม่มีใครดูเพื่อปล่อยตัว"}
{"word":"let","english":"Let go of grudges to find peace.","thai":"ปล่อยวางความแค้นเพื่อพบความสงบ"}
{"word":"find","english":"Find time to hang out with family.","thai":"หาเวลาเพื่อไปนั่งเล่นกับครอบครัว"}
{"word":"hang","english":"Hang out at the café to catch up.","thai":"ไปนั่งเล่นที่ร้านกาแฟเพื่อคุยอัพเดท"}
{"word":"catch","english":"Catch a break and enjoy some downtime.","thai":"พักสักหน่อยและเพลิดเพลินกับเวลาว่าง"}
{"word":"enjoy","english":"Enjoy the sunset to recharge your soul.","thai":"เพลิดเพลินกับพระอาทิตย์ตกเพื่อเติมพลังจิตใจ"}
{"word":"recharge","english":"Recharge your batteries with a good nap.","thai":"เติมพลังด้วยการงีบหลับที่ดี"}
{"word":"nap","english":"A bad nap can mess up your focus.","thai":"การงีบที่ไม่ดีสามารถทำให้สมาธิคุณยุ่งเหยิง"}
{"word":"mess","english":"Don’t mess up the chance to level up.","thai":"อย่าทำโอกาสเสียเพื่อยกระดับตัวเอง"}
{"word":"level","english":"Level up your game with consistent practice.","thai":"ยกระดับการเล่นด้วยการฝึกฝนอย่างสม่ำเสมอ"}
{"word":"practice","english":"Practice daily to nail down new skills.","thai":"ฝึกทุกวันเพื่อเชี่ยวชาญทักษะใหม่"}
{"word":"nail","english":"Nail the presentation to impress your boss.","thai":"ทำให้การนำเสนอสำเร็จเพื่อสร้างความประทับใจให้เจ้านาย"}
{"word":"impress","english":"Impress your friends with a home-cooked meal.","thai":"สร้างความประทับใจให้เพื่อนด้วยอาหารทำเอง"}
{"word":"meal","english":"A good meal can lift your spirits.","thai":"มื้ออาหารดีๆ สามารถยกระดับจิตใจ"}
{"word":"lift","english":"Lift weights to build up your strength.","thai":"ยกน้ำหนักเพื่อเสริมสร้างความแข็งแรง"}
{"word":"build","english":"Build a strong team to tackle challenges.","thai":"สร้างทีมที่แข็งแกร่งเพื่อรับมือความท้าทาย"}
{"word":"tackle","english":"Tackle tough problems with a clear mind.","thai":"จัดการปัญหายากๆ ด้วยจิตใจที่ปลอดโปร่ง"}
{"word":"clear","english":"Clear out clutter to make room for new ideas.","thai":"กำจัดความรกเพื่อเปิดพื้นที่ให้ไอเดียใหม่"}
{"word":"room","english":"A quiet room helps you focus better.","thai":"ห้องเงียบช่วยให้คุณจดจ่อได้ดีขึ้น"}
{"word":"focus","english":"Focus on priorities to get ahead.","thai":"จดจ่อกับสิ่งสำคัญเพื่อก้าวหน้า"}
{"word":"get","english":"Get over doubts to chase your dreams.","thai":"ก้าวข้ามความสงสัยเพื่อไล่ตามความฝัน"}
{"word":"chase","english":"Chase down goals with relentless effort.","thai":"ไล่ตามเป้าหมายด้วยความพยายามไม่หยุดยั้ง"}
{"word":"effort","english":"Effort pays off when you stay committed.","thai":"ความพยายามได้ผลเมื่อคุณยึดมั่น"}
{"word":"stay","english":"Stay calm to think through tough choices.","thai":"รักษาความสงบเพื่อคิดทบทวนการตัดสินใจยากๆ"}
{"word":"think","english":"Think outside the box to solve problems.","thai":"คิดนอกกรอบเพื่อแก้ปัญหา"}
{"word":"solve","english":"Solve the puzzle to unlock new insights.","thai":"แก้ปริศนาเพื่อค้นพบมุมมองใหม่"}
{"word":"unlock","english":"Unlock your potential by taking risks.","thai":"ปลดล็อกศักยภาพด้วยการกล้าเสี่ยง"}
{"word":"risk","english":"Taking a risk can lead to big rewards.","thai":"การเสี่ยงอาจนำไปสู่รางวัลใหญ่"}
{"word":"reward","english":"Hard work brings its own reward over time.","thai":"การทำงานหนักนำรางวัลมาให้เมื่อเวลาผ่านไป"}
{"word":"time","english":"Time flies when you’re having fun.","thai":"เวลาผ่านไปเร็วเมื่อคุณสนุก"}
{"word":"fun","english":"Fun game nights bring friends closer.","thai":"คืนเล่นเกมสนุกๆ ทำให้เพื่อนสนิทกันมากขึ้น"}
{"word":"friend","english":"A true friend always shows up for you.","thai":"เพื่อนแท้มักจะอยู่เคียงข้างคุณ"}
{"word":"show","english":"Show off your skills at the talent contest.","thai":"อวดทักษะของคุณในงานแข่งขันความสามารถ"}
{"word":"skill","english":"Skill and patience help you master crafts.","thai":"ทักษะและความอดทนช่วยให้คุณเชี่ยวชาญงานฝีมือ"}
{"word":"master","english":"Master a new language to open doors.","thai":"เชี่ยวชาญภาษาใหม่เพื่อเปิดประตูโอกาส"}
{"word":"open","english":"Open your mind to fresh perspectives.","thai":"เปิดใจรับมุมมองใหม่ๆ"}
{"word":"perspective","english":"A new perspective can shift your whole outlook.","thai":"มุมมองใหม่สามารถเปลี่ยนมุมมองทั้งหมดของคุณ"}
{"word":"shift","english":"Shift gears and pick up the pace.","thai":"เปลี่ยนเกียร์และเร่งจังหวะ"}
{"word":"pick","english":"Pick out a great outfit for the party.","thai":"เลือกชุดดีๆ สำหรับงานปาร์ตี้"}
{"word":"outfit","english":"A sharp outfit boosts your confidence.","thai":"ชุดที่ดูดีเพิ่มความมั่นใจให้คุณ"}
{"word":"confidence","english":"Confidence helps you speak up in meetings.","thai":"ความมั่นใจช่วยให้คุณพูดในที่ประชุม"}
{"word":"speak","english":"Speak clearly to get your point across.","thai":"พูดชัดเจนเพื่อให้ความคิดของคุณเข้าใจ"}
{"word":"point","english":"Make a point to check in daily.","thai":"ตั้งใจตรวจสอบทุกวัน"}
{"word":"check","english":"Check out new apps to stay organized.","thai":"ลองใช้แอปใหม่เพื่อให้เป็นระเบียบ"}
{"word":"organize","english":"Organize your desk to clear your mind.","thai":"จัดโต๊ะทำงานเพื่อปลอดโปร่งจิตใจ"}
{"word":"mind","english":"Keep an open mind to learn fast.","thai":"รักษาใจที่เปิดกว้างเพื่อเรียนรู้เร็ว"}
{"word":"learn","english":"Learn from mistakes to grow wiser.","thai":"เรียนรู้จากข้อผิดพลาดเพื่อฉลาดขึ้น"}
{"word":"wise","english":"Wise choices lead to lasting success.","thai":"การตัดสินใจที่ฉลาดนำไปสู่ความสำเร็จที่ยั่งยืน"}
{"word":"success","english":"Success comes when you push through doubt.","thai":"ความสำเร็จมาถึงเมื่อคุณฝ่าฟันความสงสัย"}
{"word":"push","english":"Push yourself to try out new challenges.","thai":"ผลักดันตัวเองเพื่อลองความท้าทายใหม่"}
{"word":"try","english":"Try new foods to spice up your meals.","thai":"ลองอาหารใหม่เพื่อเพิ่มสีสันให้มื้ออาหาร"}
{"word":"spice","english":"Spice up your day with a fun activity.","thai":"เพิ่มสีสันให้วันด้วยกิจกรรมสนุกๆ"}
{"word":"activity","english":"An outdoor activity can recharge your energy.","thai":"กิจกรรมกลางแจ้งสามารถเติมพลังให้คุณ"}
{"word":"recharge","english":"Recharge by taking a quick break.","thai":"เติมพลังด้วยการพักสั้นๆ"}
{"word":"break","english":"Take a break to clear your head.","thai":"พักสักหน่อยเพื่อปลอดโปร่งสมอง"}
{"word":"head","english":"Head out for a run to stay fit.","thai":"ออกไปวิ่งเพื่อรักษาความฟิต"}
{"word":"run","english":"Run errands early to free up your day.","thai":"วิ่งทำธุระแต่เช้าเพื่อให้วันว่าง"}
{"word":"free","english":"Free up some time to chill with friends.","thai":"หาเวลาว่างเพื่อผ่อนคลายกับเพื่อน"}
{"word":"chill","english":"Chill out by the pool to beat the heat.","thai":"ผ่อนคลายริมสระน้ำเพื่อคลายร้อน"}
{"word":"beat","english":"Beat the morning rush by waking up early.","thai":"หลีกเลี่ยงความวุ่นวายตอนเช้าด้วยการตื่นเร็ว"}
{"word":"morning","english":"A calm morning helps you kick off strong.","thai":"เช้าที่สงบช่วยให้คุณเริ่มวันอย่างมีพลัง"}
{"word":"kick","english":"Kick back with a movie on Friday night.","thai":"พักผ่อนดูหนังในคืนวันศุกร์"}
{"word":"movie","english":"A good movie can lift your spirits high.","thai":"หนังดีๆ สามารถยกระดับจิตใจของคุณ"}
{"word":"lift","english":"Lift weights to build up your strength.","thai":"ยกน้ำหนักเพื่อเสริมสร้างความแข็งแรง"}
{"word":"build","english":"Build a solid plan to nail the project.","thai":"สร้างแผนที่มั่นคงเพื่อทำให้โครงการสำเร็จ"}
{"word":"nail","english":"Nail the audition to land a big role.","thai":"ทำให้ออดิชันผ่านเพื่อได้บทบาทใหญ่"}
{"word":"land","english":"Land a new job to shake up your career.","thai":"ได้งานใหม่เพื่อเปลี่ยนแปลงเส้นทางอาชีพ"}
{"word":"shake","english":"Shake off nerves before giving a speech.","thai":"สลัดความประหม่าก่อนพูดสุนทรพจน์"}
{"word":"speech","english":"A great speech can inspire and spark change.","thai":"สุนทรพจน์ที่ดีสามารถสร้างแรงบันดาลใจและจุดประกายการเปลี่ยนแปลง"}
{"word":"spark","english":"Spark creativity by trying out new hobbies.","thai":"จุดประกายความคิดสร้างสรรค์ด้วยการลองงานอดิเรกใหม่"}
{"word":"try","english":"Try your best to stand out in class.","thai":"พยายามอย่างเต็มที่เพื่อโดดเด่นในชั้นเรียน"}
{"word":"stand","english":"Stand up for your beliefs with confidence.","thai":"ยืนหยัดเพื่อความเชื่อด้วยความมั่นใจ"}
{"word":"confidence","english":"Confidence helps you pull off tough tasks.","thai":"ความมั่นใจช่วยให้คุณจัดการงานยากๆ ได้"}
{"word":"pull","english":"Pull together resources to wrap up the deal.","thai":"รวบรวมทรัพยากรเพื่อสรุปดีล"}
{"word":"wrap","english":"Wrap up your chores to enjoy the weekend.","thai":"จัดการงานบ้านให้เสร็จเพื่อสนุกกับสุดสัปดาห์"}
{"word":"enjoy","english":"Enjoy a quiet evening to wind down.","thai":"เพลิดเพลินกับค่ำคืนเงียบสงบเพื่อผ่อนคลาย"}
{"word":"wind","english":"Wind down with music after a long day.","thai":"ผ่อนคลายด้วยดนตรีหลังวันที่ยาวนาน"}
{"word":"music","english":"Music can turn around a bad mood.","thai":"ดนตรีสามารถเปลี่ยนอารมณ์ที่แย่ได้"}
{"word":"turn","english":"Turn up the volume for a dance party.","thai":"เพิ่มเสียงดังเพื่อจัดปาร์ตี้เต้นรำ"}
{"word":"dance","english":"Dance like nobody’s watching to let loose.","thai":"เต้นราวกับไม่มีใครดูเพื่อปล่อยตัว"}
{"word":"let","english":"Let go of stress to find some peace.","thai":"ปล่อยวางความเครียดเพื่อหาความสงบ"}
{"word":"find","english":"Find time to catch up with old friends.","thai":"หาเวลาเพื่อคุยอัพเดทกับเพื่อนเก่า"}
{"word":"catch","english":"Catch a break and recharge your energy.","thai":"พักสักหน่อยเพื่อเติมพลัง"}
{"word":"recharge","english":"Recharge your phone before heading to work.","thai":"ชาร์จโทรศัพท์ก่อนไปทำงาน"}
{"word":"work","english":"Work smart to get ahead in your career.","thai":"ทำงานอย่างชาญฉลาดเพื่อก้าวหน้าในอาชีพ"}
{"word":"get","english":"Get over fears to chase your dreams.","thai":"ก้าวข้ามความกลัวเพื่อไล่ตามความฝัน"}
{"word":"chase","english":"Chase down goals with relentless passion.","thai":"ไล่ตามเป้าหมายด้วยความหลงใหลไม่หยุดยั้ง"}
{"word":"passion","english":"Passion drives you to push through obstacles.","thai":"ความหลงใหลผลักดันให้คุณฝ่าฟันอุปสรรค"}
{"word":"push","english":"Push your limits to grow stronger daily.","thai":"ผลักดันขีดจำกัดเพื่อเติบโตแข็งแกร่งทุกวัน"}
{"word":"grow","english":"Grow your skills to level up fast.","thai":"พัฒนาทักษะเพื่อยกระดับอย่างรวดเร็ว"}
{"word":"level","english":"Level up your game with consistent effort.","thai":"ยกระดับการเล่นด้วยความพยายามสม่ำเสมอ"}
{"word":"effort","english":"Effort pays off when you stay focused.","thai":"ความพยายามได้ผลเมื่อคุณจดจ่อ"}
{"word":"stay","english":"Stay calm to think through tough choices.","thai":"รักษาความสงบเพื่อคิดทบทวนการตัดสินใจยากๆ"}
{"word":"think","english":"Think outside the box to solve issues.","thai":"คิดนอกกรอบเพื่อแก้ปัญหา"}
{"word":"solve","english":"Solve problems quickly to keep things moving.","thai":"แก้ปัญหาอย่างรวดเร็วเพื่อให้ทุกอย่างดำเนินต่อ"}
{"word":"keep","english":"Keep your cool when tensions flare Ascend to the top.","thai":"รักษาความสงบเมื่อสถานการณ์ตึงเครียด"}
{"word":"top","english":"Aim for the top spot in the competition.","thai":"ตั้งเป้าคว้าอันดับหนึ่งในการแข่งขัน"}
{"word":"aim","english":"Aim high to achieve your biggest dreams.","thai":"ตั้งเป้าสูงเพื่อบรรลุความฝันที่ยิ่งใหญ่"}
{"word":"achieve","english":"Achieve your goals by planning ahead.","thai":"บรรลุเป้าหมายด้วยการวางแผนล่วงหน้า"}
{"word":"plan","english":"Plan your day to avoid last-minute stress.","thai":"วางแผนวันของคุณเพื่อหลีกเลี่ยงความเครียดนาทีสุดท้าย"}
{"word":"avoid","english":"Avoid distractions to stay on track.","thai":"หลีกเลี่ยงสิ่งรบกวนเพื่อให้อยู่ในเส้นทาง"}
{"word":"track","english":"Keep track of expenses to save money.","thai":"ติดตามค่าใช้จ่ายเพื่อประหยัดเงิน"}
{"word":"save","english":"Save up for a big trip next summer.","thai":"เก็บเงินเพื่อทริปใหญ่ในหน้าร้อนหน้า"}
{"word":"trip","english":"A road trip can spark new adventures.","thai":"การเดินทางโดยรถยนต์สามารถจุดประกายการผจญภัยใหม่"}
{"word":"spark","english":"Spark joy with a thoughtful gift.","thai":"จุดประกายความสุขด้วยของขวัญที่ตั้งใจ"}
{"word":"gift","english":"A small gift can brighten someone’s day.","thai":"ของขวัญเล็กๆ สามารถทำให้วันของใครบางคนสดใส"}
{"word":"brighten","english":"Brighten your mood with a funny show.","thai":"ทำให้อารมณ์ดีด้วยรายการตลก"}
{"word":"mood","english":"A bad mood can throw off your focus.","thai":"อารมณ์ไม่ดีสามารถรบกวนสมาธิของคุณ"}
{"word":"throw","english":"Throw out old junk to clear your space.","thai":"ทิ้งของเก่าเพื่อจัดพื้นที่ให้โล่ง"}
{"word":"clear","english":"Clear your mind with a quick nap.","thai":"ปลอดโปร่งจิตใจด้วยการงีบสั้นๆ"}
{"word":"nap","english":"A short nap can recharge your energy.","thai":"การงีบสั้นๆ สามารถเติมพลังให้คุณ"}
{"word":"energy","english":"Channel your energy to crank out work.","thai":"ใช้พลังของคุณเพื่อทำงานให้เสร็จ"}
{"word":"crank","english":"Crank up the AC to cool off fast.","thai":"เปิดแอร์ให้เย็นเร็วขึ้น"}
{"word":"cool","english":"Cool vibes make the party more fun.","thai":"บรรยากาศเจ๋งๆ ทำให้ปาร์ตี้สนุกยิ่งขึ้น"}
{"word":"party","english":"The party fizzled out after midnight.","thai":"งานปาร์ตี้เงียบลงหลังเที่ยงคืน"}
{"word":"fizzle","english":"Don’t let your plans fizzle out quietly.","thai":"อย่าปล่อยให้แผนของคุณล้มเหลวเงียบๆ"}
{"word":"plan","english":"Plan a fun outing to lift spirits.","thai":"วางแผนออกไปเที่ยวสนุกๆ เพื่อยกระดับจิตใจ"}
{"word":"lift","english":"Lift your game to impress the team.","thai":"ยกระดับการเล่นเพื่อสร้างความประทับใจให้ทีม"}
{"word":"impress","english":"Impress your boss with a solid pitch.","thai":"สร้างความประทับใจให้เจ้านายด้วยการนำเสนอที่แข็งแกร่ง"}
{"word":"pitch","english":"A great pitch can seal the deal.","thai":"การนำเสนอที่ดีสามารถปิดดีลได้"}
{"word":"deal","english":"Strike a deal to move things forward.","thai":"ตกลงเพื่อให้ทุกอย่างดำเนินต่อ"}
{"word":"move","english":"Move fast to catch the early train.","thai":"เคลื่อนไหวเร็วเพื่อขึ้นรถไฟรอบเช้า"}
{"word":"catch","english":"Catch up on emails to stay organized.","thai":"ตามอ่านอีเมลเพื่อให้เป็นระเบียบ"}
{"word":"stay","english":"Stay sharp to keep up with trends.","thai":"รักษาความเฉียบคมเพื่อตามเทรนด์"}
{"word":"keep","english":"Keep your focus to nail the exam.","thai":"จดจ่อเพื่อสอบให้ผ่าน"}
{"word":"nail","english":"Nail down details to avoid mistakes.","thai":"จัดการรายละเอียดเพื่อหลีกเลี่ยงข้อผิดพลาด"}
{"word":"avoid","english":"Avoid stress by planning your day well.","thai":"หลีกเลี่ยงความเครียดด้วยการวางแผนวันให้ดี"}
{"word":"stress","english":"Stress can sneak up during busy weeks.","thai":"ความเครียดอาจมาเงียบๆ ในสัปดาห์ที่วุ่นวาย"}
{"word":"sneak","english":"Sneak in a workout to boost energy.","thai":"แอบออกกำลังกายเพื่อเพิ่มพลัง"}
{"word":"boost","english":"Boost your mood with a quick run.","thai":"เพิ่มอารมณ์ดีด้วยการวิ่งสั้นๆ"}
{"word":"mood","english":"A good mood helps you shine at work.","thai":"อารมณ์ดีช่วยให้คุณโดดเด่นในที่ทำงาน"}
{"word":"shine","english":"Shine bright with a confident attitude.","thai":"เปล่งประกายด้วยทัศนคติที่มั่นใจ"}
{"word":"confident","english":"A confident vibe can win over clients.","thai":"บรรยากาศที่มั่นใจสามารถชนะใจลูกค้า"}
{"word":"win","english":"Win the game by playing it smart.","thai":"ชนะเกมด้วยการเล่นอย่างชาญฉลาด"}
{"word":"play","english":"Play music to set a chill vibe.","thai":"เล่นดนตรีเพื่อสร้างบรรยากาศผ่อนคลาย"}
{"word":"set","english":"Set aside time to hang out with friends.","thai":"จัดสรรเวลาเพื่อไปนั่งเล่นกับเพื่อน"}
{"word":"hang","english":"Hang out at the beach to unwind.","thai":"ไปนั่งเล่นที่ชายหาดเพื่อผ่อนคลาย"}
{"word":"unwind","english":"Unwind with a book after a long day.","thai":"ผ่อนคลายด้วยหนังสือหลังวันที่ยาวนาน"}
{"word":"book","english":"A good book can spark new ideas.","thai":"หนังสือดีๆ สามารถจุดประกายไอเดียใหม่"}
{"word":"idea","english":"A fresh idea can turn things around.","thai":"ไอเดียใหม่สามารถเปลี่ยนสถานการณ์ได้"}
{"word":"turn","english":"Turn down distractions to focus better.","thai":"ลดสิ่งรบกวนเพื่อจดจ่อได้ดีขึ้น"}
{"word":"focus","english":"Focus hard to pull off big wins.","thai":"จดจ่ออย่างมากเพื่อคว้าชัยชนะใหญ่"}
{"word":"pull","english":"Pull together a team to tackle challenges.","thai":"รวมทีมเพื่อรับมือความท้าทาย"}
{"word":"tackle","english":"Tackle tough tasks with a clear plan.","thai":"จัดการงานยากๆ ด้วยแผนที่ชัดเจน"}
{"word":"clear","english":"Clear out your schedule for some downtime.","thai":"เคลียร์ตารางเพื่อให้มีเวลาว่าง"}
{"word":"downtime","english":"Downtime helps you recharge for the week.","thai":"เวลาว่างช่วยให้คุณเติมพลังสำหรับสัปดาห์"}
{"word":"recharge","english":"Recharge your spirit with a nature hike.","thai":"เติมพลังจิตใจด้วยการเดินป่า"}
{"word":"spirit","english":"A strong spirit pushes you to keep going.","thai":"จิตวิญญาณที่แข็งแกร่งผลักดันให้คุณเดินหน้าต่อ"}
{"word":"push","english":"Push through doubts to achieve your goals.","thai":"ฝ่าฟันความสงสัยเพื่อบรรลุเป้าหมาย"}
{"word":"achieve","english":"Achieve success by staying true to yourself.","thai":"ประสบความสำเร็จด้วยการยึดมั่นในตัวเอง"}
{"word":"stay","english":"Stay true to your values under pressure.","thai":"ยึดมั่นในค่านิยมของคุณแม้อยู่ภายใต้แรงกดดัน"}
{"word":"true","english":"Stay true to yourself to build confidence.","thai":"ยึดมั่นในตัวเองเพื่อสร้างความมั่นใจ"}
{"word":"build","english":"Build up your skills to stand out.","thai":"พัฒนาทักษะเพื่อโดดเด่น"}
{"word":"stand","english":"Stand up for your ideas in meetings.","thai":"ยืนหยัดเพื่อแนวคิดของคุณในที่ประชุม"}
{"word":"idea","english":"A fresh idea can spark new projects.","thai":"ไอเดียใหม่สามารถจุดประกายโครงการใหม่"}
{"word":"spark","english":"Spark joy with a thoughtful gesture.","thai":"จุดประกายความสุขด้วยการกระทำที่ตั้งใจ"}
{"word":"joy","english":"Finding joy in small moments lifts your mood.","thai":"การพบความสุขในช่วงเวลาเล็กๆ ยกระดับอารมณ์"}
{"word":"lift","english":"Lift your spirits with a fun outing.","thai":"ยกระดับจิตใจด้วยการออกไปเที่ยวสนุกๆ"}
{"word":"fun","english":"Fun times with friends recharge your energy.","thai":"ช่วงเวลาสนุกกับเพื่อนเติมพลังให้คุณ"}
{"word":"recharge","english":"Recharge by taking a quick nap.","thai":"เติมพลังด้วยการงีบสั้นๆ"}
{"word":"nap","english":"A short nap can clear your mind.","thai":"การงีบสั้นๆ สามารถปลอดโปร่งจิตใจ"}
{"word":"clear","english":"Clear out distractions to focus better.","thai":"กำจัดสิ่งรบกวนเพื่อจดจ่อได้ดีขึ้น"}
{"word":"focus","english":"Focus hard to pull off big wins.","thai":"จดจ่ออย่างมากเพื่อคว้าชัยชนะใหญ่"}
{"word":"pull","english":"Pull together a plan to stay organized.","thai":"รวบรวมแผนเพื่อให้เป็นระเบียบ"}
{"word":"stay","english":"Stay calm to get through tough days.","thai":"รักษาความสงบเพื่อผ่านวันที่ยากลำบาก"}
{"word":"get","english":"Get over hurdles to chase your dreams.","thai":"ก้าวข้ามอุปสรรคเพื่อไล่ตามความฝัน"}
{"word":"chase","english":"Chase down goals with relentless effort.","thai":"ไล่ตามเป้าหมายด้วยความพยายามไม่หยุดยั้ง"}
{"word":"effort","english":"Effort pays off when you push forward.","thai":"ความพยายามได้ผลเมื่อคุณก้าวไปข้างหน้า"}
{"word":"push","english":"Push through challenges to grow stronger.","thai":"ฝ่าฟันความท้าทายเพื่อเติบโตแข็งแกร่ง"}
{"word":"grow","english":"Grow your network by reaching out often.","thai":"ขยายเครือข่ายด้วยการติดต่อบ่อยๆ"}
{"word":"reach","english":"Reach for the stars to achieve greatness.","thai":"เอื้อมถึงดวงดาวเพื่อบรรลุความยิ่งใหญ่"}
{"word":"achieve","english":"Achieve your goals by planning ahead.","thai":"บรรลุเป้าหมายด้วยการวางแผนล่วงหน้า"}
{"word":"plan","english":"Plan a trip to shake up your routine.","thai":"วางแผนทริปเพื่อเปลี่ยนกิจวัตร"}
{"word":"shake","english":"Shake off doubts to take on challenges.","thai":"สลัดความสงสัยเพื่อรับมือความท้าทาย"}
{"word":"take","english":"Take on new projects to level up.","thai":"รับงานใหม่เพื่อยกระดับ"}
{"word":"level","english":"Level up your skills with daily practice.","thai":"ยกระดับทักษะด้วยการฝึกฝนทุกวัน"}
{"word":"practice","english":"Practice hard to nail the performance.","thai":"ฝึกหนักเพื่อทำให้การแสดงสำเร็จ"}
{"word":"nail","english":"Nail the interview to land a job.","thai":"ทำให้สัมภาษณ์ผ่านเพื่อได้งาน"}
{"word":"land","english":"Land a big deal to boost your career.","thai":"ปิดดีลใหญ่เพื่อส่งเสริมอาชีพ"}
{"word":"boost","english":"Boost your mood with a quick workout.","thai":"เพิ่มอารมณ์ดีด้วยการออกกำลังกายสั้นๆ"}
{"word":"mood","english":"A good mood helps you shine at work.","thai":"อารมณ์ดีช่วยให้คุณโดดเด่นในที่ทำงาน"}
{"word":"shine","english":"Shine bright with a confident smile.","thai":"เปล่งประกายด้วยรอยยิ้มที่มั่นใจ"}
{"word":"confident","english":"A confident attitude can win over anyone.","thai":"ทัศนคติที่มั่นใจสามารถชนะใจทุกคน"}
{"word":"win","english":"Win the crowd with a killer speech.","thai":"ชนะใจผู้ฟังด้วยสุนทรพจน์ที่ยอดเยี่ยม"}
{"word":"speech","english":"A great speech can spark inspiration.","thai":"สุนทรพจน์ที่ดีสามารถจุดประกายแรงบันดาลใจ"}
{"word":"inspiration","english":"Find inspiration in nature to spark creativity.","thai":"หาแรงบันดาลใจจากธรรมชาติเพื่อจุดประกายความคิดสร้างสรรค์"}
{"word":"creativity","english":"Creativity flows when you let go of fear.","thai":"ความคิดสร้างสรรค์ไหลลื่นเมื่อคุณปล่อยวางความกลัว"}
{"word":"let","english":"Let loose at the party to have fun.","thai":"ปล่อยตัวในงานปาร์ตี้เพื่อสนุก"}
{"word":"fun","english":"Fun game nights bring friends closer.","thai":"คืนเล่นเกมสนุกๆ ทำให้เพื่อนสนิทกันมากขึ้น"}
{"word":"friend","english":"A true friend always shows up for you.","thai":"เพื่อนแท้มักจะอยู่เคียงข้างคุณ"}
{"word":"show","english":"Show off your talents at the open mic.","thai":"อวดความสามารถของคุณในงานโอเพ่นไมค์"}
{"word":"talent","english":"Talent shines when you put in effort.","thai":"ความสามารถเปล่งประกายเมื่อคุณทุ่มเท"}
{"word":"put","english":"Put aside distractions to crank out work.","thai":"วางสิ่งรบกวนไว้เพื่อทำงานให้เสร็จ"}
{"word":"crank","english":"Crank up the music for a dance vibe.","thai":"เพิ่มเสียงดนตรีเพื่อสร้างบรรยากาศเต้นรำ"}
{"word":"dance","english":"Dance like nobody’s watching to chill out.","thai":"เต้นราวกับไม่มีใครดูเพื่อผ่อนคลาย"}
{"word":"chill","english":"Chill with a book to wind down.","thai":"ผ่อนคลายกับหนังสือเพื่อพักผ่อน"}
{"word":"wind","english":"Wind down with a cozy evening at home.","thai":"ผ่อนคลายด้วยค่ำคืนแสนอบอุ่นที่บ้าน"}
{"word":"cozy","english":"A cozy blanket helps you drift off.","thai":"ผ้าห่มนุ่มๆ ช่วยให้คุณหลับง่าย"}
{"word":"drift","english":"Drift into daydreams during a quiet moment.","thai":"ล่องลอยไปในจินตนาการในช่วงเวลาเงียบสงบ"}
{"word":"quiet","english":"A quiet evening sets a peaceful vibe.","thai":"ค่ำคืนที่เงียบสงบสร้างบรรยากาศสงบ"}
{"word":"set","english":"Set out on a hike to clear your head.","thai":"ออกไปเดินป่าเพื่อปลอดโปร่งสมอง"}
{"word":"clear","english":"Clear your schedule to enjoy some downtime.","thai":"เคลียร์ตารางเพื่อเพลิดเพลินกับเวลาว่าง"}
{"word":"enjoy","english":"Enjoy a sunset to recharge your soul.","thai":"เพลิดเพลินกับพระอาทิตย์ตกเพื่อเติมพลังจิตใจ"}
{"word":"recharge","english":"Recharge your energy with a quick run.","thai":"เติมพลังด้วยการวิ่งสั้นๆ"}
{"word":"run","english":"Run errands early to free up time.","thai":"วิ่งทำธุระแต่เช้าเพื่อให้มีเวลาว่าง"}
{"word":"free","english":"Free up your afternoon for a fun project.","thai":"ปล่อยบ่ายให้ว่างสำหรับโปรเจกต์สนุกๆ"}
{"word":"project","english":"A creative project can spark new ideas.","thai":"โปรเจกต์สร้างสรรค์สามารถจุดประกายไอเดียใหม่"}
{"word":"idea","english":"A bold idea can shake up the team.","thai":"ไอเดียที่กล้าสามารถเปลี่ยนแปลงทีม"}
{"word":"shake","english":"Shake off stress with a quick workout.","thai":"สลัดความเครียดด้วยการออกกำลังกายสั้นๆ"}
{"word":"stress","english":"Stress can sneak up during busy weeks.","thai":"ความเครียดอาจมาเงียบๆ ในสัปดาห์ที่วุ่นวาย"}
{"word":"sneak","english":"Sneak in a nap to boost your mood.","thai":"แอบงีบเพื่อเพิ่มอารมณ์ดี"}
{"word":"boost","english":"Boost your confidence with a new look.","thai":"เพิ่มความมั่นใจด้วยลุคใหม่"}
{"word":"confidence","english":"Confidence helps you speak up clearly.","thai":"ความมั่นใจช่วยให้คุณพูดอย่างชัดเจน"}
{"word":"speak","english":"Speak out to stand up for justice.","thai":"พูดออกมาเพื่อยืนหยัดเพื่อความยุติธรรม"}
{"word":"stand","english":"Stand tall to inspire those around you.","thai":"ยืนเด่นเพื่อสร้างแรงบันดาลใจให้คนรอบข้าง"}
{"word":"inspire","english":"Inspire others by chasing your dreams.","thai":"สร้างแรงบันดาลใจให้ผู้อื่นด้วยการไล่ตามความฝัน"}
{"word":"dreams","english":"Follow your dreams with relentless passion.","thai":"ตามความฝันของคุณด้วยความหลงใหลไม่หยุดยั้ง"}
{"word":"passion","english":"Passion drives you to push past limits.","thai":"ความหลงใหลผลักดันให้คุณก้าวข้ามขีดจำกัด"}
{"word":"push","english":"Push through doubts to achieve success.","thai":"ฝ่าฟันความสงสัยเพื่อบรรลุความสำเร็จ"}
{"word":"achieve","english":"Achieve greatness by staying true to yourself.","thai":"บรรลุความยิ่งใหญ่ด้วยการยึดมั่นในตัวเอง"}
{"word":"true","english":"True friends always show up when needed.","thai":"เพื่อนแท้มักจะปรากฏตัวเมื่อต้องการ"}
{"word":"show","english":"Show off your skills at the talent night.","thai":"อวดทักษะในคืนแสดงความสามารถ"}
{"word":"skill","english":"Skill and practice help you nail challenges.","thai":"ทักษะและการฝึกฝนช่วยให้คุณจัดการความท้าทาย"}
{"word":"nail","english":"Nail the presentation to impress the boss.","thai":"ทำให้การนำเสนอสำเร็จเพื่อสร้างความประทับใจให้เจ้านาย"}
{"word":"impress","english":"Impress your team with a bold plan.","thai":"สร้างความประทับใจให้ทีมด้วยแผนที่กล้า"}
{"word":"plan","english":"Plan ahead to avoid last-minute chaos.","thai":"วางแผนล่วงหน้าเพื่อหลีกเลี่ยงความวุ่นวายนาทีสุดท้าย"}
{"word":"avoid","english":"Avoid distractions to keep your focus sharp.","thai":"หลีกเลี่ยงสิ่งรบกวนเพื่อรักษาสมาธิให้เฉียบคม"}
{"word":"focus","english":"Focus on priorities to get ahead.","thai":"จดจ่อกับสิ่งสำคัญเพื่อก้าวหน้า"}
{"word":"get","english":"Get over fears to unlock your potential.","thai":"ก้าวข้ามความกลัวเพื่อปลดล็อกศักยภาพ"}
{"word":"unlock","english":"Unlock new opportunities by taking risks.","thai":"ปลดล็อกโอกาสใหม่ด้วยการกล้าเสี่ยง"}
{"word":"risk","english":"Taking a risk can lead to big rewards.","thai":"การเสี่ยงอาจนำไปสู่รางวัลใหญ่"}
{"word":"reward","english":"Hard work brings its own reward over time.","thai":"การทำงานหนักนำรางวัลมาให้เมื่อเวลาผ่านไป"}
{"word":"time","english":"Time flies when you’re having fun.","thai":"เวลาผ่านไปเร็วเมื่อคุณสนุก"}
{"word":"fun","english":"A fun outing can lift your mood.","thai":"การออกไปเที่ยวสนุกๆ สามารถยกระดับอารมณ์"}
{"word":"lift","english":"Lift weights to build up strength.","thai":"ยกน้ำหนักเพื่อเสริมสร้างความแข็งแรง"}
{"word":"build","english":"Build a strong team to tackle projects.","thai":"สร้างทีมที่แข็งแกร่งเพื่อรับมือโครงการ"}
{"word":"tackle","english":"Tackle tough tasks with a clear mind.","thai":"จัดการงานยากๆ ด้วยจิตใจที่ปลอดโปร่ง"}
{"word":"clear","english":"Clear out clutter to free up space.","thai":"กำจัดความรกเพื่อให้มีพื้นที่ว่าง"}
{"word":"free","english":"Free up your evening for a cozy dinner.","thai":"ปล่อยให้ตอนเย็นว่างสำหรับมื้อเย็นแสนอบอุ่น"}
{"word":"dinner","english":"Dinner with friends sparks great conversations.","thai":"มื้อเย็นกับเพื่อนจุดประกายบทสนทนาดีๆ"}
{"word":"spark","english":"Spark excitement with a new adventure.","thai":"จุดประกายความตื่นเต้นด้วยการผจญภัยใหม่"}
{"word":"adventure","english":"An adventure abroad can broaden your horizons.","thai":"การผจญภัยในต่างประเทศสามารถขยายขอบเขตของคุณ"}
{"word":"broaden","english":"Broaden your skills to stand out at work.","thai":"ขยายทักษะเพื่อโดดเด่นในที่ทำงาน"}
{"word":"stand","english":"Stand up for what you believe in.","thai":"ยืนหยัดเพื่อสิ่งที่คุณเชื่อ"}
{"word":"believe","english":"Believe in yourself to push through doubts.","thai":"เชื่อมั่นในตัวเองเพื่อฝ่าฟันความสงสัย"}
{"word":"push","english":"Push your limits to grow stronger.","thai":"ผลักดันขีดจำกัดเพื่อเติบโตแข็งแกร่ง"}
{"word":"grow","english":"Grow your confidence by trying new things.","thai":"พัฒนาความมั่นใจด้วยการลองสิ่งใหม่"}
{"word":"try","english":"Try out a new recipe to spice up dinner.","thai":"ลองสูตรอาหารใหม่เพื่อเพิ่มสีสันให้มื้อเย็น"}
{"word":"spice","english":"Spice up your day with a bold adventure.","thai":"เพิ่มสีสันให้วันด้วยการผจญภัยที่กล้า"}
{"word":"adventure","english":"An adventure outdoors can lift your spirits.","thai":"การผจญภัยกลางแจ้งสามารถยกระดับจิตใจ"}
{"word":"lift","english":"Lift your mood with a fun workout.","thai":"ยกระดับอารมณ์ด้วยการออกกำลังกายสนุกๆ"}
{"word":"mood","english":"A good mood helps you shine at work.","thai":"อารมณ์ดีช่วยให้คุณโดดเด่นในที่ทำงาน"}
{"word":"shine","english":"Shine bright by showing off your skills.","thai":"เปล่งประกายด้วยการอวดทักษะของคุณ"}
{"word":"show","english":"Show up early to make a great impression.","thai":"มาถึง早くเพื่อสร้างความประทับใจที่ดี"}
{"word":"make","english":"Make time to chill with close friends.","thai":"หาเวลาเพื่อผ่อนคลายกับเพื่อนสนิท"}
{"word":"chill","english":"Chill out with music to ease stress.","thai":"ผ่อนคลายด้วยดนตรีเพื่อคลายเครียด"}
{"word":"stress","english":"Stress can sneak up during busy weeks.","thai":"ความเครียดอาจมาเงียบๆ ในสัปดาห์ที่วุ่นวาย"}
{"word":"sneak","english":"Sneak in a quick nap to recharge.","thai":"แอบงีบสั้นๆ เพื่อเติมพลัง"}
{"word":"recharge","english":"Recharge your energy with a short walk.","thai":"เติมพลังด้วยการเดินสั้นๆ"}
{"word":"walk","english":"Walk the dog to enjoy fresh air.","thai":"พาสุนัขไปเดินเล่นเพื่อสูดอากาศบริสุทธิ์"}
{"word":"enjoy","english":"Enjoy a cozy evening by the fire.","thai":"เพลิดเพลินกับค่ำคืนแสนอบอุ่นข้างเตาผิง"}
{"word":"cozy","english":"A cozy blanket helps you wind down.","thai":"ผ้าห่มนุ่มๆ ช่วยให้คุณผ่อนคลาย"}
{"word":"wind","english":"Wind down with a good book tonight.","thai":"ผ่อนคลายด้วยหนังสือดีๆ คืนนี้"}
{"word":"book","english":"A great book can spark new ideas.","thai":"หนังสือดีๆ สามารถจุดประกายไอเดียใหม่"}
{"word":"spark","english":"Spark creativity by trying new hobbies.","thai":"จุดประกายความคิดสร้างสรรค์ด้วยการลองงานอดิเรกใหม่"}
{"word":"try","english":"Try your best to pull off the project.","thai":"พยายามอย่างเต็มที่เพื่อทำให้โครงการสำเร็จ"}
{"word":"pull","english":"Pull together a team to tackle challenges.","thai":"รวมทีมเพื่อรับมือความท้าทาย"}
{"word":"tackle","english":"Tackle tough tasks with a clear mind.","thai":"จัดการงานยากๆ ด้วยจิตใจที่ปลอดโปร่ง"}
{"word":"clear","english":"Clear out clutter to free up space.","thai":"กำจัดความรกเพื่อให้มีพื้นที่ว่าง"}
{"word":"free","english":"Free up your schedule for some downtime.","thai":"ปล่อยตารางให้ว่างสำหรับเวลาพัก"}
{"word":"downtime","english":"Downtime helps you recharge for the week.","thai":"เวลาว่างช่วยให้คุณเติมพลังสำหรับสัปดาห์"}
{"word":"recharge","english":"Recharge your soul with a nature hike.","thai":"เติมพลังจิตใจด้วยการเดินป่า"}
{"word":"nature","english":"Nature inspires you to think outside the box.","thai":"ธรรมชาติสร้างแรงบันดาลใจให้คิดนอกกรอบ"}
{"word":"think","english":"Think through problems to find solutions.","thai":"คิดทบทวนปัญหาเพื่อหาทางแก้"}
{"word":"find","english":"Find time to catch up with friends.","thai":"หาเวลาเพื่อคุยอัพเดทกับเพื่อน"}
{"word":"catch","english":"Catch a break to relax and unwind.","thai":"พักสักหน่อยเพื่อผ่อนคลาย"}
{"word":"relax","english":"Relax by the beach to shake off stress.","thai":"ผ่อนคลายที่ชายหาดเพื่อสลัดความเครียด"}
{"word":"shake","english":"Shake up your routine with a new hobby.","thai":"เปลี่ยนกิจวัตรด้วยงานอดิเรกใหม่"}
{"word":"hobby","english":"A fun hobby can lift your spirits.","thai":"งานอดิเรกสนุกๆ สามารถยกระดับจิตใจ"}
{"word":"lift","english":"Lift weights to build up strength.","thai":"ยกน้ำหนักเพื่อเสริมสร้างความแข็งแรง"}
{"word":"build","english":"Build confidence by taking on challenges.","thai":"สร้างความมั่นใจด้วยการรับมือความท้าทาย"}
{"word":"confidence","english":"Confidence helps you stand out in a crowd.","thai":"ความมั่นใจช่วยให้คุณโดดเด่นในกลุ่มคน"}
{"word":"stand","english":"Stand up for your beliefs with courage.","thai":"ยืนหยัดเพื่อความเชื่อด้วยความกล้า"}
{"word":"courage","english":"Courage pushes you to chase your dreams.","thai":"ความกล้าผลักดันให้คุณไล่ตามความฝัน"}
{"word":"chase","english":"Chase down goals with relentless passion.","thai":"ไล่ตามเป้าหมายด้วยความหลงใหลไม่หยุดยั้ง"}
{"word":"passion","english":"Passion drives you to push past limits.","thai":"ความหลงใหลผลักดันให้คุณก้าวข้ามขีดจำกัด"}
{"word":"push","english":"Push through doubts to achieve success.","thai":"ฝ่าฟันความสงสัยเพื่อบรรลุความสำเร็จ"}
{"word":"achieve","english":"Achieve your goals by staying focused.","thai":"บรรลุเป้าหมายด้วยการจดจ่อ"}
{"word":"focus","english":"Focus on priorities to get ahead.","thai":"จดจ่อกับสิ่งสำคัญเพื่อก้าวหน้า"}
{"word":"get","english":"Get over fears to unlock potential.","thai":"ก้าวข้ามความกลัวเพื่อปลดล็อกศักยภาพ"}
{"word":"unlock","english":"Unlock new opportunities by taking risks.","thai":"ปลดล็อกโอกาสใหม่ด้วยการกล้าเสี่ยง"}
{"word":"risk","english":"Taking a risk can lead to big rewards.","thai":"การเสี่ยงอาจนำไปสู่รางวัลใหญ่"}
{"word":"reward","english":"Hard work brings its own reward over time.","thai":"การทำงานหนักนำรางวัลมาให้เมื่อเวลาผ่านไป"}
{"word":"time","english":"Time flies when you’re having fun.","thai":"เวลาผ่านไปเร็วเมื่อคุณสนุก"}
{"word":"fun","english":"A fun outing can brighten your day.","thai":"การออกไปเที่ยวสนุกๆ สามารถทำให้วันของคุณสดใส"}
{"word":"brighten","english":"Brighten your mood with a funny movie.","thai":"ทำให้อารมณ์ดีด้วยหนังตลก"}
{"word":"mood","english":"A good mood helps you nail the presentation.","thai":"อารมณ์ดีช่วยให้คุณทำให้การนำเสนอสำเร็จ"}
{"word":"nail","english":"Nail the interview to land a job.","thai":"ทำให้สัมภาษณ์ผ่านเพื่อได้งาน"}
{"word":"land","english":"Land a big deal to boost your career.","thai":"ปิดดีลใหญ่เพื่อส่งเสริมอาชีพ"}
{"word":"boost","english":"Boost your energy with a quick snack.","thai":"เพิ่มพลังด้วยของว่างสั้นๆ"}
{"word":"snack","english":"A tasty snack can tide you over.","thai":"ของว่างอร่อยๆ สามารถช่วยให้คุณอิ่มท้อง"}
{"word":"tide","english":"Tide over hunger with a hearty meal.","thai":"แก้หิวด้วยมื้ออาหารที่อิ่มหนำ"}
{"word":"meal","english":"A great meal sparks lively conversations.","thai":"มื้ออาหารดีๆ จุดประกายบทสนทนาคึกคัก"}
{"word":"spark","english":"Spark excitement with a bold new plan.","thai":"จุดประกายความตื่นเต้นด้วยแผนใหม่ที่กล้า"}
{"word":"plan","english":"Plan ahead to avoid last-minute stress.","thai":"วางแผนล่วงหน้าเพื่อหลีกเลี่ยงความเครียดนาทีสุดท้าย"}
{"word":"avoid","english":"Avoid distractions to keep your focus sharp.","thai":"หลีกเลี่ยงสิ่งรบกวนเพื่อรักษาสมาธิให้เฉียบคม"}
{"word":"keep","english":"Keep your cool when things heat up.","thai":"รักษาความสงบเมื่อสถานการณ์รุนแรง"}
{"word":"heat","english":"The heat can wear you out fast.","thai":"ความร้อนสามารถทำให้คุณเหนื่อยล้าได้เร็ว"}
{"word":"wear","english":"Wear comfy shoes to get through the day.","thai":"สวมรองเท้าสบายเพื่อผ่านวันได้"}
{"word":"get","english":"Get through challenges by staying calm.","thai":"ผ่านความท้าทายด้วยการสงบสติ"}
{"word":"stay","english":"Stay true to your goals under pressure.","thai":"ยึดมั่นในเป้าหมายแม้อยู่ภายใต้แรงกดดัน"}
{"word":"true","english":"True friends always show up for you.","thai":"เพื่อนแท้มักจะอยู่เคียงข้างคุณ"}
{"word":"show","english":"Show off your talents at the open mic.","thai":"อวดความสามารถของคุณในงานโอเพ่นไมค์"}
{"word":"talent","english":"Talent shines when you put in effort.","thai":"ความสามารถเปล่งประกายเมื่อคุณทุ่มเท"}
{"word":"put","english":"Put aside doubts to take on challenges.","thai":"วางความสงสัยไว้เพื่อรับมือความท้าทาย"}
{"word":"take","english":"Take on new projects to level up.","thai":"รับงานใหม่เพื่อยกระดับ"}
{"word":"level","english":"Level up your skills with daily practice.","thai":"ยกระดับทักษะด้วยการฝึกฝนทุกวัน"}
{"word":"practice","english":"Practice hard to nail the performance.","thai":"ฝึกหนักเพื่อทำให้การแสดงสำเร็จ"}
{"word":"nail","english":"Nail the pitch to win over clients.","thai":"ทำให้การนำเสนอสำเร็จเพื่อชนะใจลูกค้า"}
{"word":"win","english":"Win the game by playing it smart.","thai":"ชนะเกมด้วยการเล่นอย่างชาญฉลาด"}
{"word":"play","english":"Play music to set a chill vibe.","thai":"เล่นดนตรีเพื่อสร้างบรรยากาศผ่อนคลาย"}
{"word":"set","english":"Set aside time to hang out with friends.","thai":"จัดสรรเวลาเพื่อไปนั่งเล่นกับเพื่อน"}
{"word":"hang","english":"Hang out at the park to catch up.","thai":"ไปนั่งเล่นที่สวนสาธารณะเพื่อคุยอัพเดท"}
{"word":"catch","english":"Catch a break to clear your mind.","thai":"พักสักหน่อยเพื่อปลอดโปร่งจิตใจ"}
{"word":"clear","english":"Clear out your schedule for some fun.","thai":"เคลียร์ตารางเพื่อความสนุก"}
{"word":"fun","english":"Fun nights out can spark great memories.","thai":"คืนสนุกๆ สามารถจุดประกายความทรงจำดีๆ"}
{"word":"spark","english":"Spark inspiration with a creative project.","thai":"จุดประกายแรงบันดาลใจด้วยโปรเจกต์สร้างสรรค์"}
{"word":"inspiration","english":"Inspiration strikes when you least expect it.","thai":"แรงบันดาลใจมาถึงเมื่อคุณคาดไม่ถึง"}
{"word":"strike","english":"Strike up a conversation to make friends.","thai":"เริ่มบทสนทนาเพื่อสร้างมิตร"}
{"word":"make","english":"Make a bold move to shake things up.","thai":"ทำการเคลื่อนไหวที่กล้าเพื่อเปลี่ยนแปลงสิ่งต่างๆ"}
{"word":"shake","english":"Shake off nerves before the big speech.","thai":"สลัดความประหม่าก่อนสุนทรพจน์ครั้งใหญ่"}
{"word":"speech","english":"A powerful speech can lift the crowd.","thai":"สุนทรพจน์ที่ทรงพลังสามารถยกระดับผู้ฟัง"}
{"word":"lift","english":"Lift your game to impress the coach.","thai":"ยกระดับการเล่นเพื่อสร้างความประทับใจให้โค้ช"}
{"word":"impress","english":"Impress your boss with a solid plan.","thai":"สร้างความประทับใจให้เจ้านายด้วยแผนที่แข็งแกร่ง"}
{"word":"plan","english":"Plan your day to avoid last-minute chaos.","thai":"วางแผนวันของคุณเพื่อหลีกเลี่ยงความวุ่นวายนาทีสุดท้าย"}
{"word":"avoid","english":"Avoid stress by staying organized.","thai":"หลีกเลี่ยงความเครียดด้วยการเป็นระเบียบ"}
{"word":"stay","english":"Stay focused to push through tough tasks.","thai":"จดจ่อเพื่อฝ่าฟันงานยากๆ"}
{"word":"push","english":"Push your limits to grow stronger.","thai":"ผลักดันขีดจำกัดเพื่อเติบโตแข็งแกร่ง"}
{"word":"grow","english":"Grow your skills to stand out professionally.","thai":"พัฒนาทักษะเพื่อโดดเด่นในสายงาน"}
{"word":"stand","english":"Stand up for yourself in tough situations.","thai":"ยืนหยัดเพื่อตัวเองในสถานการณ์ยากลำบาก"}
{"word":"tough","english":"Tough times call for digging deep.","thai":"ช่วงเวลายากลำบากต้องการความพยายามอย่างมาก"}
{"word":"dig","english":"Dig into a project to spark creativity.","thai":"ดำดิ่งสู่โปรเจกต์เพื่อจุดประกายความคิดสร้างสรรค์"}
{"word":"spark","english":"Spark excitement with a new challenge.","thai":"จุดประกายความตื่นเต้นด้วยความท้าทายใหม่"}
{"word":"challenge","english":"A challenge can bring out your best.","thai":"ความท้าทายสามารถดึงสิ่งที่ดีที่สุดของคุณออกมา"}
{"word":"bring","english":"Bring your A-game to nail the deal.","thai":"นำความสามารถที่ดีที่สุดมาเพื่อปิดดีล"}
{"word":"nail","english":"Nail the audition to land a role.","thai":"ทำให้ออดิชันผ่านเพื่อได้บทบาท"}
{"word":"land","english":"Land a new job to boost your career.","thai":"ได้งานใหม่เพื่อส่งเสริมอาชีพ"}
{"word":"boost","english":"Boost your confidence with a bold look.","thai":"เพิ่มความมั่นใจด้วยลุคที่กล้า"}
{"word":"confidence","english":"Confidence helps you stand out in a crowd.","thai":"ความมั่นใจช่วยให้คุณโดดเด่นในกลุ่มคน"}
{"word":"stand","english":"Stand up for your beliefs with courage.","thai":"ยืนหยัดเพื่อความเชื่อด้วยความกล้า"}
{"word":"courage","english":"Courage pushes you to take on challenges.","thai":"ความกล้าผลักดันให้คุณรับมือความท้าทาย"}
{"word":"take","english":"Take on new projects to spark creativity.","thai":"รับงานใหม่เพื่อจุดประกายความคิดสร้างสรรค์"}
{"word":"spark","english":"Spark excitement with a fun adventure.","thai":"จุดประกายความตื่นเต้นด้วยการผจญภัยสนุกๆ"}
{"word":"fun","english":"Fun outings lift your spirits high.","thai":"การออกไปเที่ยวสนุกๆ ยกระดับจิตใจ"}
{"word":"lift","english":"Lift weights to build up strength.","thai":"ยกน้ำหนักเพื่อเสริมสร้างความแข็งแรง"}
{"word":"build","english":"Build a solid plan to nail the deal.","thai":"สร้างแผนที่มั่นคงเพื่อปิดดีล"}
{"word":"nail","english":"Nail the presentation to impress your boss.","thai":"ทำให้การนำเสนอสำเร็จเพื่อสร้างความประทับใจให้เจ้านาย"}
{"word":"impress","english":"Impress your team with a bold idea.","thai":"สร้างความประทับใจให้ทีมด้วยไอเดียที่กล้า"}
{"word":"idea","english":"A fresh idea can shake up the routine.","thai":"ไอเดียใหม่สามารถเปลี่ยนกิจวัตร"}
{"word":"shake","english":"Shake off stress with a quick workout.","thai":"สลัดความเครียดด้วยการออกกำลังกายสั้นๆ"}
{"word":"stress","english":"Stress can sneak up during busy weeks.","thai":"ความเครียดอาจมาเงียบๆ ในสัปดาห์ที่วุ่นวาย"}
{"word":"sneak","english":"Sneak in a nap to recharge your energy.","thai":"แอบงีบเพื่อเติมพลัง"}
{"word":"recharge","english":"Recharge your soul with a nature hike.","thai":"เติมพลังจิตใจด้วยการเดินป่า"}
{"word":"nature","english":"Nature inspires you to think outside the box.","thai":"ธรรมชาติสร้างแรงบันดาลใจให้คิดนอกกรอบ"}
{"word":"think","english":"Think through problems to find solutions.","thai":"คิดทบทวนปัญหาเพื่อหาทางแก้"}
{"word":"find","english":"Find time to catch up with friends.","thai":"หาเวลาเพื่อคุยอัพเดทกับเพื่อน"}
{"word":"catch","english":"Catch a break to relax and unwind.","thai":"พักสักหน่อยเพื่อผ่อนคลาย"}
{"word":"relax","english":"Relax by the beach to clear your mind.","thai":"ผ่อนคลายที่ชายหาดเพื่อปลอดโปร่งจิตใจ"}
{"word":"clear","english":"Clear out clutter to free up space.","thai":"กำจัดความรกเพื่อให้มีพื้นที่ว่าง"}
{"word":"free","english":"Free up your evening for a cozy dinner.","thai":"ปล่อยให้ตอนเย็นว่างสำหรับมื้อเย็นแสนอบอุ่น"}
{"word":"dinner","english":"Dinner with friends sparks great conversations.","thai":"มื้อเย็นกับเพื่อนจุดประกายบทสนทนาดีๆ"}
{"word":"spark","english":"Spark joy with a thoughtful gift.","thai":"จุดประกายความสุขด้วยของขวัญที่ตั้งใจ"}
{"word":"joy","english":"Joy fills the room during game nights.","thai":"ความสุขเต็มห้องในคืนเล่นเกม"}
{"word":"game","english":"Game nights bring out your competitive side.","thai":"คืนเล่นเกมดึงด้านการแข่งขันของคุณออกมา"}
{"word":"bring","english":"Bring your A-game to win the match.","thai":"นำความสามารถที่ดีที่สุดมาเพื่อชนะการแข่งขัน"}
{"word":"win","english":"Win over clients with a confident pitch.","thai":"ชนะใจลูกค้าด้วยการนำเสนอที่มั่นใจ"}
{"word":"confident","english":"A confident attitude helps you shine bright.","thai":"ทัศนคติที่มั่นใจช่วยให้คุณเปล่งประกาย"}
{"word":"shine","english":"Shine at the party with your dance moves.","thai":"โดดเด่นในงานปาร์ตี้ด้วยท่าเต้นของคุณ"}
{"word":"dance","english":"Dance like nobody’s watching to let loose.","thai":"เต้นราวกับไม่มีใครดูเพื่อปล่อยตัว"}
{"word":"let","english":"Let go of worries to find peace.","thai":"ปล่อยวางความกังวลเพื่อหาความสงบ"}
{"word":"find","english":"Find inspiration in music to lift your mood.","thai":"หาแรงบันดาลใจจากดนตรีเพื่อยกระดับอารมณ์"}
{"word":"lift","english":"Lift your spirits with a fun outing.","thai":"ยกระดับจิตใจด้วยการออกไปเที่ยวสนุกๆ"}
{"word":"fun","english":"Fun activities help you recharge your energy.","thai":"กิจกรรมสนุกๆ ช่วยเติมพลังให้คุณ"}
{"word":"recharge","english":"Recharge your phone before heading out.","thai":"ชาร์จโทรศัพท์ก่อนออกไป"}
{"word":"head","english":"Head to the gym to work off stress.","thai":"ไปยิมเพื่อออกกำลังกายคลายเครียด"}
{"word":"work","english":"Work smart to pull off big projects.","thai":"ทำงานอย่างชาญฉลาดเพื่อทำให้โครงการใหญ่สำเร็จ"}
{"word":"pull","english":"Pull together a plan to stay organized.","thai":"รวบรวมแผนเพื่อให้เป็นระเบียบ"}
{"word":"stay","english":"Stay focused to get through tough tasks.","thai":"จดจ่อเพื่อผ่านงานยากๆ"}
{"word":"get","english":"Get over doubts to chase your goals.","thai":"ก้าวข้ามความสงสัยเพื่อไล่ตามเป้าหมาย"}
{"word":"chase","english":"Chase down dreams with relentless passion.","thai":"ไล่ตามความฝันด้วยความหลงใหลไม่หยุดยั้ง"}
{"word":"passion","english":"Passion drives you to push past limits.","thai":"ความหลงใหลผลักดันให้คุณก้าวข้ามขีดจำกัด"}
{"word":"push","english":"Push through challenges to achieve success.","thai":"ฝ่าฟันความท้าทายเพื่อบรรลุความสำเร็จ"}
{"word":"achieve","english":"Achieve your goals by planning ahead.","thai":"บรรลุเป้าหมายด้วยการวางแผนล่วงหน้า"}
{"word":"plan","english":"Plan a trip to shake up your routine.","thai":"วางแผนทริปเพื่อเปลี่ยนกิจวัตร"}
{"word":"shake","english":"Shake off nerves before the big speech.","thai":"สลัดความประหม่าก่อนสุนทรพจน์ครั้งใหญ่"}
{"word":"speech","english":"A great speech can inspire the crowd.","thai":"สุนทรพจน์ที่ดีสามารถสร้างแรงบันดาลใจให้ผู้ฟัง"}
{"word":"inspire","english":"Inspire others by showing up with confidence.","thai":"สร้างแรงบันดาลใจให้ผู้อื่นด้วยการปรากฏตัวอย่างมั่นใจ"}
{"word":"show","english":"Show off your skills at the talent night.","thai":"อวดทักษะในคืนแสดงความสามารถ"}
{"word":"skill","english":"Skill and effort help you nail the task.","thai":"ทักษะและความพยายามช่วยให้คุณจัดการงานสำเร็จ"}
{"word":"nail","english":"Nail the audition to land a role.","thai":"ทำให้ออดิชันผ่านเพื่อได้บทบาท"}
{"word":"land","english":"Land a new job to boost your career.","thai":"ได้งานใหม่เพื่อส่งเสริมอาชีพ"}
{"word":"boost","english":"Boost your mood with a quick run.","thai":"เพิ่มอารมณ์ดีด้วยการวิ่งสั้นๆ"}
{"word":"mood","english":"A good mood helps you shine at work.","thai":"อารมณ์ดีช่วยให้คุณโดดเด่นในที่ทำงาน"}
{"word":"shine","english":"Shine bright with a bold new look.","thai":"เปล่งประกายด้วยลุคใหม่ที่กล้า"}
{"word":"bold","english":"A bold move can turn things around.","thai":"การเคลื่อนไหวที่กล้าสามารถเปลี่ยนสถานการณ์"}
{"word":"turn","english":"Turn up the music for a fun vibe.","thai":"เพิ่มเสียงดนตรีเพื่อสร้างบรรยากาศสนุกๆ"}
{"word":"fun","english":"Fun nights out spark great memories.","thai":"คืนสนุกๆ จุดประกายความทรงจำดีๆ"}
{"word":"spark","english":"Spark creativity with a new project.","thai":"จุดประกายความคิดสร้างสรรค์ด้วยโปรเจกต์ใหม่"}
{"word":"project","english":"A cool project can lift your spirits.","thai":"โปรเจกต์เจ๋งๆ สามารถยกระดับจิตใจ"}
{"word":"lift","english":"Lift weights to build up your strength.","thai":"ยกน้ำหนักเพื่อเสริมสร้างความแข็งแรง"}
{"word":"build","english":"Build a strong team to tackle challenges.","thai":"สร้างทีมที่แข็งแกร่งเพื่อรับมือความท้าทาย"}
{"word":"tackle","english":"Tackle tough tasks with a clear plan.","thai":"จัดการงานยากๆ ด้วยแผนที่ชัดเจน"}
{"word":"clear","english":"Clear out your schedule for some downtime.","thai":"เคลียร์ตารางเพื่อให้มีเวลาว่าง"}
{"word":"downtime","english":"Downtime helps you recharge for the week.","thai":"เวลาว่างช่วยให้คุณเติมพลังสำหรับสัปดาห์"}
{"word":"recharge","english":"Recharge your energy with a nature walk.","thai":"เติมพลังด้วยการเดินในธรรมชาติ"}
{"word":"walk","english":"Walk the dog to enjoy fresh air.","thai":"พาสุนัขไปเดินเล่นเพื่อสูดอากาศบริสุทธิ์"}
{"word":"enjoy","english":"Enjoy a cozy evening by the fireplace.","thai":"เพลิดเพลินกับค่ำคืนแสนอบอุ่นข้างเตาผิง"}
{"word":"cozy","english":"A cozy blanket helps you wind down.","thai":"ผ้าห่มนุ่มๆ ช่วยให้คุณผ่อนคลาย"}
{"word":"wind","english":"Wind down with a good book tonight.","thai":"ผ่อนคลายด้วยหนังสือดีๆ คืนนี้"}
{"word":"book","english":"A great book can spark new ideas.","thai":"หนังสือดีๆ สามารถจุดประกายไอเดียใหม่"}
{"word":"idea","english":"A fresh idea can shake up the team.","thai":"ไอเดียใหม่สามารถเปลี่ยนแปลงทีม"}
{"word":"shake","english":"Shake off stress with a quick nap.","thai":"สลัดความเครียดด้วยการงีบสั้นๆ"}
{"word":"nap","english":"A short nap can clear your mind.","thai":"การงีบสั้นๆ สามารถปลอดโปร่งจิตใจ"}
{"word":"clear","english":"Clear out distractions to focus better.","thai":"กำจัดสิ่งรบกวนเพื่อจดจ่อได้ดีขึ้น"}
{"word":"focus","english":"Focus hard to pull off big wins.","thai":"จดจ่ออย่างมากเพื่อคว้าชัยชนะใหญ่"}
{"word":"pull","english":"Pull together resources to nail the project.","thai":"รวบรวมทรัพยากรเพื่อทำให้โครงการสำเร็จ"}
{"word":"nail","english":"Nail the interview to land a job.","thai":"ทำให้สัมภาษณ์ผ่านเพื่อได้งาน"}
{"word":"land","english":"Land a big deal to boost your career.","thai":"ปิดดีลใหญ่เพื่อส่งเสริมอาชีพ"}
{"word":"boost","english":"Boost your confidence with a new outfit.","thai":"เพิ่มความมั่นใจด้วยชุดใหม่"}
{"word":"confidence","english":"Confidence helps you stand out at work.","thai":"ความมั่นใจช่วยให้คุณโดดเด่นในที่ทำงาน"}
{"word":"stand","english":"Stand up for yourself in tough meetings.","thai":"ยืนหยัดเพื่อตัวเองในที่ประชุมที่ยากลำบาก"}
{"word":"tough","english":"Tough times call for digging deep.","thai":"ช่วงเวลายากลำบากต้องการความพยายามอย่างมาก"}
{"word":"dig","english":"Dig into a hobby to spark joy.","thai":"ดำดิ่งสู่งานอดิเรกเพื่อจุดประกายความสุข"}
{"word":"spark","english":"Spark excitement with a bold plan.","thai":"จุดประกายความตื่นเต้นด้วยแผนที่กล้า"}
{"word":"plan","english":"Plan ahead to avoid last-minute stress.","thai":"วางแผนล่วงหน้าเพื่อหลีกเลี่ยงความเครียดนาทีสุดท้าย"}
{"word":"avoid","english":"Avoid distractions to keep your focus sharp.","thai":"หลีกเลี่ยงสิ่งรบกวนเพื่อรักษาสมาธิให้เฉียบคม"}
{"word":"keep","english":"Keep your cool when things heat up.","thai":"รักษาความสงบเมื่อสถานการณ์รุนแรง"}
{"word":"heat","english":"The heat can wear you out fast.","thai":"ความร้อนสามารถทำให้คุณเหนื่อยล้าได้เร็ว"}
{"word":"wear","english":"Wear comfy shoes to get through the day.","thai":"สวมรองเท้าสบายเพื่อผ่านวันได้"}
{"word":"get","english":"Get over fears to chase your dreams.","thai":"ก้าวข้ามความกลัวเพื่อไล่ตามความฝัน"}
{"word":"chase","english":"Chase down goals with relentless passion.","thai":"ไล่ตามเป้าหมายด้วยความหลงใหลไม่หยุดยั้ง"}
{"word":"passion","english":"Passion drives you to push past limits.","thai":"ความหลงใหลผลักดันให้คุณก้าวข้ามขีดจำกัด"}
{"word":"push","english":"Push through doubts to achieve success.","thai":"ฝ่าฟันความสงสัยเพื่อบรรลุความสำเร็จ"}
{"word":"achieve","english":"Achieve your goals by staying true.","thai":"บรรลุเป้าหมายด้วยการยึดมั่นในตัวเอง"}
{"word":"true","english":"True friends always show up for you.","thai":"เพื่อนแท้มักจะอยู่เคียงข้างคุณ"}
{"word":"show","english":"Show off your talents at the open mic.","thai":"อวดความสามารถของคุณในงานโอเพ่นไมค์"}
{"word":"talent","english":"Talent shines when you put in effort.","thai":"ความสามารถเปล่งประกายเมื่อคุณทุ่มเท"}
{"word":"put","english":"Put aside distractions to focus on work.","thai":"วางสิ่งรบกวนไว้เพื่อจดจ่อกับงาน"}
{"word":"focus","english":"Focus hard to nail the big presentation.","thai":"จดจ่ออย่างมากเพื่อทำให้การนำเสนอใหญ่สำเร็จ"}
{"word":"nail","english":"Nail the interview to land a great job.","thai":"ทำให้สัมภาษณ์ผ่านเพื่อได้งานดีๆ"}
{"word":"land","english":"Land a big deal to boost your career.","thai":"ปิดดีลใหญ่เพื่อส่งเสริมอาชีพ"}
{"word":"boost","english":"Boost your mood with a quick workout.","thai":"เพิ่มอารมณ์ดีด้วยการออกกำลังกายสั้นๆ"}
{"word":"mood","english":"A good mood helps you shine at work.","thai":"อารมณ์ดีช่วยให้คุณโดดเด่นในที่ทำงาน"}
{"word":"shine","english":"Shine bright with a confident new look.","thai":"เปล่งประกายด้วยลุคใหม่ที่มั่นใจ"}
{"word":"confident","english":"A confident attitude can win over clients.","thai":"ทัศนคติที่มั่นใจสามารถชนะใจลูกค้า"}
{"word":"win","english":"Win the crowd with a killer speech.","thai":"ชนะใจผู้ฟังด้วยสุนทรพจน์ที่ยอดเยี่ยม"}
{"word":"speech","english":"A great speech can spark inspiration.","thai":"สุนทรพจน์ที่ดีสามารถจุดประกายแรงบันดาลใจ"}
{"word":"spark","english":"Spark creativity by trying new hobbies.","thai":"จุดประกายความคิดสร้างสรรค์ด้วยการลองงานอดิเรกใหม่"}
{"word":"try","english":"Try your best to pull off the project.","thai":"พยายามอย่างเต็มที่เพื่อทำให้โครงการสำเร็จ"}
{"word":"pull","english":"Pull together a team to tackle challenges.","thai":"รวมทีมเพื่อรับมือความท้าทาย"}
{"word":"tackle","english":"Tackle tough tasks with a clear mind.","thai":"จัดการงานยากๆ ด้วยจิตใจที่ปลอดโปร่ง"}
{"word":"clear","english":"Clear out clutter to free up space.","thai":"กำจัดความรกเพื่อให้มีพื้นที่ว่าง"}
{"word":"free","english":"Free up your evening for a cozy dinner.","thai":"ปล่อยให้ตอนเย็นว่างสำหรับมื้อเย็นแสนอบอุ่น"}
{"word":"dinner","english":"Dinner with friends sparks great conversations.","thai":"มื้อเย็นกับเพื่อนจุดประกายบทสนทนาดีๆ"}
{"word":"spark","english":"Spark joy with a thoughtful gift.","thai":"จุดประกายความสุขด้วยของขวัญที่ตั้งใจ"}
{"word":"joy","english":"Joy fills the room during fun gatherings.","thai":"ความสุขเต็มห้องในงานรวมตัวสนุกๆ"}
{"word":"fun","english":"Fun outings lift your spirits high.","thai":"การออกไปเที่ยวสนุกๆ ยกระดับจิตใจ"}
{"word":"lift","english":"Lift weights to build up strength.","thai":"ยกน้ำหนักเพื่อเสริมสร้างความแข็งแรง"}
{"word":"build","english":"Build confidence by taking on challenges.","thai":"สร้างความมั่นใจด้วยการรับมือความท้าทาย"}
{"word":"confidence","english":"Confidence helps you stand out in meetings.","thai":"ความมั่นใจช่วยให้คุณโดดเด่นในที่ประชุม"}
{"word":"stand","english":"Stand up for your beliefs with courage.","thai":"ยืนหยัดเพื่อความเชื่อด้วยความกล้า"}
{"word":"courage","english":"Courage pushes you to chase your dreams.","thai":"ความกล้าผลักดันให้คุณไล่ตามความฝัน"}
{"word":"chase","english":"Chase down goals with relentless passion.","thai":"ไล่ตามเป้าหมายด้วยความหลงใหลไม่หยุดยั้ง"}
{"word":"passion","english":"Passion drives you to push past limits.","thai":"ความหลงใหลผลักดันให้คุณก้าวข้ามขีดจำกัด"}
{"word":"push","english":"Push through doubts to achieve success.","thai":"ฝ่าฟันความสงสัยเพื่อบรรลุความสำเร็จ"}
{"word":"achieve","english":"Achieve your goals by staying focused.","thai":"บรรลุเป้าหมายด้วยการจดจ่อ"}
{"word":"focus","english":"Focus on priorities to get ahead.","thai":"จดจ่อกับสิ่งสำคัญเพื่อก้าวหน้า"}
{"word":"get","english":"Get over fears to unlock potential.","thai":"ก้าวข้ามความกลัวเพื่อปลดล็อกศักยภาพ"}
{"word":"unlock","english":"Unlock new opportunities by taking risks.","thai":"ปลดล็อกโอกาสใหม่ด้วยการกล้าเสี่ยง"}
{"word":"risk","english":"Taking a risk can lead to big rewards.","thai":"การเสี่ยงอาจนำไปสู่รางวัลใหญ่"}
{"word":"reward","english":"Hard work brings its own reward over time.","thai":"การทำงานหนักนำรางวัลมาให้เมื่อเวลาผ่านไป"}
{"word":"time","english":"Time flies when you’re having fun.","thai":"เวลาผ่านไปเร็วเมื่อคุณสนุก"}
{"word":"fun","english":"Fun game nights bring friends closer.","thai":"คืนเล่นเกมสนุกๆ ทำให้เพื่อนสนิทกันมากขึ้น"}
{"word":"friend","english":"A true friend always shows up for you.","thai":"เพื่อนแท้มักจะอยู่เคียงข้างคุณ"}
{"word":"show","english":"Show off your talents at the open mic.","thai":"อวดความสามารถของคุณในงานโอเพ่นไมค์"}
{"word":"talent","english":"Talent shines when you put in effort.","thai":"ความสามารถเปล่งประกายเมื่อคุณทุ่มเท"}
{"word":"put","english":"Put aside distractions to crank out work.","thai":"วางสิ่งรบกวนไว้เพื่อทำงานให้เสร็จ"}
{"word":"crank","english":"Crank up the music for a dance vibe.","thai":"เพิ่มเสียงดนตรีเพื่อสร้างบรรยากาศเต้นรำ"}
{"word":"dance","english":"Dance like nobody’s watching to let loose.","thai":"เต้นราวกับไม่มีใครดูเพื่อปล่อยตัว"}
{"word":"let","english":"Let go of stress to find peace.","thai":"ปล่อยวางความเครียดเพื่อหาความสงบ"}
{"word":"find","english":"Find inspiration in nature to spark ideas.","thai":"หาแรงบันดาลใจจากธรรมชาติเพื่อจุดประกายไอเดีย"}
{"word":"spark","english":"Spark excitement with a bold new plan.","thai":"จุดประกายความตื่นเต้นด้วยแผนใหม่ที่กล้า"}
{"word":"plan","english":"Plan ahead to avoid last-minute chaos.","thai":"วางแผนล่วงหน้าเพื่อหลีกเลี่ยงความวุ่นวายนาทีสุดท้าย"}
{"word":"avoid","english":"Avoid distractions to keep your focus sharp.","thai":"หลีกเลี่ยงสิ่งรบกวนเพื่อรักษาสมาธิให้เฉียบคม"}
{"word":"keep","english":"Keep your cool when things heat up.","thai":"รักษาความสงบเมื่อสถานการณ์รุนแรง"}
{"word":"heat","english":"The heat can wear you out fast.","thai":"ความร้อนสามารถทำให้คุณเหนื่อยล้าได้เร็ว"}
{"word":"wear","english":"Wear comfy shoes to get through the day.","thai":"สวมรองเท้าสบายเพื่อผ่านวันได้"}
{"word":"get","english":"Get through challenges by staying calm.","thai":"ผ่านความท้าทายด้วยการสงบสติ"}
{"word":"stay","english":"Stay true to your goals under pressure.","thai":"ยึดมั่นในเป้าหมายแม้อยู่ภายใต้แรงกดดัน"}
{"word":"true","english":"True friends always lift your spirits.","thai":"เพื่อนแท้มักจะยกระดับจิตใจของคุณ"}
{"word":"lift","english":"Lift weights to build up your strength.","thai":"ยกน้ำหนักเพื่อเสริมสร้างความแข็งแรง"}
{"word":"build","english":"Build a strong team to tackle projects.","thai":"สร้างทีมที่แข็งแกร่งเพื่อรับมือโครงการ"}
{"word":"tackle","english":"Tackle tough tasks with a clear mind.","thai":"จัดการงานยากๆ ด้วยจิตใจที่ปลอดโปร่ง"}
{"word":"clear","english":"Clear out your schedule for some downtime.","thai":"เคลียร์ตารางเพื่อให้มีเวลาว่าง"}
{"word":"downtime","english":"Downtime helps you recharge for the week.","thai":"เวลาว่างช่วยให้คุณเติมพลังสำหรับสัปดาห์"}
{"word":"recharge","english":"Recharge your energy with a nature hike.","thai":"เติมพลังด้วยการเดินป่า"}
{"word":"hike","english":"A hike in the mountains sparks adventure.","thai":"การเดินป่าในภูเขาจุดประกายการผจญภัย"}
{"word":"spark","english":"Spark creativity with a new project.","thai":"จุดประกายความคิดสร้างสรรค์ด้วยโปรเจกต์ใหม่"}
{"word":"project","english":"A cool project can lift your mood.","thai":"โปรเจกต์เจ๋งๆ สามารถยกระดับอารมณ์"}
{"word":"mood","english":"A good mood helps you shine at work.","thai":"อารมณ์ดีช่วยให้คุณโดดเด่นในที่ทำงาน"}
{"word":"shine","english":"Shine bright with a confident attitude.","thai":"เปล่งประกายด้วยทัศนคติที่มั่นใจ"}
{"word":"confident","english":"A confident vibe can win over anyone.","thai":"บรรยากาศที่มั่นใจสามารถชนะใจทุกคน"}
{"word":"win","english":"Win the game by playing it smart.","thai":"ชนะเกมด้วยการเล่นอย่างชาญฉลาด"}
{"word":"play","english":"Play music to set a chill vibe.","thai":"เล่นดนตรีเพื่อสร้างบรรยากาศผ่อนคลาย"}
{"word":"set","english":"Set aside time to hang out with friends.","thai":"จัดสรรเวลาเพื่อไปนั่งเล่นกับเพื่อน"}
{"word":"hang","english":"Hang out at the beach to unwind.","thai":"ไปนั่งเล่นที่ชายหาดเพื่อผ่อนคลาย"}
{"word":"unwind","english":"Unwind with a book after a long day.","thai":"ผ่อนคลายด้วยหนังสือหลังวันที่ยาวนาน"}
{"word":"book","english":"A great book can spark new ideas.","thai":"หนังสือดีๆ สามารถจุดประกายไอเดียใหม่"}
{"word":"idea","english":"A fresh idea can shake up the team.","thai":"ไอเดียใหม่สามารถเปลี่ยนแปลงทีม"}
{"word":"shake","english":"Shake off nerves before the big speech.","thai":"สลัดความประหม่าก่อนสุนทรพจน์ครั้งใหญ่"}
{"word":"speech","english":"A powerful speech can inspire the crowd.","thai":"สุนทรพจน์ที่ทรงพลังสามารถสร้างแรงบันดาลใจให้ผู้ฟัง"}
{"word":"inspire","english":"Inspire others by showing up with passion.","thai":"สร้างแรงบันดาลใจให้ผู้อื่นด้วยการปรากฏตัวด้วยความหลงใหล"}
{"word":"passion","english":"Passion drives you to push past doubts.","thai":"ความหลงใหลผลักดันให้คุณก้าวข้ามความสงสัย"}
{"word":"push","english":"Push through challenges to achieve your goals.","thai":"ฝ่าฟันความท้าทายเพื่อบรรลุเป้าหมาย"}
{"word":"achieve","english":"Achieve success by staying true to yourself.","thai":"ประสบความสำเร็จด้วยการยึดมั่นในตัวเอง"}
{"word":"true","english":"True friends always show up for you.","thai":"เพื่อนแท้มักจะอยู่เคียงข้างคุณ"}
{"word":"show","english":"Show off your skills at the talent night.","thai":"อวดทักษะในคืนแสดงความสามารถ"}
{"word":"skill","english":"Skill and practice help you nail challenges.","thai":"ทักษะและการฝึกฝนช่วยให้คุณจัดการความท้าทาย"}
{"word":"nail","english":"Nail the presentation to impress your boss.","thai":"ทำให้การนำเสนอสำเร็จเพื่อสร้างความประทับใจให้เจ้านาย"}
{"word":"impress","english":"Impress your team with a bold plan.","thai":"สร้างความประทับใจให้ทีมด้วยแผนที่กล้า"}
{"word":"plan","english":"Plan ahead to avoid last-minute stress.","thai":"วางแผนล่วงหน้าเพื่อหลีกเลี่ยงความเครียดนาทีสุดท้าย"}
{"word":"avoid","english":"Avoid distractions to keep your focus sharp.","thai":"หลีกเลี่ยงสิ่งรบกวนเพื่อรักษาสมาธิให้เฉียบคม"}
{"word":"keep","english":"Keep your cool when things heat up.","thai":"รักษาความสงบเมื่อสถานการณ์รุนแรง"}
{"word":"heat","english":"The heat can wear you out fast.","thai":"ความร้อนสามารถทำให้คุณเหนื่อยล้าได้เร็ว"}
{"word":"wear","english":"Wear comfy shoes to get through the day.","thai":"สวมรองเท้าสบายเพื่อผ่านวันได้"}
{"word":"get","english":"Get over fears to unlock your potential.","thai":"ก้าวข้ามความกลัวเพื่อปลดล็อกศักยภาพ"}
{"word":"unlock","english":"Unlock new opportunities by taking risks.","thai":"ปลดล็อกโอกาสใหม่ด้วยการกล้าเสี่ยง"}
{"word":"risk","english":"Taking a risk can spark big rewards.","thai":"การเสี่ยงอาจจุดประกายรางวัลใหญ่"}
{"word":"spark","english":"Spark creativity with a new hobby.","thai":"จุดประกายความคิดสร้างสรรค์ด้วยงานอดิเรกใหม่"}
{"word":"hobby","english":"A fun hobby can lift your spirits.","thai":"งานอดิเรกสนุกๆ สามารถยกระดับจิตใจ"}
{"word":"lift","english":"Lift weights to build up your strength.","thai":"ยกน้ำหนักเพื่อเสริมสร้างความแข็งแรง"}
{"word":"build","english":"Build a strong team to tackle projects.","thai":"สร้างทีมที่แข็งแกร่งเพื่อรับมือโครงการ"}
{"word":"tackle","english":"Tackle tough tasks with a clear mind.","thai":"จัดการงานยากๆ ด้วยจิตใจที่ปลอดโปร่ง"}
{"word":"clear","english":"Clear out clutter to free up space.","thai":"กำจัดความรกเพื่อให้มีพื้นที่ว่าง"}
{"word":"free","english":"Free up your evening for a cozy night.","thai":"ปล่อยให้ตอนเย็นว่างสำหรับคืนแสนอบอุ่น"}
{"word":"cozy","english":"A cozy blanket helps you wind down.","thai":"ผ้าห่มนุ่มๆ ช่วยให้คุณผ่อนคลาย"}
{"word":"wind","english":"Wind down with a good book tonight.","thai":"ผ่อนคลายด้วยหนังสือดีๆ คืนนี้"}
