{"word":"breathing","english":"Deep breathing calms my nerves before a big presentation.","thai":"การหายใจลึกๆ ช่วยให้ฉันสงบสติอารมณ์ก่อนการนำเสนอครั้งใหญ่"}
{"word":"calms","english":"A hot cup of tea calms me down after a long day.","thai":"ชาร้อนหนึ่งแก้วช่วยให้ฉันผ่อนคลายหลังจากวันที่ยาวนาน"}
{"word":"tea","english":"I spilled my tea while texting my friend.","thai":"ฉันทำชาหกขณะส่งข้อความหาเพื่อน"}
{"word":"texting","english":"Texting during class can get you in trouble.","thai":"การส่งข้อความระหว่างเรียนอาจทำให้คุณเดือดร้อน"}
{"word":"class","english":"The yoga class helps me find balance.","thai":"คลาสโยคะช่วยให้ฉันพบความสมดุล"}
{"word":"balance","english":"I need to balance work and play this weekend.","thai":"ฉันต้องรักษาสมดุลระหว่างงานและการพักผ่อนสุดสัปดาห์นี้"}
{"word":"work","english":"Teamwork makes the dream work at the office.","thai":"การทำงานเป็นทีมทำให้ความฝันเป็นจริงที่ออฟฟิศ"}
{"word":"teamwork","english":"Teamwork during the project led to awesome results.","thai":"การทำงานเป็นทีมในโปรเจกต์นำไปสู่ผลลัพธ์ที่ยอดเยี่ยม"}
{"word":"project","english":"I’m hyped to start my new art project.","thai":"ฉันตื่นเต้นที่จะเริ่มโปรเจกต์ศิลปะใหม่"}
{"word":"art","english":"Her street art totally blew my mind.","thai":"ศิลปะบนถนนของเธอทำให้ฉันทึ่งสุดๆ"}
{"word":"mind","english":"I changed my mind about joining the book club.","thai":"ฉันเปลี่ยนใจเกี่ยวกับการเข้าร่วมชมรมหนังสือ"}
{"word":"book","english":"I picked up a cool book at the thrift store.","thai":"ฉันหยิบหนังสือเจ๋งๆ มาจากร้านมือสอง"}
{"word":"store","english":"The grocery store ran out of my favorite chips.","thai":"ร้านขายของชำหมดชิปที่ฉันชอบ"}
{"word":"chips","english":"Chips and salsa are my go-to snack for movie night.","thai":"ชิปกับซัลซ่าเป็นของว่างประจำของฉันสำหรับคืนดูหนัง"}
{"word":"movie","english":"That new horror movie scared the pants off me.","thai":"หนังสยองขวัญใหม่นั้นทำให้ฉันกลัวจนตัวสั่น"}
{"word":"scared","english":"I got scared when my dog ran into traffic.","thai":"ฉันตกใจเมื่อสุนัขของฉันวิ่งเข้าไปในถนน"}
{"word":"dog","english":"My dog loves chasing squirrels in the park.","thai":"สุนัขของฉันชอบวิ่งไล่กระรอกในสวนสาธารณะ"}
{"word":"park","english":"We hung out at the park for a picnic.","thai":"เราไปนั่งเล่นที่สวนสาธารณะเพื่อปิกนิก"}
{"word":"picnic","english":"The picnic got rained out, so we stayed home.","thai":"ปิกนิกต้องยกเลิกเพราะฝนตก เลยอยู่บ้าน"}
{"word":"home","english":"Working from home boosts my productivity.","thai":"การทำงานจากบ้านช่วยเพิ่มประสิทธิภาพของฉัน"}
{"word":"productivity","english":"Good music pumps up my productivity.","thai":"ดนตรีดีๆ ช่วยกระตุ้นประสิทธิภาพของฉัน"}
{"word":"music","english":"Live music at the festival was straight fire.","thai":"ดนตรีสดที่งานเทศกาลมันสุดยอดมาก"}
{"word":"festival","english":"The food festival served up some dope dishes.","thai":"งานเทศกาลอาหารมีอาหารเจ๋งๆ เสิร์ฟเยอะมาก"}
{"word":"food","english":"I’m craving spicy food for dinner tonight.","thai":"ฉันอยากกินอาหารเผ็ดสำหรับมื้อเย็นคืนนี้"}
{"word":"dinner","english":"Cooking dinner with friends is always a blast.","thai":"การทำอาหารเย็นกับเพื่อนๆ สนุกสุดๆ เสมอ"}
{"word":"friends","english":"My friends dragged me to a karaoke night.","thai":"เพื่อนๆ ลากฉันไปคืนคาราโอเกะ"}
{"word":"night","english":"Stargazing at night clears my head.","thai":"การดูดาวตอนกลางคืนช่วยให้ฉันผ่อนคลาย"}
{"word":"head","english":"I can’t get that song out of my head.","thai":"ฉันเอาเพลงนั้นออกจากหัวไม่ได้"}
{"word":"song","english":"Writing a song for the band takes guts.","thai":"การแต่งเพลงให้วงต้องใช้ความกล้า"}
{"word":"band","english":"The band played a sick set at the club.","thai":"วงดนตรีเล่นเซ็ตเจ๊งสุดๆ ที่คลับ"}
{"word":"club","english":"Joining the hiking club was a game-changer.","thai":"การเข้าร่วมคลับเดินป่าคือตัวเปลี่ยนเกม"}
{"word":"hiking","english":"Hiking up the mountain wore me out.","thai":"การเดินป่าขึ้นเขาทำให้ฉันเหนื่อยสุดๆ"}
{"word":"mountain","english":"The mountain view from the cabin was unreal.","thai":"วิวภูเขาจากกระท่อมมันสุดยอดมาก"}
{"word":"view","english":"I love the view from my new apartment.","thai":"ฉันชอบวิวจากอพาร์ทเมนต์ใหม่ของฉัน"}
{"word":"apartment","english":"My apartment needs a deep clean this weekend.","thai":"อพาร์ทเมนต์ของฉันต้องทำความสะอาดครั้งใหญ่สุดสัปดาห์นี้"}
{"word":"clean","english":"I clean my desk to stay organized.","thai":"ฉันทำความสะอาดโต๊ะเพื่อให้เป็นระเบียบ"}
{"word":"desk","english":"My desk is piled high with research papers.","thai":"โต๊ะของฉันกองสูงไปด้วยเอกสารวิจัย"}
{"word":"research","english":"Her research on climate change blew me away.","thai":"งานวิจัยของเธอเกี่ยวกับการเปลี่ยนแปลงสภาพภูมิอากาศทำให้ฉันทึ่ง"}
{"word":"climate","english":"The climate here messes with my allergies.","thai":"สภาพอากาศที่นี่ทำให้ฉันแพ้หนัก"}
{"word":"allergies","english":"My allergies act up during spring blooms.","thai":"อาการแพ้ของฉันกำเริบช่วงดอกไม้บานในฤดูใบไม้ผลิ"}
{"word":"spring","english":"Spring break is perfect for road trips.","thai":"ช่วงปิดเทอมฤดูใบไม้ผลิเหมาะสำหรับการขับรถเที่ยว"}
{"word":"road","english":"The road trip took us through epic landscapes.","thai":"การขับรถเที่ยวพาเราผ่านทิวทัศน์สุดยอด"}
{"word":"trip","english":"I booked a trip to a beach resort.","thai":"ฉันจองทริปไปรีสอร์ทชายหาด"}
{"word":"beach","english":"The beach was packed with surfers.","thai":"ชายหาดเต็มไปด้วยนักโต้คลื่น"}
{"word":"surfers","english":"Surfers catch waves at dawn for the best rides.","thai":"นักโต้คลื่นจับคลื่นตอนรุ่งสางเพื่อการขี่ที่ดีที่สุด"}
{"word":"waves","english":"The waves crashed hard during the storm.","thai":"คลื่นซัดแรงในช่วงพายุ"}
{"word":"storm","english":"The storm knocked out our power last night.","thai":"พายุทำให้ไฟฟ้าดับเมื่อคืนนี้"}
{"word":"power","english":"Solar power is gaining traction in my town.","thai":"พลังงานแสงอาทิตย์กำลังได้รับความนิยมในเมืองของฉัน"}
{"word":"town","english":"The town fair had the best cotton candy.","thai":"งานเทศกาลเมืองมีสายไหมที่อร่อยที่สุด"}
{"word":"fair","english":"The job fair hooked me up with new leads.","thai":"งานจ้างงานช่วยให้ฉันได้โอกาสใหม่ๆ"}
{"word":"job","english":"I landed a job at a startup downtown.","thai":"ฉันได้งานที่สตาร์ทอัพในตัวเมือง"}
{"word":"startup","english":"The startup culture is super fast-paced.","thai":"วัฒนธรรมสตาร์ทอัพเร็วสุดๆ"}
{"word":"culture","english":"Pop culture shapes how we vibe online.","thai":"วัฒนธรรมป๊อปกำหนดวิธีที่เราเชื่อมต่อออนไลน์"}
{"word":"online","english":"Shopping online saves me so much time.","thai":"การช้อปปิ้งออนไลน์ช่วยประหยัดเวลาฉันเยอะมาก"}
{"word":"time","english":"Time flies when I’m gaming with friends.","thai":"เวลาเร็วมากเมื่อฉันเล่นเกมกับเพื่อนๆ"}
{"word":"gaming","english":"Gaming on my new console is next-level.","thai":"การเล่นเกมบนคอนโซลใหม่ของฉันมันสุดยอด"}
{"word":"console","english":"The console broke down mid-tournament.","thai":"คอนโซลพังระหว่างทัวร์นาเมนต์"}
{"word":"tournament","english":"The chess tournament got super intense.","thai":"การแข่งขันหมากรุกเข้มข้นสุดๆ"}
{"word":"chess","english":"Playing chess sharpens my focus.","thai":"การเล่นหมากรุกช่วยให้ฉันมีสมาธิมากขึ้น"}
{"word":"focus","english":"I lose focus when my phone keeps buzzing.","thai":"ฉันเสียสมาธิเมื่อโทรศัพท์ดังไม่หยุด"}
{"word":"phone","english":"My phone died during the video call.","thai":"โทรศัพท์ของฉันแบตหมดระหว่างวิดีโอคอล"}
{"word":"video","english":"I edited a video for my YouTube channel.","thai":"ฉันตัดต่อวิดีโอสำหรับช่องยูทูบของฉัน"}
{"word":"channel","english":"The cooking channel inspired my dinner menu.","thai":"ช่องทำอาหารเป็นแรงบันดาลใจให้เมนูอาหารเย็นของฉัน"}
{"word":"cooking","english":"Cooking with fresh herbs smells amazing.","thai":"การทำอาหารด้วยสมุนไพรสดหอมมาก"}
{"word":"herbs","english":"I grow herbs in my backyard garden.","thai":"ฉันปลูกสมุนไพรในสวนหลังบ้าน"}
{"word":"garden","english":"The community garden brings neighbors together.","thai":"สวนชุมชนทำให้เพื่อนบ้านใกล้ชิดกัน"}
{"word":"community","english":"The community center hosts dope events.","thai":"ศูนย์ชุมชนจัดงานเจ๋งๆ"}
{"word":"events","english":"Charity events make a real difference.","thai":"งานการกุศลสร้างความแตกต่างจริงๆ"}
{"word":"charity","english":"I donated clothes to a local charity.","thai":"ฉันบริจาคเสื้อผ้าให้การกุศลท้องถิ่น"}
{"word":"clothes","english":"New clothes always boost my confidence.","thai":"เสื้อผ้าใหม่ช่วยเพิ่มความมั่นใจให้ฉัน"}
{"word":"confidence","english":"Public speaking builds my confidence.","thai":"การพูดในที่สาธารณะช่วยสร้างความมั่นใจให้ฉัน"}
{"word":"speaking","english":"Speaking up in meetings gets easier with practice.","thai":"การพูดในที่ประชุมง่ายขึ้นเมื่อฝึกฝน"}
{"word":"meetings","english":"Virtual meetings save me commuting time.","thai":"การประชุมออนไลน์ช่วยประหยัดเวลาเดินทางของฉัน"}
{"word":"time","english":"Managing my time well keeps me sane.","thai":"การจัดการเวลาอย่างดีช่วยให้ฉันไม่เสียสติ"}
{"word":"managing","english":"Managing stress with meditation is a lifesaver.","thai":"การจัดการความเครียดด้วยการทำสมาธิช่วยชีวิตไว้"}
{"word":"meditation","english":"Meditation in the morning sets a chill vibe.","thai":"การทำสมาธิตอนเช้าสร้างบรรยากาศผ่อนคลาย"}
{"word":"morning","english":"Morning jogs kickstart my day.","thai":"การวิ่งตอนเช้าช่วยเริ่มวันของฉัน"}
{"word":"day","english":"A rainy day calls for cozy movie marathons.","thai":"วันที่ฝนตกเหมาะกับการดูหนังมาราธอนแบบอบอุ่น"}
{"word":"movie","english":"The movie theater was packed for the premiere.","thai":"โรงหนังแน่นไปด้วยผู้คนในรอบปฐมทัศน์"}
{"word":"theater","english":"The community theater put on a killer show.","thai":"โรงละครชุมชนจัดแสดงสุดยอด"}
{"word":"show","english":"The talent show had some wild performances.","thai":"การแสดงความสามารถมีโชว์ที่บ้าคลั่ง"}
{"word":"talent","english":"Her singing talent stole the spotlight.","thai":"พรสวรรค์ด้านการร้องเพลงของเธอโดดเด่น"}
{"word":"singing","english":"Singing in the shower is my daily jam.","thai":"ร้องเพลงในห้องน้ำคือความสนุกประจำวันของฉัน"}
{"word":"shower","english":"A hot shower melts away my tension.","thai":"การอาบน้ำร้อนช่วยคลายความตึงเครียด"}
{"word":"tension","english":"Workplace tension can mess with team vibes.","thai":"ความตึงเครียดในที่ทำงานอาจรบกวนบรรยากาศทีม"}
{"word":"team","english":"The soccer team crushed it at the finals.","thai":"ทีมฟุตบอลถล่มคู่แข่งในรอบชิง"}
{"word":"soccer","english":"Playing soccer with friends is pure fun.","thai":"การเล่นฟุตบอลกับเพื่อนๆ สนุกสุดๆ"}
{"word":"fun","english":"Board games are fun for family nights.","thai":"เกมกระดานสนุกสำหรับคืนครอบครัว"}
{"word":"games","english":"Mobile games keep me entertained on commutes.","thai":"เกมมือถือทำให้ฉันเพลิดเพลินระหว่างเดินทาง"}
{"word":"commutes","english":"Long commutes give me time to read.","thai":"การเดินทางไกลให้เวลาฉันอ่านหนังสือ"}
{"word":"read","english":"I read a thriller that kept me up all night.","thai":"ฉันอ่านนิยายระทึกขวัญที่ทำให้ฉันนอนไม่หลับทั้งคืน"}
{"word":"night","english":"Friday night pizza is a household tradition.","thai":"พิซซ่าคืนวันศุกร์คือประเพณีในบ้าน"}
{"word":"pizza","english":"I burned the pizza while chatting online.","thai":"ฉันเผลอเผาพิซซ่าขณะแชทออนไลน์"}
{"word":"chatting","english":"Chatting with coworkers sparks new ideas.","thai":"การคุยกับเพื่อนร่วมงานจุดประกายไอเดียใหม่ๆ"}
{"word":"ideas","english":"Brainstorming ideas for the project was a blast.","thai":"การระดมสมองหาไอเดียสำหรับโปรเจกต์สนุกมาก"}
{"word":"blast","english":"The concert was an absolute blast.","thai":"คอนเสิร์ตมันสุดยอดมาก"}
{"word":"concert","english":"The concert tickets sold out in minutes.","thai":"ตั๋วคอนเสิร์ตขายหมดในไม่กี่นาที"}
{"word":"tickets","english":"I scored tickets to the big game.","thai":"ฉันได้ตั๋วไปดูเกมใหญ่"}
{"word":"game","english":"Board game nights are my kind of fun.","thai":"คืนเล่นบอร์ดเกมคือความสนุกของฉัน"}
{"word":"fun","english":"Hiking is fun but wears me out.","thai":"การเดินป่าสนุกแต่ทำให้ฉันเหนื่อย"}
{"word":"hiking","english":"Hiking trails near the lake are stunning.","thai":"เส้นทางเดินป่าใกล้ทะเลสาบสวยงามมาก"}
{"word":"lake","english":"We went fishing at the lake yesterday.","thai":"เราไปตกปลาที่ทะเลสาบเมื่อวาน"}
{"word":"fishing","english":"Fishing with my dad is always chill.","thai":"การตกปลากับพ่อมันชิลล์เสมอ"}
{"word":"chill","english":"I like to chill with a good book.","thai":"ฉันชอบผ่อนคลายกับหนังสือดีๆ"}
{"word":"book","english":"This book club is totally my vibe.","thai":"คลับหนังสือนี้เข้ากับฉันสุดๆ"}
{"word":"club","english":"The dance club was lit last night.","thai":"คลับเต้นรำเมื่อคืนมันสุดยอด"}
{"word":"dance","english":"I busted a dance move at the party.","thai":"ฉันโชว์ท่าเต้นที่งานปาร์ตี้"}
{"word":"party","english":"The block party brought everyone together.","thai":"งานปาร์ตี้ในชุมชนทำให้ทุกคนใกล้ชิดกัน"}
{"word":"everyone","english":"Everyone showed up for the charity run.","thai":"ทุกคนมาร่วมงานวิ่งการกุศล"}
{"word":"charity","english":"Volunteering for charity feels so rewarding.","thai":"การเป็นอาสาสมัครเพื่อการกุศลรู้สึกคุ้มค่ามาก"}
{"word":"volunteering","english":"Volunteering at the shelter changed my perspective.","thai":"การเป็นอาสาที่ศูนย์พักพิงเปลี่ยนมุมมองของฉัน"}
{"word":"shelter","english":"The animal shelter needs more donations.","thai":"ศูนย์พักพิงสัตว์ต้องการการบริจาคเพิ่ม"}
{"word":"animal","english":"My animal instincts kicked in during trivia night.","thai":"สัญชาตญาณสัตว์ของฉันทำงานในคืนตอบคำถาม"}
{"word":"night","english":"Movie night at home is my favorite.","thai":"คืนดูหนังที่บ้านคือสิ่งที่ฉันชอบ"}
{"word":"movie","english":"The new movie got rave reviews.","thai":"หนังใหม่ได้รับคำชมอย่างล้นหลาม"}
{"word":"reviews","english":"I check reviews before buying gadgets.","thai":"ฉันเช็ครีวิวก่อนซื้ออุปกรณ์"}
{"word":"gadgets","english":"Tech gadgets make life so much easier.","thai":"อุปกรณ์เทคโนโลยีทำให้ชีวิตง่ายขึ้นเยอะ"}
{"word":"tech","english":"The tech conference was packed with innovators.","thai":"งานประชุมเทคโนโลยีเต็มไปด้วยนักนวัตกรรม"}
{"word":"conference","english":"I spoke at a conference about sustainability.","thai":"ฉันพูดในงานประชุมเกี่ยวกับความยั่งยืน"}
{"word":"sustainability","english":"Sustainability is key to our planet’s future.","thai":"ความยั่งยืนคือกุญแจสู่อนาคตของโลก"}
{"word":"planet","english":"Learning about our planet inspires me.","thai":"การเรียนรู้เกี่ยวกับโลกของเราทำให้ฉันมีแรงบันดาลใจ"}
{"word":"learning","english":"Learning to code opened new doors.","thai":"การเรียนเขียนโค้ดเปิดประตูใหม่ๆ"}
{"word":"code","english":"I debugged the code in record time.","thai":"ฉันแก้บั๊กโค้ดในเวลาที่เร็วเป็นประวัติการณ์"}
{"word":"time","english":"Time management is my biggest challenge.","thai":"การจัดการเวลาคือความท้าทายใหญ่ที่สุดของฉัน"}
{"word":"management","english":"Good management keeps the team on track.","thai":"การจัดการที่ดีทำให้ทีมอยู่ในร่องรอย"}
{"word":"team","english":"Our team pulled off an epic project.","thai":"ทีมของเราทำโปรเจกต์สุดยอดสำเร็จ"}
{"word":"project","english":"The art project took weeks to finish.","thai":"โปรเจกต์ศิลปะใช้เวลาหลายสัปดาห์กว่าจะเสร็จ"}
{"word":"art","english":"Street art always catches my eye.","thai":"ศิลปะบนถนนมักดึงดูดสายตาฉัน"}
{"word":"eye","english":"I couldn’t take my eye off the sunset.","thai":"ฉันละสายตาจากพระอาทิตย์ตกไม่ได้"}
{"word":"sunset","english":"The sunset hike was absolutely breathtaking.","thai":"การเดินป่าเพื่อดูพระอาทิตย์ตกสวยงามสุดๆ"}
{"word":"hike","english":"A morning hike clears my mind.","thai":"การเดินป่าตอนเช้าช่วยให้จิตใจฉันปลอดโปร่ง"}
{"word":"mind","english":"Meditation helps me keep my mind sharp.","thai":"การทำสมาธิช่วยให้จิตใจฉันเฉียบคม"}
{"word":"meditation","english":"Meditation sessions at the studio are calming.","thai":"เซสชันทำสมาธิที่สตูดิโอช่วยให้ผ่อนคลาย"}
{"word":"studio","english":"The yoga studio is my happy place.","thai":"สตูดิโอโยคะคือที่ที่ฉันมีความสุข"}
{"word":"yoga","english":"Yoga classes improve my flexibility.","thai":"คลาสโยคะช่วยเพิ่มความยืดหยุ่นให้ฉัน"}
{"word":"classes","english":"Cooking classes are my new obsession.","thai":"คลาสทำอาหารคือสิ่งที่ฉันหลงใหลใหม่"}
{"word":"cooking","english":"Cooking dinner for friends is super fun.","thai":"การทำอาหารเย็นให้เพื่อนๆ สนุกมาก"}
{"word":"friends","english":"Hanging out with friends always lifts my mood.","thai":"การออกไปเที่ยวกับเพื่อนๆ ทำให้อารมณ์ฉันดีขึ้นเสมอ"}
{"word":"mood","english":"Rainy days put me in a cozy mood.","thai":"วันที่ฝนตกทำให้ฉันรู้สึกอบอุ่น"}
{"word":"days","english":"Long work days call for strong coffee.","thai":"วันทำงานยาวๆ ต้องมีกาแฟเข้มๆ"}
{"word":"coffee","english":"I grabbed coffee at the local shop.","thai":"ฉันซื้อกาแฟที่ร้านท้องถิ่น"}
{"word":"shop","english":"The thrift shop had some dope finds.","thai":"ร้านมือสองมีของเจ๋งๆ เยอะเลย"}
{"word":"finds","english":"Scoring great finds online is so satisfying.","thai":"การเจอของดีๆ ออนไลน์มันช่างน่าพอใจ"}
{"word":"online","english":"Online workouts keep me in shape.","thai":"การออกกำลังกายออนไลน์ช่วยให้ฉันฟิต"}
{"word":"workouts","english":"Workouts at the gym boost my energy.","thai":"การออกกำลังกายที่ยิมเพิ่มพลังให้ฉัน"}
{"word":"gym","english":"The gym was packed after New Year’s.","thai":"ยิมแน่นไปด้วยผู้คนหลังปีใหม่"}
{"word":"year","english":"This year I’m focusing on self-care.","thai":"ปีนี้ฉันเน้นที่การดูแลตัวเอง"}
{"word":"self-care","english":"Self-care routines help me stay grounded.","thai":"กิจวัตรการดูแลตัวเองช่วยให้ฉันมั่นคง"}
{"word":"routines","english":"Morning routines set the tone for my day.","thai":"กิจวัตรตอนเช้ากำหนดโทนของวันฉัน"}
{"word":"day","english":"A chill day at home recharges me.","thai":"วันที่ผ่อนคลายที่บ้านช่วยเติมพลังให้ฉัน"}
{"word":"home","english":"Home renovations are stressing me out.","thai":"การปรับปรุงบ้านทำให้ฉันเครียด"}
{"word":"renovations","english":"Renovations turned our kitchen into a dream.","thai":"การปรับปรุงทำให้ครัวของเราเหมือนฝัน"}
{"word":"kitchen","english":"The kitchen smells amazing when I bake.","thai":"ครัวหอมฟุ้งเมื่อฉันอบขนม"}
{"word":"bake","english":"I love to bake cookies for the holidays.","thai":"ฉันชอบอบคุกกี้สำหรับวันหยุด"}
{"word":"holidays","english":"Holidays with family are always chaotic.","thai":"วันหยุดกับครอบครัววุ่นวายเสมอ"}
{"word":"family","english":"Family game nights get super competitive.","thai":"คืนเล่นเกมครอบครัวมันดุเดือดมาก"}
{"word":"game","english":"The soccer game was a total nail-biter.","thai":"เกมฟุตบอลตื่นเต้นสุดๆ"}
{"word":"soccer","english":"Soccer practice runs late every Thursday.","thai":"การฝึกซ้อมฟุตบอลเลิกดึกทุกวันพฤหัส"}
{"word":"practice","english":"Practice makes perfect for my guitar skills.","thai":"การฝึกฝนทำให้ทักษะกีตาร์ของฉันสมบูรณ์แบบ"}
{"word":"guitar","english":"I strummed my guitar at the open mic.","thai":"ฉันดีดกีตาร์ที่งานโอเพ่นไมค์"}
{"word":"mic","english":"The mic cut out during her speech.","thai":"ไมค์ดับระหว่างการพูดของเธอ"}
{"word":"speech","english":"Her speech at the seminar was inspiring.","thai":"คำปราศรัยของเธอในงานสัมมนาน่าประทับใจ"}
{"word":"seminar","english":"The PhD seminar sparked deep discussions.","thai":"งานสัมมนาปริญญาเอกจุดประกายการถกเถียงเชิงลึก"}
{"word":"discussions","english":"Discussions over coffee are my favorite.","thai":"การพูดคุยจิบกาแฟคือสิ่งที่ฉันชอบ"}
{"word":"coffee","english":"I spilled coffee on my new shirt.","thai":"ฉันทำกาแฟหกใส่เสื้อใหม่"}
{"word":"shirt","english":"This shirt looks dope for the festival.","thai":"เสื้อตัวนี้ดูเจ๋งสำหรับงานเทศกาล"}
{"word":"festival","english":"The music festival was a total vibe.","thai":"งานเทศกาลดนตรีมันสุดยอด"}
{"word":"music","english":"Music helps me focus during work.","thai":"ดนตรีช่วยให้ฉันมีสมาธิระหว่างทำงาน"}
{"word":"work","english":"I need to cut back on work hours.","thai":"ฉันต้องลดชั่วโมงทำงานลง"}
{"word":"hours","english":"Long hours at the office drain me.","thai":"ชั่วโมงทำงานยาวๆ ที่ออฟฟิศทำให้ฉันเหนื่อย"}
{"word":"office","english":"The office vibe is super chill today.","thai":"บรรยากาศในออฟฟิศวันนี้ชิลล์มาก"}
{"word":"vibe","english":"This playlist gives off a great vibe.","thai":"เพลย์ลิสต์นี้ให้ความรู้สึกดีมาก"}
{"word":"playlist","english":"I made a playlist for my road trip.","thai":"ฉันทำเพลย์ลิสต์สำหรับการขับรถเที่ยว"}
{"word":"road","english":"The road was bumpy during our adventure.","thai":"ถนนขรุขระระหว่างการผจญภัยของเรา"}
{"word":"adventure","english":"Camping is my kind of adventure.","thai":"การตั้งแคมป์คือการผจญภัยในแบบของฉัน"}
{"word":"camping","english":"Camping under the stars feels magical.","thai":"การตั้งแคมป์ใต้ดวงดาวรู้สึกมหัศจรรย์"}
{"word":"stars","english":"Stargazing with friends is so relaxing.","thai":"การดูดาวกับเพื่อนๆ ผ่อนคลายมาก"}
{"word":"relaxing","english":"A relaxing spa day is long overdue.","thai":"วันสปาผ่อนคลายนี่รอนานเกินไปแล้ว"}
{"word":"spa","english":"The spa had an awesome massage deal.","thai":"สปามีดีลนวดที่เจ๋งมาก"}
{"word":"massage","english":"A good massage melts away my stress.","thai":"การนวดดีๆ ช่วยคลายความเครียดของฉัน"}
{"word":"stress","english":"Work stress is messing with my sleep.","thai":"ความเครียดจากงานรบกวนการนอนของฉัน"}
{"word":"sleep","english":"I need more sleep to stay sharp.","thai":"ฉันต้องการนอนมากขึ้นเพื่อให้สมองปลอดโปร่ง"}
{"word":"sharp","english":"Her wit is razor sharp in debates.","thai":"ไหวพริบของเธอเฉียบคมในการโต้วาที"}
{"word":"debates","english":"Political debates get heated on social media.","thai":"การโต้วาทีการเมืองร้อนแรงในโซเชียลมีเดีย"}
{"word":"social","english":"Social gatherings at work build camaraderie.","thai":"การรวมตัวในที่ทำงานสร้างความสนิทสนม"}
{"word":"work","english":"I figured out a new work hack.","thai":"ฉันค้นพบวิธีลัดในการทำงาน"}
{"word":"hack","english":"This productivity hack saves me hours.","thai":"วิธีเพิ่มประสิทธิภาพนี้ช่วยฉันประหยัดเวลา"}
{"word":"productivity","english":"Boosting productivity feels so rewarding.","thai":"การเพิ่มประสิทธิภาพรู้สึกคุ้มค่ามาก"}
{"word":"rewarding","english":"Mentoring kids is incredibly rewarding.","thai":"การเป็นพี่เลี้ยงเด็กให้รางวัลอย่างเหลือเชื่อ"}
{"word":"kids","english":"The kids loved the science fair.","thai":"เด็กๆ ชอบงานวิทยาศาสตร์มาก"}
{"word":"science","english":"Science experiments always spark my curiosity.","thai":"การทดลองวิทยาศาสตร์จุดประกายความอยากรู้ของฉัน"}
{"word":"curiosity","english":"Curiosity drives my love for travel.","thai":"ความอยากรู้ขับเคลื่อนความรักในการท่องเที่ยวของฉัน"}
{"word":"travel","english":"Travel blogs inspire my next getaway.","thai":"บล็อกท่องเที่ยวเป็นแรงบันดาลใจให้ฉันไปพักผ่อน"}
{"word":"getaway","english":"A weekend getaway recharges my soul.","thai":"การพักผ่อนสุดสัปดาห์เติมพลังให้จิตวิญญาณฉัน"}
