{"word": "drawing", "english": "I’m working on a drawing for my art class.", "thai": "ฉันกำลังวาดภาพสำหรับชั้นเรียนศิลปะ"}
{"word": "drawing", "english": "Her drawing of the sunset was breathtaking.", "thai": "ภาพวาดพระอาทิตย์ตกของเธอสวยงามมาก"}
{"word": "drawing", "english": "He’s really good at drawing portraits.", "thai": "เขาเก่งมากในการวาดภาพเหมือน"}
{"word": "drawing", "english": "The kids are drawing pictures in the backyard.", "thai": "เด็กๆ กำลังวาดรูปที่หลังบ้าน"}
{"word": "drawing", "english": "I found an old drawing in the attic.", "thai": "ฉันเจอภาพวาดเก่าในห้องใต้หลังคา"}
{"word": "drawing", "english": "She’s been drawing since she was five.", "thai": "เธอวาดรูปมาตั้งแต่อายุห้าขวบ"}
{"word": "drawing", "english": "This drawing needs more color, don’t you think?", "thai": "ภาพวาดนี้ต้องการสีสันมากกว่านี้ คุณว่าไหม?"}
{"word": "drawing", "english": "He showed me a drawing of his dog.", "thai": "เขาให้ฉันดูภาพวาดของหมาเขา"}
{"word": "drawing", "english": "I’m not great at drawing, but I try.", "thai": "ฉันไม่เก่งวาดรูป แต่ก็พยายาม"}
{"word": "drawing", "english": "The teacher praised her detailed drawing.", "thai": "ครูชมภาพวาดที่มีรายละเอียดของเธอ"}
{"word": "drawing", "english": "Let’s have a drawing contest this weekend!", "thai": "มาจัดการแข่งขันวาดรูปสุดสัปดาห์นี้กันเถอะ!"}
{"word": "drawing", "english": "His drawing won first place in the competition.", "thai": "ภาพวาดของเขาได้รางวัลที่หนึ่งในการแข่งขัน"}
{"word": "drawing", "english": "I’m drawing a map for the treasure hunt.", "thai": "ฉันกำลังวาดแผนที่สำหรับการล่าสมบัติ"}
{"word": "drawing", "english": "She’s drawing a comic book for fun.", "thai": "เธอกำลังวาดการ์ตูนเพื่อความสนุก"}
{"word": "drawing", "english": "The drawing on the wall was so realistic.", "thai": "ภาพวาดบนผนังดูสมจริงมาก"}
{"word": "drawing", "english": "I’m taking a drawing class next month.", "thai": "ฉันจะเรียนคลาสวาดรูปเดือนหน้า"}
{"word": "drawing", "english": "He’s drawing a sketch of the building.", "thai": "เขากำลังร่างภาพของอาคาร"}
{"word": "drawing", "english": "This drawing took me three hours to finish.", "thai": "ภาพวาดนี้ใช้เวลาฉันสามชั่วโมงกว่าจะเสร็จ"}
{"word": "drawing", "english": "She’s always drawing in her notebook.", "thai": "เธอมักจะวาดรูปในสมุดบันทึก"}
{"word": "drawing", "english": "The kids love drawing with crayons.", "thai": "เด็กๆ ชอบวาดรูปด้วยสีเทียน"}
{"word": "drawing", "english": "I’m not sure what to add to this drawing.", "thai": "ฉันไม่แน่ใจว่าจะเพิ่มอะไรในภาพวาดนี้"}
{"word": "drawing", "english": "His drawing of the city was so detailed.", "thai": "ภาพวาดเมืองของเขามีรายละเอียดมาก"}
{"word": "drawing", "english": "She’s drawing a picture of her family.", "thai": "เธอกำลังวาดรูปครอบครัว"}
{"word": "drawing", "english": "I saw a cool drawing at the art fair.", "thai": "ฉันเห็นภาพวาดเจ๋งๆ ที่งานศิลปะ"}
{"word": "drawing", "english": "He’s drawing a cartoon character right now.", "thai": "เขากำลังวาดตัวการ์ตูนอยู่ตอนนี้"}
{"word": "drawing", "english": "The drawing class is every Tuesday.", "thai": "คลาสวาดรูปจัดทุกวันอังคาร"}
{"word": "drawing", "english": "I’m drawing a flower for my mom.", "thai": "ฉันกำลังวาดดอกไม้ให้แม่"}
{"word": "drawing", "english": "Her drawing skills have really improved.", "thai": "ทักษะการวาดรูปของเธอดีขึ้นมาก"}
{"word": "drawing", "english": "He’s drawing a dragon for his project.", "thai": "เขากำลังวาดมังกรสำหรับโปรเจกต์"}
{"word": "drawing", "english": "The drawing on the fridge is so cute!", "thai": "ภาพวาดบนตู้เย็นน่ารักมาก!"}
{"word": "drawing", "english": "I’m practicing my drawing every day.", "thai": "ฉันฝึกวาดรูปทุกวัน"}
{"word": "drawing", "english": "She’s drawing a landscape for the exhibit.", "thai": "เธอกำลังวาดทิวทัศน์สำหรับนิทรรศการ"}
{"word": "drawing", "english": "This drawing is inspired by my dreams.", "thai": "ภาพวาดนี้ได้แรงบันดาลใจจากความฝันของฉัน"}
{"word": "drawing", "english": "He’s really into drawing superheroes.", "thai": "เขาชอบวาดซูเปอร์ฮีโร่มาก"}
{"word": "drawing", "english": "I’m drawing a picture of my cat.", "thai": "ฉันกำลังวาดรูปแมวของฉัน"}
{"word": "drawing", "english": "Her drawing was featured in the magazine.", "thai": "ภาพวาดของเธอได้รับการตีพิมพ์ในนิตยสาร"}
{"word": "drawing", "english": "The kids are drawing animals at school.", "thai": "เด็กๆ กำลังวาดสัตว์ที่โรงเรียน"}
{"word": "drawing", "english": "I’m struggling with this drawing’s perspective.", "thai": "ฉันกำลังมีปัญหากับมุมมองของภาพวาดนี้"}
{"word": "drawing", "english": "He’s drawing a mural for the community center.", "thai": "เขากำลังวาดภาพจิตรกรรมฝาผนังให้ศูนย์ชุมชน"}
{"word": "drawing", "english": "This drawing is part of my portfolio.", "thai": "ภาพวาดนี้เป็นส่วนหนึ่งของพอร์ตโฟลิโอของฉัน"}
{"word": "drawing", "english": "She’s drawing a still life with fruit.", "thai": "เธอกำลังวาดภาพนิ่งที่มีผลไม้"}
{"word": "drawing", "english": "I love drawing with charcoal and pastels.", "thai": "ฉันชอบวาดรูปด้วยถ่านและสีพาสเทล"}
{"word": "drawing", "english": "His drawing of the forest was so vivid.", "thai": "ภาพวาดป่าของเขาดูมีชีวิตชีวามาก"}
{"word": "drawing", "english": "I’m drawing a gift for my best friend.", "thai": "ฉันกำลังวาดของขวัญให้เพื่อนสนิท"}
{"word": "drawing", "english": "She’s drawing a scene from her favorite movie.", "thai": "เธอกำลังวาดฉากจากภาพยนตร์ที่ชอบ"}
{"word": "drawing", "english": "The drawing workshop was really fun.", "thai": "เวิร์กช็อปวาดรูปสนุกมาก"}
{"word": "drawing", "english": "He’s drawing a spaceship for his story.", "thai": "เขากำลังวาดยานอวกาศสำหรับเรื่องราวของเขา"}
{"word": "drawing", "english": "I’m trying to finish this drawing tonight.", "thai": "ฉันพยายามจะวาดภาพนี้ให้เสร็จคืนนี้"}
{"word": "drawing", "english": "Her drawing captured the moment perfectly.", "thai": "ภาพวาดของเธอจับช่วงเวลานั้นได้อย่างสมบูรณ์แบบ"}
{"word": "drawing", "english": "The kids made a drawing for their teacher.", "thai": "เด็กๆ วาดรูปให้ครู"}
{"word": "drawing", "english": "I’m drawing a blueprint for the project.", "thai": "ฉันกำลังวาดพิมพ์เขียวสำหรับโปรเจกต์"}
{"word": "drawing", "english": "She’s drawing a portrait of her sister.", "thai": "เธอกำลังวาดภาพเหมือนของน้องสาว"}
{"word": "drawing", "english": "This drawing is for the charity auction.", "thai": "ภาพวาดนี้สำหรับการประมูลการกุศล"}
{"word": "drawing", "english": "He’s teaching me some drawing techniques.", "thai": "เขากำลังสอนเทคนิคการวาดรูปให้ฉัน"}
{"word": "drawing", "english": "I’m drawing a tree for the school play.", "thai": "ฉันกำลังวาดต้นไม้สำหรับละครโรงเรียน"}
{"word": "drawing", "english": "Her drawing of the ocean was stunning.", "thai": "ภาพวาดมหาสมุทรของเธอน่าทึ่งมาก"}
{"word": "drawing", "english": "I’m not happy with this drawing yet.", "thai": "ฉันยังไม่พอใจกับภาพวาดนี้"}
{"word": "drawing", "english": "He’s drawing a character for his game.", "thai": "เขากำลังวาดตัวละครสำหรับเกมของเขา"}
{"word": "drawing", "english": "The drawing board is full of sketches.", "thai": "กระดานวาดรูปเต็มไปด้วยภาพร่าง"}
{"word": "drawing", "english": "She’s drawing a pattern for her dress.", "thai": "เธอกำลังวาดลายสำหรับชุดของเธอ"}
{"word": "drawing", "english": "I’m drawing a card for my grandma.", "thai": "ฉันกำลังวาดการ์ดให้คุณย่า"}
{"word": "drawing", "english": "His drawing of the car was super detailed.", "thai": "ภาพวาดรถของเขามีรายละเอียดสุดยอด"}
{"word": "drawing", "english": "The kids are drawing on the sidewalk.", "thai": "เด็กๆ กำลังวาดรูปบนทางเท้า"}
{"word": "drawing", "english": "I’m taking a break from drawing today.", "thai": "ฉันหยุดพักจากการวาดรูปวันนี้"}
{"word": "drawing", "english": "She’s drawing a design for the logo.", "thai": "เธอกำลังวาดแบบสำหรับโลโก้"}
{"word": "drawing", "english": "This drawing is part of a series.", "thai": "ภาพวาดนี้เป็นส่วนหนึ่งของชุด"}
{"word": "drawing", "english": "He’s drawing a picture for the book cover.", "thai": "เขากำลังวาดรูปสำหรับปกหนังสือ"}
{"word": "drawing", "english": "I’m learning new drawing techniques online.", "thai": "ฉันกำลังเรียนเทคนิคการวาดรูปใหม่ๆ ทางออนไลน์"}
{"word": "drawing", "english": "Her drawing of the mountain was so cool.", "thai": "ภาพวาดภูเขาของเธอเจ๋งมาก"}
{"word": "drawing", "english": "I’m drawing a scene from my vacation.", "thai": "ฉันกำลังวาดฉากจากวันหยุดของฉัน"}
{"word": "drawing", "english": "The drawing app on my tablet is awesome.", "thai": "แอปวาดรูปบนแท็บเล็ตของฉันเจ๋งมาก"}
{"word": "drawing", "english": "He’s drawing a map of the neighborhood.", "thai": "เขากำลังวาดแผนที่ของละแวกบ้าน"}
{"word": "drawing", "english": "She’s really focused on her drawing today.", "thai": "เธอตั้งใจวาดรูปมากวันนี้"}
{"word": "drawing", "english": "I’m drawing a poster for the event.", "thai": "ฉันกำลังวาดโปสเตอร์สำหรับงาน"}
{"word": "drawing", "english": "His drawing of the bridge was impressive.", "thai": "ภาพวาดสะพานของเขาน่าประทับใจ"}
{"word": "drawing", "english": "The kids are drawing their favorite characters.", "thai": "เด็กๆ กำลังวาดตัวละครที่ชอบ"}
{"word": "drawing", "english": "I’m working on a digital drawing now.", "thai": "ฉันกำลังทำงานวาดรูปดิจิทัลอยู่"}
{"word": "drawing", "english": "She’s drawing a picture for her blog.", "thai": "เธอกำลังวาดรูปสำหรับบล็อกของเธอ"}
{"word": "drawing", "english": "This drawing is my best work yet.", "thai": "ภาพวาดนี้เป็นผลงานที่ดีที่สุดของฉัน"}
{"word": "drawing", "english": "He’s drawing a concept for the movie.", "thai": "เขากำลังวาดคอนเซปต์สำหรับภาพยนตร์"}
{"word": "drawing", "english": "I’m drawing a gift for my teacher.", "thai": "ฉันกำลังวาดของขวัญให้ครู"}
{"word": "drawing", "english": "Her drawing of the park was so lively.", "thai": "ภาพวาดสวนสาธารณะของเธอดูมีชีวิตชีวา"}
{"word": "drawing", "english": "I’m trying to improve my drawing skills.", "thai": "ฉันพยายามพัฒนาทักษะการวาดรูป"}
{"word": "drawing", "english": "He’s drawing a tattoo design for a friend.", "thai": "เขากำลังวาดลายสักให้เพื่อน"}
{"word": "drawing", "english": "The drawing on the table caught my eye.", "thai": "ภาพวาดบนโต๊ะสะดุดตาฉัน"}
{"word": "drawing", "english": "She’s drawing a picture of her house.", "thai": "เธอกำลังวาดรูปบ้านของเธอ"}
{"word": "drawing", "english": "I’m drawing a cartoon for the school paper.", "thai": "ฉันกำลังวาดการ์ตูนให้หนังสือพิมพ์โรงเรียน"}
{"word": "drawing", "english": "His drawing of the robot was so creative.", "thai": "ภาพวาดหุ่นยนต์ของเขาสร้างสรรค์มาก"}
{"word": "drawing", "english": "The kids are drawing with colored pencils.", "thai": "เด็กๆ กำลังวาดรูปด้วยดินสอสี"}
{"word": "drawing", "english": "I’m drawing a scene for the art show.", "thai": "ฉันกำลังวาดฉากสำหรับงานแสดงศิลปะ"}
{"word": "drawing", "english": "She’s drawing a picture of her dog.", "thai": "เธอกำลังวาดรูปหมาของเธอ"}
{"word": "drawing", "english": "This drawing took a lot of patience.", "thai": "ภาพวาดนี้ต้องใช้ความอดทนมาก"}
{"word": "drawing", "english": "He’s drawing a portrait for the gallery.", "thai": "เขากำลังวาดภาพเหมือนสำหรับแกลเลอรี"}
{"word": "drawing", "english": "I’m drawing a map for the hiking trip.", "thai": "ฉันกำลังวาดแผนที่สำหรับการเดินป่า"}
{"word": "drawing", "english": "Her drawing of the city skyline was amazing.", "thai": "ภาพวาดเส้นขอบฟ้าของเมืองของเธอน่าทึ่ง"}
{"word": "drawing", "english": "I’m entering my drawing in a contest.", "thai": "ฉันจะส่งภาพวาดนี้เข้าประกวด"}
{"word": "drawing", "english": "He’s drawing a picture for his mom’s birthday.", "thai": "เขากำลังวาดรูปให้วันเกิดแม่"}
{"word": "drawing", "english": "The drawing on the poster was eye-catching.", "thai": "ภาพวาดบนโปสเตอร์สะดุดตา"}
{"word": "drawing", "english": "She’s drawing a fantasy world for her story.", "thai": "เธอกำลังวาดโลกแฟนตาซีสำหรับเรื่องราวของเธอ"}
{"word": "drawing", "english": "I’m practicing drawing faces this week.", "thai": "ฉันกำลังฝึกวาดใบหน้าสัปดาห์นี้"}
{"word": "driving", "english": "I’m driving to the store to grab some groceries.", "thai": "ฉันกำลังขับรถไปร้านค้าเพื่อซื้อของชำ"}
{"word": "driving", "english": "She’s been driving for hours without a break.", "thai": "เธอขับรถมาหลายชั่วโมงโดยไม่หยุดพัก"}
{"word": "driving", "english": "He loves driving his new sports car.", "thai": "เขารักการขับรถสปอร์ตคันใหม่ของเขา"}
{"word": "driving", "english": "Driving in the rain can be really tricky.", "thai": "การขับรถในฝนตกอาจจะยุ่งยากมาก"}
{"word": "driving", "english": "I’m nervous about driving on the highway.", "thai": "ฉันรู้สึกกังวลเกี่ยวกับการขับรถบนทางหลวง"}
{"word": "driving", "english": "Are you driving to the party tonight?", "thai": "คุณจะขับรถไปงานปาร์ตี้คืนนี้ไหม?"}
{"word": "driving", "english": "He’s driving his kids to school every morning.", "thai": "เขาขับรถพาลูกๆ ไปโรงเรียนทุกเช้า"}
{"word": "driving", "english": "Driving through the mountains is so scenic.", "thai": "การขับรถผ่านภูเขาสวยงามมาก"}
{"word": "driving", "english": "She’s taking driving lessons this summer.", "thai": "เธอกำลังเรียนขับรถในฤดูร้อนนี้"}
{"word": "driving", "english": "I’m tired of driving in city traffic.", "thai": "ฉันเบื่อการขับรถในจราจรเมือง"}
{"word": "driving", "english": "He got a ticket for driving too fast.", "thai": "เขาได้ใบสั่งเพราะขับรถเร็วเกินไป"}
{"word": "driving", "english": "Driving at night makes me a bit anxious.", "thai": "การขับรถตอนกลางคืนทำให้ฉันรู้สึกกังวลนิดหน่อย"}
{"word": "driving", "english": "She’s really good at driving a manual car.", "thai": "เธอเก่งมากในการขับรถเกียร์ธรรมดา"}
{"word": "driving", "english": "I’m driving to the beach this weekend.", "thai": "ฉันจะขับรถไปชายหาดสุดสัปดาห์นี้"}
{"word": "driving", "english": "He’s been driving trucks for over ten years.", "thai": "เขาขับรถบรรทุกมานานกว่าสิบปี"}
{"word": "driving", "english": "Driving in the snow is so stressful.", "thai": "การขับรถในหิมะเครียดมาก"}
{"word": "driving", "english": "I love driving with the windows down.", "thai": "ฉันชอบขับรถโดยเปิดหน้าต่าง"}
{"word": "driving", "english": "She’s driving her mom to the airport.", "thai": "เธอกำลังขับรถพาแม่ไปสนามบิน"}
{"word": "driving", "english": "He’s practicing driving for his test tomorrow.", "thai": "เขากำลังฝึกขับรถเพื่อสอบพรุ่งนี้"}
{"word": "driving", "english": "Driving long distances makes me sleepy.", "thai": "การขับรถระยะไกลทำให้ฉันง่วง"}
{"word": "driving", "english": "I’m driving to work instead of taking the bus.", "thai": "ฉันขับรถไปทำงานแทนที่จะนั่งรถบัส"}
{"word": "driving", "english": "She got lost while driving in the new city.", "thai": "เธอหลงทางขณะขับรถในเมืองใหม่"}
{"word": "driving", "english": "He’s driving a rental car on his trip.", "thai": "เขาขับรถเช่าตอนไปเที่ยว"}
{"word": "driving", "english": "Driving on country roads is so relaxing.", "thai": "การขับรถบนถนนชนบทผ่อนคลายมาก"}
{"word": "driving", "english": "I’m not comfortable driving in heavy traffic.", "thai": "ฉันไม่สบายใจขับรถในจราจรหนาแน่น"}
{"word": "driving", "english": "She’s driving her brother to soccer practice.", "thai": "เธอกำลังขับรถพาน้องชายไปซ้อมฟุตบอล"}
{"word": "driving", "english": "He’s been driving without a license, which is risky.", "thai": "เขาขับรถโดยไม่มีใบขับขี่ ซึ่งเสี่ยงมาก"}
{"word": "driving", "english": "I’m driving to the mountains for a hike.", "thai": "ฉันกำลังขับรถไปภูเขาเพื่อเดินป่า"}
{"word": "driving", "english": "Driving with music on makes it more fun.", "thai": "การขับรถพร้อมเปิดเพลงทำให้สนุกขึ้น"}
{"word": "driving", "english": "She’s driving carefully because of the fog.", "thai": "เธอขับรถอย่างระวังเพราะหมอก"}
{"word": "driving", "english": "He’s driving to the concert with his friends.", "thai": "เขากำลังขับรถไปคอนเสิร์ตกับเพื่อนๆ"}
{"word": "driving", "english": "I’m taking a driving test next week.", "thai": "ฉันจะสอบใบขับขี่สัปดาห์หน้า"}
{"word": "driving", "english": "Driving in a new country can be confusing.", "thai": "การขับรถในประเทศใหม่น่าสับสน"}
{"word": "driving", "english": "She’s driving her dad’s old pickup truck.", "thai": "เธอกำลังขับรถกระบะเก่าของพ่อ"}
{"word": "driving", "english": "He loves driving fast on open roads.", "thai": "เขาชอบขับรถเร็วบนถนนโล่ง"}
{"word": "driving", "english": "I’m driving to the mall to meet my friends.", "thai": "ฉันกำลังขับรถไปห้างเพื่อเจอเพื่อน"}
{"word": "driving", "english": "Driving during rush hour is a nightmare.", "thai": "การขับรถในชั่วโมงเร่งด่วนคือฝันร้าย"}
{"word": "driving", "english": "She’s driving a van for the family trip.", "thai": "เธอกำลังขับรถตู้สำหรับทริปครอบครัว"}
{"word": "driving", "english": "He’s been driving for Uber to earn extra cash.", "thai": "เขาขับรถให้ Uber เพื่อหาเงินพิเศษ"}
{"word": "driving", "english": "I’m not used to driving on the left side.", "thai": "ฉันไม่ชินกับการขับรถด้านซ้าย"}
{"word": "driving", "english": "Driving to the lake takes about an hour.", "thai": "การขับรถไปทะเลสาบใช้เวลาประมาณหนึ่งชั่วโมง"}
{"word": "driving", "english": "She’s driving slowly to enjoy the scenery.", "thai": "เธอกำลังขับรถช้าๆ เพื่อเพลิดเพลินกับวิว"}
{"word": "driving", "english": "He’s driving his motorcycle to the meetup.", "thai": "เขากำลังขับมอเตอร์ไซค์ไปงานรวมตัว"}
{"word": "driving", "english": "I’m driving home after the movie tonight.", "thai": "ฉันจะขับรถกลับบ้านหลังดูหนังคืนนี้"}
{"word": "driving", "english": "Driving in the city requires a lot of patience.", "thai": "การขับรถในเมืองต้องใช้ความอดทนมาก"}
{"word": "driving", "english": "She’s driving to the gym for her workout.", "thai": "เธอกำลังขับรถไปยิมเพื่อออกกำลังกาย"}
{"word": "driving", "english": "He got pulled over for driving recklessly.", "thai": "เขาถูกจับเพราะขับรถโดยประมาท"}
{"word": "driving", "english": "I’m driving my sister to her dance class.", "thai": "ฉันกำลังขับรถพาน้องสาวไปเรียนเต้น"}
{"word": "driving", "english": "Driving on icy roads is really dangerous.", "thai": "การขับรถบนถนนน้ำแข็งอันตรายมาก"}
{"word": "driving", "english": "She’s driving a hybrid car to save gas.", "thai": "เธอกำลังขับรถไฮบริดเพื่อประหยัดน้ำมัน"}
{"word": "driving", "english": "He’s driving to the park for a picnic.", "thai": "เขากำลังขับรถไปสวนสาธารณะเพื่อปิกนิก"}
{"word": "driving", "english": "I’m learning defensive driving techniques.", "thai": "ฉันกำลังเรียนเทคนิคการขับรถแบบป้องกัน"}
{"word": "driving", "english": "Driving with a GPS makes things easier.", "thai": "การขับรถโดยใช้ GPS ทำให้ง่ายขึ้น"}
{"word": "driving", "english": "She’s driving to visit her grandparents.", "thai": "เธอกำลังขับรถไปเยี่ยมปู่ย่าตายาย"}
{"word": "driving", "english": "He’s driving a delivery truck for his job.", "thai": "เขาขับรถส่งของสำหรับงานของเขา"}
{"word": "driving", "english": "I’m driving to the countryside tomorrow.", "thai": "ฉันจะขับรถไปชนบทพรุ่งนี้"}
{"word": "driving", "english": "Driving in a storm is not a good idea.", "thai": "การขับรถในพายุไม่ใช่ความคิดที่ดี"}
{"word": "driving", "english": "She’s driving her friend to the train station.", "thai": "เธอกำลังขับรถพาเพื่อนไปสถานีรถไฟ"}
{"word": "driving", "english": "He’s really careful when driving at night.", "thai": "เขาระวังมากตอนขับรถตอนกลางคืน"}
{"word": "driving", "english": "I’m driving to the festival this afternoon.", "thai": "ฉันกำลังขับรถไปงานเทศกาลบ่ายนี้"}
{"word": "driving", "english": "Driving a stick shift is kind of fun.", "thai": "การขับรถเกียร์ธรรมดาค่อนข้างสนุก"}
{"word": "driving", "english": "She’s driving to the office for a meeting.", "thai": "เธอกำลังขับรถไปออฟฟิศเพื่อประชุม"}
{"word": "driving", "english": "He’s been driving buses for the city.", "thai": "เขาขับรถบัสให้เมืองนี้"}
{"word": "driving", "english": "I’m not a fan of driving in the rain.", "thai": "ฉันไม่ชอบขับรถในฝน"}
{"word": "driving", "english": "Driving to the cabin takes a few hours.", "thai": "การขับรถไปกระท่อมใช้เวลาสองสามชั่วโมง"}
{"word": "driving", "english": "She’s driving her new SUV today.", "thai": "เธอกำลังขับรถ SUV คันใหม่วันนี้"}
{"word": "driving", "english": "He’s driving to the game with his buddies.", "thai": "เขากำลังขับรถไปดูเกมกับเพื่อนๆ"}
{"word": "driving", "english": "I’m driving carefully because of the kids.", "thai": "ฉันขับรถอย่างระวังเพราะมีเด็กๆ"}
{"word": "driving", "english": "Driving on this road is so bumpy.", "thai": "การขับรถบนถนนนี้ขรุขระมาก"}
{"word": "driving", "english": "She’s driving to the store for some snacks.", "thai": "เธอกำลังขับรถไปร้านค้าเพื่อซื้อของว่าง"}
{"word": "driving", "english": "He’s taking a driving course this month.", "thai": "เขากำลังเรียนคอร์สขับรถเดือนนี้"}
{"word": "driving", "english": "I’m driving to the lake for some fishing.", "thai": "ฉันกำลังขับรถไปทะเลสาบเพื่อตกปลา"}
{"word": "driving", "english": "Driving in the desert is a unique experience.", "thai": "การขับรถในทะเลทรายเป็นประสบการณ์ที่ไม่เหมือนใคร"}
{"word": "driving", "english": "She’s driving her cousin to the doctor.", "thai": "เธอกำลังขับรถพาลูกพี่ลูกน้องไปหาหมอ"}
{"word": "driving", "english": "He’s driving a convertible for the first time.", "thai": "เขาขับรถเปิดประทุนครั้งแรก"}
{"word": "driving", "english": "I’m driving to the farm to see the animals.", "thai": "ฉันกำลังขับรถไปฟาร์มเพื่อดูสัตว์"}
{"word": "driving", "english": "Driving with sunglasses helps with the glare.", "thai": "การขับรถโดยใส่แว่นกันแดดช่วยลดแสงจ้า"}
{"word": "driving", "english": "She’s driving to the library to return books.", "thai": "เธอกำลังขับรถไปห้องสมุดเพื่อคืนหนังสือ"}
{"word": "driving", "english": "He’s driving to the hardware store for tools.", "thai": "เขากำลังขับรถไปร้านเครื่องมือเพื่อซื้ออุปกรณ์"}
{"word": "driving", "english": "I’m driving my parents to dinner tonight.", "thai": "ฉันจะขับรถพาพ่อแม่ไปกินข้าวเย็นคืนนี้"}
{"word": "driving", "english": "Driving on winding roads is so thrilling.", "thai": "การขับรถบนถนนคดเคี้ยวตื่นเต้นมาก"}
{"word": "driving", "english": "She’s driving to the museum with her class.", "thai": "เธอกำลังขับรถไปพิพิธภัณฑ์กับชั้นเรียน"}
{"word": "driving", "english": "He’s been driving all day for work.", "thai": "เขาขับรถทั้งวันเพื่อทำงาน"}
{"word": "driving", "english": "I’m driving to the campground this evening.", "thai": "ฉันกำลังขับรถไปที่แคมป์ตอนเย็นนี้"}
{"word": "driving", "english": "Driving in a big city can be overwhelming.", "thai": "การขับรถในเมืองใหญ่ทำให้รู้สึกหนักใจ"}
{"word": "driving", "english": "She’s driving her kids to the amusement park.", "thai": "เธอกำลังขับรถพาลูกๆ ไปสวนสนุก"}
{"word": "driving", "english": "He’s driving to the mountains for skiing.", "thai": "เขากำลังขับรถไปภูเขาเพื่อเล่นสกี"}
{"word": "driving", "english": "I’m practicing parallel parking while driving.", "thai": "ฉันกำลังฝึกจอดรถแบบขนานขณะขับ"}
{"word": "driving", "english": "Driving with a full car is always fun.", "thai": "การขับรถที่มีคนเต็มคันรถสนุกเสมอ"}
{"word": "driving", "english": "She’s driving to the bakery for some bread.", "thai": "เธอกำลังขับรถไปร้านเบเกอรี่เพื่อซื้อขนมปัง"}
{"word": "driving", "english": "He’s driving an electric car now.", "thai": "เขากำลังขับรถไฟฟ้าตอนนี้"}
{"word": "driving", "english": "I’m driving to the post office to mail a package.", "thai": "ฉันกำลังขับรถไปที่ทำการไปรษณีย์เพื่อส่งพัสดุ"}
{"word": "driving", "english": "Driving through the forest is so peaceful.", "thai": "การขับรถผ่านป่าสงบมาก"}
{"word": "driving", "english": "She’s driving to the vet with her dog.", "thai": "เธอกำลังขับรถพาหมาไปหาสัตวแพทย์"}
{"word": "driving", "english": "He’s driving to the stadium for the game.", "thai": "เขากำลังขับรถไปสนามกีฬาเพื่อดูเกม"}
{"word": "driving", "english": "I’m driving to the grocery store after work.", "thai": "ฉันจะขับรถไปร้านของชำหลังเลิกงาน"}
{"word": "driving", "english": "Driving on this new road is so smooth.", "thai": "การขับรถบนถนนใหม่นี้ลื่นไหลมาก"}
{"word": "driving", "english": "She’s driving to the mall for some shopping.", "thai": "เธอกำลังขับรถไปห้างเพื่อช็อปปิ้ง"}
{"word": "driving", "english": "He’s driving to the lake house for the weekend.", "thai": "เขากำลังขับรถไปบ้านพักตากอากาศที่ทะเลสาบสำหรับสุดสัปดาห์"}
{"word": "driving", "english": "I’m driving to the park to meet my friends.", "thai": "ฉันกำลังขับรถไปสวนสาธารณะเพื่อเจอเพื่อน"}
{"word": "exercise", "english": "I try to exercise at least three times a week.", "thai": "ฉันพยายามออกกำลังกายอย่างน้อยสามครั้งต่อสัปดาห์"}
{"word": "exercise", "english": "She loves doing yoga as her daily exercise.", "thai": "เธอชอบเล่นโยคะเป็นการออกกำลังกายประจำวัน"}
{"word": "exercise", "english": "He’s starting a new exercise routine tomorrow.", "thai": "เขาจะเริ่มตารางออกกำลังกายใหม่พรุ่งนี้"}
{"word": "exercise", "english": "Exercise helps me feel more energized.", "thai": "การออกกำลังกายช่วยให้ฉันรู้สึกกระปรี้กระเปร่ามากขึ้น"}
{"word": "exercise", "english": "I need to find time for exercise in my schedule.", "thai": "ฉันต้องหาเวลาสำหรับออกกำลังกายในตารางของฉัน"}
{"word": "exercise", "english": "She’s doing an exercise video at home.", "thai": "เธอกำลังออกกำลังกายตามวิดีโอที่บ้าน"}
{"word": "exercise", "english": "He says exercise is key to staying healthy.", "thai": "เขาบอกว่าการออกกำลังกายเป็นกุญแจสำคัญในการรักษาสุขภาพ"}
{"word": "exercise", "english": "I’m too tired to exercise after work today.", "thai": "ฉันเหนื่อยเกินกว่าจะออกกำลังกายหลังเลิกงานวันนี้"}
{"word": "exercise", "english": "Running is my favorite form of exercise.", "thai": "การวิ่งเป็นรูปแบบการออกกำลังกายที่ฉันชอบที่สุด"}
{"word": "exercise", "english": "She’s joining an exercise class at the gym.", "thai": "เธอกำลังเข้าร่วมคลาสออกกำลังกายที่ยิม"}
{"word": "exercise", "english": "Exercise always boosts my mood.", "thai": "การออกกำลังกายช่วยเพิ่มอารมณ์ดีให้ฉันเสมอ"}
{"word": "exercise", "english": "He’s doing a strength exercise with weights.", "thai": "เขากำลังออกกำลังกายแบบฝึกความแข็งแรงด้วยน้ำหนัก"}
{"word": "exercise", "english": "I forgot my exercise gear at home.", "thai": "ฉันลืมอุปกรณ์ออกกำลังกายไว้ที่บ้าน"}
{"word": "exercise", "english": "She recommends exercise for stress relief.", "thai": "เธอแนะนำให้ออกกำลังกายเพื่อคลายเครียด"}
{"word": "exercise", "english": "He’s trying a new exercise app this month.", "thai": "เขากำลังลองใช้แอปออกกำลังกายใหม่เดือนนี้"}
{"word": "exercise", "english": "Exercise is part of my morning routine.", "thai": "การออกกำลังกายเป็นส่วนหนึ่งของกิจวัตรตอนเช้าของฉัน"}
{"word": "exercise", "english": "I’m not a fan of intense exercise.", "thai": "ฉันไม่ชอบออกกำลังกายหนักๆ"}
{"word": "exercise", "english": "She’s doing a cardio exercise right now.", "thai": "เธอกำลังออกกำลังกายแบบคาร์ดิโออยู่ตอนนี้"}
{"word": "exercise", "english": "He thinks exercise is boring without music.", "thai": "เขาคิดว่าการออกกำลังกายน่าเบื่อถ้าไม่มีเพลง"}
{"word": "exercise", "english": "I need to stretch before I exercise.", "thai": "ฉันต้องยืดกล้ามเนื้อก่อนออกกำลังกาย"}
{"word": "exercise", "english": "She’s teaching an exercise class this evening.", "thai": "เธอกำลังสอนคลาสออกกำลังกายเย็นนี้"}
{"word": "exercise", "english": "Exercise helps me sleep better at night.", "thai": "การออกกำลังกายช่วยให้ฉันนอนหลับดีขึ้นตอนกลางคืน"}
{"word": "exercise", "english": "He’s been skipping exercise because of work.", "thai": "เขาไม่ได้ออกกำลังกายเพราะงานยุ่ง"}
{"word": "exercise", "english": "I’m trying to make exercise a habit.", "thai": "ฉันพยายามทำให้การออกกำลังกายเป็นนิสัย"}
{"word": "exercise", "english": "She loves outdoor exercise like hiking.", "thai": "เธอชอบออกกำลังกายกลางแจ้งอย่างเช่นการเดินป่า"}
{"word": "exercise", "english": "He’s doing a quick exercise before dinner.", "thai": "เขากำลังออกกำลังกายสั้นๆ ก่อนมื้อเย็น"}
{"word": "exercise", "english": "Exercise is great for mental health.", "thai": "การออกกำลังกายดีต่อสุขภาพจิต"}
{"word": "exercise", "english": "I’m signing up for an exercise challenge.", "thai": "ฉันกำลังสมัครเข้าร่วมการท้าทายออกกำลังกาย"}
{"word": "exercise", "english": "She’s doing a group exercise at the park.", "thai": "เธอกำลังออกกำลังกายเป็นกลุ่มที่สวนสาธารณะ"}
{"word": "exercise", "english": "He bought new shoes for exercise.", "thai": "เขาซื้อรองเท้าใหม่สำหรับออกกำลังกาย"}
{"word": "exercise", "english": "I feel amazing after a good exercise.", "thai": "ฉันรู้สึกดีมากหลังจากการออกกำลังกายที่ดี"}
{"word": "exercise", "english": "She’s planning an exercise routine for beginners.", "thai": "เธอกำลังวางแผนตารางออกกำลังกายสำหรับมือใหม่"}
{"word": "exercise", "english": "Exercise is tough when it’s so hot outside.", "thai": "การออกกำลังกายยากเมื่ออากาศร้อนมาก"}
{"word": "exercise", "english": "He’s combining diet and exercise to lose weight.", "thai": "เขากำลังรวมการควบคุมอาหารและออกกำลังกายเพื่อลดน้ำหนัก"}
{"word": "exercise", "english": "I’m doing a short exercise in the morning.", "thai": "ฉันกำลังออกกำลังกายสั้นๆ ในตอนเช้า"}
{"word": "exercise", "english": "She’s really into high-intensity exercise.", "thai": "เธอชอบออกกำลังกายแบบเข้มข้นสูงมาก"}
{"word": "exercise", "english": "Exercise makes me feel stronger every day.", "thai": "การออกกำลังกายทำให้ฉันรู้สึกแข็งแรงขึ้นทุกวัน"}
{"word": "exercise", "english": "He’s doing an exercise to improve his balance.", "thai": "เขากำลังออกกำลังกายเพื่อพัฒนาการทรงตัว"}
{"word": "exercise", "english": "I’m too busy to exercise this week.", "thai": "ฉันยุ่งเกินกว่าจะออกกำลังกายสัปดาห์นี้"}
{"word": "exercise", "english": "She’s trying a new exercise for flexibility.", "thai": "เธอกำลังลองออกกำลังกายเพื่อเพิ่มความยืดหยุ่น"}
{"word": "exercise", "english": "Exercise is part of his recovery plan.", "thai": "การออกกำลังกายเป็นส่วนหนึ่งของแผนฟื้นฟูของเขา"}
{"word": "exercise", "english": "I’m joining a friend for exercise tomorrow.", "thai": "ฉันจะไปออกกำลังกายกับเพื่อนพรุ่งนี้"}
{"word": "exercise", "english": "She’s doing an exercise to strengthen her core.", "thai": "เธอกำลังออกกำลังกายเพื่อเสริมสร้างกล้ามเนื้อแกนกลาง"}
{"word": "exercise", "english": "He thinks exercise is better with a partner.", "thai": "เขาคิดว่าการออกกำลังกายดีกว่าถ้ามีคู่หู"}
{"word": "exercise", "english": "I’m starting my day with some exercise.", "thai": "ฉันเริ่มวันด้วยการออกกำลังกาย"}
{"word": "exercise", "english": "Exercise helps me clear my mind.", "thai": "การออกกำลังกายช่วยให้ฉันปลอดโปร่ง"}
{"word": "exercise", "english": "She’s doing an exercise class online.", "thai": "เธอกำลังออกกำลังกายตามคลาสออนไลน์"}
{"word": "exercise", "english": "He’s been consistent with exercise lately.", "thai": "เขาเริ่มออกกำลังกายอย่างสม่ำเสมอเมื่อเร็วๆ นี้"}
{"word": "exercise", "english": "I need new music for my exercise routine.", "thai": "ฉันต้องการเพลงใหม่สำหรับตารางออกกำลังกาย"}
{"word": "exercise", "english": "She’s doing a 30-day exercise challenge.", "thai": "เธอกำลังทำการท้าทายออกกำลังกาย 30 วัน"}
{"word": "exercise", "english": "Exercise is hard when you’re not motivated.", "thai": "การออกกำลังกายยากเมื่อคุณไม่มีแรงจูงใจ"}
{"word": "exercise", "english": "He’s doing an exercise to improve his stamina.", "thai": "เขากำลังออกกำลังกายเพื่อเพิ่มความทนทาน"}
{"word": "exercise", "english": "I’m trying to exercise more regularly.", "thai": "ฉันพยายามออกกำลังกายอย่างสม่ำเสมอมากขึ้น"}
{"word": "exercise", "english": "She loves swimming as her exercise.", "thai": "เธอชอบว่ายน้ำเป็นการออกกำลังกาย"}
{"word": "exercise", "english": "Exercise is part of my New Year’s resolution.", "thai": "การออกกำลังกายเป็นส่วนหนึ่งของปณิธานปีใหม่ของฉัน"}
{"word": "exercise", "english": "He’s doing an exercise to build muscle.", "thai": "เขากำลังออกกำลังกายเพื่อสร้างกล้ามเนื้อ"}
{"word": "exercise", "english": "I’m skipping exercise today to rest.", "thai": "ฉันจะข้ามการออกกำลังกายวันนี้เพื่อพักผ่อน"}
{"word": "exercise", "english": "She’s doing an exercise for better posture.", "thai": "เธอกำลังออกกำลังกายเพื่อปรับปรุงท่าทาง"}
{"word": "exercise", "english": "Exercise feels easier with good weather.", "thai": "การออกกำลังกายรู้สึกง่ายขึ้นเมื่ออากาศดี"}
{"word": "exercise", "english": "He’s teaching his kids about exercise.", "thai": "เขากำลังสอนลูกๆ เกี่ยวกับการออกกำลังกาย"}
{"word": "exercise", "english": "I’m doing a quick exercise before work.", "thai": "ฉันกำลังออกกำลังกายสั้นๆ ก่อนทำงาน"}
{"word": "exercise", "english": "She’s trying a dance exercise class.", "thai": "เธอกำลังลองคลาสออกกำลังกายแบบเต้น"}
{"word": "exercise", "english": "Exercise is important for heart health.", "thai": "การออกกำลังกายสำคัญต่อสุขภาพหัวใจ"}
{"word": "exercise", "english": "He’s doing an exercise to relieve back pain.", "thai": "เขากำลังออกกำลังกายเพื่อบรรเทาอาการปวดหลัง"}
{"word": "exercise", "english": "I’m planning to exercise at the park.", "thai": "ฉันกำลังวhingานออกกำลังกายที่สวนสาธารณะ"}
{"word": "exercise", "english": "She’s doing a low-impact exercise routine.", "thai": "เธอกำลังออกกำลังกายแบบแรงกระแทกต่ำ"}
{"word": "exercise", "english": "Exercise helps me stay focused at work.", "thai": "การออกกำลังกายช่วยให้ฉันมีสมาธิในการทำงาน"}
{"word": "exercise", "english": "He’s doing an exercise to improve his speed.", "thai": "เขากำลังออกกำลังกายเพื่อเพิ่มความเร็ว"}
{"word": "exercise", "english": "I’m not in the mood for exercise today.", "thai": "ฉันไม่อยู่ในอารมณ์ออกกำลังกายวันนี้"}
{"word": "exercise", "english": "She’s doing an exercise with resistance bands.", "thai": "เธอกำลังออกกำลังกายด้วยยางยืด"}
{"word": "exercise", "english": "Exercise is a great way to start the day.", "thai": "การออกกำลังกายเป็นวิธีที่ดีในการเริ่มต้นวัน"}
{"word": "exercise", "english": "He’s following an exercise plan from a trainer.", "thai": "เขากำลังปฏิบัติตามแผนออกกำลังกายจากเทรนเนอร์"}
{"word": "exercise", "english": "I’m doing an exercise to tone my arms.", "thai": "ฉันกำลังออกกำลังกายเพื่อกระชับแขน"}
{"word": "exercise", "english": "She’s recommending exercise for better sleep.", "thai": "เธอแนะนำให้ออกกำลังกายเพื่อการนอนหลับที่ดีขึ้น"}
{"word": "exercise", "english": "Exercise is tough when you’re out of shape.", "thai": "การออกกำลังกายยากเมื่อคุณไม่ได้อยู่ในสภาพดี"}
{"word": "exercise", "english": "He’s doing an exercise to stretch his legs.", "thai": "เขากำลังออกกำลังกายเพื่อยืดขา"}
{"word": "exercise", "english": "I’m trying a new exercise for endurance.", "thai": "ฉันกำลังลองออกกำลังกายเพื่อเพิ่มความอดทน"}
{"word": "exercise", "english": "She’s doing an exercise video with her friends.", "thai": "เธอกำลังออกกำลังกายตามวิดีโอกับเพื่อนๆ"}
{"word": "exercise", "english": "Exercise is part of my wellness plan.", "thai": "การออกกำลังกายเป็นส่วนหนึ่งของแผนสุขภาพของฉัน"}
{"word": "exercise", "english": "He’s doing an exercise to improve flexibility.", "thai": "เขากำลังออกกำลังกายเพื่อเพิ่มความยืดหยุ่น"}
{"word": "exercise", "english": "I’m starting with light exercise this week.", "thai": "ฉันเริ่มต้นด้วยการออกกำลังกายเบาๆ สัปดาห์นี้"}
{"word": "exercise", "english": "She loves cycling as her main exercise.", "thai": "เธอชอบปั่นจักรยานเป็นการออกกำลังกายหลัก"}
{"word": "exercise", "english": "Exercise makes me feel more confident.", "thai": "การออกกำลังกายทำให้ฉันรู้สึกมั่นใจมากขึ้น"}
{"word": "exercise", "english": "He’s doing an exercise for his shoulders.", "thai": "เขากำลังออกกำลังกายเพื่อบ่า"}
{"word": "exercise", "english": "I’m doing an exercise class at the community center.", "thai": "ฉันกำลังออกกำลังกายในคลาสที่ศูนย์ชุมชน"}
{"word": "exercise", "english": "She’s trying to exercise more consistently.", "thai": "เธอพยายามออกกำลังกายอย่างสม่ำเสมอมากขึ้น"}
{"word": "exercise", "english": "Exercise is a great stress reliever for me.", "thai": "การออกกำลังกายเป็นวิธีคลายเครียดที่ดีสำหรับฉัน"}
{"word": "exercise", "english": "He’s doing an exercise to work on his abs.", "thai": "เขากำลังออกกำลังกายเพื่อฝึกกล้ามท้อง"}
{"word": "exercise", "english": "I’m planning to exercise after lunch.", "thai": "ฉันวางแผนจะออกกำลังกายหลังมื้อเที่ยง"}
{"word": "exercise", "english": "She’s doing an exercise to improve her endurance.", "thai": "เธอกำลังออกกำลังกายเพื่อเพิ่มความทนทาน"}
{"word": "exercise", "english": "Exercise feels better with a good playlist.", "thai": "การออกกำลังกายรู้สึกดีกว่าด้วยเพลย์ลิสต์ดีๆ"}
{"word": "exercise", "english": "He’s doing an exercise for better mobility.", "thai": "เขากำลังออกกำลังกายเพื่อเพิ่มการเคลื่อนไหว"}
{"word": "exercise", "english": "I’m starting an exercise group with friends.", "thai": "ฉันกำลังเริ่มกลุ่มออกกำลังกายกับเพื่อนๆ"}
{"word": "exercise", "english": "She’s doing an exercise to tone her legs.", "thai": "เธอกำลังออกกำลังกายเพื่อกระชับขา"}
{"word": "exercise", "english": "Exercise is part of my daily routine now.", "thai": "การออกกำลังกายเป็นส่วนหนึ่งของกิจวัตรประจำวันของฉันแล้ว"}
{"word": "exercise", "english": "He’s doing an exercise to help his knees.", "thai": "เขากำลังออกกำลังกายเพื่อช่วยเรื่องเข่า"}
{"word": "exercise", "english": "I’m trying an exercise for better balance.", "thai": "ฉันกำลังลองออกกำลังกายเพื่อการทรงตัวที่ดีขึ้น"}
{"word": "exercise", "english": "She’s doing an exercise class with her mom.", "thai": "เธอกำลังออกกำลังกายในคลาสกับแม่ของเธอ"}
{"word": "exercise", "english": "Exercise is my way to unwind after work.", "thai": "การออกกำลังกายเป็นวิธีผ่อนคลายของฉันหลังเลิกงาน"}
{"word": "exercise", "english": "He’s doing an exercise to boost his energy.", "thai": "เขากำลังออกกำลังกายเพื่อเพิ่มพลังงาน"}
{"word": "exploration", "english": "I’m planning an exploration of the nearby forest.", "thai": "ฉันกำลังวางแผนสำรวจป่าใกล้ๆ"}
{"word": "exploration", "english": "She loves space exploration and wants to be an astronaut.", "thai": "เธอรักการสำรวจอวกาศและอยากเป็นนักบินอวกาศ"}
{"word": "exploration", "english": "His exploration of the city was full of surprises.", "thai": "การสำรวจเมืองของเขามีแต่เรื่องน่าประหลาดใจ"}
{"word": "exploration", "english": "We’re going on an exploration of the caves tomorrow.", "thai": "เราจะไปสำรวจถ้ำพรุ่งนี้"}
{"word": "exploration", "english": "Exploration is key to learning new things.", "thai": "การสำรวจเป็นกุญแจสำคัญในการเรียนรู้สิ่งใหม่"}
{"word": "exploration", "english": "He’s funding an exploration to find rare plants.", "thai": "เขากำลังสนับสนุนการสำรวจเพื่อหาพืชหายาก"}
{"word": "exploration", "english": "Her exploration of new cuisines is inspiring.", "thai": "การสำรวจอาหารใหม่ๆ ของเธอน่าประทับใจ"}
{"word": "exploration", "english": "I’m excited for an exploration of the mountains.", "thai": "ฉันตื่นเต้นกับการสำรวจภูเขา"}
{"word": "exploration", "english": "Space exploration has always fascinated me.", "thai": "การสำรวจอวกาศทำให้ฉันหลงใหลเสมอ"}
{"word": "exploration", "english": "She’s writing a book about her exploration of Asia.", "thai": "เธอกำลังเขียนหนังสือเกี่ยวกับการสำรวจเอเชียของเธอ"}
{"word": "exploration", "english": "He’s leading an exploration team in the Arctic.", "thai": "เขากำลังนำทีมสำรวจในอาร์กติก"}
{"word": "exploration", "english": "Exploration of new ideas drives innovation.", "thai": "การสำรวจแนวคิดใหม่ผลักดันนวัตกรรม"}
{"word": "exploration", "english": "I’m ready for an exploration of the local culture.", "thai": "ฉันพร้อมสำหรับการสำรวจวัฒนธรรมท้องถิ่น"}
{"word": "exploration", "english": "Her exploration of history is so thorough.", "thai": "การสำรวจประวัติศาสตร์ของเธอละเอียดมาก"}
{"word": "exploration", "english": "He’s planning an exploration of the ocean floor.", "thai": "เขากำลังวางแผนสำรวจก้นมหาสมุทร"}
{"word": "exploration", "english": "Exploration is part of human curiosity.", "thai": "การสำรวจเป็นส่วนหนึ่งของความอยากรู้อยากเห็นของมนุษย์"}
{"word": "exploration", "english": "She’s into urban exploration of old buildings.", "thai": "เธอชอบสำรวจเมืองในตึกเก่าๆ"}
{"word": "exploration", "english": "I joined an exploration trip to the desert.", "thai": "ฉันเข้าร่วมทริปสำรวจทะเลทราย"}
{"word": "exploration", "english": "His exploration of music genres is impressive.", "thai": "การสำรวจแนวเพลงของเขาน่าประทับใจ"}
{"word": "exploration", "english": "We’re funding space exploration research.", "thai": "เรากำลังสนับสนุนการวิจัยสำรวจอวกาศ"}
{"word": "exploration", "english": "Exploration of the jungle sounds thrilling.", "thai": "การสำรวจป่าดงดิบฟังดูน่าตื่นเต้น"}
{"word": "exploration", "english": "She’s documenting her exploration of small towns.", "thai": "เธอกำลังบันทึกการสำรวจเมืองเล็กๆ ของเธอ"}
{"word": "exploration", "english": "He’s passionate about deep-sea exploration.", "thai": "เขาหลงใหลในการสำรวจทะเลลึก"}
{"word": "exploration", "english": "I’m reading about the history of space exploration.", "thai": "ฉันกำลังอ่านเกี่ยวกับประวัติศาสตร์ของการสำรวจอวกาศ"}
{"word": "exploration", "english": "Exploration of new hobbies keeps life exciting.", "thai": "การสำรวจงานอดิเรกใหม่ทำให้ชีวิตน่าตื่นเต้น"}
{"word": "exploration", "english": "She’s leading an exploration of ancient ruins.", "thai": "เธอกำลังนำการสำรวจซากโบราณ"}
{"word": "exploration", "english": "He’s planning an exploration of local markets.", "thai": "เขากำลังวางแผนสำรวจตลาดท้องถิ่น"}
{"word": "exploration", "english": "Exploration is how we discover new places.", "thai": "การสำรวจคือวิธีที่เราค้นพบสถานที่ใหม่"}
{"word": "exploration", "english": "I’m joining an exploration of the national park.", "thai": "ฉันกำลังเข้าร่วมการสำรวจอุทยานแห่งชาติ"}
{"word": "exploration", "english": "Her exploration of art history is fascinating.", "thai": "การสำรวจประวัติศาสตร์ศิลปะของเธอน่าสนใจ"}
{"word": "exploration", "english": "He’s into exploration of abandoned places.", "thai": "เขาชอบสำรวจสถานที่ร้าง"}
{"word": "exploration", "english": "Space exploration could change our future.", "thai": "การสำรวจอวกาศอาจเปลี่ยนอนาคตของเรา"}
{"word": "exploration", "english": "She’s on an exploration of her family’s roots.", "thai": "เธอกำลังสำรวจรากเหง้าของครอบครัว"}
{"word": "exploration", "english": "I’m excited about an exploration of the coastline.", "thai": "ฉันตื่นเต้นกับการสำรวจชายฝั่ง"}
{"word": "exploration", "english": "His exploration of science fiction is inspiring.", "thai": "การสำรวจนิยายวิทยาศาสตร์ของเขาน่าประทับใจ"}
{"word": "exploration", "english": "Exploration of new technology is my passion.", "thai": "การสำรวจเทคโนโลยีใหม่คือความหลงใหลของฉัน"}
{"word": "exploration", "english": "She’s planning an exploration of the islands.", "thai": "เธอกำลังวางแผนสำรวจหมู่เกาะ"}
{"word": "exploration", "english": "He’s funding an exploration of coral reefs.", "thai": "เขากำลังสนับสนุนการสำรวจแนวปะการัง"}
{"word": "exploration", "english": "I love the idea of space exploration missions.", "thai": "ฉันชอบแนวคิดของภารกิจสำรวจอวกาศ"}
{"word": "exploration", "english": "Her exploration of poetry is really creative.", "thai": "การสำรวจกวีนิพนธ์ของเธอสร้างสรรค์มาก"}
{"word": "exploration", "english": "He’s documenting his exploration of the wilderness.", "thai": "เขากำลังบันทึกการสำรวจป่าเขา"}
{"word": "exploration", "english": "Exploration of new cultures is so enriching.", "thai": "การสำรวจวัฒนธรรมใหม่ๆ ทำให้ชีวิตสมบูรณ์ขึ้น"}
{"word": "exploration", "english": "I’m planning an exploration of the old town.", "thai": "ฉันกำลังวางแผนสำรวจเมืองเก่า"}
{"word": "exploration", "english": "She’s teaching kids about space exploration.", "thai": "เธอกำลังสอนเด็กๆ เกี่ยวกับการสำรวจอวกาศ"}
{"word": "exploration", "english": "He’s into exploration of historical sites.", "thai": "เขาชอบสำรวจสถานที่ทางประวัติศาสตร์"}
{"word": "exploration", "english": "Exploration of the unknown is always exciting.", "thai": "การสำรวจสิ่งที่ไม่รู้จักน่าตื่นเต้นเสมอ"}
{"word": "exploration", "english": "I’m joining an exploration of the river valley.", "thai": "ฉันกำลังเข้าร่วมการสำรวจหุบเขาแม่น้ำ"}
{"word": "exploration", "english": "Her exploration of meditation is life-changing.", "thai": "การสำรวจการทำสมาธิของเธอเปลี่ยนชีวิต"}
{"word": "exploration", "english": "He’s leading an exploration of the rainforest.", "thai": "เขากำลังนำการสำรวจป่าฝน"}
{"word": "exploration", "english": "I’m reading about the exploration of Mars.", "thai": "ฉันกำลังอ่านเกี่ยวกับการสำรวจดาวอังคาร"}
{"word": "exploration", "english": "Exploration of new music keeps me inspired.", "thai": "การสำรวจดนตรีใหม่ทำให้ฉันมีแรงบันดาลใจ"}
{"word": "exploration", "english": "She’s on an exploration of local festivals.", "thai": "เธอกำลังสำรวจเทศกาลท้องถิ่น"}
{"word": "exploration", "english": "He’s passionate about Antarctic exploration.", "thai": "เขาหลงใหลในการสำรวจแอนตาร์กติก"}
{"word": "exploration", "english": "I’m excited for an exploration of the canyons.", "thai": "ฉันตื่นเต้นกับการสำรวจหุบเขา"}
{"word": "exploration", "english": "Her exploration of philosophy is so deep.", "thai": "การสำรวจปรัชญาของเธอลึกซึ้งมาก"}
{"word": "exploration", "english": "He’s planning an exploration of ancient temples.", "thai": "เขากำลังวางแผนสำรวจวัดโบราณ"}
{"word": "exploration", "english": "Exploration of space is humanity’s next frontier.", "thai": "การสำรวจอวกาศคือพรมแดนต่อไปของมนุษยชาติ"}
{"word": "exploration", "english": "I’m joining an exploration of the wetlands.", "thai": "ฉันกำลังเข้าร่วมการสำรวจพื้นที่ชุ่มน้ำ"}
{"word": "exploration", "english": "She’s documenting her exploration of street art.", "thai": "เธอกำลังบันทึกการสำรวจศิลปะข้างถนน"}
{"word": "exploration", "english": "He’s into exploration of new hiking trails.", "thai": "เขาชอบสำรวจเส้นทางเดินป่าใหม่ๆ"}
{"word": "exploration", "english": "Exploration of the mind fascinates me.", "thai": "การสำรวจจิตใจทำให้ฉันหลงใหล"}
{"word": "exploration", "english": "I’m planning an exploration of the countryside.", "thai": "ฉันกำลังวางแผนสำรวจชนบท"}
{"word": "exploration", "english": "She’s teaching about the exploration of the Americas.", "thai": "เธอกำลังสอนเกี่ยวกับการสำรวจทวีปอเมริกา"}
{"word": "exploration", "english": "He’s funding an exploration of volcanic regions.", "thai": "เขากำลังสนับสนุนการสำรวจพื้นที่ภูเขาไฟ"}
{"word": "exploration", "english": "Exploration of new books is my favorite hobby.", "thai": "การสำรวจหนังสือใหม่คืองานอดิเรกที่ฉันชอบ"}
{"word": "exploration", "english": "I’m excited about an exploration of the lakes.", "thai": "ฉันตื่นเต้นกับการสำรวจทะเลสาบ"}
{"word": "exploration", "english": "Her exploration of dance styles is amazing.", "thai": "การสำรวจสไตล์การเต้นของเธอน่าทึ่ง"}
{"word": "exploration", "english": "He’s leading an exploration of the tundra.", "thai": "เขากำลังนำการสำรวจทุ่งทุนดรา"}
{"word": "exploration", "english": "I’m reading about the exploration of the moon.", "thai": "ฉันกำลังอ่านเกี่ยวกับการสำรวจดวงจันทร์"}
{"word": "exploration", "english": "Exploration of new flavors excites my palate.", "thai": "การสำรวจรสชาติใหม่ทำให้ต่อมรับรสของฉันตื่นเต้น"}
{"word": "exploration", "english": "She’s on an exploration of her heritage.", "thai": "เธอกำลังสำรวจมรดกของเธอ"}
{"word": "exploration", "english": "He’s into exploration of old shipwrecks.", "thai": "เขาชอบสำรวจซากเรือเก่า"}
{"word": "exploration", "english": "I’m joining an exploration of the highlands.", "thai": "ฉันกำลังเข้าร่วมการสำรวจที่ราบสูง"}
{"word": "exploration", "english": "Exploration of science is so rewarding.", "thai": "การสำรวจวิทยาศาสตร์ให้ผลตอบแทนมาก"}
{"word": "exploration", "english": "She’s documenting her exploration of vineyards.", "thai": "เธอกำลังบันทึกการสำรวจไร่องุ่น"}
{"word": "exploration", "english": "He’s planning an exploration of the savanna.", "thai": "เขากำลังวางแผนสำรวจทุ่งหญ้าสะวันนา"}
{"word": "exploration", "english": "I’m excited for an exploration of the beaches.", "thai": "ฉันตื่นเต้นกับการสำรวจชายหาด"}
{"word": "exploration", "english": "Her exploration of literature is inspiring.", "thai": "การสำรวจวรรณกรรมของเธอน่าประทับใจ"}
{"word": "exploration", "english": "He’s into exploration of ancient artifacts.", "thai": "เขาชอบสำรวจโบราณวัตถุ"}
{"word": "exploration", "english": "Exploration of new places keeps me alive.", "thai": "การสำรวจสถานที่ใหม่ทำให้ฉันมีชีวิตชีวา"}
{"word": "exploration", "english": "I’m joining an exploration of the coral islands.", "thai": "ฉันกำลังเข้าร่วมการสำรวจเกาะปะการัง"}
{"word": "exploration", "english": "She’s teaching about the exploration of the oceans.", "thai": "เธอกำลังสอนเกี่ยวกับการสำรวจมหาสมุทร"}
{"word": "exploration", "english": "He’s funding an exploration of remote villages.", "thai": "เขากำลังสนับสนุนการสำรวจหมู่บ้านห่างไกล"}
{"word": "exploration", "english": "I’m reading about the exploration of Antarctica.", "thai": "ฉันกำลังอ่านเกี่ยวกับการสำรวจแอนตาร์กติกา"}
{"word": "exploration", "english": "Exploration of new skills is always fun.", "thai": "การสำรวจทักษะใหม่ๆ สนุกเสมอ"}
{"word": "exploration", "english": "She’s on an exploration of local history.", "thai": "เธอกำลังสำรวจประวัติศาสตร์ท้องถิ่น"}
{"word": "exploration", "english": "He’s passionate about space exploration technology.", "thai": "เขาหลงใหลในเทคโนโลยีการสำรวจอวกาศ"}
{"word": "exploration", "english": "I’m planning an exploration of the old castle.", "thai": "ฉันกำลังวางแผนสำรวจปราสาทเก่า"}
{"word": "exploration", "english": "Her exploration of spirituality is profound.", "thai": "การสำรวจจิตวิญญาณของเธอลึกซึ้ง"}
{"word": "exploration", "english": "He’s leading an exploration of the caves.", "thai": "เขากำลังนำการสำรวจถ้ำ"}
{"word": "exploration", "english": "Exploration of new landscapes is my dream.", "thai": "การสำรวจภูมิทัศน์ใหม่คือความฝันของฉัน"}
{"word": "exploration", "english": "I’m joining an exploration of the forest trails.", "thai": "ฉันกำลังเข้าร่วมการสำรวจเส้นทางป่า"}
{"word": "exploration", "english": "She’s documenting her exploration of markets.", "thai": "เธอกำลังบันทึกการสำรวจตลาด"}
{"word": "exploration", "english": "He’s into exploration of rare ecosystems.", "thai": "เขาชอบสำรวจระบบนิเวศที่หายาก"}
{"word": "exploration", "english": "I’m excited about an exploration of the rivers.", "thai": "ฉันตื่นเต้นกับการสำรวจแม่น้ำ"}
{"word": "exploration", "english": "Exploration of new ideas fuels creativity.", "thai": "การสำรวจแนวคิดใหม่กระตุ้นความคิดสร้างสรรค์"}
{"word": "exploration", "english": "She’s on an exploration of traditional crafts.", "thai": "เธอกำลังสำรวจงานฝีมือแบบดั้งเดิม"}
{"word": "exploration", "english": "He’s planning an exploration of the tundra.", "thai": "เขากำลังวางแผนสำรวจทุ่งทุนดรา"}
{"word": "exploration", "english": "I’m reading about the exploration of new planets.", "thai": "ฉันกำลังอ่านเกี่ยวกับการสำรวจดาวเคราะห์ใหม่"}
{"word": "exploration", "english": "Exploration of the outdoors is my favorite activity.", "thai": "การสำรวจกลางแจ้งคือกิจกรรมที่ฉันชอบที่สุด"}
{"word": "festival", "english": "I’m going to the music festival this weekend.", "thai": "ฉันจะไปงานเทศกาลดนตรีสุดสัปดาห์นี้"}
{"word": "festival", "english": "The town is hosting a food festival next month.", "thai": "เมืองนี้จะจัดงานเทศกาลอาหารเดือนหน้า"}
{"word": "festival", "english": "She loves the vibe at the arts festival.", "thai": "เธอชอบบรรยากาศในงานเทศกาลศิลปะ"}
{"word": "festival", "english": "We had so much fun at the summer festival.", "thai": "เราสนุกมากในงานเทศกาลฤดูร้อน"}
{"word": "festival", "english": "He’s performing at the jazz festival tomorrow.", "thai": "เขาจะแสดงในงานเทศกาลแจ๊สพรุ่งนี้"}
{"word": "festival", "english": "The festival is known for its amazing fireworks.", "thai": "งานเทศกาลนี้ขึ้นชื่อเรื่องดอกไม้ไฟที่สวยงาม"}
{"word": "festival", "english": "I’m volunteering at the film festival this year.", "thai": "ฉันจะเป็นอาสาสมัครในงานเทศกาลภาพยนตร์ปีนี้"}
{"word": "festival", "english": "She bought a cool hat at the cultural festival.", "thai": "เธอซื้อหมวกเท่ๆ ในงานเทศกาลวัฒนธรรม"}
{"word": "festival", "english": "The harvest festival is always a big event.", "thai": "งานเทศกาลเก็บเกี่ยวเป็นงานใหญ่เสมอ"}
{"word": "festival", "english": "I’m excited for the lantern festival tonight.", "thai": "ฉันตื่นเต้นกับงานเทศกาลโคมไฟคืนนี้"}
{"word": "festival", "english": "He’s selling his art at the street festival.", "thai": "เขากำลังขายผลงานศิลปะในงานเทศกาลถนน"}
{"word": "festival", "english": "The festival has the best food trucks.", "thai": "งานเทศกาลนี้มีรถขายอาหารที่ดีที่สุด"}
{"word": "festival", "english": "She’s dancing at the folk festival this weekend.", "thai": "เธอจะเต้นในงานเทศกาลพื้นบ้านสุดสัปดาห์นี้"}
{"word": "festival", "english": "I’m taking my kids to the kite festival.", "thai": "ฉันจะพาลูกๆ ไปงานเทศกาลว่าว"}
{"word": "festival", "english": "The music festival was packed with people.", "thai": "งานเทศกาลดนตรีเต็มไปด้วยผู้คน"}
{"word": "festival", "english": "He’s organizing a beer festival downtown.", "thai": "เขากำลังจัดงานเทศกาลเบียร์ในตัวเมือง"}
{"word": "festival", "english": "I got these earrings at the craft festival.", "thai": "ฉันได้ต่างหูนี้จากงานเทศกาลงานฝีมือ"}
{"word": "festival", "english": "The festival celebrates local traditions.", "thai": "งานเทศกาลนี้เฉลิมฉลองประเพณีท้องถิ่น"}
{"word": "festival", "english": "She’s singing at the gospel festival Sunday.", "thai": "เธอจะร้องเพลงในงานเทศกาลกอสเปลวันอาทิตย์"}
{"word": "festival", "english": "I’m heading to the wine festival this afternoon.", "thai": "ฉันจะไปงานเทศกาลไวน์บ่ายนี้"}
{"word": "festival", "english": "The festival had live music and dancing.", "thai": "งานเทศกาลนี้มีดนตรีสดและการเต้นรำ"}
{"word": "festival", "english": "He’s competing in the chili cook-off festival.", "thai": "เขากำลังแข่งขันในงานเทศกาลปรุงพริก"}
{"word": "festival", "english": "I love the energy at the spring festival.", "thai": "ฉันชอบพลังในงานเทศกาลฤดูใบไม้ผลิ"}
{"word": "festival", "english": "She’s attending a literary festival next week.", "thai": "เธอจะไปงานเทศกาลวรรณกรรมสัปดาห์หน้า"}
{"word": "festival", "english": "The festival is famous for its parades.", "thai": "งานเทศกาลนี้มีชื่อเสียงจากขบวนพาเหรด"}
{"word": "festival", "english": "I’m bringing my camera to the flower festival.", "thai": "ฉันจะพกกล้องไปงานเทศกาลดอกไม้"}
{"word": "festival", "english": "He’s playing drums at the reggae festival.", "thai": "เขาจะตีกลองในงานเทศกาลเรกเก้"}
{"word": "festival", "english": "The festival has a huge Ferris wheel.", "thai": "งานเทศกาลนี้มีชิงช้าสวรรค์ขนาดใหญ่"}
{"word": "festival", "english": "She’s selling jewelry at the artisan festival.", "thai": "เธอกำลังขายเครื่องประดับในงานเทศกาลช่างฝีมือ"}
{"word": "festival", "english": "I’m going to the balloon festival this year.", "thai": "ฉันจะไปงานเทศกาลบอลลูนปีนี้"}
{"word": "festival", "english": "The festival is all about local history.", "thai": "งานเทศกาลนี้เกี่ยวกับประวัติศาสตร์ท้องถิ่น"}
{"word": "festival", "english": "He’s cooking at the barbecue festival Saturday.", "thai": "เขาจะทำอาหารในงานเทศกาลบาร์บีคิววันเสาร์"}
{"word": "festival", "english": "I’m excited for the pumpkin festival in October.", "thai": "ฉันตื่นเต้นกับงานเทศกาลฟักทองในเดือนตุลาคม"}
{"word": "festival", "english": "She’s performing poetry at the cultural festival.", "thai": "เธอจะแสดงกวีนิพนธ์ในงานเทศกาลวัฒนธรรม"}
{"word": "festival", "english": "The festival had amazing street performers.", "thai": "งานเทศกาลนี้มีนักแสดงข้างถนนที่ยอดเยี่ยม"}
{"word": "festival", "english": "I’m helping set up the community festival.", "thai": "ฉันกำลังช่วยจัดงานเทศกาลชุมชน"}
{"word": "festival", "english": "He’s going to the rock festival with friends.", "thai": "เขาจะไปงานเทศกาลร็อกกับเพื่อนๆ"}
{"word": "festival", "english": "The festival is free for everyone to attend.", "thai": "งานเทศกาลนี้เข้าฟรีสำหรับทุกคน"}
{"word": "festival", "english": "She’s teaching a workshop at the art festival.", "thai": "เธอกำลังสอนเวิร์กช็อปในงานเทศกาลศิลปะ"}
{"word": "festival", "english": "I’m driving to the county festival tomorrow.", "thai": "ฉันจะขับรถไปงานเทศกาลประจำเทศมณฑลพรุ่งนี้"}
{"word": "festival", "english": "The festival features local bands and artists.", "thai": "งานเทศกาลนี้มีวงดนตรีและศิลปินท้องถิ่น"}
{"word": "festival", "english": "He’s entering his pie in the festival contest.", "thai": "เขาจะส่งพายเข้าร่วมการแข่งขันในงานเทศกาล"}
{"word": "festival", "english": "I love the lights at the winter festival.", "thai": "ฉันชอบแสงไฟในงานเทศกาลฤดูหนาว"}
{"word": "festival", "english": "She’s volunteering at the children’s festival.", "thai": "เธอกำลังเป็นอาสาสมัครในงานเทศกาลสำหรับเด็ก"}
{"word": "festival", "english": "The festival is a big deal in our town.", "thai": "งานเทศกาลนี้เป็นเรื่องใหญ่ในเมืองของเรา"}
{"word": "festival", "english": "He’s playing guitar at the folk festival.", "thai": "เขาจะเล่นกีตาร์ในงานเทศกาลพื้นบ้าน"}
{"word": "festival", "english": "I’m checking out the seafood festival today.", "thai": "ฉันจะไปดูงานเทศกาลอาหารทะเลวันนี้"}
{"word": "festival", "english": "The festival has a great lineup of bands.", "thai": "งานเทศกาลนี้มีรายชื่อวงดนตรีที่ยอดเยี่ยม"}
{"word": "festival", "english": "She’s selling her pottery at the craft festival.", "thai": "เธอกำลังขายเครื่องปั้นดินเผาในงานเทศกาลงานฝีมือ"}
{"word": "festival", "english": "I’m taking photos at the heritage festival.", "thai": "ฉันจะถ่ายรูปในงานเทศกาลมรดก"}
{"word": "festival", "english": "The festival is all about celebrating diversity.", "thai": "งานเทศกาลนี้เกี่ยวกับการเฉลิมฉลองความหลากหลาย"}
{"word": "festival", "english": "He’s performing at the comedy festival next week.", "thai": "เขาจะแสดงในงานเทศกาลตลกสัปดาห์หน้า"}
{"word": "festival", "english": "I’m going to the strawberry festival this spring.", "thai": "ฉันจะไปงานเทศกาลสตรอว์เบอร์รี่ฤดูใบไม้ผลินี้"}
{"word": "festival", "english": "The festival had the best tacos I’ve ever tasted.", "thai": "งานเทศกาลนี้มีทาโก้ที่อร่อยที่สุดที่ฉันเคยชิม"}
{"word": "festival", "english": "She’s dancing at the cultural festival tonight.", "thai": "เธอจะเต้นในงานเทศกาลวัฒนธรรมคืนนี้"}
{"word": "festival", "english": "I’m excited for the holiday festival downtown.", "thai": "ฉันตื่นเต้นกับงานเทศกาลวันหยุดในตัวเมือง"}
{"word": "festival", "english": "He’s selling lemonade at the summer festival.", "thai": "เขากำลังขายน้ำมะนาวในงานเทศกาลฤดูร้อน"}
{"word": "festival", "english": "The festival is famous for its costume contest.", "thai": "งานเทศกาลนี้มีชื่อเสียงจากประกวดชุดแต่งกาย"}
{"word": "festival", "english": "I’m bringing my dog to the pet festival.", "thai": "ฉันจะพาหมาไปงานเทศกาลสัตว์เลี้ยง"}
{"word": "festival", "english": "She’s running a booth at the farmers’ festival.", "thai": "เธอกำลังดูแลร้านในงานเทศกาลชาวนา"}
{"word": "festival", "english": "The festival has games for kids and adults.", "thai": "งานเทศกาลนี้มีเกมสำหรับเด็กและผู้ใหญ่"}
{"word": "festival", "english": "He’s playing at the blues festival this weekend.", "thai": "เขาจะเล่นในงานเทศกาลบลูส์สุดสัปดาห์นี้"}
{"word": "festival", "english": "I’m going to the apple festival in the fall.", "thai": "ฉันจะไปงานเทศกาลแอปเปิ้ลในฤดูใบไม้ร่วง"}
{"word": "festival", "english": "The festival is a great place to meet people.", "thai": "งานเทศกาลนี้เป็นสถานที่ที่ดีในการพบปะผู้คน"}
{"word": "festival", "english": "She’s teaching kids crafts at the festival.", "thai": "เธอกำลังสอนเด็กๆ ทำงานฝีมือในงานเทศกาล"}
{"word": "festival", "english": "I’m checking out the book festival tomorrow.", "thai": "ฉันจะไปดูงานเทศกาลหนังสือพรุ่งนี้"}
{"word": "festival", "english": "The festival has a huge outdoor market.", "thai": "งานเทศกาลนี้มีตลาดกลางแจ้งขนาดใหญ่"}
{"word": "festival", "english": "He’s performing magic at the street festival.", "thai": "เขาจะแสดงมายากลในงานเทศกาลถนน"}
{"word": "festival", "english": "I’m going to the cultural festival with friends.", "thai": "ฉันจะไปงานเทศกาลวัฒนธรรมกับเพื่อนๆ"}
{"word": "festival", "english": "The festival is all about local crafts.", "thai": "งานเทศกาลนี้เกี่ยวกับงานฝีมือท้องถิ่น"}
{"word": "festival", "english": "She’s competing in the dance festival Saturday.", "thai": "เธอจะแข่งขันในงานเทศกาลเต้นวันเสาร์"}
{"word": "festival", "english": "I love the food at the international festival.", "thai": "ฉันชอบอาหารในงานเทศกาลนานาชาติ"}
{"word": "festival", "english": "He’s setting up lights for the winter festival.", "thai": "เขากำลังติดตั้งไฟสำหรับงานเทศกาลฤดูหนาว"}
{"word": "festival", "english": "The festival is packed with fun activities.", "thai": "งานเทศกาลนี้เต็มไปด้วยกิจกรรมสนุกๆ"}
{"word": "festival", "english": "I’m volunteering at the music festival this year.", "thai": "ฉันจะเป็นอาสาสมัครในงานเทศกาลดนตรีปีนี้"}
{"word": "festival", "english": "She’s selling her art at the summer festival.", "thai": "เธอกำลังขายผลงานศิลปะในงานเทศกาลฤดูร้อน"}
{"word": "festival", "english": "The festival celebrates the town’s history.", "thai": "งานเทศกาลนี้เฉลิมฉลองประวัติศาสตร์ของเมือง"}
{"word": "festival", "english": "I’m going to the beer festival with my brother.", "thai": "ฉันจะไปงานเทศกาลเบียร์กับพี่ชาย"}
{"word": "festival", "english": "He’s playing violin at the classical festival.", "thai": "เขาจะเล่นไวโอลินในงานเทศกาลดนตรีคลาสสิก"}
{"word": "festival", "english": "The festival has a cool vintage car show.", "thai": "งานเทศกาลนี้มีการแสดงรถวินเทจที่เจ๋งมาก"}
{"word": "festival", "english": "I’m excited for the cherry blossom festival.", "thai": "ฉันตื่นเต้นกับงานเทศกาลดอกซากุระ"}
{"word": "festival", "english": "She’s running a game booth at the festival.", "thai": "เธอกำลังดูแลบูธเกมในงานเทศกาล"}
{"word": "festival", "english": "The festival is a great spot for photos.", "thai": "งานเทศกาลนี้เป็นจุดถ่ายรูปที่ดีมาก"}
{"word": "festival", "english": "He’s cooking for the food festival downtown.", "thai": "เขากำลังทำอาหารสำหรับงานเทศกาลอาหารในตัวเมือง"}
{"word": "festival", "english": "I’m bringing my kids to the science festival.", "thai": "ฉันจะพาลูกๆ ไปงานเทศกาลวิทยาศาสตร์"}
{"word": "festival", "english": "The festival has live performances all day.", "thai": "งานเทศกาลนี้มีการแสดงสดทั้งวัน"}
{"word": "festival", "english": "She’s selling candles at the holiday festival.", "thai": "เธอกำลังขายเทียนในงานเทศกาลวันหยุด"}
{"word": "festival", "english": "I’m going to the wine and cheese festival.", "thai": "ฉันจะไปงานเทศกาลไวน์และชีส"}
{"word": "festival", "english": "The festival is a highlight of the summer.", "thai": "งานเทศกาลนี้เป็นไฮไลต์ของฤดูร้อน"}
{"word": "festival", "english": "He’s judging a contest at the festival.", "thai": "เขากำลังตัดสินการแข่งขันในงานเทศกาล"}
{"word": "festival", "english": "I’m checking out the lantern festival tonight.", "thai": "ฉันจะไปดูงานเทศกาลโคมไฟคืนนี้"}
{"word": "festival", "english": "The festival is known for its unique crafts.", "thai": "งานเทศกาลนี้ขึ้นชื่อเรื่องงานฝีมือที่ไม่เหมือนใคร"}
{"word": "festival", "english": "She’s performing at the dance festival tomorrow.", "thai": "เธอจะแสดงในงานเทศกาลเต้นพรุ่งนี้"}
{"word": "festival", "english": "I’m excited for the multicultural festival.", "thai": "ฉันตื่นเต้นกับงานเทศกาลหลากวัฒนธรรม"}
{"word": "festival", "english": "The festival has a great kids’ play area.", "thai": "งานเทศกาลนี้มีพื้นที่เล่นสำหรับเด็กที่เยี่ยมมาก"}
{"word": "festival", "english": "He’s selling his photos at the art festival.", "thai": "เขากำลังขายภาพถ่ายในงานเทศกาลศิลปะ"}
{"word": "festival", "english": "I’m going to the fall festival with my family.", "thai": "ฉันจะไปงานเทศกาลฤดูใบไม้ร่วงกับครอบครัว"}
{"word": "festival", "english": "The festival is all about local music.", "thai": "งานเทศกาลนี้เกี่ยวกับดนตรีท้องถิ่น"}
{"word": "festival", "english": "She’s helping organize the spring festival.", "thai": "เธอกำลังช่วยจัดงานเทศกาลฤดูใบไม้ผลิ"}
{"word": "festival", "english": "I’m checking out the street food festival.", "thai": "ฉันจะไปดูงานเทศกาลอาหารข้างถนน"}
