{"word":"helps","english":"Volunteering at the shelter helps me feel fulfilled.","thai":"การเป็นอาสาสมัครที่ศูนย์พักพิงช่วยให้ฉันรู้สึกเติมเต็ม"}
{"word":"feel","english":"I feel so relaxed after a yoga session.","thai":"ฉันรู้สึกผ่อนคลายมากหลังจากฝึกโยคะ"}
{"word":"relaxed","english":"Sipping coffee in a cozy café makes me relaxed.","thai":"การจิบกาแฟในร้านกาแฟที่อบอุ่นทำให้ฉันผ่อนคลาย"}
{"word":"coffee","english":"I always pick up coffee before work.","thai":"ฉันมักจะซื้อกาแฟก่อนไปทำงาน"}
{"word":"work","english":"Teamwork at work boosts our productivity.","thai":"การทำงานเป็นทีมที่ทำงานช่วยเพิ่มผลผลิตของเรา"}
{"word":"teamwork","english":"Good teamwork turns ideas into reality.","thai":"การทำงานเป็นทีมที่ดีเปลี่ยนไอเดียให้เป็นจริง"}
{"word":"ideas","english":"Brainstorming fresh ideas is my favorite part of the job.","thai":"การระดมความคิดใหม่ๆ เป็นส่วนที่ฉันชอบที่สุดในงาน"}
{"word":"favorite","english":"This diner serves my favorite burger in town.","thai":"ร้านอาหารนี้เสิร์ฟเบอร์เกอร์ที่ฉันชอบที่สุดในเมือง"}
{"word":"burger","english":"Grilling a burger at the barbecue is always fun.","thai":"การย่างเบอร์เกอร์ที่งานบาร์บีคิวสนุกเสมอ"}
{"word":"fun","english":"Playing board games with friends is so much fun.","thai":"การเล่นบอร์ดเกมกับเพื่อนๆ สนุกมาก"}
{"word":"friends","english":"I ran into old friends at the music festival.","thai":"ฉันบังเอิญเจอเพื่อนเก่าที่งานเทศกาลดนตรี"}
{"word":"music","english":"Listening to music helps me unwind after a long day.","thai":"การฟังเพลงช่วยให้ฉันผ่อนคลายหลังจากวันที่ยาวนาน"}
{"word":"day","english":"A sunny day is perfect for a hike.","thai":"วันที่แดดออกเหมาะสำหรับการเดินป่า"}
{"word":"hike","english":"I love to hike through the forest trails.","thai":"ฉันชอบเดินป่าผ่านเส้นทางในป่า"}
{"word":"love","english":"I love trying new recipes in the kitchen.","thai":"ฉันชอบลองสูตรอาหารใหม่ๆ ในครัว"}
{"word":"kitchen","english":"Renovating the kitchen was a game-changer for our home.","thai":"การปรับปรุงครัวเปลี่ยนบ้านของเราไปเลย"}
{"word":"home","english":"Working from home saves me commuting time.","thai":"การทำงานจากบ้านช่วยประหยัดเวลาเดินทาง"}
{"word":"time","english":"Managing my time well keeps me on track.","thai":"การจัดการเวลาอย่างดีช่วยให้ฉันไม่หลุดจากเป้าหมาย"}
{"word":"track","english":"I track my workouts to stay motivated.","thai":"ฉันติดตามการออกกำลังกายเพื่อรักษาแรงจูงใจ"}
{"word":"motivated","english":"A good mentor keeps me motivated in my career.","thai":"ที่ปรึกษาที่ดีช่วยให้ฉันมีแรงจูงใจในอาชีพ"}
{"word":"career","english":"Switching to a new career was a bold move.","thai":"การเปลี่ยนไปสู่อาชีพใหม่เป็นการตัดสินใจที่กล้าหาญ"}
{"word":"move","english":"I helped my friend move to a new apartment.","thai":"ฉันช่วยเพื่อนย้ายไปอพาร์ตเมนต์ใหม่"}
{"word":"apartment","english":"My apartment has a great view of the city.","thai":"อพาร์ตเมนต์ของฉันมีวิวเมืองที่สวยงาม"}
{"word":"view","english":"I love to view the stars through my telescope.","thai":"ฉันชอบดูดาวผ่านกล้องโทรทรรศน์"}
{"word":"stars","english":"The movie stars threw an epic party.","thai":"ดาราภาพยนตร์จัด10จัดงานปาร์ตี้สุดยิ่งใหญ่"}
{"word":"party","english":"The block party brought the whole neighborhood together.","thai":"งานปาร์ตี้ในชุมชนทำให้ทั้งละแวกใกล้เคียงมารวมตัวกัน"}
{"word":"together","english":"We worked together to clean up the park.","thai":"เราทำงานร่วมกันเพื่อทำความสะอาดสวนสาธารณะ"}
{"word":"clean","english":"I need to clean out my closet this weekend.","thai":"ฉันต้องทำความสะอาดตู้เสื้อผ้าสุดสัปดาห์นี้"}
{"word":"weekend","english":"The weekend farmer’s market is always bustling.","thai":"ตลาดนัดสุดสัปดาห์ของเกษตรกรคึกคักเสมอ"}
{"word":"market","english":"The stock market can be unpredictable.","thai":"ตลาดหุ้นอาจคาดเดาได้ยาก"}
{"word":"unpredictable","english":"The weather here is so unpredictable lately.","thai":"สภาพอากาศที่นี่คาดเดาไม่ได้เลยช่วงนี้"}
{"word":"weather","english":"Bad weather canceled our camping trip.","thai":"สภาพอากาศไม่ดีทำให้ทริปแคมป์ปิ้งของเรายกเลิก"}
{"word":"trip","english":"A road trip across the country sounds epic.","thai":"การเดินทางข้ามประเทศดูยิ่งใหญ่"}
{"word":"road","english":"The road to success is never easy.","thai":"เส้นทางสู่ความสำเร็จไม่เคยง่าย"}
{"word":"success","english":"Hard work pays off for success in school.","thai":"การทำงานหนักให้ผลตอบแทนสำหรับความสำเร็จในโรงเรียน"}
{"word":"school","english":"I picked up new skills at cooking school.","thai":"ฉันเรียนรู้ทักษะใหม่ๆ ที่โรงเรียนสอนทำอาหาร"}
{"word":"skills","english":"Her photography skills are absolutely stunning.","thai":"ทักษะการถ่ายภาพของเธอน่าทึ่งมาก"}
{"word":"photography","english":"Photography captures moments we cherish forever.","thai":"การถ่ายภาพจับภาพช่วงเวลาที่เราทะนุถนอมตลอดไป"}
{"word":"moments","english":"Sharing quiet moments with my pet is priceless.","thai":"การแบ่งปันช่วงเวลาที่เงียบสงบกับสัตว์เลี้ยงของฉันมีค่ามาก"}
{"word":"pet","english":"My pet always cheers me up.","thai":"สัตว์เลี้ยงของฉันทำให้ฉันรู้สึกดีขึ้นเสมอ"}
{"word":"cheers","english":"A good laugh cheers everyone up.","thai":"เสียงหัวเราะที่ดีทำให้ทุกคนรู้สึกดีขึ้น"}
{"word":"laugh","english":"We couldn’t stop laughing at the comedy show.","thai":"เราหยุดหัวเราะไม่ได้ที่โชว์ตลก"}
{"word":"show","english":"The talent show at school was a blast.","thai":"การแสดงความสามารถที่โรงเรียนสนุกมาก"}
{"word":"blast","english":"Gaming with friends is always a blast.","thai":"การเล่นเกมกับเพื่อนๆ สนุกสุดๆ เสมอ"}
{"word":"gaming","english":"Gaming online connects me with people worldwide.","thai":"การเล่นเกมออนไลน์เชื่อมโยงฉันกับผู้คนทั่วโลก"}
{"word":"people","english":"Meeting new people at the festival was awesome.","thai":"การพบปะผู้คนใหม่ๆ ที่งานเทศกาลนั้นยอดเยี่ยมมาก"}
{"word":"awesome","english":"That new restaurant’s vibe is totally awesome.","thai":"บรรยากาศของร้านอาหารใหม่นั้นเจ๋งสุดๆ"}
{"word":"vibe","english":"The coffee shop has a chill vibe.","thai":"ร้านกาแฟมีบรรยากาศที่ผ่อนคลาย"}
{"word":"chill","english":"I like to chill with a good book.","thai":"ฉันชอบพักผ่อนกับหนังสือดีๆ"}
{"word":"book","english":"I couldn’t put down that mystery book.","thai":"ฉันวางหนังสือลึกลับเล่มนั้นลงไม่ได้"}
{"word":"mystery","english":"The mystery of the missing keys was solved.","thai":"ปริศนาของกุญแจที่หายไปได้รับการแก้ไขแล้ว"}
{"word":"solved","english":"We solved the puzzle in record time.","thai":"เราแก้ปริศนาได้ในเวลาที่เร็วเป็นประวัติการณ์"}
{"word":"puzzle","english":"Jigsaw puzzles are my go-to for relaxation.","thai":"จิ๊กซอว์เป็นสิ่งที่ฉันเลือกเพื่อการผ่อนคลาย"}
{"word":"relaxation","english":"Meditation is key for my relaxation routine.","thai":"การนั่งสมาธิเป็นกุญแจสำคัญในกิจวัตรการผ่อนคลายของฉัน"}
{"word":"routine","english":"My morning routine includes a quick jog.","thai":"กิจวัตรยามเช้าของฉันรวมถึงการวิ่งเหยาะๆ สั้นๆ"}
{"word":"morning","english":"The morning hike offered stunning views.","thai":"การเดินป่ายามเช้ามีวิวที่สวยงาม"}
{"word":"views","english":"Her views on sustainability inspired us all.","thai":"มุมมองของเธอเกี่ยวกับความยั่งยืนสร้างแรงบันดาลใจให้เราทุกคน"}
{"word":"inspired","english":"That TED Talk really inspired my career goals.","thai":"TED Talk นั้นสร้างแรงบันดาลใจให้กับเป้าหมายในอาชีพของฉันจริงๆ"}
{"word":"goals","english":"Setting clear goals keeps me focused.","thai":"การตั้งเป้าหมายที่ชัดเจนช่วยให้ฉันมีสมาธิ"}
{"word":"focused","english":"Staying focused during meetings is tough sometimes.","thai":"การมีสมาธิในระหว่างการประชุมบางครั้งก็ยาก"}
{"word":"meetings","english":"Team meetings spark creative solutions.","thai":"การประชุมทีมจุดประกายโซลูชันที่สร้างสรรค์"}
{"word":"creative","english":"Her creative approach to art stands out.","thai":"แนวทางการสร้างสรรค์ของเธอในงานศิลปะโดดเด่น"}
{"word":"art","english":"Street art transforms the city’s look.","thai":"ศิลปะข้างถนนเปลี่ยนโฉมหน้าของเมือง"}
{"word":"city","english":"The city buzzes with energy at night.","thai":"เมืองนี้เต็มไปด้วยพลังในตอนกลางคืน"}
{"word":"energy","english":"Solar energy powers our eco-friendly home.","thai":"พลังงานแสงอาทิตย์ขับเคลื่อนบ้านที่เป็นมิตรต่อสิ่งแวดล้อมของเรา"}
{"word":"home","english":"Smart home tech makes life easier.","thai":"เทคโนโลยีบ้านอัจฉริยะทำให้ชีวิตง่ายขึ้น"}
{"word":"life","english":"Balancing work and life is a challenge.","thai":"การสร้างสมดุลระหว่างงานและชีวิตเป็นความท้าทาย"}
{"word":"challenge","english":"I took on the challenge of learning guitar.","thai":"ฉันรับความท้าทายในการเรียนกีตาร์"}
{"word":"guitar","english":"Playing guitar at the campfire was magical.","thai":"การเล่นกีตาร์ที่กองไฟนั้นวิเศษมาก"}
{"word":"campfire","english":"We shared stories around the campfire.","thai":"เราแบ่งปันเรื่องราวรอบกองไฟ"}
{"word":"stories","english":"Her travel stories always captivate me.","thai":"เรื่องราวการเดินทางของเธอทำให้ฉันหลงใหลเสมอ"}
{"word":"travel","english":"I love to travel light and spontaneously.","thai":"ฉันชอบเดินทางแบบเบาๆ และตามใจชอบ"}
{"word":"light","english":"The festival’s light show was breathtaking.","thai":"การแสดงแสงสีของงานเทศกาลนั้นน่าทึ่ง"}
{"word":"show","english":"Reality TV shows are my guilty pleasure.","thai":"รายการเรียลลิตี้ทีวีคือความสุขต้องห้ามของฉัน"}
{"word":"pleasure","english":"Cooking for friends is a real pleasure.","thai":"การทำอาหารให้เพื่อนๆ เป็นความสุขที่แท้จริง"}
{"word":"cooking","english":"Cooking classes taught me new techniques.","thai":"ชั้นเรียนทำอาหารสอนเทคนิคใหม่ๆ ให้ฉัน"}
{"word":"techniques","english":"Her negotiation techniques sealed the deal.","thai":"เทคนิคการเจรจาของเธอทำให้ข้อตกลงสำเร็จ"}
{"word":"deal","english":"We struck a deal at the flea market.","thai":"เราตกลงซื้อของที่ตลาดนัด"}
{"word":"market","english":"Local markets support small businesses.","thai":"ตลาดท้องถิ่นสนับสนุนธุรกิจขนาดเล็ก"}
{"word":"businesses","english":"Entrepreneurship drives new businesses forward.","thai":"การเป็นผู้ประกอบการขับเคลื่อนธุรกิจใหม่ๆ ไปข้างหน้า"}
{"word":"forward","english":"I’m looking forward to the holiday season.","thai":"ฉันตั้งตารอฤดูกาลวันหยุด"}
{"word":"holiday","english":"Holiday baking fills the house with warmth.","thai":"การอบขนมวันหยุดทำให้บ้านเต็มไปด้วยความอบอุ่น"}
{"word":"house","english":"Flipping a house takes serious effort.","thai":"การพลิกบ้านต้องใช้ความพยายามอย่างมาก"}
{"word":"effort","english":"Team effort won us the championship.","thai":"ความพยายามของทีมทำให้เราได้แชมป์"}
{"word":"team","english":"Our team nailed the project deadline.","thai":"ทีมของเราทำโปรเจกต์เสร็จทันกำหนด"}
{"word":"project","english":"The science project blew everyone away.","thai":"โปรเจกต์วิทยาศาสตร์ทำให้ทุกคนทึ่ง"}
{"word":"science","english":"Science fairs spark kids’ curiosity.","thai":"งานนิทรรศการวิทยาศาสตร์จุดประกายความอยากรู้อยากเห็นของเด็กๆ"}
{"word":"curiosity","english":"Curiosity drives my love for podcasts.","thai":"ความอยากรู้อยากเห็นขับเคลื่อนความรักของฉันที่มีต่อพอดแคสต์"}
{"word":"podcasts","english":"I listen to podcasts during my commute.","thai":"ฉันฟังพอดแคสต์ระหว่างเดินทาง"}
{"word":"commute","english":"My commute gives me time to think.","thai":"การเดินทางไปทำงานให้เวลาฉันได้คิด"}
{"word":"think","english":"I think hiking beats gym workouts.","thai":"ฉันคิดว่าการเดินป่าดีกว่าการออกกำลังกายในยิม"}
{"word":"hiking","english":"Hiking with my dog is pure joy.","thai":"การเดินป่ากับสุนัขของฉันคือความสุขล้วนๆ"}
{"word":"joy","english":"Sharing a meal brings joy to my family.","thai":"การแบ่งปันมื้ออาหารนำความสุขมาสู่ครอบครัวของฉัน"}
{"word":"family","english":"Family game nights are always a hit.","thai":"คืนเล่นเกมของครอบครัวได้รับความนิยมเสมอ"}
{"word":"hit","english":"Her new song is a total hit.","thai":"เพลงใหม่ของเธอได้รับความนิยมอย่างมาก"}
{"word":"song","english":"We sang a song at the karaoke bar.","thai":"เราร้องเพลงที่บาร์คาราโอเกะ"}
