{"word": "department", "english": "The marketing department is launching a new campaign next week.", "thai": "แผนกการตลาดกำลังเปิดตัวแคมเปญใหม่ในสัปดาห์หน้า"}
{"word": "department", "english": "I need to speak with someone from the HR department about my benefits.", "thai": "ฉันต้องพูดกับใครสักคนจากแผนกทรัพยากรบุคคลเกี่ยวกับสวัสดิการของฉัน"}
{"word": "department", "english": "Our department is understaffed, so we're hiring new employees.", "thai": "แผนกของเราขาดแคลนพนักงาน ดังนั้นเรากำลังจ้างพนักงานใหม่"}
{"word": "department", "english": "The IT department fixed my computer in less than an hour.", "thai": "แผนกไอทีซ่อมคอมพิวเตอร์ของฉันในเวลาไม่ถึงหนึ่งชั่วโมง"}
{"word": "department", "english": "Which department is responsible for handling customer complaints?", "thai": "แผนกไหนรับผิดชอบจัดการกับข้อร้องเรียนของลูกค้า?"}
{"word": "department", "english": "The finance department approved the budget for the new project.", "thai": "แผนกการเงินอนุมัติงบประมาณสำหรับโครงการใหม่"}
{"word": "department", "english": "She works in the sales department and loves her job.", "thai": "เธอทำงานในแผนกขายและรักงานของเธอ"}
{"word": "department", "english": "The research department is working on a groundbreaking study.", "thai": "แผนกวิจัยกำลังทำงานเกี่ยวกับการศึกษาที่ก้าวล้ำ"}
{"word": "department", "english": "I got transferred to the logistics department last month.", "thai": "ฉันถูกย้ายไปที่แผนกโลจิสติกส์เมื่อเดือนที่แล้ว"}
{"word": "department", "english": "The department meeting is scheduled for Friday morning.", "thai": "การประชุมแผนกถูกกำหนดไว้ในเช้าวันศุกร์"}
{"word": "department", "english": "Our department head is retiring at the end of the year.", "thai": "หัวหน้าแผนกของเราจะเกษียณในสิ้นปีนี้"}
{"word": "department", "english": "The customer service department is open 24 hours a day.", "thai": "แผนกบริการลูกค้าเปิดให้บริการ 24 ชั่วโมงต่อวัน"}
{"word": "department", "english": "The engineering department designed a new prototype.", "thai": "แผนกวิศวกรรมออกแบบต้นแบบใหม่"}
{"word": "department", "english": "I left my jacket in the accounting department by mistake.", "thai": "ฉันลืมแจ็คเก็ตไว้ในแผนกบัญชีโดยไม่ได้ตั้งใจ"}
{"word": "department", "english": "The legal department is reviewing the new contract.", "thai": "แผนกกฎหมายกำลังตรวจสอบสัญญาใหม่"}
{"word": "department", "english": "The department store is having a big sale this weekend.", "thai": "ห้างสรรพสินค้ากำลังจัดงานลดราคาครั้งใหญ่ในสุดสัปดาห์นี้"}
{"word": "department", "english": "Our department is collaborating with the marketing team on this.", "thai": "แผนกของเรากำลังร่วมงานกับทีมการตลาดในเรื่องนี้"}
{"word": "department", "english": "The quality control department caught the error before shipping.", "thai": "แผนกควบคุมคุณภาพตรวจพบข้อผิดพลาดก่อนการจัดส่ง"}
{"word": "department", "english": "I need approval from the operations department to proceed.", "thai": "ฉันต้องการการอนุมัติจากแผนกปฏิบัติการเพื่อดำเนินการต่อ"}
{"word": "department", "english": "The department budget was cut by 10% this year.", "thai": "งบประมาณของแผนกถูกตัด 10% ในปีนี้"}
{"word": "department", "english": "She’s the new manager of the development department.", "thai": "เธอเป็นผู้จัดการคนใหม่ของแผนกพัฒนา"}
{"word": "department", "english": "The purchasing department ordered new office supplies.", "thai": "แผนกจัดซื้อสั่งซื้ออุปกรณ์สำนักงานใหม่"}
{"word": "department", "english": "Our department is hosting a team-building event next month.", "thai": "แผนกของเรากำลังจัดงานสร้างทีมในเดือนหน้า"}
{"word": "department", "english": "The communications department sent out a company-wide email.", "thai": "แผนกสื่อสารส่งอีเมลทั่วทั้งบริษัท"}
{"word": "department", "english": "The department is short on staff due to the holidays.", "thai": "แผนกขาดแคลนพนักงานเนื่องจากวันหยุด"}
{"word": "department", "english": "I’m meeting with the design department this afternoon.", "thai": "ฉันจะประชุมกับแผนกออกแบบในบ่ายนี้"}
{"word": "department", "english": "The production department is working overtime to meet demand.", "thai": "แผนกผลิตทำงานล่วงเวลาเพื่อตอบสนองความต้องการ"}
{"word": "department", "english": "The department is planning a holiday party for December.", "thai": "แผนกกำลังวางแผนจัดงานปาร์ตี้วันหยุดในเดือนธันวาคม"}
{"word": "department", "english": "The maintenance department fixed the broken elevator.", "thai": "แผนกซ่อมบำรุงซ่อมลิฟต์ที่เสีย"}
{"word": "department", "english": "The department manager asked for a progress report.", "thai": "ผู้จัดการแผนกขอรายงานความคืบหน้า"}
{"word": "department", "english": "Our department is moving to a new office next month.", "thai": "แผนกของเราจะย้ายไปที่สำนักงานใหม่ในเดือนหน้า"}
{"word": "department", "english": "The compliance department ensures we follow regulations.", "thai": "แผนกปฏิบัติตามกฎระเบียบทำให้แน่ใจว่าเราปฏิบัติตามกฎ"}
{"word": "department", "english": "The shipping department handles all outgoing packages.", "thai": "แผนกจัดส่งจัดการพัสดุขาออกทั้งหมด"}
{"word": "department", "english": "I need to visit the records department to get a file.", "thai": "ฉันต้องไปที่แผนกบันทึกเพื่อขอไฟล์"}
{"word": "department", "english": "The department is adopting new software next quarter.", "thai": "แผนกจะเริ่มใช้ซอฟต์แวร์ใหม่ในไตรมาสหน้า"}
{"word": "department", "english": "The training department offers free workshops monthly.", "thai": "แผนกฝึกอบรมจัดเวิร์กช็อปฟรีทุกเดือน"}
{"word": "department", "english": "The department is behind schedule on the new project.", "thai": "แผนกกำลังล่าช้าในโครงการใหม่"}
{"word": "department", "english": "The security department monitors the building 24/7.", "thai": "แผนกรักษาความปลอดภัยดูแลอาคารตลอด 24 ชั่วโมง"}
{"word": "department", "english": "The department is looking for volunteers for the event.", "thai": "แผนกกำลังมองหาอาสาสมัครสำหรับงานนี้"}
{"word": "department", "english": "The auditing department found discrepancies in the books.", "thai": "แผนกตรวจสอบพบความคลาดเคลื่อนในบัญชี"}
{"word": "department", "english": "The department is hosting a webinar next Tuesday.", "thai": "แผนกจะจัดงานสัมมนาออนไลน์ในวันอังคารหน้า"}
{"word": "department", "english": "The procurement department negotiates with suppliers.", "thai": "แผนกจัดหาทำการเจรจากับซัพพลายเออร์"}
{"word": "department", "english": "The department is upgrading its equipment this year.", "thai": "แผนกกำลังอัพเกรดอุปกรณ์ในปีนี้"}
{"word": "department", "english": "The public relations department issued a press release.", "thai": "แผนกประชาสัมพันธ์ออกแถลงการณ์ต่อสื่อ"}
{"word": "department", "english": "The department is divided into three smaller teams.", "thai": "แผนกถูกแบ่งออกเป็นสามทีมย่อย"}
{"word": "department", "english": "The HR department is organizing a diversity workshop.", "thai": "แผนกทรัพยากรบุคคลกำลังจัดเวิร์กช็อปความหลากหลาย"}
{"word": "department", "english": "The department is struggling with the new software.", "thai": "แผนกกำลังมีปัญหากับซอฟต์แวร์ใหม่"}
{"word": "department", "english": "The marketing department created a viral ad campaign.", "thai": "แผนกการตลาดสร้างแคมเปญโฆษณาที่กลายเป็นไวรัล"}
{"word": "department", "english": "The department is responsible for quality assurance.", "thai": "แผนกนี้รับผิดชอบด้านการประกันคุณภาพ"}
{"word": "department", "english": "The IT department is upgrading the company servers.", "thai": "แผนกไอทีกำลังอัพเกรดเซิร์ฟเวอร์ของบริษัท"}
{"word": "department", "english": "The department is holding a brainstorming session tomorrow.", "thai": "แผนกจะจัดเซสชันระดมความคิดในวันพรุ่งนี้"}
{"word": "department", "english": "The sales department exceeded its quarterly goals.", "thai": "แผนกขายเกินเป้าหมายรายไตรมาส"}
{"word": "department", "english": "The department is testing a new workflow system.", "thai": "แผนกกำลังทดสอบระบบเวิร์กโฟลว์ใหม่"}
{"word": "department", "english": "The finance department is preparing the annual report.", "thai": "แผนกการเงินกำลังจัดทำรายงานประจำปี"}
{"word": "department", "english": "The department is under pressure to meet deadlines.", "thai": "แผนกกำลังเผชิญแรงกดดันในการทำตามกำหนดเวลา"}
{"word": "department", "english": "The research department published a new paper.", "thai": "แผนกวิจัยตีพิมพ์เอกสารฉบับใหม่"}
{"word": "department", "english": "The department is hiring a new assistant manager.", "thai": "แผนกกำลังจ้างผู้ช่วยผู้จัดการคนใหม่"}
{"word": "department", "english": "The logistics department streamlined the supply chain.", "thai": "แผนกโลจิสติกส์ปรับปรุงห่วงโซ่อุปทานให้คล่องตัว"}
{"word": "department", "english": "The department is planning a team retreat.", "thai": "แผนกกำลังวางแผนการพักผ่อนของทีม"}
{"word": "department", "english": "The customer service department resolved my issue quickly.", "thai": "แผนกบริการลูกค้าแก้ไขปัญหาของฉันอย่างรวดเร็ว"}
{"word": "department", "english": "The department is rolling out a new policy next month.", "thai": "แผนกจะเริ่มใช้นโยบายใหม่ในเดือนหน้า"}
{"word": "department", "english": "The engineering department is prototyping a new device.", "thai": "แผนกวิศวกรรมกำลังสร้างต้นแบบอุปกรณ์ใหม่"}
{"word": "department", "english": "The department is celebrating its 10th anniversary.", "thai": "แผนกกำลังฉลองครบรอบ 10 ปี"}
{"word": "department", "english": "The legal department advised against the merger.", "thai": "แผนกกฎหมายแนะนำให้ต่อต้านการควบรวม"}
{"word": "department", "english": "The department is conducting a satisfaction survey.", "thai": "แผนกกำลังดำเนินการสำรวจความพึงพอใจ"}
{"word": "department", "english": "The marketing department is targeting younger audiences.", "thai": "แผนกการตลาดกำลังมุ่งเป้าไปที่กลุ่มผู้ชมที่อายุน้อยกว่า"}
{"word": "department", "english": "The department is working on a tight budget.", "thai": "แผนกกำลังทำงานภายใต้งบประมาณที่จำกัด"}
{"word": "department", "english": "The IT department is troubleshooting network issues.", "thai": "แผนกไอทีกำลังแก้ไขปัญหาเครือข่าย"}
{"word": "department", "english": "The department is organizing a charity fundraiser.", "thai": "แผนกกำลังจัดงานระดมทุนเพื่อการกุศล"}
{"word": "department", "english": "The sales department is forecasting higher revenue.", "thai": "แผนกขายคาดการณ์รายได้ที่สูงขึ้น"}
{"word": "department", "english": "The department is implementing new safety protocols.", "thai": "แผนกกำลังดำเนินการตามโปรโตคอลความปลอดภัยใหม่"}
{"word": "department", "english": "The finance department is auditing last year’s expenses.", "thai": "แผนกการเงินกำลังตรวจสอบค่าใช้จ่ายของปีที่แล้ว"}
{"word": "department", "english": "The department is launching a new initiative.", "thai": "แผนกกำลังเปิดตัวโครงการริเริ่มใหม่"}
{"word": "department", "english": "The HR department is updating the employee handbook.", "thai": "แผนกทรัพยากรบุคคลกำลังอัพเดตคู่มือพนักงาน"}
{"word": "department", "english": "The department is collaborating on a cross-functional project.", "thai": "แผนกกำลังร่วมงานในโครงการข้ามสายงาน"}
{"word": "department", "english": "The quality control department rejected the faulty batch.", "thai": "แผนกควบคุมคุณภาพปฏิเสธชุดผลิตภัณฑ์ที่มีข้อบกพร่อง"}
{"word": "department", "english": "The department is hosting a guest speaker next week.", "thai": "แผนกจะจัดงานที่มีวิทยากรรับเชิญในสัปดาห์หน้า"}
{"word": "department", "english": "The operations department optimized the workflow.", "thai": "แผนกปฏิบัติการปรับปรุงเวิร์กโฟลว์ให้เหมาะสม"}
{"word": "department", "english": "The department is relocating to a bigger office.", "thai": "แผนกกำลังย้ายไปที่สำนักงานที่ใหญ่กว่า"}
{"word": "department", "english": "The communications department is redesigning the website.", "thai": "แผนกสื่อสารกำลังออกแบบเว็บไซต์ใหม่"}
{"word": "department", "english": "The department is facing a staffing shortage.", "thai": "แผนกกำลังเผชิญกับการขาดแคลนพนักงาน"}
{"word": "department", "english": "The design department is presenting their concepts tomorrow.", "thai": "แผนกออกแบบจะนำเสนอแนวคิดของพวกเขาในวันพรุ่งนี้"}
{"word": "department", "english": "The department is adopting eco-friendly practices.", "thai": "แผนกกำลังนำแนวปฏิบัติที่เป็นมิตรต่อสิ่งแวดล้อมมาใช้"}
{"word": "department", "english": "The production department is scaling up output.", "thai": "แผนกผลิตกำลังเพิ่มปริมาณการผลิต"}
{"word": "department", "english": "The department is reviewing its annual goals.", "thai": "แผนกกำลังทบทวนเป้าหมายประจำปี"}
{"word": "department", "english": "The maintenance department is on call this weekend.", "thai": "แผนกซ่อมบำรุงพร้อมให้บริการในสุดสัปดาห์นี้"}
{"word": "department", "english": "The department is preparing for a major audit.", "thai": "แผนกกำลังเตรียมตัวสำหรับการตรวจสอบครั้งใหญ่"}
{"word": "department", "english": "The purchasing department secured a better deal.", "thai": "แผนกจัดซื้อได้ข้อตกลงที่ดีกว่า"}
{"word": "department", "english": "The department is transitioning to remote work.", "thai": "แผนกกำลังเปลี่ยนไปทำงานระยะไกล"}
{"word": "department", "english": "The security department installed new cameras.", "thai": "แผนกรักษาความปลอดภัยติดตั้งกล้องใหม่"}
{"word": "department", "english": "The department is brainstorming new product ideas.", "thai": "แผนกกำลังระดมความคิดสำหรับไอเดียผลิตภัณฑ์ใหม่"}
{"word": "department", "english": "The auditing department flagged an unusual expense.", "thai": "แผนกตรวจสอบตั้งข้อสงสัยเกี่ยวกับค่าใช้จ่ายที่ผิดปกติ"}
{"word": "department", "english": "The department is offering flexible work hours.", "thai": "แผนกกำลังเสนอเวลาทำงานที่ยืดหยุ่น"}
{"word": "department", "english": "The procurement department is vetting new vendors.", "thai": "แผนกจัดหาคัดเลือกผู้ค้าส่งรายใหม่"}
{"word": "department", "english": "The department is hosting a training session.", "thai": "แผนกกำลังจัดเซสชันฝึกอบรม"}
{"word": "department", "english": "The public relations department is managing the crisis.", "thai": "แผนกประชาสัมพันธ์กำลังจัดการกับวิกฤต"}
{"word": "department", "english": "The department is evaluating its performance metrics.", "thai": "แผนกกำลังประเมินตัวชี้วัดผลงาน"}
{"word": "department", "english": "The compliance department updated the guidelines.", "thai": "แผนกปฏิบัติตามกฎระเบียบอัพเดตแนวทาง"}
{"word": "department", "english": "The department is restructuring its leadership team.", "thai": "แผนกกำลังปรับโครงสร้างทีมผู้นำ"}
{"word": "project", "english": "The team is working hard to finish the project by Friday.", "thai": "ทีมกำลังทำงานหนักเพื่อให้โครงการเสร็จภายในวันศุกร์"}
{"word": "project", "english": "I’m leading a new project to improve our website.", "thai": "ฉันกำลังเป็นผู้นำโครงการใหม่เพื่อปรับปรุงเว็บไซต์ของเรา"}
{"word": "project", "english": "The project deadline was extended by two weeks.", "thai": "กำหนดเวลาโครงการถูกขยายออกไปอีกสองสัปดาห์"}
{"word": "project", "english": "She presented the project proposal to the board yesterday.", "thai": "เธอนำเสนอข้อเสนอโครงการต่อคณะกรรมการเมื่อวานนี้"}
{"word": "project", "english": "This project requires more funding than we expected.", "thai": "โครงการนี้ต้องการเงินทุนมากกว่าที่เราคาดไว้"}
{"word": "project", "english": "We need to assign more staff to the project.", "thai": "เราต้องจัดสรรพนักงานเพิ่มให้กับโครงการ"}
{"word": "project", "english": "The project is running smoothly so far.", "thai": "โครงการนี้ดำเนินไปอย่างราบรื่นจนถึงตอนนี้"}
{"word": "project", "english": "He’s been working on a secret project for months.", "thai": "เขาทำงานในโครงการลับมาหลายเดือนแล้ว"}
{"word": "project", "english": "The project manager scheduled a meeting for tomorrow.", "thai": "ผู้จัดการโครงการนัดประชุมในวันพรุ่งนี้"}
{"word": "project", "english": "Our latest project aims to reduce energy consumption.", "thai": "โครงการล่าสุดของเรามุ่งลดการใช้พลังงาน"}
{"word": "project", "english": "The project is behind schedule due to delays.", "thai": "โครงการล่าช้าเนื่องจากความล่าช้า"}
{"word": "project", "english": "I’m excited to join the new research project.", "thai": "ฉันตื่นเต้นที่ได้เข้าร่วมโครงการวิจัยใหม่"}
{"word": "project", "english": "The project team is brainstorming new ideas.", "thai": "ทีมโครงการกำลังระดมความคิดใหม่"}
{"word": "project", "english": "This project has a tight budget, so we need to be careful.", "thai": "โครงการนี้มีงบจำกัด ดังนั้นเราต้องระวัง"}
{"word": "project", "english": "The client approved the project plan last week.", "thai": "ลูกค้าอนุมัติแผนโครงการเมื่อสัปดาห์ที่แล้ว"}
{"word": "project", "english": "The project launch is set for next month.", "thai": "การเปิดตัวโครงการถูกกำหนดไว้ในเดือนหน้า"}
{"word": "project", "english": "We’re collaborating with another company on this project.", "thai": "เรากำลังร่วมงานกับบริษัทอื่นในโครงการนี้"}
{"word": "project", "english": "The project requires approval from the CEO.", "thai": "โครงการนี้ต้องได้รับการอนุมัติจากซีอีโอ"}
{"word": "project", "english": "She’s managing multiple projects at the same time.", "thai": "เธอกำลังจัดการหลายโครงการพร้อมกัน"}
{"word": "project", "english": "The project is on track to meet its goals.", "thai": "โครงการนี้อยู่ในเส้นทางที่จะบรรลุเป้าหมาย"}
{"word": "project", "english": "I need feedback on the project draft by Monday.", "thai": "ฉันต้องการความคิดเห็นเกี่ยวกับร่างโครงการภายในวันจันทร์"}
{"word": "project", "english": "The project was a huge success last year.", "thai": "โครงการนี้ประสบความสำเร็จอย่างมากเมื่อปีที่แล้ว"}
{"word": "project", "english": "We’re hiring a consultant for the project.", "thai": "เรากำลังจ้างที่ปรึกษาสำหรับโครงการ"}
{"word": "project", "english": "The project scope changed after the client’s input.", "thai": "ขอบเขตของโครงการเปลี่ยนไปหลังจากได้รับข้อมูลจากลูกค้า"}
{"word": "project", "english": "This project is our top priority right now.", "thai": "โครงการนี้เป็นสิ่งสำคัญอันดับแรกของเราตอนนี้"}
{"word": "project", "english": "The project timeline is very aggressive.", "thai": "กำหนดเวลาโครงการนี้เข้มงวดมาก"}
{"word": "project", "english": "He’s been assigned to a high-profile project.", "thai": "เขาได้รับมอบหมายให้ทำโครงการที่มีชื่อเสียง"}
{"word": "project", "english": "The project is funded by a government grant.", "thai": "โครงการนี้ได้รับเงินทุนจากรัฐบาล"}
{"word": "project", "english": "We need to finalize the project budget today.", "thai": "เราต้องสรุปงบประมาณโครงการวันนี้"}
{"word": "project", "english": "The project team is meeting twice a week.", "thai": "ทีมโครงการประชุมสัปดาห์ละสองครั้ง"}
{"word": "project", "english": "This project involves a lot of fieldwork.", "thai": "โครงการนี้เกี่ยวข้องกับการทำงานนอกสถานที่มาก"}
{"word": "project", "english": "The project is expected to create new jobs.", "thai": "คาดว่าโครงการนี้จะสร้างงานใหม่"}
{"word": "project", "english": "We’re facing challenges with the project timeline.", "thai": "เรากำลังเผชิญกับความท้าทายในกำหนดเวลาโครงการ"}
{"word": "project", "english": "The project requires advanced technical skills.", "thai": "โครงการนี้ต้องการทักษะทางเทคนิคขั้นสูง"}
{"word": "project", "english": "The project kickoff meeting is next Tuesday.", "thai": "การประชุมเริ่มต้นโครงการคือวันอังคารหน้า"}
{"word": "project", "english": "I’m volunteering for the community project.", "thai": "ฉันกำลังเป็นอาสาสมัครสำหรับโครงการชุมชน"}
{"word": "project", "english": "The project is still in the planning phase.", "thai": "โครงการยังอยู่ในขั้นตอนการวางแผน"}
{"word": "project", "english": "We completed the project ahead of schedule.", "thai": "เราเสร็จสิ้นโครงการก่อนกำหนด"}
{"word": "project", "english": "The project is part of a larger initiative.", "thai": "โครงการนี้เป็นส่วนหนึ่งของความริเริ่มที่ใหญ่กว่า"}
{"word": "project", "english": "The project team needs more resources.", "thai": "ทีมโครงการต้องการทรัพยากรเพิ่ม"}
{"word": "project", "english": "This project will take at least six months.", "thai": "โครงการนี้จะใช้เวลาอย่างน้อยหกเดือน"}
{"word": "project", "english": "The project is aimed at improving efficiency.", "thai": "โครงการนี้มุ่งเป้าไปที่การปรับปรุงประสิทธิภาพ"}
{"word": "project", "english": "We’re outsourcing part of the project.", "thai": "เรากำลังจ้างงานบางส่วนของโครงการ"}
{"word": "project", "english": "The project is attracting a lot of attention.", "thai": "โครงการนี้กำลังดึงดูดความสนใจอย่างมาก"}
{"word": "project", "english": "I’m writing a report on the project’s progress.", "thai": "ฉันกำลังเขียนรายงานเกี่ยวกับความคืบหน้าของโครงการ"}
{"word": "project", "english": "The project involves multiple departments.", "thai": "โครงการนี้เกี่ยวข้องกับหลายแผนก"}
{"word": "project", "english": "We’re scaling back the project due to costs.", "thai": "เรากำลังลดขนาดโครงการเนื่องจากต้นทุน"}
{"word": "project", "english": "The project is moving into the testing phase.", "thai": "โครงการกำลังเข้าสู่ขั้นตอนการทดสอบ"}
{"word": "project", "english": "The project leader is very experienced.", "thai": "ผู้นำโครงการมีประสบการณ์มาก"}
{"word": "project", "english": "This project aligns with our company’s goals.", "thai": "โครงการนี้สอดคล้องกับเป้าหมายของบริษัทเรา"}
{"word": "project", "english": "The project requires regular status updates.", "thai": "โครงการนี้ต้องการการอัพเดทสถานะอย่างสม่ำเสมอ"}
{"word": "project", "english": "We’re presenting the project to investors soon.", "thai": "เราจะนำเสนอโครงการต่อนักลงทุนในไม่ช้า"}
{"word": "project", "english": "The project is critical to our success.", "thai": "โครงการนี้สำคัญต่อความสำเร็จของเรา"}
{"word": "project", "english": "The project team is working remotely this week.", "thai": "ทีมโครงการกำลังทำงานจากระยะไกลในสัปดาห์นี้"}
{"word": "project", "english": "The project is funded by private investors.", "thai": "โครงการนี้ได้รับเงินทุนจากนักลงทุนเอกชน"}
{"word": "project", "english": "We need to revise the project timeline.", "thai": "เราต้องปรับปรุงกำหนดเวลาโครงการ"}
{"word": "project", "english": "The project is generating a lot of buzz.", "thai": "โครงการนี้กำลังสร้างกระแสมาก"}
{"word": "project", "english": "The project coordinator is organizing a workshop.", "thai": "ผู้ประสานงานโครงการกำลังจัดเวิร์กช็อป"}
{"word": "project", "english": "This project could change the industry.", "thai": "โครงการนี้สามารถเปลี่ยนแปลงอุตสาหกรรมได้"}
{"word": "project", "english": "The project is facing unexpected setbacks.", "thai": "โครงการกำลังเผชิญกับอุปสรรคที่ไม่คาดคิด"}
{"word": "project", "english": "We’re recruiting interns for the project.", "thai": "เรากำลังรับสมัครนักศึกษาฝึกงานสำหรับโครงการ"}
{"word": "project", "english": "The project is focused on sustainability.", "thai": "โครงการนี้มุ่งเน้นเรื่องความยั่งยืน"}
{"word": "project", "english": "The project deadline is non-negotiable.", "thai": "กำหนดเวลาโครงการนี้ไม่สามารถต่อรองได้"}
{"word": "project", "english": "The project is almost ready for launch.", "thai": "โครงการนี้เกือบพร้อมสำหรับการเปิดตัว"}
{"word": "project", "english": "We’re conducting a survey for the project.", "thai": "เรากำลังดำเนินการสำรวจสำหรับโครงการ"}
{"word": "project", "english": "The project is part of a global initiative.", "thai": "โครงการนี้เป็นส่วนหนึ่งของความริเริ่มระดับโลก"}
{"word": "project", "english": "The project requires weekly progress reports.", "thai": "โครงการนี้ต้องการรายงานความคืบหน้าประจำสัปดาห์"}
{"word": "project", "english": "The project is ahead of its milestones.", "thai": "โครงการนี้ล้ำหน้าไปกว่าหลักไมล์ที่ตั้งไว้"}
{"word": "project", "english": "We’re troubleshooting issues with the project.", "thai": "เรากำลังแก้ไขปัญหากับโครงการ"}
{"word": "project", "english": "The project is a collaboration with a university.", "thai": "โครงการนี้เป็นการร่วมมือกับมหาวิทยาลัย"}
{"word": "project", "english": "The project is on hold until further notice.", "thai": "โครงการนี้ถูกระงับจนกว่าจะมีประกาศเพิ่มเติม"}
{"word": "project", "english": "The project team is very motivated.", "thai": "ทีมโครงการมีแรงจูงใจสูงมาก"}
{"word": "project", "english": "The project is expected to finish early.", "thai": "คาดว่าโครงการนี้จะเสร็จก่อนกำหนด"}
{"word": "project", "english": "We’re pitching the project to new clients.", "thai": "เรากำลังนำเสนอโครงการให้ลูกค้าใหม่"}
{"word": "project", "english": "The project is part of a larger campaign.", "thai": "โครงการนี้เป็นส่วนหนึ่งของแคมเปญที่ใหญ่กว่า"}
{"word": "project", "english": "The project requires specialized equipment.", "thai": "โครงการนี้ต้องการอุปกรณ์เฉพาะทาง"}
{"word": "project", "english": "The project is under review by the board.", "thai": "โครงการนี้อยู่ระหว่างการพิจารณาของคณะกรรมการ"}
{"word": "project", "english": "We’re expanding the project’s scope.", "thai": "เรากำลังขยายขอบเขตของโครงการ"}
{"word": "project", "english": "The project is attracting media coverage.", "thai": "โครงการนี้กำลังได้รับความสนใจจากสื่อ"}
{"word": "project", "english": "The project team is working around the clock.", "thai": "ทีมโครงการกำลังทำงานตลอดเวลา"}
{"word": "project", "english": "The project is funded through crowdfunding.", "thai": "โครงการนี้ได้รับเงินทุนผ่านการระดมทุน"}
{"word": "project", "english": "We’re documenting the project for a case study.", "thai": "เรากำลังบันทึกโครงการสำหรับกรณีศึกษา"}
{"word": "project", "english": "The project is aimed at helping local businesses.", "thai": "โครงการนี้มุ่งช่วยเหลือธุรกิจท้องถิ่น"}
{"word": "project", "english": "The project is progressing faster than expected.", "thai": "โครงการนี้ดำเนินไปเร็วกว่าที่คาด"}
{"word": "project", "english": "We’re seeking volunteers for the project.", "thai": "เรากำลังมองหาอาสาสมัครสำหรับโครงการ"}
{"word": "project", "english": "The project is a joint venture with a partner.", "thai": "โครงการนี้เป็นการร่วมทุนกับพันธมิตร"}
{"word": "project", "english": "The project is designed to improve safety.", "thai": "โครงการนี้ถูกออกแบบมาเพื่อปรับปรุงความปลอดภัย"}
{"word": "project", "english": "We’re reallocating resources for the project.", "thai": "เรากำลังจัดสรรทรัพยากรใหม่สำหรับโครงการ"}
{"word": "project", "english": "The project is in its final stages.", "thai": "โครงการนี้อยู่ในขั้นตอนสุดท้าย"}
{"word": "project", "english": "The project is a long-term investment.", "thai": "โครงการนี้เป็นการลงทุนระยะยาว"}
{"word": "project", "english": "We’re evaluating the project’s impact.", "thai": "เรากำลังประเมินผลกระทบของโครงการ"}
{"word": "project", "english": "The project is on budget so far.", "thai": "โครงการนี้อยู่ในงบประมาณจนถึงตอนนี้"}
{"word": "project", "english": "The project team is preparing a presentation.", "thai": "ทีมโครงการกำลังเตรียมการนำเสนอ"}
{"word": "project", "english": "The project is part of our strategic plan.", "thai": "โครงการนี้เป็นส่วนหนึ่งของแผนกลยุทธ์ของเรา"}
{"word": "project", "english": "We’re celebrating the project’s completion.", "thai": "เรากำลังฉลองการเสร็จสิ้นของโครงการ"}
{"word": "project", "english": "The project is facing budget constraints.", "thai": "โครงการนี้กำลังเผชิญกับข้อจำกัดด้านงบประมาณ"}
{"word": "project", "english": "The project is a priority for the company.", "thai": "โครงการนี้เป็นสิ่งสำคัญสำหรับบริษัท"}
{"word": "project", "english": "We’re wrapping up the project this week.", "thai": "เรากำลังสรุปโครงการในสัปดาห์นี้"}
{"word": "project", "english": "The project is expected to generate revenue.", "thai": "คาดว่าโครงการนี้จะสร้างรายได้"}
{"word": "deadline", "english": "We need to meet the deadline for this project.", "thai": "เราต้องทำให้ทันกำหนดเวลาของโครงการนี้"}
{"word": "deadline", "english": "The deadline for the report is next Friday.", "thai": "กำหนดเวลาสำหรับรายงานคือวันศุกร์หน้า"}
{"word": "deadline", "english": "I’m stressed because the deadline is tomorrow.", "thai": "ฉันเครียดเพราะกำหนดเวลาคือวันพรุ่งนี้"}
{"word": "deadline", "english": "They extended the deadline by a week.", "thai": "พวกเขาขยายกำหนดเวลาออกไปอีกหนึ่งสัปดาห์"}
{"word": "deadline", "english": "Missing the deadline could cost us the contract.", "thai": "การพลาดกำหนดเวลาอาจทำให้เราเสียสัญญา"}
{"word": "deadline", "english": "The team is working overtime to hit the deadline.", "thai": "ทีมกำลังทำงานล่วงเวลาเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "What’s the deadline for submitting the proposal?", "thai": "กำหนดเวลาสำหรับการส่งข้อเสนอคือเมื่อไหร่?"}
{"word": "deadline", "english": "The deadline is tight, so we need to focus.", "thai": "กำหนดเวลาเข้มงวด ดังนั้นเราต้องตั้งใจ"}
{"word": "deadline", "english": "She always delivers her work before the deadline.", "thai": "เธอมักจะส่งงานก่อนกำหนดเวลา"}
{"word": "deadline", "english": "The client set a strict deadline for the project.", "thai": "ลูกค้ากำหนดกำหนดเวลาที่เข้มงวดสำหรับโครงการ"}
{"word": "deadline", "english": "We’re cutting it close with this deadline.", "thai": "เรากำลังใกล้ถึงกำหนดเวลานี้แล้ว"}
{"word": "deadline", "english": "The deadline for applications is this afternoon.", "thai": "กำหนดเวลาสำหรับการสมัครคือบ่ายนี้"}
{"word": "deadline", "english": "I forgot about the deadline for the invoice.", "thai": "ฉันลืมกำหนดเวลาสำหรับใบแจ้งหนี้"}
{"word": "deadline", "english": "The boss is pushing us to meet the deadline.", "thai": "เจ้านายกำลังเร่งให้เราทำตามกำหนดเวลา"}
{"word": "deadline", "english": "The deadline was moved up to next Monday.", "thai": "กำหนดเวลาถูกเลื่อนขึ้นมาเป็นวันจันทร์หน้า"}
{"word": "deadline", "english": "We’re on track to meet the deadline.", "thai": "เราอยู่ในเส้นทางที่จะทำตามกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is non-negotiable, so we can’t delay.", "thai": "กำหนดเวลานี้ไม่สามารถต่อรองได้ ดังนั้นเราไม่สามารถเลื่อนได้"}
{"word": "deadline", "english": "I need help to finish this before the deadline.", "thai": "ฉันต้องการความช่วยเหลือเพื่อให้เสร็จก่อนกำหนดเวลา"}
{"word": "deadline", "english": "The deadline for registration is tomorrow.", "thai": "กำหนดเวลาสำหรับการลงทะเบียนคือวันพรุ่งนี้"}
{"word": "deadline", "english": "We missed the deadline for the grant application.", "thai": "เราพลาดกำหนดเวลาสำหรับการสมัครขอทุน"}
{"word": "deadline", "english": "The project’s deadline is causing a lot of stress.", "thai": "กำหนดเวลาของโครงการทำให้เกิดความเครียดมาก"}
{"word": "deadline", "english": "Can we request an extension on the deadline?", "thai": "เราสามารถขอขยายกำหนดเวลาได้ไหม?"}
{"word": "deadline", "english": "The deadline is approaching faster than I thought.", "thai": "กำหนดเวลากำลังใกล้เข้ามาเร็วกว่าที่ฉันคิด"}
{"word": "deadline", "english": "He’s confident we’ll meet the deadline.", "thai": "เขามั่นใจว่าเราจะทำตามกำหนดเวลาได้"}
{"word": "deadline", "english": "The deadline for feedback is end of day.", "thai": "กำหนดเวลาสำหรับความคิดเห็นคือสิ้นวัน"}
{"word": "deadline", "english": "We’re racing against the deadline to finish.", "thai": "เรากำลังแข่งกับกำหนดเวลาเพื่อให้เสร็จ"}
{"word": "deadline", "english": "The deadline was set by the client last week.", "thai": "กำหนดเวลาถูกกำหนดโดยลูกค้าเมื่อสัปดาห์ที่แล้ว"}
{"word": "deadline", "english": "I’m working late to meet the deadline.", "thai": "ฉันทำงานดึกเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "The deadline for the payment is next Tuesday.", "thai": "กำหนดเวลาสำหรับการชำระเงินคือวันอังคารหน้า"}
{"word": "deadline", "english": "We need to prioritize tasks to meet the deadline.", "thai": "เราต้องจัดลำดับความสำคัญของงานเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is creating a lot of pressure.", "thai": "กำหนดเวลากำลังสร้างแรงกดดันมาก"}
{"word": "deadline", "english": "The team is scrambling to meet the deadline.", "thai": "ทีมกำลังเร่งรีบเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "The deadline for the contract is tomorrow.", "thai": "กำหนดเวลาสำหรับสัญญาคือวันพรุ่งนี้"}
{"word": "deadline", "english": "We’re ahead of the deadline for once.", "thai": "เรานำหน้ากำหนดเวลาในครั้งนี้"}
{"word": "deadline", "english": "The deadline is looming, and we’re not ready.", "thai": "กำหนดเวลากำลังใกล้เข้ามา และเรายังไม่พร้อม"}
{"word": "deadline", "english": "She reminded us about the deadline this morning.", "thai": "เธอเตือนเราถึงกำหนดเวลาเมื่อเช้านี้"}
{"word": "deadline", "english": "The deadline for submissions is midnight.", "thai": "กำหนดเวลาสำหรับการส่งคือเที่ยงคืน"}
{"word": "deadline", "english": "We’re cutting it close to the deadline.", "thai": "เรากำลังใกล้ถึงกำหนดเวลาแบบฉิวเฉียด"}
{"word": "deadline", "english": "The deadline was extended due to technical issues.", "thai": "กำหนดเวลาถูกขยายออกไปเนื่องจากปัญหาทางเทคนิค"}
{"word": "deadline", "english": "I’m worried we won’t meet the deadline.", "thai": "ฉันกังวลว่าเราจะไม่สามารถทำตามกำหนดเวลาได้"}
{"word": "deadline", "english": "The deadline for the audit is next month.", "thai": "กำหนดเวลาสำหรับการตรวจสอบคือเดือนหน้า"}
{"word": "deadline", "english": "The project’s deadline is driving us crazy.", "thai": "กำหนดเวลาของโครงการทำให้เราคลั่ง"}
{"word": "deadline", "english": "We need to clarify the deadline with the client.", "thai": "เราต้องชี้แจงกำหนดเวลากับลูกค้า"}
{"word": "deadline", "english": "The deadline is tomorrow, so we’re working late.", "thai": "กำหนดเวลาคือวันพรุ่งนี้ ดังนั้นเราทำงานดึก"}
{"word": "deadline", "english": "The deadline for the application is strict.", "thai": "กำหนดเวลาสำหรับการสมัครเข้มงวด"}
{"word": "deadline", "english": "We’re pushing to meet the deadline on time.", "thai": "เรากำลังเร่งเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "The deadline for the budget is next week.", "thai": "กำหนดเวลาสำหรับงบประมาณคือสัปดาห์หน้า"}
{"word": "deadline", "english": "The team missed the deadline by two days.", "thai": "ทีมพลาดกำหนดเวลาไปสองวัน"}
{"word": "deadline", "english": "The deadline is critical for this deal.", "thai": "กำหนดเวลานี้สำคัญมากสำหรับข้อตกลงนี้"}
{"word": "deadline", "english": "I need an update before the deadline.", "thai": "ฉันต้องการอัพเดทก่อนกำหนดเวลา"}
{"word": "deadline", "english": "The deadline for the survey is today.", "thai": "กำหนดเวลาสำหรับการสำรวจคือวันนี้"}
{"word": "deadline", "english": "We’re working hard to beat the deadline.", "thai": "เรากำลังทำงานหนักเพื่อให้เร็วกว่ากำหนดเวลา"}
{"word": "deadline", "english": "The deadline was set to ensure timely delivery.", "thai": "กำหนดเวลาถูกตั้งไว้เพื่อให้มั่นใจในการส่งมอบทันเวลา"}
{"word": "deadline", "english": "The deadline for the proposal is in two days.", "thai": "กำหนดเวลาสำหรับข้อเสนอคืออีกสองวัน"}
{"word": "deadline", "english": "We’re struggling to meet the deadline.", "thai": "เรากำลังพยายามอย่างหนักเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is making everyone nervous.", "thai": "กำหนดเวลาทำให้ทุกคนตื่นเต้น"}
{"word": "deadline", "english": "The deadline for the report was yesterday.", "thai": "กำหนดเวลาสำหรับรายงานคือเมื่อวานนี้"}
{"word": "deadline", "english": "We need to finalize this before the deadline.", "thai": "เราต้องสรุปเรื่องนี้ก่อนกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is set for the end of the month.", "thai": "กำหนดเวลาถูกกำหนดไว้สำหรับสิ้นเดือน"}
{"word": "deadline", "english": "The team is confident about meeting the deadline.", "thai": "ทีมมั่นใจว่าจะทำตามกำหนดเวลาได้"}
{"word": "deadline", "english": "The deadline for the payment is tomorrow.", "thai": "กำหนดเวลาสำหรับการชำระเงินคือวันพรุ่งนี้"}
{"word": "deadline", "english": "We’re under pressure because of the deadline.", "thai": "เราอยู่ภายใต้แรงกดดันเพราะกำหนดเวลา"}
{"word": "deadline", "english": "The deadline for the project is next Thursday.", "thai": "กำหนดเวลาสำหรับโครงการคือวันพฤหัสบดีหน้า"}
{"word": "deadline", "english": "I need your input before the deadline.", "thai": "ฉันต้องการความคิดเห็นของคุณก่อนกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is tight, but we’ll manage.", "thai": "กำหนดเวลาเข้มงวด แต่เราจะจัดการได้"}
{"word": "deadline", "english": "The deadline for the application was extended.", "thai": "กำหนดเวลาสำหรับการสมัครถูกขยายออกไป"}
{"word": "deadline", "english": "We’re rushing to meet the deadline.", "thai": "เรากำลังรีบเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "The deadline for the invoice is next Monday.", "thai": "กำหนดเวลาสำหรับใบแจ้งหนี้คือวันจันทร์หน้า"}
{"word": "deadline", "english": "The team is stressed about the deadline.", "thai": "ทีมกำลังเครียดเกี่ยวกับกำหนดเวลา"}
{"word": "deadline", "english": "The deadline for the contract is this Friday.", "thai": "กำหนดเวลาสำหรับสัญญาคือวันศุกร์นี้"}
{"word": "deadline", "english": "We’re on schedule to meet the deadline.", "thai": "เราอยู่ในกำหนดการที่จะทำตามกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is causing some delays.", "thai": "กำหนดเวลากำลังทำให้เกิดความล่าช้า"}
{"word": "deadline", "english": "The deadline for the submission is tonight.", "thai": "กำหนดเวลาสำหรับการส่งคือคืนนี้"}
{"word": "deadline", "english": "We need to work faster to meet the deadline.", "thai": "เราต้องทำงานเร็วขึ้นเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "The deadline was announced in the meeting.", "thai": "กำหนดเวลาถูกประกาศในที่ประชุม"}
{"word": "deadline", "english": "The deadline for the feedback is tomorrow.", "thai": "กำหนดเวลาสำหรับความคิดเห็นคือวันพรุ่งนี้"}
{"word": "deadline", "english": "We’re trying to avoid missing the deadline.", "thai": "เรากำลังพยายามหลีกเลี่ยงการพลาดกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is critical for the project’s success.", "thai": "กำหนดเวลานี้สำคัญต่อความสำเร็จของโครงการ"}
{"word": "deadline", "english": "The deadline for the application is next week.", "thai": "กำหนดเวลาสำหรับการสมัครคือสัปดาห์หน้า"}
{"word": "deadline", "english": "We’re finalizing the details before the deadline.", "thai": "เรากำลังสรุปรายละเอียดก่อนกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is putting pressure on the team.", "thai": "กำหนดเวลากำลังกดดันทีม"}
{"word": "deadline", "english": "The deadline for the proposal was yesterday.", "thai": "กำหนดเวลาสำหรับข้อเสนอคือเมื่อวานนี้"}
{"word": "deadline", "english": "We’re confident we’ll hit the deadline.", "thai": "เรามั่นใจว่าเราจะทำตามกำหนดเวลาได้"}
{"word": "deadline", "english": "The deadline for the report is this afternoon.", "thai": "กำหนดเวลาสำหรับรายงานคือบ่ายนี้"}
{"word": "deadline", "english": "The deadline is making us work faster.", "thai": "กำหนดเวลาทำให้เราทำงานเร็วขึ้น"}
{"word": "deadline", "english": "The deadline for the payment was extended.", "thai": "กำหนดเวลาสำหรับการชำระเงินถูกขยายออกไป"}
{"word": "deadline", "english": "We’re struggling with the deadline pressure.", "thai": "เรากำลังต่อสู้กับแรงกดดันจากกำหนดเวลา"}
{"word": "deadline", "english": "The deadline for the project is next month.", "thai": "กำหนดเวลาสำหรับโครงการคือเดือนหน้า"}
{"word": "deadline", "english": "The deadline is set for the end of the week.", "thai": "กำหนดเวลาถูกกำหนดไว้สำหรับสิ้นสัปดาห์"}
{"word": "deadline", "english": "We’re working around the clock to meet the deadline.", "thai": "เรากำลังทำงานตลอดเวลาเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "The deadline for the application is tomorrow.", "thai": "กำหนดเวลาสำหรับการสมัครคือวันพรุ่งนี้"}
{"word": "deadline", "english": "The deadline is causing some tension.", "thai": "กำหนดเวลากำลังทำให้เกิดความตึงเครียด"}
{"word": "deadline", "english": "We need to submit this before the deadline.", "thai": "เราต้องส่งสิ่งนี้ก่อนกำหนดเวลา"}
{"word": "deadline", "english": "The deadline for the contract is next week.", "thai": "กำหนดเวลาสำหรับสัญญาคือสัปดาห์หน้า"}
{"word": "deadline", "english": "The team is focused on meeting the deadline.", "thai": "ทีมกำลังมุ่งเน้นไปที่การทำตามกำหนดเวลา"}
{"word": "deadline", "english": "The deadline for the survey is this evening.", "thai": "กำหนดเวลาสำหรับการสำรวจคือเย็นนี้"}
{"word": "deadline", "english": "We’re trying to stay ahead of the deadline.", "thai": "เรากำลังพยายามให้เร็วกว่ากำหนดเวลา"}
{"word": "deadline", "english": "The deadline was discussed in the meeting.", "thai": "กำหนดเวลาถูกหารือในที่ประชุม"}
{"word": "deadline", "english": "The deadline for the budget is tomorrow.", "thai": "กำหนดเวลาสำหรับงบประมาณคือวันพรุ่งนี้"}
{"word": "schedule", "english": "We need to stick to the schedule to finish on time.", "thai": "เราต้องยึดตามกำหนดการเพื่อให้เสร็จทันเวลา"}
{"word": "schedule", "english": "The meeting is on my schedule for tomorrow.", "thai": "การประชุมอยู่ในกำหนดการของฉันสำหรับวันพรุ่งนี้"}
{"word": "schedule", "english": "Can you check the schedule for next week?", "thai": "คุณช่วยตรวจสอบกำหนดการสำหรับสัปดาห์หน้าได้ไหม?"}
{"word": "schedule", "english": "The project schedule was updated yesterday.", "thai": "กำหนดการโครงการได้รับการอัพเดทเมื่อวานนี้"}
{"word": "schedule", "english": "I’m booked all day according to my schedule.", "thai": "ฉันมีงานเต็มวันตามกำหนดการของฉัน"}
{"word": "schedule", "english": "The schedule is tight, so we can’t delay.", "thai": "กำหนดการแน่นมาก ดังนั้นเราไม่สามารถเลื่อนได้"}
{"word": "schedule", "english": "She’s behind schedule on her assignments.", "thai": "เธอตามหลังกำหนดการในงานที่ได้รับมอบหมาย"}
{"word": "schedule", "english": "The team is ahead of schedule for once.", "thai": "ทีมนำหน้ากำหนดการในครั้งนี้"}
{"word": "schedule", "english": "We need to adjust the schedule to fit the new deadline.", "thai": "เราต้องปรับกำหนดการให้เหมาะกับกำหนดเวลใหม่"}
{"word": "schedule", "english": "The schedule for the conference is online.", "thai": "กำหนดการสำหรับการประชุมอยู่บนออนไลน์"}
{"word": "schedule", "english": "I have a packed schedule this week.", "thai": "ฉันมีกำหนดการที่แน่นมากในสัปดาห์นี้"}
{"word": "schedule", "english": "The schedule was sent to everyone this morning.", "thai": "กำหนดการถูกส่งให้ทุกคนเมื่อเช้านี้"}
{"word": "schedule", "english": "We’re running behind schedule due to delays.", "thai": "เรากำลังตามหลังกำหนดการเนื่องจากความล่าช้า"}
{"word": "schedule", "english": "Can you fit me into your schedule tomorrow?", "thai": "คุณสามารถจัดฉันเข้าในกำหนดการของคุณพรุ่งนี้ได้ไหม?"}
{"word": "schedule", "english": "The schedule for the event is finalized.", "thai": "กำหนดการสำหรับงานนี้ได้รับการสรุปแล้ว"}
{"word": "schedule", "english": "The manager is reviewing the production schedule.", "thai": "ผู้จัดการกำลังตรวจสอบกำหนดการผลิต"}
{"word": "schedule", "english": "I need to check my schedule before confirming.", "thai": "ฉันต้องตรวจสอบกำหนดการก่อนยืนยัน"}
{"word": "schedule", "english": "The schedule is flexible for next month.", "thai": "กำหนดการยืดหยุ่นได้สำหรับเดือนหน้า"}
{"word": "schedule", "english": "We’re trying to stay on schedule with the project.", "thai": "เรากำลังพยายามยึดตามกำหนดการของโครงการ"}
{"word": "schedule", "english": "The schedule for the training is posted.", "thai": "กำหนดการสำหรับการฝึกอบรมถูกโพสต์แล้ว"}
{"word": "schedule", "english": "The bus schedule changed last week.", "thai": "กำหนดการรถบัสเปลี่ยนไปเมื่อสัปดาห์ที่แล้ว"}
{"word": "schedule", "english": "The team is working around the schedule.", "thai": "ทีมกำลังทำงานตามกำหนดการ"}
{"word": "schedule", "english": "I have a conflict in my schedule tomorrow.", "thai": "ฉันมีตารางขัดแย้งในกำหนดการพรุ่งนี้"}
{"word": "schedule", "english": "The schedule for deliveries is on the board.", "thai": "กำหนดการสำหรับการส่งของอยู่บนกระดาน"}
{"word": "schedule", "english": "We need to coordinate our schedules for the meeting.", "thai": "เราต้องประสานกำหนดการของเราสำหรับการประชุม"}
{"word": "schedule", "english": "The schedule is causing some stress.", "thai": "กำหนดการกำลังทำให้เกิดความเครียด"}
{"word": "schedule", "english": "The flight schedule was delayed due to weather.", "thai": "กำหนดการบินล่าช้าเนื่องจากสภาพอากาศ"}
{"word": "schedule", "english": "Can we reschedule to fit your schedule?", "thai": "เราสามารถจัดกำหนดการใหม่ให้เหมาะกับกำหนดการของคุณได้ไหม?"}
{"word": "schedule", "english": "The schedule for the workshop is full.", "thai": "กำหนดการสำหรับเวิร์กช็อปเต็มแล้ว"}
{"word": "schedule", "english": "The schedule was revised to include breaks.", "thai": "กำหนดการได้รับการปรับปรุงให้รวมช่วงพัก"}
{"word": "schedule", "english": "I’m trying to clear my schedule for Friday.", "thai": "ฉันกำลังพยายามเคลียร์กำหนดการของฉันสำหรับวันศุกร์"}
{"word": "schedule", "english": "The schedule for the classes is online now.", "thai": "กำหนดการสำหรับชั้นเรียนอยู่บนออนไลน์แล้ว"}
{"word": "schedule", "english": "We’re behind schedule on the construction.", "thai": "เราตามหลังกำหนดการในการก่อสร้าง"}
{"word": "schedule", "english": "The schedule is posted in the break room.", "thai": "กำหนดการถูกโพสต์ในห้องพัก"}
{"word": "schedule", "english": "I need to update my schedule for next week.", "thai": "ฉันต้องอัพเดทกำหนดการของฉันสำหรับสัปดาห์หน้า"}
{"word": "schedule", "english": "The schedule for the event is very tight.", "thai": "กำหนดการสำหรับงานนี้แน่นมาก"}
{"word": "schedule", "english": "The team is working to meet the schedule.", "thai": "ทีมกำลังทำงานเพื่อให้ทันกำหนดการ"}
{"word": "schedule", "english": "The schedule was shared with all departments.", "thai": "กำหนดการถูกแชร์ให้ทุกแผนก"}
{"word": "schedule", "english": "I have an opening in my schedule tomorrow.", "thai": "ฉันมีช่องว่างในกำหนดการของฉันพรุ่งนี้"}
{"word": "schedule", "english": "The schedule for the exams was announced.", "thai": "กำหนดการสำหรับการสอบถูกประกาศแล้ว"}
{"word": "schedule", "english": "We’re trying to stick to the original schedule.", "thai": "เรากำลังพยายามยึดตามกำหนดการเดิม"}
{"word": "schedule", "english": "The schedule is packed with meetings today.", "thai": "กำหนดการวันนี้เต็มไปด้วยการประชุม"}
{"word": "schedule", "english": "The schedule for the launch is finalized.", "thai": "กำหนดการสำหรับการเปิดตัวได้รับการสรุปแล้ว"}
{"word": "schedule", "english": "I need to check the schedule for the train.", "thai": "ฉันต้องตรวจสอบกำหนดการสำหรับรถไฟ"}
{"word": "schedule", "english": "The schedule is causing some conflicts.", "thai": "กำหนดการกำลังทำให้เกิดความขัดแย้ง"}
{"word": "schedule", "english": "We’re ahead of schedule on the project.", "thai": "เรานำหน้ากำหนดการในโครงการ"}
{"word": "schedule", "english": "The schedule for the festival is out.", "thai": "กำหนดการสำหรับงานเทศกาลออกแล้ว"}
{"word": "schedule", "english": "Can you send me the schedule for next month?", "thai": "คุณสามารถส่งกำหนดการสำหรับเดือนหน้าให้ฉันได้ไหม?"}
{"word": "schedule", "english": "The schedule was adjusted to accommodate delays.", "thai": "กำหนดการได้รับการปรับเพื่อรองรับความล่าช้า"}
{"word": "schedule", "english": "I’m trying to fit this into my schedule.", "thai": "ฉันกำลังพยายามจัดให้เข้ากับกำหนดการของฉัน"}
{"word": "schedule", "english": "The schedule for the delivery is tomorrow.", "thai": "กำหนดการสำหรับการส่งของคือวันพรุ่งนี้"}
{"word": "schedule", "english": "The schedule is too tight for us to manage.", "thai": "กำหนดการแน่นเกินไปสำหรับเราที่จะจัดการ"}
{"word": "schedule", "english": "The schedule for the meeting was changed.", "thai": "กำหนดการสำหรับการประชุมถูกเปลี่ยน"}
{"word": "schedule", "english": "We need to review the schedule together.", "thai": "เราต้องทบทวนกำหนดการด้วยกัน"}
{"word": "schedule", "english": "The schedule is set for the next quarter.", "thai": "กำหนดการถูกกำหนดไว้สำหรับไตรมาสหน้า"}
{"word": "schedule", "english": "I’m running late according to the schedule.", "thai": "ฉันมาสายตามกำหนดการ"}
{"word": "schedule", "english": "The schedule for the workshop is ready.", "thai": "กำหนดการสำหรับเวิร์กช็อปพร้อมแล้ว"}
{"word": "schedule", "english": "We’re trying to keep up with the schedule.", "thai": "เรากำลังพยายามตามกำหนดการ"}
{"word": "schedule", "english": "The schedule for the flights is online.", "thai": "กำหนดการสำหรับเที่ยวบินอยู่บนออนไลน์"}
{"word": "schedule", "english": "The schedule is causing some confusion.", "thai": "กำหนดการกำลังทำให้เกิดความสับสน"}
{"word": "schedule", "english": "I need to clear my schedule for the event.", "thai": "ฉันต้องเคลียร์กำหนดการของฉันสำหรับงานนี้"}
{"word": "schedule", "english": "The schedule for the classes was updated.", "thai": "กำหนดการสำหรับชั้นเรียนได้รับการอัพเดท"}
{"word": "schedule", "english": "We’re behind schedule on the renovations.", "thai": "เราตามหลังกำหนดการในการปรับปรุง"}
{"word": "schedule", "english": "The schedule for the day is posted.", "thai": "กำหนดการสำหรับวันนี้ถูกโพสต์แล้ว"}
{"word": "schedule", "english": "I need to adjust my schedule for tomorrow.", "thai": "ฉันต้องปรับกำหนดการของฉันสำหรับวันพรุ่งนี้"}
{"word": "schedule", "english": "The schedule for the project is aggressive.", "thai": "กำหนดการสำหรับโครงการนี้เข้มงวด"}
{"word": "schedule", "english": "The team is working to stay on schedule.", "thai": "ทีมกำลังทำงานเพื่อให้อยู่ตามกำหนดการ"}
{"word": "schedule", "english": "The schedule was shared with the client.", "thai": "กำหนดการถูกแชร์กับลูกค้า"}
{"word": "schedule", "english": "I have a gap in my schedule this afternoon.", "thai": "ฉันมีช่องว่างในกำหนดการของฉันบ่ายนี้"}
{"word": "schedule", "english": "The schedule for the exams is strict.", "thai": "กำหนดการสำหรับการสอบเข้มงวด"}
{"word": "schedule", "english": "We’re trying to follow the original schedule.", "thai": "เรากำลังพยายามตามกำหนดการเดิม"}
{"word": "schedule", "english": "The schedule is full of meetings today.", "thai": "กำหนดการวันนี้เต็มไปด้วยการประชุม"}
{"word": "schedule", "english": "The schedule for the launch was revised.", "thai": "กำหนดการสำหรับการเปิดตัวได้รับการปรับปรุง"}
{"word": "schedule", "english": "I need to check the schedule for the bus.", "thai": "ฉันต้องตรวจสอบกำหนดการสำหรับรถบัส"}
{"word": "schedule", "english": "The schedule is creating some issues.", "thai": "กำหนดการกำลังทำให้เกิดปัญหา"}
{"word": "schedule", "english": "We’re ahead of schedule on the delivery.", "thai": "เรานำหน้ากำหนดการในการส่งของ"}
{"word": "schedule", "english": "The schedule for the festival is finalized.", "thai": "กำหนดการสำหรับงานเทศกาลได้รับการสรุปแล้ว"}
{"word": "schedule", "english": "Can you share the schedule for next week?", "thai": "คุณสามารถแชร์กำหนดการสำหรับสัปดาห์หน้าได้ไหม?"}
{"word": "schedule", "english": "The schedule was adjusted for the holidays.", "thai": "กำหนดการได้รับการปรับสำหรับวันหยุด"}
{"word": "schedule", "english": "I’m trying to fit this into my schedule.", "thai": "ฉันกำลังพยายามจัดให้เข้ากับกำหนดการของฉัน"}
{"word": "schedule", "english": "The schedule for the delivery is next week.", "thai": "กำหนดการสำหรับการส่งของคือสัปดาห์หน้า"}
{"word": "schedule", "english": "The schedule is too packed to add more.", "thai": "กำหนดการแน่นเกินไปที่จะเพิ่มอะไรอีก"}
{"word": "schedule", "english": "The schedule for the meeting was updated.", "thai": "กำหนดการสำหรับการประชุมได้รับการอัพเดท"}
{"word": "schedule", "english": "We need to align our schedules for the call.", "thai": "เราต้องจัดกำหนดการให้ตรงกันสำหรับการโทร"}
{"word": "schedule", "english": "The schedule is set for the next month.", "thai": "กำหนดการถูกกำหนดไว้สำหรับเดือนหน้า"}
{"word": "schedule", "english": "I’m running behind schedule today.", "thai": "ฉันตามหลังกำหนดการวันนี้"}
{"word": "schedule", "english": "The schedule for the workshop is online.", "thai": "กำหนดการสำหรับเวิร์กช็อปอยู่บนออนไลน์"}
{"word": "schedule", "english": "We’re struggling to keep up with the schedule.", "thai": "เรากำลังพยายามตามกำหนดการ"}
{"word": "schedule", "english": "The schedule for the flights was changed.", "thai": "กำหนดการสำหรับเที่ยวบินถูกเปลี่ยน"}
{"word": "schedule", "english": "The schedule is causing some delays.", "thai": "กำหนดการกำลังทำให้เกิดความล่าช้า"}
{"word": "schedule", "english": "I need to free up my schedule for the event.", "thai": "ฉันต้องเคลียร์กำหนดการของฉันสำหรับงานนี้"}
{"word": "schedule", "english": "The schedule for the classes is finalized.", "thai": "กำหนดการสำหรับชั้นเรียนได้รับการสรุปแล้ว"}
{"word": "schedule", "english": "We’re behind schedule on the project.", "thai": "เราตามหลังกำหนดการในโครงการ"}
{"word": "schedule", "english": "The schedule for the day is on the board.", "thai": "กำหนดการสำหรับวันนี้อยู่บนกระดาน"}
{"word": "schedule", "english": "I need to update my schedule for the week.", "thai": "ฉันต้องอัพเดทกำหนดการของฉันสำหรับสัปดาห์นี้"}
{"word": "schedule", "english": "The schedule for the project is tight.", "thai": "กำหนดการสำหรับโครงการนี้แน่น"}
{"word": "schedule", "english": "The team is working to meet the schedule.", "thai": "ทีมกำลังทำงานเพื่อให้ทันกำหนดการ"}
{"word": "schedule", "english": "The schedule was sent to the client.", "thai": "กำหนดการถูกส่งให้ลูกค้า"}
{"word": "schedule", "english": "I have an opening in my schedule this week.", "thai": "ฉันมีช่องว่างในกำหนดการของฉันสัปดาห์นี้"}
{"word": "schedule", "english": "The schedule for the exams was posted.", "thai": "กำหนดการสำหรับการสอบถูกโพสต์แล้ว"}
{"word": "schedule", "english": "We’re trying to stick to the schedule.", "thai": "เรากำลังพยายามยึดตามกำหนดการ"}
{"word": "memo", "english": "I sent a memo to the team about the meeting.", "thai": "ฉันส่งบันทึกถึงทีมเกี่ยวกับการประชุม"}
{"word": "memo", "english": "Did you read the memo from HR?", "thai": "คุณอ่านบันทึกจากฝ่ายบุคคลหรือยัง"}
{"word": "memo", "english": "The boss wrote a memo clarifying the new policy.", "thai": "เจ้านายเขียนบันทึกชี้แจงนโยบายใหม่"}
{"word": "memo", "english": "I forgot to include that detail in the memo.", "thai": "ฉันลืมใส่รายละเอียดนั้นในบันทึก"}
{"word": "memo", "english": "She drafted a memo to address the budget cuts.", "thai": "เธอร่างบันทึกเพื่อพูดถึงการตัดงบประมาณ"}
{"word": "memo", "english": "The memo went out to all employees yesterday.", "thai": "บันทึกถูกส่งไปยังพนักงานทุกคนเมื่อวานนี้"}
{"word": "memo", "english": "Can you forward me that memo from last week?", "thai": "คุณส่งต่อบันทึกจากสัปดาห์ที่แล้วให้ฉันได้ไหม"}
{"word": "memo", "english": "The memo outlined the project timeline.", "thai": "บันทึกอธิบายไทม์ไลน์ของโครงการ"}
{"word": "memo", "english": "I need to write a memo about the new hires.", "thai": "ฉันต้องเขียนบันทึกเกี่ยวกับพนักงานใหม่"}
{"word": "memo", "english": "His memo was short but clear.", "thai": "บันทึกของเขาสั้นแต่ชัดเจน"}
{"word": "memo", "english": "The memo caused a lot of confusion.", "thai": "บันทึกนั้นทำให้เกิดความสับสนมาก"}
{"word": "memo", "english": "Did you get the memo about the office closure?", "thai": "คุณได้รับบันทึกเกี่ยวกับการปิดสำนักงานหรือยัง"}
{"word": "memo", "english": "I’ll send a memo to confirm the details.", "thai": "ฉันจะส่งบันทึกเพื่อยืนยันรายละเอียด"}
{"word": "memo", "english": "The memo mentioned a new dress code.", "thai": "บันทึกกล่าวถึงระเบียบการแต่งกายใหม่"}
{"word": "memo", "english": "She ignored the memo about the deadline.", "thai": "เธอเพิกเฉยต่อบันทึกเกี่ยวกับกำหนดเวลา"}
{"word": "memo", "english": "The CEO’s memo was quite inspiring.", "thai": "บันทึกของซีอีโอนั้นสร้างแรงบันดาลใจมาก"}
{"word": "memo", "english": "I attached the report to the memo.", "thai": "ฉันแนบรายงานไปกับบันทึก"}
{"word": "memo", "english": "The memo was sent to the wrong department.", "thai": "บันทึกถูกส่งไปยังแผนกที่ผิด"}
{"word": "memo", "english": "He wrote a memo to address the complaints.", "thai": "เขาเขียนบันทึกเพื่อจัดการกับข้อร้องเรียน"}
{"word": "memo", "english": "The memo didn’t mention the time change.", "thai": "บันทึกไม่ได้กล่าวถึงการเปลี่ยนแปลงเวลา"}
{"word": "memo", "english": "I’ll draft a memo for the team tomorrow.", "thai": "ฉันจะร่างบันทึกสำหรับทีมในวันพรุ่งนี้"}
{"word": "memo", "english": "The memo was posted on the bulletin board.", "thai": "บันทึกถูกติดไว้ที่กระดานข่าว"}
{"word": "memo", "english": "Did you see the memo about the picnic?", "thai": "คุณเห็นบันทึกเกี่ยวกับงานปิกนิกหรือยัง"}
{"word": "memo", "english": "The memo clarified the vacation policy.", "thai": "บันทึกชี้แจงนโยบายการลาพักร้อน"}
{"word": "memo", "english": "I need a memo to summarize the meeting.", "thai": "ฉันต้องการบันทึกเพื่อสรุปการประชุม"}
{"word": "memo", "english": "The memo was emailed to everyone.", "thai": "บันทึกถูกส่งทางอีเมลถึงทุกคน"}
{"word": "memo", "english": "She sent a memo to remind us of the rules.", "thai": "เธอส่งบันทึกเพื่อเตือนเราถึงกฎ"}
{"word": "memo", "english": "The memo included a new schedule.", "thai": "บันทึกมีตารางเวลาใหม่"}
{"word": "memo", "english": "I missed the memo about the training.", "thai": "ฉันพลาดบันทึกเกี่ยวกับการฝึกอบรม"}
{"word": "memo", "english": "The memo was very detailed.", "thai": "บันทึกนั้นมีรายละเอียดมาก"}
{"word": "memo", "english": "He circulated a memo about safety protocols.", "thai": "เขาเผยแพร่บันทึกเกี่ยวกับระเบียบความปลอดภัย"}
{"word": "memo", "english": "The memo was addressed to all staff.", "thai": "บันทึกนั้นส่งถึงพนักงานทุกคน"}
{"word": "memo", "english": "I’ll need your input for the memo.", "thai": "ฉันต้องการความเห็นของคุณสำหรับบันทึก"}
{"word": "memo", "english": "The memo sparked a lot of discussion.", "thai": "บันทึกนั้นจุดประกายการถกเถียงมากมาย"}
{"word": "memo", "english": "She wrote a memo to update the team.", "thai": "เธอเขียนบันทึกเพื่ออัปเดตทีม"}
{"word": "memo", "english": "The memo was about the new software.", "thai": "บันทึกนั้นเกี่ยวกับซอฟต์แวร์ใหม่"}
{"word": "memo", "english": "I got a memo about the budget meeting.", "thai": "ฉันได้รับบันทึกเกี่ยวกับการประชุมงบประมาณ"}
{"word": "memo", "english": "The memo outlined the next steps.", "thai": "บันทึกอธิบายขั้นตอนต่อไป"}
{"word": "memo", "english": "He sent a memo to cancel the event.", "thai": "เขาส่งบันทึกเพื่อยกเลิกงาน"}
{"word": "memo", "english": "The memo was hard to understand.", "thai": "บันทึกนั้นเข้าใจยาก"}
{"word": "memo", "english": "I’ll send a memo to clarify the issue.", "thai": "ฉันจะส่งบันทึกเพื่อชี้แจงปัญหา"}
{"word": "memo", "english": "The memo listed all the requirements.", "thai": "บันทึกระบุข้อกำหนดทั้งหมด"}
{"word": "memo", "english": "She forgot to send the memo.", "thai": "เธอลืมส่งบันทึก"}
{"word": "memo", "english": "The memo was about the holiday schedule.", "thai": "บันทึกนั้นเกี่ยวกับตารางวันหยุด"}
{"word": "memo", "english": "I received a memo from the director.", "thai": "ฉันได้รับบันทึกจากผู้อำนวยการ"}
{"word": "memo", "english": "The memo was only one page long.", "thai": "บันทึกนั้นยาวเพียงหนึ่งหน้า"}
{"word": "memo", "english": "He wrote a memo to thank the team.", "thai": "เขาเขียนบันทึกเพื่อขอบคุณทีม"}
{"word": "memo", "english": "The memo was sent to the wrong group.", "thai": "บันทึกถูกส่งไปยังกลุ่มที่ผิด"}
{"word": "memo", "english": "I need to review the memo before sending.", "thai": "ฉันต้องตรวจสอบบันทึกก่อนส่ง"}
{"word": "memo", "english": "The memo was about the new benefits.", "thai": "บันทึกนั้นเกี่ยวกับสวัสดิการใหม่"}
{"word": "memo", "english": "She circulated a memo about the changes.", "thai": "เธอเผยแพร่บันทึกเกี่ยวกับการเปลี่ยนแปลง"}
{"word": "memo", "english": "The memo was written in a hurry.", "thai": "บันทึกนั้นถูกเขียนอย่างเร่งรีบ"}
{"word": "memo", "english": "I didn’t get the memo about the party.", "thai": "ฉันไม่ได้รับบันทึกเกี่ยวกับงานเลี้ยง"}
{"word": "memo", "english": "The memo explained the new process.", "thai": "บันทึกอธิบายกระบวนการใหม่"}
{"word": "memo", "english": "He sent a memo to all managers.", "thai": "เขาส่งบันทึกถึงผู้จัดการทุกคน"}
{"word": "memo", "english": "The memo was shared on the intranet.", "thai": "บันทึกถูกแชร์บนอินทราเน็ต"}
{"word": "memo", "english": "I’ll write a memo to follow up.", "thai": "ฉันจะเขียนบันทึกเพื่อติดตาม"}
{"word": "memo", "english": "The memo was about the team restructuring.", "thai": "บันทึกนั้นเกี่ยวกับการปรับโครงสร้างทีม"}
{"word": "memo", "english": "She sent a memo to confirm the plan.", "thai": "เธอส่งบันทึกเพื่อยืนยันแผน"}
{"word": "memo", "english": "The memo included a call to action.", "thai": "บันทึกมีคำเรียกร้องให้ดำเนินการ"}
{"word": "memo", "english": "I found the memo in my inbox.", "thai": "ฉันพบบันทึกในกล่องจดหมายของฉัน"}
{"word": "memo", "english": "The memo was sent out too late.", "thai": "บันทึกถูกส่งออกไปช้าเกินไป"}
{"word": "memo", "english": "He drafted a memo for the board.", "thai": "เขาร่างบันทึกสำหรับคณะกรรมการ"}
{"word": "memo", "english": "The memo was about the annual review.", "thai": "บันทึกนั้นเกี่ยวกับการทบทวนประจำปี"}
{"word": "memo", "english": "I need to respond to that memo.", "thai": "ฉันต้องตอบกลับบันทึกนั้น"}
{"word": "memo", "english": "The memo was very well-written.", "thai": "บันทึกนั้นเขียนได้ดีมาก"}
{"word": "memo", "english": "She sent a memo to all departments.", "thai": "เธอส่งบันทึกถึงทุกแผนก"}
{"word": "memo", "english": "The memo addressed the recent issues.", "thai": "บันทึกกล่าวถึงปัญหาล่าสุด"}
{"word": "memo", "english": "I’ll include that in the next memo.", "thai": "ฉันจะรวมสิ่งนั้นในบันทึกถัดไป"}
{"word": "memo", "english": "The memo was about the new hires.", "thai": "บันทึกนั้นเกี่ยวกับพนักงานใหม่"}
{"word": "memo", "english": "He forgot to sign the memo.", "thai": "เขาลืมลงนามในบันทึก"}
{"word": "memo", "english": "The memo was shared with the team.", "thai": "บันทึกถูกแชร์กับทีม"}
{"word": "memo", "english": "I didn’t understand the memo’s purpose.", "thai": "ฉันไม่เข้าใจจุดประสงค์ของบันทึก"}
{"word": "memo", "english": "The memo was about the office move.", "thai": "บันทึกนั้นเกี่ยวกับการย้ายสำนักงาน"}
{"word": "memo", "english": "She sent a memo to clarify the rules.", "thai": "เธอส่งบันทึกเพื่อชี้แจงกฎ"}
{"word": "memo", "english": "The memo was sent to the wrong person.", "thai": "บันทึกถูกส่งไปยังคนที่ผิด"}
{"word": "memo", "english": "I’ll need a memo for the presentation.", "thai": "ฉันต้องการบันทึกสำหรับการนำเสนอ"}
{"word": "memo", "english": "The memo was about the new project.", "thai": "บันทึกนั้นเกี่ยวกับโครงการใหม่"}
{"word": "memo", "english": "He sent a memo to update the staff.", "thai": "เขาส่งบันทึกเพื่ออัปเดตพนักงาน"}
{"word": "memo", "english": "The memo was discussed in the meeting.", "thai": "บันทึกถูกพูดถึงในที่ประชุม"}
{"word": "memo", "english": "I’ll send a memo to the team later.", "thai": "ฉันจะส่งบันทึกถึงทีมในภายหลัง"}
{"word": "memo", "english": "The memo was about the safety guidelines.", "thai": "บันทึกนั้นเกี่ยวกับแนวทางความปลอดภัย"}
{"word": "memo", "english": "She wrote a memo to address concerns.", "thai": "เธอเขียนบันทึกเพื่อจัดการกับข้อกังวล"}
{"word": "memo", "english": "The memo was sent via email.", "thai": "บันทึกถูกส่งผ่านอีเมล"}
{"word": "memo", "english": "I need to check the memo again.", "thai": "ฉันต้องตรวจสอบบันทึกอีกครั้ง"}
{"word": "memo", "english": "The memo was about the new policy.", "thai": "บันทึกนั้นเกี่ยวกับนโยบายใหม่"}
{"word": "memo", "english": "He sent a memo to the entire company.", "thai": "เขาส่งบันทึกถึงทั้งบริษัท"}
{"word": "memo", "english": "The memo was pinned to the board.", "thai": "บันทึกถูกปักไว้ที่กระดาน"}
{"word": "memo", "english": "I’ll write a memo to explain the changes.", "thai": "ฉันจะเขียนบันทึกเพื่ออธิบายการเปลี่ยนแปลง"}
{"word": "memo", "english": "The memo was about the team goals.", "thai": "บันทึกนั้นเกี่ยวกับเป้าหมายของทีม"}
{"word": "memo", "english": "She sent a memo to schedule a meeting.", "thai": "เธอส่งบันทึกเพื่อนัดประชุม"}
{"word": "memo", "english": "The memo was very straightforward.", "thai": "บันทึกนั้นตรงไปตรงมามาก"}
{"word": "memo", "english": "I didn’t see the memo about the event.", "thai": "ฉันไม่เห็นบันทึกเกี่ยวกับงาน"}
{"word": "memo", "english": "The memo was sent to all supervisors.", "thai": "บันทึกถูกส่งถึงหัวหน้างานทุกคน"}
{"word": "memo", "english": "He wrote a memo to announce the news.", "thai": "เขาเขียนบันทึกเพื่อประกาศข่าว"}
{"word": "memo", "english": "The memo was about the budget cuts.", "thai": "บันทึกนั้นเกี่ยวกับการตัดงบประมาณ"}
{"word": "memo", "english": "I’ll need to revise the memo.", "thai": "ฉันต้องแก้ไขบันทึก"}
{"word": "memo", "english": "The memo was about the new guidelines.", "thai": "บันทึกนั้นเกี่ยวกับแนวทางใหม่"}
{"word": "memo", "english": "She sent a memo to all team members.", "thai": "เธอส่งบันทึกถึงสมาชิกทีมทุกคน"}
{"word": "agenda", "english": "The meeting’s agenda was sent out yesterday.", "thai": "วาระการประชุมถูกส่งออกไปเมื่อวานนี้"}
{"word": "agenda", "english": "What’s on the agenda for today?", "thai": "วันนี้มีอะไรอยู่ในวาระ?"}
{"word": "agenda", "english": "She set the agenda for the workshop.", "thai": "เธอกำหนดวาระสำหรับการสัมมนา"}
{"word": "agenda", "english": "The agenda includes a budget discussion.", "thai": "วาระรวมถึงการอภิปรายเรื่องงบประมาณ"}
{"word": "agenda", "english": "I need to review the agenda before the meeting.", "thai": "ฉันต้องทบทวนวาระก่อนการประชุม"}
{"word": "agenda", "english": "The agenda was too packed for one session.", "thai": "วาระแน่นเกินไปสำหรับการประชุมครั้งเดียว"}
{"word": "agenda", "english": "He pushed his own agenda during the talk.", "thai": "เขาผลักดันวาระของตัวเองในระหว่างการพูดคุย"}
{"word": "agenda", "english": "The agenda was posted on the board.", "thai": "วาระถูกติดไว้ที่กระดาน"}
{"word": "agenda", "english": "Can you share the agenda for tomorrow?", "thai": "คุณแชร์วาระสำหรับวันพรุ่งนี้ได้ไหม?"}
{"word": "agenda", "english": "The agenda didn’t include a break.", "thai": "วาระไม่ได้รวมช่วงพัก"}
{"word": "agenda", "english": "She drafted the agenda for the team.", "thai": "เธอร่างวาระสำหรับทีม"}
{"word": "agenda", "english": "The agenda focused on new projects.", "thai": "วาระเน้นเรื่องโครงการใหม่"}
{"word": "agenda", "english": "I forgot to add that to the agenda.", "thai": "ฉันลืมเพิ่มสิ่งนั้นในวาระ"}
{"word": "agenda", "english": "The agenda was emailed to everyone.", "thai": "วาระถูกส่งทางอีเมลถึงทุกคน"}
{"word": "agenda", "english": "What’s the first item on the agenda?", "thai": "รายการแรกในวาระคืออะไร?"}
{"word": "agenda", "english": "The agenda was clear and concise.", "thai": "วาระชัดเจนและกระชับ"}
{"word": "agenda", "english": "He ignored the agenda and went off-topic.", "thai": "เขาเพิกเฉยต่อวาระและพูดนอกเรื่อง"}
{"word": "agenda", "english": "The agenda covered all key issues.", "thai": "วาระครอบคลุมทุกประเด็นสำคัญ"}
{"word": "agenda", "english": "I’ll send the agenda by this afternoon.", "thai": "ฉันจะส่งวาระภายในบ่ายนี้"}
{"word": "agenda", "english": "The agenda was approved by the board.", "thai": "วาระได้รับการอนุมัติจากคณะกรรมการ"}
{"word": "agenda", "english": "She added a new item to the agenda.", "thai": "เธอเพิ่มรายการใหม่ในวาระ"}
{"word": "agenda", "english": "The agenda was discussed in advance.", "thai": "วาระถูกพูดคุยล่วงหน้า"}
{"word": "agenda", "english": "I didn’t get the updated agenda.", "thai": "ฉันไม่ได้รับวาระที่อัปเดต"}
{"word": "agenda", "english": "The agenda included a guest speaker.", "thai": "วาระรวมถึงวิทยากรรับเชิญ"}
{"word": "agenda", "english": "He set a hidden agenda for the meeting.", "thai": "เขากำหนดวาระซ่อนเร้นสำหรับการประชุม"}
{"word": "agenda", "english": "The agenda was too long for one hour.", "thai": "วาระยาวเกินไปสำหรับหนึ่งชั่วโมง"}
{"word": "agenda", "english": "Can we stick to the agenda, please?", "thai": "เราจะยึดตามวาระได้ไหม?"}
{"word": "agenda", "english": "The agenda was shared with the team.", "thai": "วาระถูกแชร์กับทีม"}
{"word": "agenda", "english": "I need to finalize the agenda today.", "thai": "ฉันต้องสรุปวาระวันนี้"}
{"word": "agenda", "english": "The agenda listed three main topics.", "thai": "วาระระบุหัวข้อหลักสามหัวข้อ"}
{"word": "agenda", "english": "She circulated the agenda last night.", "thai": "เธอเผยแพร่วาระเมื่อคืนนี้"}
{"word": "agenda", "english": "The agenda was about new policies.", "thai": "วาระเกี่ยวกับนโยบายใหม่"}
{"word": "agenda", "english": "I missed the agenda for the conference.", "thai": "ฉันพลาดวาระสำหรับการประชุม"}
{"word": "agenda", "english": "The agenda was very well-organized.", "thai": "วาระถูกจัดระเบียบอย่างดี"}
{"word": "agenda", "english": "He followed the agenda closely.", "thai": "เขายึดตามวาระอย่างใกล้ชิด"}
{"word": "agenda", "english": "The agenda included a Q&A session.", "thai": "วาระรวมถึงช่วงถามตอบ"}
{"word": "agenda", "english": "I’ll need your input on the agenda.", "thai": "ฉันต้องการความเห็นของคุณเกี่ยวกับวาระ"}
{"word": "agenda", "english": "The agenda was sent to all participants.", "thai": "วาระถูกส่งถึงผู้เข้าร่วมทุกคน"}
{"word": "agenda", "english": "She revised the agenda this morning.", "thai": "เธอแก้ไขวาระเมื่อเช้านี้"}
{"word": "agenda", "english": "The agenda didn’t cover the new issue.", "thai": "วาระไม่ได้ครอบคลุมประเด็นใหม่"}
{"word": "agenda", "english": "I’ll prepare the agenda for next week.", "thai": "ฉันจะเตรียมวาระสำหรับสัปดาห์หน้า"}
{"word": "agenda", "english": "The agenda was about team goals.", "thai": "วาระเกี่ยวกับเป้าหมายของทีม"}
{"word": "agenda", "english": "He shared the agenda with the group.", "thai": "เขาแชร์วาระกับกลุ่ม"}
{"word": "agenda", "english": "The agenda was posted online.", "thai": "วาระถูกโพสต์ออนไลน์"}
{"word": "agenda", "english": "Can you add this to the agenda?", "thai": "คุณเพิ่มสิ่งนี้ในวาระได้ไหม?"}
{"word": "agenda", "english": "The agenda was discussed in the briefing.", "thai": "วาระถูกพูดถึงในสรุป"}
{"word": "agenda", "english": "She sent the agenda to the wrong team.", "thai": "เธอส่งวาระไปยังทีมที่ผิด"}
{"word": "agenda", "english": "The agenda was about the new software.", "thai": "วาระเกี่ยวกับซอฟต์แวร์ใหม่"}
{"word": "agenda", "english": "I need to check the agenda again.", "thai": "ฉันต้องตรวจสอบวาระอีกครั้ง"}
{"word": "agenda", "english": "The agenda was very detailed.", "thai": "วาระมีรายละเอียดมาก"}
{"word": "agenda", "english": "He ignored the agenda completely.", "thai": "เขาเพิกเฉยต่อวาระโดยสิ้นเชิง"}
{"word": "agenda", "english": "The agenda included a team-building activity.", "thai": "วาระรวมถึงกิจกรรมสร้างทีม"}
{"word": "agenda", "english": "I’ll email the agenda to everyone.", "thai": "ฉันจะส่งวาระทางอีเมลถึงทุกคน"}
{"word": "agenda", "english": "The agenda was about the annual review.", "thai": "วาระเกี่ยวกับการทบทวนประจำปี"}
{"word": "agenda", "english": "She forgot to include that in the agenda.", "thai": "เธอลืมรวมสิ่งนั้นในวาระ"}
{"word": "agenda", "english": "The agenda was sent out too late.", "thai": "วาระถูกส่งออกไปช้าเกินไป"}
{"word": "agenda", "english": "He drafted the agenda for the board.", "thai": "เขาร่างวาระสำหรับคณะกรรมการ"}
{"word": "agenda", "english": "The agenda was about the budget cuts.", "thai": "วาระเกี่ยวกับการตัดงบประมาณ"}
{"word": "agenda", "english": "I need to revise the agenda.", "thai": "ฉันต้องแก้ไขวาระ"}
{"word": "agenda", "english": "The agenda was about the new guidelines.", "thai": "วาระเกี่ยวกับแนวทางใหม่"}
{"word": "agenda", "english": "She sent the agenda to all departments.", "thai": "เธอส่งวาระถึงทุกแผนก"}
{"word": "agenda", "english": "The agenda addressed the recent issues.", "thai": "วาระกล่าวถึงปัญหาล่าสุด"}
{"word": "agenda", "english": "I’ll include that in the next agenda.", "thai": "ฉันจะรวมสิ่งนั้นในวาระถัดไป"}
{"word": "agenda", "english": "The agenda was about the new hires.", "thai": "วาระเกี่ยวกับพนักงานใหม่"}
{"word": "agenda", "english": "He forgot to share the agenda.", "thai": "เขาลืมแชร์วาระ"}
{"word": "agenda", "english": "The agenda was shared with the staff.", "thai": "วาระถูกแชร์กับพนักงาน"}
{"word": "agenda", "english": "I didn’t understand the agenda’s purpose.", "thai": "ฉันไม่เข้าใจจุดประสงค์ของวาระ"}
{"word": "agenda", "english": "The agenda was about the office move.", "thai": "วาระเกี่ยวกับการย้ายสำนักงาน"}
{"word": "agenda", "english": "She sent the agenda to clarify the plan.", "thai": "เธอส่งวาระเพื่อชี้แจงแผน"}
{"word": "agenda", "english": "The agenda was sent to the wrong person.", "thai": "วาระถูกส่งไปยังคนที่ผิด"}
{"word": "agenda", "english": "I’ll need an agenda for the presentation.", "thai": "ฉันต้องการวาระสำหรับการนำเสนอ"}
{"word": "agenda", "english": "The agenda was about the new project.", "thai": "วาระเกี่ยวกับโครงการใหม่"}
{"word": "agenda", "english": "He sent the agenda to update the staff.", "thai": "เขาส่งวาระเพื่ออัปเดตพนักงาน"}
{"word": "agenda", "english": "The agenda was discussed in the meeting.", "thai": "วาระถูกพูดถึงในที่ประชุม"}
{"word": "agenda", "english": "I’ll send the agenda to the team later.", "thai": "ฉันจะส่งวาระถึงทีมในภายหลัง"}
{"word": "agenda", "english": "The agenda was about safety guidelines.", "thai": "วาระเกี่ยวกับแนวทางความปลอดภัย"}
{"word": "agenda", "english": "She wrote the agenda to address concerns.", "thai": "เธอเขียนวาระเพื่อจัดการกับข้อกังวล"}
{"word": "agenda", "english": "The agenda was sent via email.", "thai": "วาระถูกส่งผ่านอีเมล"}
{"word": "agenda", "english": "I need to check the agenda again.", "thai": "ฉันต้องตรวจสอบวาระอีกครั้ง"}
{"word": "agenda", "english": "The agenda was about the new policy.", "thai": "วาระเกี่ยวกับนโยบายใหม่"}
{"word": "agenda", "english": "He sent the agenda to the entire company.", "thai": "เขาส่งวาระถึงทั้งบริษัท"}
{"word": "agenda", "english": "The agenda was pinned to the board.", "thai": "วาระถูกปักไว้ที่กระดาน"}
{"word": "agenda", "english": "I’ll write the agenda to explain the changes.", "thai": "ฉันจะเขียนวาระเพื่ออธิบายการเปลี่ยนแปลง"}
{"word": "agenda", "english": "The agenda was about the team goals.", "thai": "วาระเกี่ยวกับเป้าหมายของทีม"}
{"word": "agenda", "english": "She sent the agenda to schedule a meeting.", "thai": "เธอส่งวาระเพื่อนัดประชุม"}
{"word": "agenda", "english": "The agenda was very straightforward.", "thai": "วาระตรงไปตรงมามาก"}
{"word": "agenda", "english": "I didn’t see the agenda for the event.", "thai": "ฉันไม่เห็นวาระสำหรับงาน"}
{"word": "agenda", "english": "The agenda was sent to all supervisors.", "thai": "วาระถูกส่งถึงหัวหน้างานทุกคน"}
{"word": "agenda", "english": "He wrote the agenda to announce the news.", "thai": "เขาเขียนวาระเพื่อประกาศข่าว"}
{"word": "agenda", "english": "The agenda was about the budget cuts.", "thai": "วาระเกี่ยวกับการตัดงบประมาณ"}
{"word": "agenda", "english": "I’ll need to revise the agenda.", "thai": "ฉันต้องแก้ไขวาระ"}
{"word": "agenda", "english": "The agenda was about the new guidelines.", "thai": "วาระเกี่ยวกับแนวทางใหม่"}
{"word": "agenda", "english": "She sent the agenda to all team members.", "thai": "เธอส่งวาระถึงสมาชิกทีมทุกคน"}
{"word": "agenda", "english": "The agenda addressed the recent changes.", "thai": "วาระกล่าวถึงการเปลี่ยนแปลงล่าสุด"}
{"word": "agenda", "english": "I’ll include that in the next agenda.", "thai": "ฉันจะรวมสิ่งนั้นในวาระถัดไป"}
{"word": "agenda", "english": "The agenda was about the new strategy.", "thai": "วาระเกี่ยวกับกลยุทธ์ใหม่"}
{"word": "agenda", "english": "He drafted the agenda for the conference.", "thai": "เขาร่างวาระสำหรับการประชุม"}
{"word": "agenda", "english": "The agenda was shared on the intranet.", "thai": "วาระถูกแชร์บนอินทราเน็ต"}
{"word": "agenda", "english": "I need to prepare the agenda for tomorrow.", "thai": "ฉันต้องเตรียมวาระสำหรับวันพรุ่งนี้"}
{"word": "agenda", "english": "The agenda was about the team restructuring.", "thai": "วาระเกี่ยวกับการปรับโครงสร้างทีม"}
{"word": "proposal", "english": "The team submitted a proposal for the project.", "thai": "ทีมยื่นข้อเสนอสำหรับโครงการ"}
{"word": "proposal", "english": "I’m still waiting for their proposal.", "thai": "ฉันยังรอข้อเสนอของพวกเขา"}
{"word": "proposal", "english": "His marriage proposal was so romantic.", "thai": "ข้อเสนอการแต่งงานของเขาช่างโรแมนติก"}
{"word": "proposal", "english": "The proposal was rejected by the board.", "thai": "ข้อเสนอถูกปฏิเสธโดยคณะกรรมการ"}
{"word": "proposal", "english": "She drafted a proposal for the new campaign.", "thai": "เธอร่างข้อเสนอสำหรับแคมเปญใหม่"}
{"word": "proposal", "english": "I need to review the proposal before deciding.", "thai": "ฉันต้องตรวจสอบข้อเสนอก่อนตัดสินใจ"}
{"word": "proposal", "english": "The proposal outlined the budget details.", "thai": "ข้อเสนอระบุรายละเอียดงบประมาณ"}
{"word": "proposal", "english": "He presented a proposal to the investors.", "thai": "เขานำเสนอข้อเสนอต่อนักลงทุน"}
{"word": "proposal", "english": "Her proposal was very well-received.", "thai": "ข้อเสนอของเธอได้รับการตอบรับอย่างดี"}
{"word": "proposal", "english": "The proposal needs more details.", "thai": "ข้อเสนอต้องการรายละเอียดเพิ่มเติม"}
{"word": "proposal", "english": "I’m working on a proposal for the client.", "thai": "ฉันกำลังทำงานเกี่ยวกับข้อเสนอสำหรับลูกค้า"}
{"word": "proposal", "english": "The proposal was sent to the wrong department.", "thai": "ข้อเสนอถูกส่งไปยังแผนกที่ผิด"}
{"word": "proposal", "english": "She said yes to his proposal!", "thai": "เธอตอบตกลงต่อข้อเสนอของเขา!"}
{"word": "proposal", "english": "The proposal included a timeline.", "thai": "ข้อเสนอรวมถึงไทม์ไลน์"}
{"word": "proposal", "english": "I’ll submit the proposal by tomorrow.", "thai": "ฉันจะยื่นข้อเสนอภายในวันพรุ่งนี้"}
{"word": "proposal", "english": "The proposal was about a new partnership.", "thai": "ข้อเสนอเกี่ยวกับการเป็นพันธมิตรใหม่"}
{"word": "proposal", "english": "He’s preparing a proposal for the meeting.", "thai": "เขากำลังเตรียมข้อเสนอสำหรับการประชุม"}
{"word": "proposal", "english": "The proposal was too vague.", "thai": "ข้อเสนอนั้นคลุมเครือเกินไป"}
{"word": "proposal", "english": "I need feedback on my proposal.", "thai": "ฉันต้องการความคิดเห็นเกี่ยวกับข้อเสนอของฉัน"}
{"word": "proposal", "english": "The proposal was discussed in the meeting.", "thai": "ข้อเสนอถูกพูดถึงในที่ประชุม"}
{"word": "proposal", "english": "She wrote a proposal for the grant.", "thai": "เธอเขียนข้อเสนอสำหรับเงินช่วยเหลือ"}
{"word": "proposal", "english": "The proposal was approved yesterday.", "thai": "ข้อเสนอได้รับการอนุมัติเมื่อวานนี้"}
{"word": "proposal", "english": "I’m not sure about this proposal.", "thai": "ฉันไม่แน่ใจเกี่ยวกับข้อเสนอนี้"}
{"word": "proposal", "english": "The proposal sparked a lot of debate.", "thai": "ข้อเสนอนี้จุดประกายการถกเถียงมากมาย"}
{"word": "proposal", "english": "He sent the proposal to the client.", "thai": "เขาส่งข้อเสนอไปยังลูกค้า"}
{"word": "proposal", "english": "The proposal was very detailed.", "thai": "ข้อเสนอนั้นมีรายละเอียดมาก"}
{"word": "proposal", "english": "I’ll revise the proposal tonight.", "thai": "ฉันจะแก้ไขข้อเสนอคืนนี้"}
{"word": "proposal", "english": "The proposal was about cost savings.", "thai": "ข้อเสนอเกี่ยวกับการประหยัดค่าใช้จ่าย"}
{"word": "proposal", "english": "She presented her proposal to the team.", "thai": "เธอนำเสนอข้อเสนอต่อทีม"}
{"word": "proposal", "english": "The proposal needs to be finalized.", "thai": "ข้อเสนอต้องได้รับการสรุป"}
{"word": "proposal", "english": "His proposal was quite innovative.", "thai": "ข้อเสนอของเขาค่อนข้างสร้างสรรค์"}
{"word": "proposal", "english": "I didn’t understand the proposal’s purpose.", "thai": "ฉันไม่เข้าใจจุดประสงค์ของข้อเสนอ"}
{"word": "proposal", "english": "The proposal was sent via email.", "thai": "ข้อเสนอถูกส่งผ่านอีเมล"}
{"word": "proposal", "english": "She rejected his marriage proposal.", "thai": "เธอปฏิเสธข้อเสนอการแต่งงานของเขา"}
{"word": "proposal", "english": "The proposal was about a new product.", "thai": "ข้อเสนอเกี่ยวกับผลิตภัณฑ์ใหม่"}
{"word": "proposal", "english": "I need to prepare a proposal for the board.", "thai": "ฉันต้องเตรียมข้อเสนอสำหรับคณะกรรมการ"}
{"word": "proposal", "english": "The proposal was well-written.", "thai": "ข้อเสนอนั้นเขียนได้ดี"}
{"word": "proposal", "english": "He’s working on a business proposal.", "thai": "เขากำลังทำงานเกี่ยวกับข้อเสนอทางธุรกิจ"}
{"word": "proposal", "english": "The proposal was too ambitious.", "thai": "ข้อเสนอนั้นทะเยอทะยานเกินไป"}
{"word": "proposal", "english": "I’ll discuss the proposal with the team.", "thai": "ฉันจะพูดคุยเกี่ยวกับข้อเสนอกับทีม"}
{"word": "proposal", "english": "The proposal was about sustainability.", "thai": "ข้อเสนอเกี่ยวกับความยั่งยืน"}
{"word": "proposal", "english": "She submitted a proposal for funding.", "thai": "เธอยื่นข้อเสนอเพื่อขอเงินทุน"}
{"word": "proposal", "english": "The proposal was sent to all stakeholders.", "thai": "ข้อเสนอถูกส่งถึงผู้มีส่วนได้ส่วนเสียทุกคน"}
{"word": "proposal", "english": "I need to tweak the proposal slightly.", "thai": "ฉันต้องปรับแต่งข้อเสนอเล็กน้อย"}
{"word": "proposal", "english": "The proposal addressed the key issues.", "thai": "ข้อเสนอกล่าวถึงประเด็นสำคัญ"}
{"word": "proposal", "english": "He forgot to include data in the proposal.", "thai": "เขาลืมรวมข้อมูลในข้อเสนอ"}
{"word": "proposal", "english": "The proposal was about team restructuring.", "thai": "ข้อเสนอเกี่ยวกับการปรับโครงสร้างทีม"}
{"word": "proposal", "english": "I’ll need your input on the proposal.", "thai": "ฉันต้องการความเห็นของคุณเกี่ยวกับข้อเสนอ"}
{"word": "proposal", "english": "The proposal was shared with the group.", "thai": "ข้อเสนอถูกแชร์กับกลุ่ม"}
{"word": "proposal", "english": "She’s drafting a proposal for the event.", "thai": "เธอกำลังร่างข้อเสนอสำหรับงาน"}
{"word": "proposal", "english": "The proposal was about new software.", "thai": "ข้อเสนอเกี่ยวกับซอฟต์แวร์ใหม่"}
{"word": "proposal", "english": "I need to finalize the proposal today.", "thai": "ฉันต้องสรุปข้อเสนอวันนี้"}
{"word": "proposal", "english": "The proposal was rejected due to costs.", "thai": "ข้อเสนอถูกปฏิเสธเนื่องจากค่าใช้จ่าย"}
{"word": "proposal", "english": "He sent a proposal to the committee.", "thai": "เขาส่งข้อเสนอไปยังคณะกรรมการ"}
{"word": "proposal", "english": "The proposal included a marketing plan.", "thai": "ข้อเสนอรวมถึงแผนการตลาด"}
{"word": "proposal", "english": "I’ll present the proposal tomorrow.", "thai": "ฉันจะนำเสนอข้อเสนอพรุ่งนี้"}
{"word": "proposal", "english": "The proposal was about employee benefits.", "thai": "ข้อเสนอเกี่ยวกับสวัสดิการพนักงาน"}
{"word": "proposal", "english": "She wrote a proposal for the merger.", "thai": "เธอเขียนข้อเสนอสำหรับการควบรวม"}
{"word": "proposal", "english": "The proposal was very professional.", "thai": "ข้อเสนอนั้นดูเป็นมืออาชีพมาก"}
{"word": "proposal", "english": "I need to clarify the proposal’s terms.", "thai": "ฉันต้องชี้แจงเงื่อนไขของข้อเสนอ"}
{"word": "proposal", "english": "The proposal was about new equipment.", "thai": "ข้อเสนอเกี่ยวกับอุปกรณ์ใหม่"}
{"word": "proposal", "english": "He’s revising the proposal now.", "thai": "เขากำลังแก้ไขข้อเสนออยู่"}
{"word": "proposal", "english": "The proposal was sent to the wrong person.", "thai": "ข้อเสนอถูกส่งไปยังคนที่ผิด"}
{"word": "proposal", "english": "I’ll need a proposal for the conference.", "thai": "ฉันต้องการข้อเสนอสำหรับการประชุม"}
{"word": "proposal", "english": "The proposal was about cost reduction.", "thai": "ข้อเสนอเกี่ยวกับการลดต้นทุน"}
{"word": "proposal", "english": "She presented a proposal to the CEO.", "thai": "เธอนำเสนอข้อเสนอต่อซีอีโอ"}
{"word": "proposal", "english": "The proposal was about safety measures.", "thai": "ข้อเสนอเกี่ยวกับมาตรการความปลอดภัย"}
{"word": "proposal", "english": "I need to submit the proposal soon.", "thai": "ฉันต้องยื่นข้อเสนอในเร็ว ๆ นี้"}
{"word": "proposal", "english": "The proposal was very persuasive.", "thai": "ข้อเสนอนั้นโน้มน้าวใจมาก"}
{"word": "proposal", "english": "He drafted a proposal for the partnership.", "thai": "เขาร่างข้อเสนอสำหรับการเป็นพันธมิตร"}
{"word": "proposal", "english": "The proposal was about the new strategy.", "thai": "ข้อเสนอเกี่ยวกับกลยุทธ์ใหม่"}
{"word": "proposal", "english": "I’ll need to discuss the proposal further.", "thai": "ฉันต้องพูดคุยเกี่ยวกับข้อเสนอเพิ่มเติม"}
{"word": "proposal", "english": "The proposal was shared on the intranet.", "thai": "ข้อเสนอถูกแชร์บนอินทราเน็ต"}
{"word": "proposal", "english": "She forgot to send the proposal.", "thai": "เธอลืมส่งข้อเสนอ"}
{"word": "proposal", "english": "The proposal was about the new hires.", "thai": "ข้อเสนอเกี่ยวกับพนักงานใหม่"}
{"word": "proposal", "english": "I need to check the proposal again.", "thai": "ฉันต้องตรวจสอบข้อเสนออีกครั้ง"}
{"word": "proposal", "english": "The proposal was sent to all managers.", "thai": "ข้อเสนอถูกส่งถึงผู้จัดการทุกคน"}
{"word": "proposal", "english": "He wrote a proposal to address concerns.", "thai": "เขาเขียนข้อเสนอเพื่อจัดการกับข้อกังวล"}
{"word": "proposal", "english": "The proposal was about the office move.", "thai": "ข้อเสนอเกี่ยวกับการย้ายสำนักงาน"}
{"word": "proposal", "english": "I’ll include that in the next proposal.", "thai": "ฉันจะรวมสิ่งนั้นในข้อเสนอถัดไป"}
{"word": "proposal", "english": "The proposal was about team goals.", "thai": "ข้อเสนอเกี่ยวกับเป้าหมายของทีม"}
{"word": "proposal", "english": "She sent a proposal to schedule a meeting.", "thai": "เธอส่งข้อเสนอเพื่อนัดประชุม"}
{"word": "proposal", "english": "The proposal was very straightforward.", "thai": "ข้อเสนอนั้นตรงไปตรงมามาก"}
{"word": "proposal", "english": "I didn’t see the proposal for the event.", "thai": "ฉันไม่เห็นข้อเสนอสำหรับงาน"}
{"word": "proposal", "english": "The proposal was sent to all supervisors.", "thai": "ข้อเสนอถูกส่งถึงหัวหน้างานทุกคน"}
{"word": "proposal", "english": "He wrote a proposal to announce the news.", "thai": "เขาเขียนข้อเสนอเพื่อประกาศข่าว"}
{"word": "proposal", "english": "The proposal was about the budget cuts.", "thai": "ข้อเสนอเกี่ยวกับการตัดงบประมาณ"}
{"word": "proposal", "english": "I’ll need to revise the proposal.", "thai": "ฉันต้องแก้ไขข้อเสนอ"}
{"word": "proposal", "english": "The proposal was about the new guidelines.", "thai": "ข้อเสนอเกี่ยวกับแนวทางใหม่"}
{"word": "proposal", "english": "She sent a proposal to all team members.", "thai": "เธอส่งข้อเสนอถึงสมาชิกทีมทุกคน"}
{"word": "proposal", "english": "The proposal addressed the recent changes.", "thai": "ข้อเสนอกล่าวถึงการเปลี่ยนแปลงล่าสุด"}
{"word": "proposal", "english": "I’ll include that in the next proposal.", "thai": "ฉันจะรวมสิ่งนั้นในข้อเสนอถัดไป"}
{"word": "proposal", "english": "The proposal was about the new strategy.", "thai": "ข้อเสนอเกี่ยวกับกลยุทธ์ใหม่"}
{"word": "proposal", "english": "He drafted a proposal for the conference.", "thai": "เขาร่างข้อเสนอสำหรับการประชุม"}
{"word": "proposal", "english": "The proposal was shared with the staff.", "thai": "ข้อเสนอถูกแชร์กับพนักงาน"}
{"word": "proposal", "english": "I need to prepare a proposal for tomorrow.", "thai": "ฉันต้องเตรียมข้อเสนอสำหรับวันพรุ่งนี้"}
{"word": "proposal", "english": "The proposal was about the team restructuring.", "thai": "ข้อเสนอเกี่ยวกับการปรับโครงสร้างทีม"}
{"word": "proposal", "english": "She sent a proposal to clarify the plan.", "thai": "เธอส่งข้อเสนอเพื่อชี้แจงแผน"}
{"word": "proposal", "english": "The proposal was very compelling.", "thai": "ข้อเสนอนั้นน่าสนใจมาก"}
{"word": "proposal", "english": "I need to finalize the proposal soon.", "thai": "ฉันต้องสรุปข้อเสนอในเร็ว ๆ นี้"}
{"word": "skill", "english": "She has a great skill in public speaking.", "thai": "เธอมีทักษะที่ยอดเยี่ยมในการพูดต่อหน้าสาธารณะ"}
{"word": "skill", "english": "His coding skill got him the job.", "thai": "ทักษะการเขียนโค้ดของเขาทำให้เขาได้งาน"}
{"word": "skill", "english": "I’m working on my writing skill.", "thai": "ฉันกำลังพัฒนาทักษะการเขียนของฉัน"}
{"word": "skill", "english": "Her skill in negotiation is impressive.", "thai": "ทักษะการเจรจาของเธอน่าประทับใจ"}
{"word": "skill", "english": "He lacks the skill to manage a team.", "thai": "เขาขาดทักษะในการจัดการทีม"}
{"word": "skill", "english": "The job requires a specific skill set.", "thai": "งานนี้ต้องการชุดทักษะเฉพาะ"}
{"word": "skill", "english": "She’s learning a new skill this month.", "thai": "เธอกำลังเรียนรู้ทักษะใหม่ในเดือนนี้"}
{"word": "skill", "english": "His skill in design stood out.", "thai": "ทักษะการออกแบบของเขาโดดเด่น"}
{"word": "skill", "english": "I need to improve my cooking skill.", "thai": "ฉันต้องพัฒนาทักษะการทำอาหาร"}
{"word": "skill", "english": "The candidate’s skill was perfect for the role.", "thai": "ทักษะของผู้สมัครเหมาะสมกับตำแหน่งนี้"}
{"word": "skill", "english": "He’s got a unique skill in problem-solving.", "thai": "เขามีทักษะที่ไม่เหมือนใครในการแก้ปัญหา"}
{"word": "skill", "english": "Her leadership skill is really strong.", "thai": "ทักษะความเป็นผู้นำของเธอแข็งแกร่งมาก"}
{"word": "skill", "english": "I’m taking a course to develop my skill.", "thai": "ฉันกำลังเรียนคอร์สเพื่อพัฒนาทักษะ"}
{"word": "skill", "english": "The skill required for this job is rare.", "thai": "ทักษะที่ต้องการสำหรับงานนี้หายาก"}
{"word": "skill", "english": "She showcased her skill during the presentation.", "thai": "เธอแสดงทักษะของเธอในระหว่างการนำเสนอ"}
{"word": "skill", "english": "His skill in photography is amazing.", "thai": "ทักษะการถ่ายภาพของเขาน่าทึ่ง"}
{"word": "skill", "english": "I don’t have the skill for that task.", "thai": "ฉันไม่มีทักษะสำหรับงานนั้น"}
{"word": "skill", "english": "The skill gap needs to be addressed.", "thai": "ช่องว่างด้านทักษะต้องได้รับการแก้ไข"}
{"word": "skill", "english": "She’s honing her skill in graphic design.", "thai": "เธอกำลังฝึกฝนทักษะด้านการออกแบบกราฟิก"}
{"word": "skill", "english": "His skill set matches the job perfectly.", "thai": "ชุดทักษะของเขาเหมาะสมกับงานอย่างสมบูรณ์"}
{"word": "skill", "english": "I’m proud of my new skill.", "thai": "ฉันภูมิใจกับทักษะใหม่ของฉัน"}
{"word": "skill", "english": "The skill was listed on her resume.", "thai": "ทักษะถูกระบุไว้ในเรซูเม่ของเธอ"}
{"word": "skill", "english": "He’s teaching me a new skill.", "thai": "เขากำลังสอนทักษะใหม่ให้ฉัน"}
{"word": "skill", "english": "Her skill in coding is self-taught.", "thai": "ทักษะการเขียนโค้ดของเธอเป็นแบบเรียนรู้ด้วยตัวเอง"}
{"word": "skill", "english": "The job demands a high level of skill.", "thai": "งานนี้ต้องการทักษะในระดับสูง"}
{"word": "skill", "english": "I’m practicing my skill every day.", "thai": "ฉันฝึกทักษะของฉันทุกวัน"}
{"word": "skill", "english": "His skill in sales is unmatched.", "thai": "ทักษะการขายของเขาไม่มีใครเทียบได้"}
{"word": "skill", "english": "She needs to work on her communication skill.", "thai": "เธอต้องพัฒนาทักษะการสื่อสาร"}
{"word": "skill", "english": "The skill test was really challenging.", "thai": "การทดสอบทักษะยากมาก"}
{"word": "skill", "english": "He’s adding a new skill to his resume.", "thai": "เขากำลังเพิ่มทักษะใหม่ลงในเรซูเม่"}
{"word": "skill", "english": "Her skill in time management is great.", "thai": "ทักษะการบริหารเวลาของเธอยอดเยี่ยม"}
{"word": "skill", "english": "I’m not confident in my skill yet.", "thai": "ฉันยังไม่มั่นใจในทักษะของฉัน"}
{"word": "skill", "english": "The skill was learned through practice.", "thai": "ทักษะนี้เรียนรู้ผ่านการฝึกฝน"}
{"word": "skill", "english": "His skill in negotiation helped close the deal.", "thai": "ทักษะการเจรจาของเขาช่วยปิดดีล"}
{"word": "skill", "english": "She’s developing a skill in data analysis.", "thai": "เธอกำลังพัฒนาทักษะด้านการวิเคราะห์ข้อมูล"}
{"word": "skill", "english": "The skill is highly valued in this industry.", "thai": "ทักษะนี้มีมูลค่าสูงในอุตสาหกรรมนี้"}
{"word": "skill", "english": "I need to brush up on my skill.", "thai": "ฉันต้องทบทวนทักษะของฉัน"}
{"word": "skill", "english": "His skill in programming is top-notch.", "thai": "ทักษะการเขียนโปรแกรมของเขายอดเยี่ยม"}
{"word": "skill", "english": "She’s teaching a skill to her team.", "thai": "เธอกำลังสอนทักษะให้ทีมของเธอ"}
{"word": "skill", "english": "The skill was a requirement for the job.", "thai": "ทักษะนี้เป็นข้อกำหนดสำหรับงาน"}
{"word": "skill", "english": "He’s got a natural skill for teaching.", "thai": "เขามีทักษะโดยธรรมชาติในการสอน"}
{"word": "skill", "english": "Her skill in marketing got her promoted.", "thai": "ทักษะด้านการตลาดของเธอทำให้เธอได้เลื่อนตำแหน่ง"}
{"word": "skill", "english": "I’m still building my skill in editing.", "thai": "ฉันยังคงพัฒนาทักษะด้านการตัดต่อ"}
{"word": "skill", "english": "The skill set needed is quite diverse.", "thai": "ชุดทักษะที่ต้องการค่อนข้างหลากหลาย"}
{"word": "skill", "english": "He demonstrated his skill during the interview.", "thai": "เขาแสดงทักษะของเขาในระหว่างการสัมภาษณ์"}
{"word": "skill", "english": "She’s mastering a new skill every year.", "thai": "เธอกำลังเชี่ยวชาญทักษะใหม่ทุกปี"}
{"word": "skill", "english": "His skill in leadership is inspiring.", "thai": "ทักษะความเป็นผู้นำของเขาน่าประทับใจ"}
{"word": "skill", "english": "I need to learn a new skill for work.", "thai": "ฉันต้องเรียนรู้ทักษะใหม่สำหรับงาน"}
{"word": "skill", "english": "The skill was developed over years.", "thai": "ทักษะนี้ถูกพัฒนามาหลายปี"}
{"word": "skill", "english": "Her skill in writing is exceptional.", "thai": "ทักษะการเขียนของเธอยอดเยี่ยม"}
{"word": "skill", "english": "He’s lacking a skill in customer service.", "thai": "เขาขาดทักษะด้านการบริการลูกค้า"}
{"word": "skill", "english": "The skill training was really helpful.", "thai": "การฝึกอบรมทักษะช่วยได้มาก"}
{"word": "skill", "english": "She’s got a skill for organizing events.", "thai": "เธอมีทักษะในการจัดงาน"}
{"word": "skill", "english": "His skill in analytics is impressive.", "thai": "ทักษะด้านการวิเคราะห์ของเขาน่าประทับใจ"}
{"word": "skill", "english": "I’m nervous about my skill level.", "thai": "ฉันกังวลเกี่ยวกับระดับทักษะของฉัน"}
{"word": "skill", "english": "The skill was listed in the job description.", "thai": "ทักษะถูกระบุไว้ในรายละเอียดงาน"}
{"word": "skill", "english": "She’s improving her skill in public relations.", "thai": "เธอกำลังพัฒนาทักษะด้านประชาสัมพันธ์"}
{"word": "skill", "english": "His skill in teamwork makes him valuable.", "thai": "ทักษะการทำงานเป็นทีมของเขาทำให้เขามีคุณค่า"}
{"word": "skill", "english": "I’m taking a class to build my skill.", "thai": "ฉันกำลังเรียนเพื่อพัฒนาทักษะ"}
{"word": "skill", "english": "The skill is critical for this project.", "thai": "ทักษะนี้สำคัญสำหรับโปรเจกต์นี้"}
{"word": "skill", "english": "Her skill in teaching is remarkable.", "thai": "ทักษะการสอนของเธอน่าทึ่ง"}
{"word": "skill", "english": "He’s showcasing his skill at the workshop.", "thai": "เขากำลังแสดงทักษะของเขาในเวิร์กช็อป"}
{"word": "skill", "english": "The skill gap is holding me back.", "thai": "ช่องว่างด้านทักษะกำลังฉุดฉันไว้"}
{"word": "skill", "english": "She’s got a skill in conflict resolution.", "thai": "เธอมีทักษะในการแก้ไขข้อขัดแย้ง"}
{"word": "skill", "english": "His skill in finance helped the company.", "thai": "ทักษะด้านการเงินของเขาช่วยบริษัท"}
{"word": "skill", "english": "I need to work on my technical skill.", "thai": "ฉันต้องพัฒนาทักษะด้านเทคนิค"}
{"word": "skill", "english": "The skill was acquired through training.", "thai": "ทักษะนี้ได้มาผ่านการฝึกอบรม"}
{"word": "skill", "english": "Her skill in research is outstanding.", "thai": "ทักษะด้านการวิจัยของเธอยอดเยี่ยม"}
{"word": "skill", "english": "He’s learning a skill in web development.", "thai": "เขากำลังเรียนรู้ทักษะด้านการพัฒนาเว็บ"}
{"word": "skill", "english": "The skill is in high demand now.", "thai": "ทักษะนี้มีความต้องการสูงในตอนนี้"}
{"word": "skill", "english": "She’s teaching herself a new skill.", "thai": "เธอกำลังสอนตัวเองทักษะใหม่"}
{"word": "skill", "english": "His skill in project management is great.", "thai": "ทักษะการบริหารโครงการของเขายอดเยี่ยม"}
{"word": "skill", "english": "I’m still developing my skill in editing.", "thai": "ฉันยังคงพัฒนาทักษะด้านการตัดต่อ"}
{"word": "skill", "english": "The skill test was part of the interview.", "thai": "การทดสอบทักษะเป็นส่วนหนึ่งของการสัมภาษณ์"}
{"word": "skill", "english": "She’s got a natural skill for singing.", "thai": "เธอมีทักษะโดยธรรมชาติในการร้องเพลง"}
{"word": "skill", "english": "His skill in negotiation saved the deal.", "thai": "ทักษะการเจรจาของเขาช่วยรักษาดีล"}
{"word": "skill", "english": "I’m not confident in my skill yet.", "thai": "ฉันยังไม่มั่นใจในทักษะของฉัน"}
{"word": "skill", "english": "The skill was taught in a workshop.", "thai": "ทักษะนี้ถูกสอนในเวิร์กช็อป"}
{"word": "skill", "english": "Her skill in coding got her hired.", "thai": "ทักษะการเขียนโค้ดของเธอทำให้เธอได้งาน"}
{"word": "skill", "english": "He’s improving his skill in public speaking.", "thai": "เขากำลังพัฒนาทักษะการพูดต่อหน้าสาธารณะ"}
{"word": "skill", "english": "The skill is essential for this role.", "thai": "ทักษะนี้จำเป็นสำหรับตำแหน่งนี้"}
{"word": "skill", "english": "She’s practicing her skill in photography.", "thai": "เธอกำลังฝึกทักษะการถ่ายภาพ"}
{"word": "skill", "english": "His skill in analytics is highly valued.", "thai": "ทักษะด้านการวิเคราะห์ของเขามีมูลค่าสูง"}
{"word": "skill", "english": "I need to develop a new skill.", "thai": "ฉันต้องพัฒนาทักษะใหม่"}
{"word": "skill", "english": "The skill was learned on the job.", "thai": "ทักษะนี้เรียนรู้จากการทำงาน"}
{"word": "skill", "english": "Her skill in leadership is inspiring.", "thai": "ทักษะความเป็นผู้นำของเธอน่าประทับใจ"}
{"word": "skill", "english": "He’s got a skill for fixing things.", "thai": "เขามีทักษะในการซ่อมแซมสิ่งของ"}
{"word": "skill", "english": "The skill course was really expensive.", "thai": "คอร์สทักษะนี้แพงมาก"}
{"word": "skill", "english": "She’s showcasing her skill in the competition.", "thai": "เธอกำลังแสดงทักษะของเธอในการแข่งขัน"}
{"word": "skill", "english": "His skill in writing is improving.", "thai": "ทักษะการเขียนของเขากำลังดีขึ้น"}
{"word": "skill", "english": "I’m learning a skill in digital marketing.", "thai": "ฉันกำลังเรียนรู้ทักษะด้านการตลาดดิจิทัล"}
{"word": "skill", "english": "The skill was a key job requirement.", "thai": "ทักษะนี้เป็นข้อกำหนดสำคัญของงาน"}
{"word": "skill", "english": "She’s got a skill in event planning.", "thai": "เธอมีทักษะในการวางแผนงาน"}
{"word": "skill", "english": "His skill in coding is self-taught.", "thai": "ทักษะการเขียนโค้ดของเขาเป็นแบบเรียนรู้ด้วยตัวเอง"}
{"word": "skill", "english": "I’m working on my skill in negotiation.", "thai": "ฉันกำลังพัฒนาทักษะการเจรจา"}
{"word": "skill", "english": "The skill helped her stand out.", "thai": "ทักษะนี้ช่วยให้เธอโดดเด่น"}
{"word": "skill", "english": "He’s teaching a skill to new employees.", "thai": "เขากำลังสอนทักษะให้พนักงานใหม่"}
{"word": "skill", "english": "Her skill in teamwork is amazing.", "thai": "ทักษะการทำงานเป็นทีมของเธอน่าทึ่ง"}
{"word": "skill", "english": "The skill was critical for the project.", "thai": "ทักษะนี้สำคัญสำหรับโปรเจกต์"}
{"word": "skill", "english": "I’m proud of my skill in design.", "thai": "ฉันภูมิใจกับทักษะการออกแบบของฉัน"}
{"word": "experience", "english": "She has a lot of experience in marketing.", "thai": "เธอมีประสบการณ์มากในด้านการตลาด"}
{"word": "experience", "english": "This job requires five years of experience.", "thai": "งานนี้ต้องการประสบการณ์ห้าปี"}
{"word": "experience", "english": "His experience with coding helped him get hired.", "thai": "ประสบการณ์ด้านการเขียนโค้ดช่วยให้เขาได้งาน"}
{"word": "experience", "english": "I had a great experience at the conference.", "thai": "ฉันมีประสบการณ์ที่ดีในงานประชุม"}
{"word": "experience", "english": "He’s lacking experience in project management.", "thai": "เขาขาดประสบการณ์ด้านการบริหารโครงการ"}
{"word": "experience", "english": "Her experience abroad shaped her perspective.", "thai": "ประสบการณ์ในต่างประเทศของเธอหล่อหลอมมุมมองของเธอ"}
{"word": "experience", "english": "I’m looking for a new work experience.", "thai": "ฉันกำลังมองหาประสบการณ์การทำงานใหม่"}
{"word": "experience", "english": "The internship gave me valuable experience.", "thai": "การฝึกงานให้ประสบการณ์ที่มีค่าแก่ฉัน"}
{"word": "experience", "english": "His experience in sales is impressive.", "thai": "ประสบการณ์ด้านการขายของเขาน่าประทับใจ"}
{"word": "experience", "english": "She shared her experience with the team.", "thai": "เธอแบ่งปันประสบการณ์ของเธอกับทีม"}
{"word": "experience", "english": "I don’t have enough experience for this role.", "thai": "ฉันไม่มีประสบการณ์เพียงพอสำหรับตำแหน่งนี้"}
{"word": "experience", "english": "The experience was unforgettable.", "thai": "ประสบการณ์นั้นลืมไม่ลง"}
{"word": "experience", "english": "He listed his experience on his resume.", "thai": "เขาระบุประสบการณ์ของเขาในเรซูเม่"}
{"word": "experience", "english": "Her teaching experience got her the job.", "thai": "ประสบการณ์การสอนของเธอทำให้เธอได้งาน"}
{"word": "experience", "english": "I want to gain more experience in design.", "thai": "ฉันต้องการประสบการณ์เพิ่มเติมในด้านการออกแบบ"}
{"word": "experience", "english": "The experience taught me a lot.", "thai": "ประสบการณ์นั้นสอนอะไรฉันมากมาย"}
{"word": "experience", "english": "His experience in leadership is strong.", "thai": "ประสบการณ์ด้านความเป็นผู้นำของเขาแข็งแกร่ง"}
{"word": "experience", "english": "She’s looking for hands-on experience.", "thai": "เธอกำลังมองหาประสบการณ์จริง"}
{"word": "experience", "english": "The job ad asked for relevant experience.", "thai": "ประกาศรับสมัครงานขอประสบการณ์ที่เกี่ยวข้อง"}
{"word": "experience", "english": "I had a bad experience with that company.", "thai": "ฉันมีประสบการณ์ที่ไม่ดีกับบริษัทนั้น"}
{"word": "experience", "english": "His experience in tech is extensive.", "thai": "ประสบการณ์ด้านเทคโนโลยีของเขากว้างขวาง"}
{"word": "experience", "english": "She’s nervous about her lack of experience.", "thai": "เธอกังวลเกี่ยวกับการขาดประสบการณ์"}
{"word": "experience", "english": "The experience was life-changing for me.", "thai": "ประสบการณ์นั้นเปลี่ยนชีวิตฉัน"}
{"word": "experience", "english": "He’s got years of experience in finance.", "thai": "เขามีประสบการณ์หลายปีในด้านการเงิน"}
{"word": "experience", "english": "I’m adding my experience to my resume.", "thai": "ฉันกำลังเพิ่มประสบการณ์ลงในเรซูเม่"}
{"word": "experience", "english": "Her experience in customer service is great.", "thai": "ประสบการณ์ด้านการบริการลูกค้าของเธอยอดเยี่ยม"}
{"word": "experience", "english": "The experience helped me grow professionally.", "thai": "ประสบการณ์นั้นช่วยให้ฉันเติบโตในสายงาน"}
{"word": "experience", "english": "He doesn’t have the experience we need.", "thai": "เขาไม่มีประสบการณ์ที่เราต้องการ"}
{"word": "experience", "english": "She’s seeking experience in data analysis.", "thai": "เธอกำลังมองหาประสบการณ์ด้านการวิเคราะห์ข้อมูล"}
{"word": "experience", "english": "The experience was a learning opportunity.", "thai": "ประสบการณ์นั้นเป็นโอกาสในการเรียนรู้"}
{"word": "experience", "english": "His experience in management stood out.", "thai": "ประสบการณ์ด้านการจัดการของเขาโดดเด่น"}
{"word": "experience", "english": "I want to share my experience with others.", "thai": "ฉันต้องการแบ่งปันประสบการณ์ของฉันกับผู้อื่น"}
{"word": "experience", "english": "Her experience in teaching is limited.", "thai": "ประสบการณ์ด้านการสอนของเธอมีจำกัด"}
{"word": "experience", "english": "The experience was totally worth it.", "thai": "ประสบการณ์นั้นคุ้มค่ามาก"}
{"word": "experience", "english": "He’s building experience in web development.", "thai": "เขากำลังสร้างประสบการณ์ด้านการพัฒนาเว็บ"}
{"word": "experience", "english": "The job requires hands-on experience.", "thai": "งานนี้ต้องการประสบการณ์จริง"}
{"word": "experience", "english": "She described her experience in the interview.", "thai": "เธออธิบายประสบการณ์ของเธอในการสัมภาษณ์"}
{"word": "experience", "english": "His experience in sales is unmatched.", "thai": "ประสบการณ์ด้านการขายของเขาไม่มีใครเทียบได้"}
{"word": "experience", "english": "I’m looking for a unique work experience.", "thai": "ฉันกำลังมองหาประสบการณ์การทำงานที่ไม่เหมือนใคร"}
{"word": "experience", "english": "The experience was challenging but rewarding.", "thai": "ประสบการณ์นั้นท้าทายแต่คุ้มค่า"}
{"word": "experience", "english": "Her experience in research is impressive.", "thai": "ประสบการณ์ด้านการวิจัยของเธอน่าประทับใจ"}
{"word": "experience", "english": "He needs more experience to qualify.", "thai": "เขาต้องการประสบการณ์เพิ่มเพื่อให้มีคุณสมบัติ"}
{"word": "experience", "english": "The experience shaped my career path.", "thai": "ประสบการณ์นั้นหล่อหลอมเส้นทางอาชีพของฉัน"}
{"word": "experience", "english": "She’s got extensive experience in HR.", "thai": "เธอมีประสบการณ์กว้างขวางในด้านทรัพยากรบุคคล"}
{"word": "experience", "english": "I learned a lot from that experience.", "thai": "ฉันเรียนรู้มากจากประสบการณ์นั้น"}
{"word": "experience", "english": "His experience in coding is self-taught.", "thai": "ประสบการณ์ด้านการเขียนโค้ดของเขาเป็นแบบเรียนรู้ด้วยตัวเอง"}
{"word": "experience", "english": "The experience was a total disaster.", "thai": "ประสบการณ์นั้นเป็นหายนะโดยสิ้นเชิง"}
{"word": "experience", "english": "She’s gaining experience in graphic design.", "thai": "เธอกำลังสร้างประสบการณ์ด้านการออกแบบกราฟิก"}
{"word": "experience", "english": "The job posting asked for prior experience.", "thai": "ประกาศรับสมัครงานขอประสบการณ์ก่อนหน้า"}
{"word": "experience", "english": "He shared his experience with the group.", "thai": "เขาแบ่งปันประสบการณ์ของเขากับกลุ่ม"}
{"word": "experience", "english": "Her experience in leadership is strong.", "thai": "ประสบการณ์ด้านความเป็นผู้นำของเธอแข็งแกร่ง"}
{"word": "experience", "english": "I’m nervous about my lack of experience.", "thai": "ฉันกังวลเกี่ยวกับการขาดประสบการณ์ของฉัน"}
{"word": "experience", "english": "The experience was a turning point for me.", "thai": "ประสบการณ์นั้นเป็นจุดเปลี่ยนสำหรับฉัน"}
{"word": "experience", "english": "He’s got a lot of experience in teaching.", "thai": "เขามีประสบการณ์มากในด้านการสอน"}
{"word": "experience", "english": "The experience helped me build confidence.", "thai": "ประสบการณ์นั้นช่วยให้ฉันสร้างความมั่นใจ"}
{"word": "experience", "english": "She’s seeking experience in public relations.", "thai": "เธอกำลังมองหาประสบการณ์ด้านประชาสัมพันธ์"}
{"word": "experience", "english": "The experience was tough but valuable.", "thai": "ประสบการณ์นั้นยากแต่มีค่า"}
{"word": "experience", "english": "His experience in engineering is vast.", "thai": "ประสบการณ์ด้านวิศวกรรมของเขากว้างขวาง"}
{"word": "experience", "english": "I need more experience for this job.", "thai": "ฉันต้องการประสบการณ์เพิ่มสำหรับงานนี้"}
{"word": "experience", "english": "The experience was a complete success.", "thai": "ประสบการณ์นั้นประสบความสำเร็จอย่างสมบูรณ์"}
{"word": "experience", "english": "She’s adding her experience to her resume.", "thai": "เธอกำลังเพิ่มประสบการณ์ลงในเรซูเม่"}
{"word": "experience", "english": "His experience in analytics is top-notch.", "thai": "ประสบการณ์ด้านการวิเคราะห์ของเขายอดเยี่ยม"}
{"word": "experience", "english": "The experience taught me to stay calm.", "thai": "ประสบการณ์นั้นสอนให้ฉันสงบสติอารมณ์"}
{"word": "experience", "english": "She’s got experience in event planning.", "thai": "เธอมีประสบการณ์ด้านการวางแผนงาน"}
{"word": "experience", "english": "The experience was humbling for me.", "thai": "ประสบการณ์นั้นทำให้ฉันรู้สึกถ่อมตัว"}
{"word": "experience", "english": "He’s looking for experience in marketing.", "thai": "เขากำลังมองหาประสบการณ์ด้านการตลาด"}
{"word": "experience", "english": "Her experience in sales stood out.", "thai": "ประสบการณ์ด้านการขายของเธอโดดเด่น"}
{"word": "experience", "english": "The experience was a career highlight.", "thai": "ประสบการณ์นั้นเป็นจุดเด่นในอาชีพ"}
{"word": "experience", "english": "I’m gaining experience in web development.", "thai": "ฉันกำลังสร้างประสบการณ์ด้านการพัฒนาเว็บ"}
{"word": "experience", "english": "His experience in finance is limited.", "thai": "ประสบการณ์ด้านการเงินของเขามีจำกัด"}
{"word": "experience", "english": "The experience was eye-opening for her.", "thai": "ประสบการณ์นั้นเปิดโลกทัศน์ให้เธอ"}
{"word": "experience", "english": "She’s sharing her experience with new hires.", "thai": "เธอกำลังแบ่งปันประสบการณ์กับพนักงานใหม่"}
{"word": "experience", "english": "The job requires international experience.", "thai": "งานนี้ต้องการประสบการณ์ในต่างประเทศ"}
{"word": "experience", "english": "He’s proud of his experience in research.", "thai": "เขาภูมิใจกับประสบการณ์ด้านการวิจัย"}
{"word": "experience", "english": "The experience was a big learning curve.", "thai": "ประสบการณ์นั้นเป็นช่วงการเรียนรู้ที่ยิ่งใหญ่"}
{"word": "experience", "english": "She’s got experience in project management.", "thai": "เธอมีประสบการณ์ด้านการบริหารโครงการ"}
{"word": "experience", "english": "The experience wasn’t what I expected.", "thai": "ประสบการณ์นั้นไม่เป็นอย่างที่ฉันคาดไว้"}
{"word": "experience", "english": "He’s building experience in customer service.", "thai": "เขากำลังสร้างประสบการณ์ด้านการบริการลูกค้า"}
{"word": "experience", "english": "The experience helped her career grow.", "thai": "ประสบการณ์นั้นช่วยให้อาชีพของเธอเติบโต"}
{"word": "experience", "english": "I’m looking for real-world experience.", "thai": "ฉันกำลังมองหาประสบการณ์ในโลกแห่งความจริง"}
{"word": "experience", "english": "Her experience in teaching is extensive.", "thai": "ประสบการณ์ด้านการสอนของเธอกว้างขวาง"}
{"word": "experience", "english": "The experience was a total game-changer.", "thai": "ประสบการณ์นั้นเปลี่ยนเกมโดยสิ้นเชิง"}
{"word": "experience", "english": "He’s adding experience to his portfolio.", "thai": "เขากำลังเพิ่มประสบการณ์ลงในแฟ้มผลงาน"}
{"word": "experience", "english": "The experience was tough but worth it.", "thai": "ประสบการณ์นั้นยากแต่คุ้มค่า"}
{"word": "experience", "english": "She’s seeking experience in graphic design.", "thai": "เธอกำลังมองหาประสบการณ์ด้านการออกแบบกราฟิก"}
{"word": "experience", "english": "His experience in leadership is valuable.", "thai": "ประสบการณ์ด้านความเป็นผู้นำของเขามีค่า"}
{"word": "experience", "english": "The experience was a wake-up call.", "thai": "ประสบการณ์นั้นเป็นการตื่นตัว"}
{"word": "experience", "english": "I need experience to get this job.", "thai": "ฉันต้องการประสบการณ์เพื่อได้งานนี้"}
{"word": "experience", "english": "Her experience in analytics is strong.", "thai": "ประสบการณ์ด้านการวิเคราะห์ของเธอแข็งแกร่ง"}
{"word": "experience", "english": "The experience was a huge success.", "thai": "ประสบการณ์นั้นประสบความสำเร็จอย่างมาก"}
{"word": "experience", "english": "He’s gaining experience in public speaking.", "thai": "เขากำลังสร้างประสบการณ์ด้านการพูดต่อหน้าสาธารณะ"}
{"word": "experience", "english": "The experience taught me resilience.", "thai": "ประสบการณ์นั้นสอนให้ฉันมีความยืดหยุ่น"}
{"word": "experience", "english": "She’s got experience in event planning.", "thai": "เธอมีประสบการณ์ด้านการวางแผนงาน"}
{"word": "experience", "english": "The experience was a career milestone.", "thai": "ประสบการณ์นั้นเป็นก้าวสำคัญในอาชีพ"}
{"word": "experience", "english": "He’s looking for experience in teaching.", "thai": "เขากำลังมองหาประสบการณ์ด้านการสอน"}
{"word": "experience", "english": "Her experience in coding is impressive.", "thai": "ประสบการณ์ด้านการเขียนโค้ดของเธอน่าประทับใจ"}
{"word": "experience", "english": "The experience was a bit overwhelming.", "thai": "ประสบการณ์นั้นค่อนข้างหนักหนา"}
{"word": "experience", "english": "I’m building experience in data science.", "thai": "ฉันกำลังสร้างประสบการณ์ด้านวิทยาศาสตร์ข้อมูล"}
{"word": "experience", "english": "His experience in management is limited.", "thai": "ประสบการณ์ด้านการจัดการของเขามีจำกัด"}
{"word": "experience", "english": "The experience was truly motivating.", "thai": "ประสบการณ์นั้นสร้างแรงบันดาลใจอย่างแท้จริง"}
{"word": "experience", "english": "She’s sharing her experience in a blog.", "thai": "เธอกำลังแบ่งปันประสบการณ์ในบล็อก"}
{"word": "experience", "english": "The job requires practical experience.", "thai": "งานนี้ต้องการประสบการณ์ปฏิบัติ"}
{"word": "experience", "english": "His experience in research is outstanding.", "thai": "ประสบการณ์ด้านการวิจัยของเขายอดเยี่ยม"}
{"word": "responsibility", "english": "Taking care of the team is my responsibility.", "thai": "การดูแลทีมเป็นความรับผิดชอบของฉัน"}
{"word": "responsibility", "english": "She has a lot of responsibility at work.", "thai": "เธอมีความรับผิดชอบมากในที่ทำงาน"}
{"word": "responsibility", "english": "It’s his responsibility to finish the project.", "thai": "เป็นความรับผิดชอบของเขาที่จะทำโปรเจกต์ให้เสร็จ"}
{"word": "responsibility", "english": "I feel a huge responsibility to help others.", "thai": "ฉันรู้สึกถึงความรับผิดชอบอย่างมากในการช่วยเหลือผู้อื่น"}
{"word": "responsibility", "english": "The manager gave her more responsibility.", "thai": "ผู้จัดการให้ความรับผิดชอบเพิ่มเติมแก่เธอ"}
{"word": "responsibility", "english": "He shirks his responsibility every time.", "thai": "เขาเลี่ยงความรับผิดชอบทุกครั้ง"}
{"word": "responsibility", "english": "It’s my responsibility to lock the office.", "thai": "เป็นความรับผิดชอบของฉันที่จะล็อกออฟฟิศ"}
{"word": "responsibility", "english": "She takes her responsibility seriously.", "thai": "เธอรับผิดชอบหน้าที่ของเธออย่างจริงจัง"}
{"word": "responsibility", "english": "The job comes with a lot of responsibility.", "thai": "งานนี้มาพร้อมกับความรับผิดชอบมากมาย"}
{"word": "responsibility", "english": "He’s not ready for that kind of responsibility.", "thai": "เขาไม่พร้อมสำหรับความรับผิดชอบแบบนั้น"}
{"word": "responsibility", "english": "I have a responsibility to my family.", "thai": "ฉันมีความรับผิดชอบต่อครอบครัว"}
{"word": "responsibility", "english": "Her main responsibility is customer service.", "thai": "ความรับผิดชอบหลักของเธอคือการบริการลูกค้า"}
{"word": "responsibility", "english": "He took full responsibility for the mistake.", "thai": "เขารับผิดชอบอย่างเต็มที่สำหรับความผิดพลาด"}
{"word": "responsibility", "english": "The responsibility falls on the team leader.", "thai": "ความรับผิดชอบตกอยู่ที่หัวหน้าทีม"}
{"word": "responsibility", "english": "She’s overwhelmed by her new responsibility.", "thai": "เธอรู้สึกหนักใจกับความรับผิดชอบใหม่"}
{"word": "responsibility", "english": "It’s our responsibility to keep the workplace safe.", "thai": "เป็นความรับผิดชอบของเราที่จะรักษาความปลอดภัยในที่ทำงาน"}
{"word": "responsibility", "english": "He delegated his responsibility to a colleague.", "thai": "เขามอบหมายความรับผิดชอบให้เพื่อนร่วมงาน"}
{"word": "responsibility", "english": "The role involves a lot of responsibility.", "thai": "บทบาทนี้เกี่ยวข้องกับความรับผิดชอบมาก"}
{"word": "responsibility", "english": "She’s ready to take on more responsibility.", "thai": "เธอพร้อมที่จะรับความรับผิดชอบเพิ่ม"}
{"word": "responsibility", "english": "It’s my responsibility to submit the report.", "thai": "เป็นความรับผิดชอบของฉันที่จะส่งรายงาน"}
{"word": "responsibility", "english": "He avoids responsibility whenever possible.", "thai": "เขาเลี่ยงความรับผิดชอบเมื่อใดก็ตามที่ทำได้"}
{"word": "responsibility", "english": "Her responsibility includes managing budgets.", "thai": "ความรับผิดชอบของเธอรวมถึงการจัดการงบประมาณ"}
{"word": "responsibility", "english": "I feel a responsibility to mentor others.", "thai": "ฉันรู้สึกถึงความรับผิดชอบในการเป็นพี่เลี้ยงผู้อื่น"}
{"word": "responsibility", "english": "The responsibility was too much for him.", "thai": "ความรับผิดชอบนั้นมากเกินไปสำหรับเขา"}
{"word": "responsibility", "english": "She handles her responsibility with care.", "thai": "เธอจัดการความรับผิดชอบของเธอด้วยความระมัดระวัง"}
{"word": "responsibility", "english": "It’s his responsibility to train new hires.", "thai": "เป็นความรับผิดชอบของเขาที่จะฝึกอบรมพนักงานใหม่"}
{"word": "responsibility", "english": "The team shares the responsibility equally.", "thai": "ทีมแบ่งปันความรับผิดชอบอย่างเท่าเทียม"}
{"word": "responsibility", "english": "I’m nervous about this new responsibility.", "thai": "ฉันกังวлเกี่ยวกับความรับผิดชอบใหม่นี้"}
{"word": "responsibility", "english": "Her responsibility is to oversee the project.", "thai": "ความรับผิดชอบของเธอคือการดูแลโปรเจกต์"}
{"word": "responsibility", "english": "He took responsibility for the team’s failure.", "thai": "เขารับผิดชอบต่อความล้มเหลวของทีม"}
{"word": "responsibility", "english": "The job description lists every responsibility.", "thai": "รายละเอียดงานระบุความรับผิดชอบทุกอย่าง"}
{"word": "responsibility", "english": "She’s got a lot of responsibility at home.", "thai": "เธอมีความรับผิดชอบมากที่บ้าน"}
{"word": "responsibility", "english": "It’s my responsibility to organize the event.", "thai": "เป็นความรับผิดชอบของฉันที่จะจัดงาน"}
{"word": "responsibility", "english": "He’s not good at handling responsibility.", "thai": "เขาไม่เก่งในการจัดการความรับผิดชอบ"}
{"word": "responsibility", "english": "Her responsibility includes scheduling meetings.", "thai": "ความรับผิดชอบของเธอรวมถึงการจัดตารางประชุม"}
{"word": "responsibility", "english": "I feel a responsibility to do my best.", "thai": "ฉันรู้สึกถึงความรับผิดชอบที่จะทำให้ดีที่สุด"}
{"word": "responsibility", "english": "The responsibility was assigned to her.", "thai": "ความรับผิดชอบถูกมอบหมายให้เธอ"}
{"word": "responsibility", "english": "He’s taking on a big responsibility.", "thai": "เขากำลังรับความรับผิดชอบใหญ่"}
{"word": "responsibility", "english": "She shares the responsibility with her team.", "thai": "เธอแบ่งปันความรับผิดชอบกับทีมของเธอ"}
{"word": "responsibility", "english": "It’s our responsibility to meet deadlines.", "thai": "เป็นความรับผิดชอบของเราที่จะทำตามกำหนดเวลา"}
{"word": "responsibility", "english": "He’s shirking his responsibility again.", "thai": "เขากำลังเลี่ยงความรับผิดชอบอีกครั้ง"}
{"word": "responsibility", "english": "Her responsibility is to manage the budget.", "thai": "ความรับผิดชอบของเธอคือการจัดการงบประมาณ"}
{"word": "responsibility", "english": "I have a responsibility to my community.", "thai": "ฉันมีความรับผิดชอบต่อชุมชนของฉัน"}
{"word": "responsibility", "english": "The responsibility feels overwhelming sometimes.", "thai": "ความรับผิดชอบรู้สึกหนักหนาบางครั้ง"}
{"word": "responsibility", "english": "He’s ready for more responsibility at work.", "thai": "เขาพร้อมสำหรับความรับผิดชอบเพิ่มในที่ทำงาน"}
{"word": "responsibility", "english": "It’s my responsibility to check the data.", "thai": "เป็นความรับผิดชอบของฉันที่จะตรวจสอบข้อมูล"}
{"word": "responsibility", "english": "She handles her responsibility like a pro.", "thai": "เธอจัดการความรับผิดชอบอย่างมืออาชีพ"}
{"word": "responsibility", "english": "The responsibility was split among the team.", "thai": "ความรับผิดชอบถูกแบ่งปันในหมู่ทีม"}
{"word": "responsibility", "english": "He took responsibility for the error.", "thai": "เขารับผิดชอบต่อข้อผิดพลาด"}
{"word": "responsibility", "english": "Her responsibility is to lead the meeting.", "thai": "ความรับผิดชอบของเธอคือการนำการประชุม"}
{"word": "responsibility", "english": "I’m not ready for that responsibility.", "thai": "ฉันไม่พร้อมสำหรับความรับผิดชอบนั้น"}
{"word": "responsibility", "english": "The responsibility comes with the promotion.", "thai": "ความรับผิดชอบมาพร้อมกับการเลื่อนตำแหน่ง"}
{"word": "responsibility", "english": "He’s avoiding his responsibility to the team.", "thai": "เขากำลังเลี่ยงความรับผิดชอบต่อทีม"}
{"word": "responsibility", "english": "Her responsibility includes training staff.", "thai": "ความรับผิดชอบของเธอรวมถึงการฝึกอบรมพนักงาน"}
{"word": "responsibility", "english": "I feel a responsibility to volunteer.", "thai": "ฉันรู้สึกถึงความรับผิดชอบในการเป็นอาสาสมัคร"}
{"word": "responsibility", "english": "The responsibility was too much for her.", "thai": "ความรับผิดชอบนั้นมากเกินไปสำหรับเธอ"}
{"word": "responsibility", "english": "He’s taking on a new responsibility.", "thai": "เขากำลังรับความรับผิดชอบใหม่"}
{"word": "responsibility", "english": "It’s my responsibility to update the system.", "thai": "เป็นความรับผิดชอบของฉันที่จะอัปเดตระบบ"}
{"word": "responsibility", "english": "She’s great at managing responsibility.", "thai": "เธอเก่งในการจัดการความรับผิดชอบ"}
{"word": "responsibility", "english": "The responsibility was given to the new hire.", "thai": "ความรับผิดชอบถูกมอบให้พนักงานใหม่"}
{"word": "responsibility", "english": "He feels a responsibility to his mentor.", "thai": "เขารู้สึกถึงความรับผิดชอบต่อพี่เลี้ยงของเขา"}
{"word": "responsibility", "english": "Her responsibility is to review the reports.", "thai": "ความรับผิดชอบของเธอคือการตรวจสอบรายงาน"}
{"word": "responsibility", "english": "I’m nervous about this big responsibility.", "thai": "ฉันกังวลเกี่ยวกับความรับผิดชอบใหญ่ครั้งนี้"}
{"word": "responsibility", "english": "The responsibility lies with the supervisor.", "thai": "ความรับผิดชอบอยู่ที่หัวหน้างาน"}
{"word": "responsibility", "english": "She’s handling her responsibility well.", "thai": "เธอกำลังจัดการความรับผิดชอบได้ดี"}
{"word": "responsibility", "english": "It’s his responsibility to fix the issue.", "thai": "เป็นความรับผิดชอบของเขาที่จะแก้ไขปัญหา"}
{"word": "responsibility", "english": "The responsibility was shared by the group.", "thai": "ความรับผิดชอบถูกแบ่งปันโดยกลุ่ม"}
{"word": "responsibility", "english": "He’s not taking his responsibility seriously.", "thai": "เขาไม่รับผิดชอบหน้าที่ของเขาอย่างจริงจัง"}
{"word": "responsibility", "english": "Her responsibility is to ensure quality.", "thai": "ความรับผิดชอบของเธอคือการรับประกันคุณภาพ"}
{"word": "responsibility", "english": "I have a responsibility to my team.", "thai": "ฉันมีความรับผิดชอบต่อทีมของฉัน"}
{"word": "responsibility", "english": "The responsibility was a bit daunting.", "thai": "ความรับผิดชอบนั้นน่ากลัวเล็กน้อย"}
{"word": "responsibility", "english": "He’s ready to accept more responsibility.", "thai": "เขาพร้อมที่จะยอมรับความรับผิดชอบเพิ่ม"}
{"word": "responsibility", "english": "It’s my responsibility to call the client.", "thai": "เป็นความรับผิดชอบของฉันที่จะโทรหาลูกค้า"}
{"word": "responsibility", "english": "She’s overwhelmed by her responsibility.", "thai": "เธอรู้สึกหนักใจกับความรับผิดชอบของเธอ"}
{"word": "responsibility", "english": "The responsibility was clearly outlined.", "thai": "ความรับผิดชอบถูกระบุไว้อย่างชัดเจน"}
{"word": "responsibility", "english": "He took responsibility for the delay.", "thai": "เขารับผิดชอบต่อความล่าช้า"}
{"word": "responsibility", "english": "Her responsibility is to manage the team.", "thai": "ความรับผิดชอบของเธอคือการจัดการทีม"}
{"word": "responsibility", "english": "I feel a responsibility to speak up.", "thai": "ฉันรู้สึกถึงความรับผิดชอบในการพูดออกมา"}
{"word": "responsibility", "english": "The responsibility was too heavy for him.", "thai": "ความรับผิดชอบนั้นหนักเกินไปสำหรับเขา"}
{"word": "responsibility", "english": "She’s taking on a leadership responsibility.", "thai": "เธอกำลังรับความรับผิดชอบด้านความเป็นผู้นำ"}
{"word": "responsibility", "english": "It’s our responsibility to stay on track.", "thai": "เป็นความรับผิดชอบของเราที่จะดำเนินการตามแผน"}
{"word": "responsibility", "english": "He’s avoiding his responsibility to report.", "thai": "เขากำลังเลี่ยงความรับผิดชอบในการรายงาน"}
{"word": "responsibility", "english": "Her responsibility includes data analysis.", "thai": "ความรับผิดชอบของเธอรวมถึงการวิเคราะห์ข้อมูล"}
{"word": "responsibility", "english": "I have a responsibility to my clients.", "thai": "ฉันมีความรับผิดชอบต่อลูกค้าของฉัน"}
{"word": "responsibility", "english": "The responsibility was a learning experience.", "thai": "ความรับผิดชอบนั้นเป็นประสบการณ์การเรียนรู้"}
{"word": "responsibility", "english": "He’s handling his responsibility well.", "thai": "เขากำลังจัดการความรับผิดชอบได้ดี"}
{"word": "responsibility", "english": "It’s my responsibility to clean the office.", "thai": "เป็นความรับผิดชอบของฉันที่จะทำความสะอาดออฟฟิศ"}
{"word": "responsibility", "english": "She’s great at taking responsibility.", "thai": "เธอเก่งในการรับผิดชอบ"}
{"word": "responsibility", "english": "The responsibility was assigned to the team.", "thai": "ความรับผิดชอบถูกมอบให้ทีม"}
{"word": "responsibility", "english": "He feels a responsibility to his boss.", "thai": "เขารู้สึกถึงความรับผิดชอบต่อเจ้านาย"}
{"word": "responsibility", "english": "Her responsibility is to plan the event.", "thai": "ความรับผิดชอบของเธอคือการวางแผนงาน"}
{"word": "responsibility", "english": "I’m not sure about this responsibility.", "thai": "ฉันไม่แน่ใจเกี่ยวกับความรับผิดชอบนี้"}
{"word": "responsibility", "english": "The responsibility was a big challenge.", "thai": "ความรับผิดชอบนั้นเป็นความท้าทายใหญ่"}
{"word": "responsibility", "english": "He’s ready for a new responsibility.", "thai": "เขาพร้อมสำหรับความรับผิดชอบใหม่"}
{"word": "responsibility", "english": "It’s my responsibility to lead the project.", "thai": "เป็นความรับผิดชอบของฉันที่จะนำโปรเจกต์"}
{"word": "responsibility", "english": "She’s handling her responsibility with ease.", "thai": "เธอกำลังจัดการความรับผิดชอบได้อย่างง่ายดาย"}
{"word": "responsibility", "english": "The responsibility was shared equally.", "thai": "ความรับผิดชอบถูกแบ่งปันอย่างเท่าเทียม"}
{"word": "responsibility", "english": "He took full responsibility for the issue.", "thai": "เขารับผิดชอบอย่างเต็มที่สำหรับปัญหานี้"}
{"word": "responsibility", "english": "Her responsibility is to monitor progress.", "thai": "ความรับผิดชอบของเธอคือการติดตามความคืบหน้า"}
{"word": "network", "english": "I need to troubleshoot the network because it's running slow.", "thai": "ฉันต้องแก้ไขปัญหาเครือข่ายเพราะมันทำงานช้า"}
{"word": "network", "english": "Our company just upgraded the network to handle more traffic.", "thai": "บริษัทของเราเพิ่งอัพเกรดเครือข่ายเพื่อรองรับการใช้งานที่มากขึ้น"}
{"word": "network", "english": "She has a great network of friends who support her.", "thai": "เธอมีเครือข่ายเพื่อนที่ดีที่คอยสนับสนุนเธอ"}
{"word": "network", "english": "The TV network canceled my favorite show last week.", "thai": "เครือข่ายทีวียกเลิกรายการโปรดของฉันเมื่อสัปดาห์ที่แล้ว"}
{"word": "network", "english": "Can you connect to the Wi-Fi network?", "thai": "คุณสามารถเชื่อมต่อกับเครือข่าย Wi-Fi ได้ไหม"}
{"word": "network", "english": "Building a professional network takes time and effort.", "thai": "การสร้างเครือข่ายมืออาชีพต้องใช้เวลาและความพยายาม"}
{"word": "network", "english": "The network outage caused a lot of delays today.", "thai": "การขัดข้องของเครือข่ายทำให้เกิดความล่าช้ามากมายในวันนี้"}
{"word": "network", "english": "He's part of a network of entrepreneurs in the city.", "thai": "เขาเป็นส่วนหนึ่งของเครือข่ายผู้ประกอบการในเมือง"}
{"word": "network", "english": "The network security team found a potential breach.", "thai": "ทีมรักษาความปลอดภัยเครือข่ายพบการละเมิดที่อาจเกิดขึ้น"}
{"word": "network", "english": "I met her through my business network.", "thai": "ฉันพบเธอผ่านเครือข่ายธุรกิจของฉัน"}
{"word": "network", "english": "The network is down, so we can't access the files.", "thai": "เครือข่ายล่ม ทำให้เราไม่สามารถเข้าถึงไฟล์ได้"}
{"word": "network", "english": "She works for a major news network in New York.", "thai": "เธอทำงานให้กับเครือข่ายข่าวรายใหญ่ในนิวยอร์ก"}
{"word": "network", "english": "We need to expand our network to reach new clients.", "thai": "เราต้องขยายเครือข่ายเพื่อเข้าถึงลูกค้าใหม่"}
{"word": "network", "english": "The phone network is spotty in this area.", "thai": "เครือข่ายโทรศัพท์ในพื้นที่นี้ไม่ค่อยดี"}
{"word": "network", "english": "He used his network to find a new job quickly.", "thai": "เขาใช้เครือข่ายของเขาเพื่อหางานใหม่ได้อย่างรวดเร็ว"}
{"word": "network", "english": "The network administrator fixed the issue in an hour.", "thai": "ผู้ดูแลระบบเครือข่ายแก้ไขปัญหาได้ภายในหนึ่งชั่วโมง"}
{"word": "network", "english": "Our social network keeps us connected across states.", "thai": "เครือข่ายโซเชียลของเราทำให้เราเชื่อมต่อกันได้ทั่วทั้งรัฐ"}
{"word": "network", "english": "The cable network is airing a new series tonight.", "thai": "เครือข่ายเคเบิลจะออกอากาศซีรีส์ใหม่คืนนี้"}
{"word": "network", "english": "I joined a network of local artists to collaborate.", "thai": "ฉันเข้าร่วมเครือข่ายของศิลปินท้องถิ่นเพื่อทำงานร่วมกัน"}
{"word": "network", "english": "The network settings need to be adjusted for better speed.", "thai": "ต้องปรับการตั้งค่าเครือข่ายเพื่อให้ได้ความเร็วที่ดีขึ้น"}
{"word": "network", "english": "She built a strong network during her time at college.", "thai": "เธอสร้างเครือข่ายที่แข็งแกร่งในช่วงเวลาที่เรียนในมหาวิทยาลัย"}
{"word": "network", "english": "The network is overloaded with too many users.", "thai": "เครือข่ายทำงานหนักเกินไปเพราะมีผู้ใช้มากเกิน"}
{"word": "network", "english": "I saw the interview on a sports network last night.", "thai": "ฉันดูการสัมภาษณ์ในเครือข่ายกีฬาคืนนี้"}
{"word": "network", "english": "Our network of volunteers helped clean the park.", "thai": "เครือข่ายอาสาสมัครของเราช่วยทำความสะอาดสวนสาธารณะ"}
{"word": "network", "english": "The network connection keeps dropping every few minutes.", "thai": "การเชื่อมต่อเครือข่ายขาดหายทุกๆ สองสามนาที"}
{"word": "network", "english": "He’s trying to network with industry leaders at the conference.", "thai": "เขากำลังพยายามสร้างเครือข่ายกับผู้นำในอุตสาหกรรมที่งานประชุม"}
{"word": "network", "english": "The network broadcasted the game live across the country.", "thai": "เครือข่ายออกอากาศเกมถ่ายทอดสดทั่วประเทศ"}
{"word": "network", "english": "We rely on a secure network for our transactions.", "thai": "เราพึ่งพาเครือข่ายที่ปลอดภัยสำหรับการทำธุรกรรมของเรา"}
{"word": "network", "english": "Her network of contacts helped her start the business.", "thai": "เครือข่ายผู้ติดต่อของเธอช่วยให้เธอเริ่มต้นธุรกิจ"}
{"word": "network", "english": "The network infrastructure needs a major overhaul.", "thai": "โครงสร้างพื้นฐานของเครือข่ายต้องการการปรับปรุงครั้งใหญ่"}
{"word": "network", "english": "I’m part of a network that supports small businesses.", "thai": "ฉันเป็นส่วนหนึ่งของเครือข่ายที่สนับสนุนธุรกิจขนาดเล็ก"}
{"word": "network", "english": "The network signal is weak in the basement.", "thai": "สัญญาณเครือข่ายอ่อนในชั้นใต้ดิน"}
{"word": "network", "english": "She’s on a network show that airs every Friday.", "thai": "เธออยู่ในรายการเครือข่ายที่ออกอากาศทุกวันศุกร์"}
{"word": "network", "english": "We need to secure the network against cyber threats.", "thai": "เราต้องรักษาความปลอดภัยเครือข่ายจากภัยคุกคามทางไซเบอร์"}
{"word": "network", "english": "His network of mentors guided him through the project.", "thai": "เครือข่ายที่ปรึกษาของเขาช่วยแนะนำเขาผ่านโครงการ"}
{"word": "network", "english": "The network crashed during the online meeting.", "thai": "เครือข่ายล่มระหว่างการประชุมออนไลน์"}
{"word": "network", "english": "I’m trying to join a network of freelancers in my field.", "thai": "ฉันกำลังพยายามเข้าร่วมเครือข่ายของฟรีแลนซ์ในสาขาของฉัน"}
{"word": "network", "english": "The network provider offered a discount for new users.", "thai": "ผู้ให้บริการเครือข่ายเสนอส่วนลดสำหรับผู้ใช้ใหม่"}
{"word": "network", "english": "Our team uses a private network for communication.", "thai": "ทีมของเราใช้เครือข่ายส่วนตัวสำหรับการสื่อสาร"}
{"word": "network", "english": "The network of roads in this city is confusing.", "thai": "เครือข่ายถนนในเมืองนี้น่าสับสน"}
{"word": "network", "english": "She’s expanding her network through social media.", "thai": "เธอกำลังขยายเครือข่ายของเธอผ่านโซเชียลมีเดีย"}
{"word": "network", "english": "The network is stable now after the update.", "thai": "เครือข่ายเสถียรแล้วหลังจากการอัพเดต"}
{"word": "network", "english": "He works in network engineering for a tech company.", "thai": "เขาทำงานด้านวิศวกรรมเครือข่ายให้กับบริษัทเทคโนโลยี"}
{"word": "network", "english": "The network of suppliers ensures timely deliveries.", "thai": "เครือข่ายผู้จัดหาสินค้าช่วยให้การจัดส่งตรงเวลา"}
{"word": "network", "english": "I lost my network connection during the call.", "thai": "ฉันสูญเสียการเชื่อมต่อเครือข่ายระหว่างการโทร"}
{"word": "network", "english": "The network of volunteers is growing every month.", "thai": "เครือข่ายอาสาสมัครเติบโตขึ้นทุกเดือน"}
{"word": "network", "english": "We watched the movie on a streaming network.", "thai": "เราดูภาพยนตร์ในเครือข่ายสตรีมมิ่ง"}
{"word": "network", "english": "The network supports thousands of devices daily.", "thai": "เครือข่ายรองรับอุปกรณ์หลายพันเครื่องทุกวัน"}
{"word": "network", "english": "She’s well-known in the network of local charities.", "thai": "เธอเป็นที่รู้จักในเครือข่ายองค์กรการกุศลท้องถิ่น"}
{"word": "network", "english": "The network protocol needs to be updated.", "thai": "โปรโตคอลเครือข่ายต้องได้รับการอัพเดต"}
{"word": "network", "english": "I’m attending a network event for startups tonight.", "thai": "ฉันจะไปงานสร้างเครือข่ายสำหรับสตาร์ทอัพคืนนี้"}
{"word": "network", "english": "The network of trails in the park is amazing.", "thai": "เครือข่ายเส้นทางในสวนสาธารณะนั้นยอดเยี่ยม"}
{"word": "network", "english": "Our office network is down again.", "thai": "เครือข่ายในสำนักงานของเราล่มอีกแล้ว"}
{"word": "network", "english": "He’s part of a network that promotes eco-friendly products.", "thai": "เขาเป็นส่วนหนึ่งของเครือข่ายที่ส่งเสริมผลิตภัณฑ์ที่เป็นมิตรต่อสิ่งแวดล้อม"}
{"word": "network", "english": "The network speed is much faster now.", "thai": "ความเร็วของเครือข่ายเร็วกว่ามากแล้วตอนนี้"}
{"word": "network", "english": "She used her network to get funding for the project.", "thai": "เธอใช้เครือข่ายของเธอเพื่อหาทุนสำหรับโครงการ"}
{"word": "network", "english": "The network of stores spans across three states.", "thai": "เครือข่ายร้านค้าครอบคลุมสามรัฐ"}
{"word": "network", "english": "We need a stronger network for remote work.", "thai": "เราต้องการเครือข่ายที่แข็งแกร่งกว่าสำหรับการทำงานระยะไกล"}
{"word": "network", "english": "The network of investors is interested in our startup.", "thai": "เครือข่ายนักลงทุนสนใจในสตาร์ทอัพของเรา"}
{"word": "network", "english": "The network error caused a system crash.", "thai": "ข้อผิดพลาดของเครือข่ายทำให้ระบบล่ม"}
{"word": "network", "english": "She’s hosting a network party for young professionals.", "thai": "เธอกำลังจัดงานปาร์ตี้สร้างเครือข่ายสำหรับมืออาชีพรุ่นใหม่"}
{"word": "network", "english": "The network of libraries shares resources online.", "thai": "เครือข่ายห้องสมุดแบ่งปันทรัพยากรออนไลน์"}
{"word": "network", "english": "I can’t access the network from my laptop.", "thai": "ฉันไม่สามารถเข้าถึงเครือข่ายจากแล็ปท็อปของฉันได้"}
{"word": "network", "english": "The network of alumni helped me find a mentor.", "thai": "เครือข่ายศิษย์เก่าช่วยฉันหาที่ปรึกษา"}
{"word": "network", "english": "The network broadcasted a live concert last night.", "thai": "เครือข่ายออกอากาศคอนเสิร์ตสดเมื่อคืนนี้"}
{"word": "network", "english": "We’re upgrading the network to 5G soon.", "thai": "เรากำลังอัพเกรดเครือข่ายเป็น 5G ในไม่ช้า"}
{"word": "network", "english": "Her network of colleagues spans multiple industries.", "thai": "เครือข่ายเพื่อนร่วมงานของเธอครอบคลุมหลายอุตสาหกรรม"}
{"word": "network", "english": "The network is congested during peak hours.", "thai": "เครือข่ายหนาแน่นในช่วงชั่วโมงเร่งด่วน"}
{"word": "network", "english": "He’s building a network of tech enthusiasts.", "thai": "เขากำลังสร้างเครือข่ายของผู้ที่ชื่นชอบเทคโนโลยี"}
{"word": "network", "english": "The network of partners supports our charity event.", "thai": "เครือข่ายพันธมิตรสนับสนุนงานการกุศลของเรา"}
{"word": "network", "english": "I need help setting up a home network.", "thai": "ฉันต้องการความช่วยเหลือในการตั้งค่าเครือข่ายที่บ้าน"}
{"word": "network", "english": "The network of bloggers promoted the new product.", "thai": "เครือข่ายบล็อกเกอร์ส่งเสริมผลิตภัณฑ์ใหม่"}
{"word": "network", "english": "The network is secure, so our data is safe.", "thai": "เครือข่ายปลอดภัย ดังนั้นข้อมูลของเราจึงปลอดภัย"}
{"word": "network", "english": "She’s part of a global network of scientists.", "thai": "เธอเป็นส่วนหนึ่งของเครือข่ายนักวิทยาศาสตร์ระดับโลก"}
{"word": "network", "english": "The network went down during the storm.", "thai": "เครือข่ายล่มระหว่างพายุ"}
{"word": "network", "english": "I’m trying to network with other writers online.", "thai": "ฉันกำลังพยายามสร้างเครือข่ายกับนักเขียนคนอื่นๆ ทางออนไลน์"}
{"word": "network", "english": "The network of cameras monitors the entire building.", "thai": "เครือข่ายกล้องวงจรปิดตรวจสอบทั้งอาคาร"}
{"word": "network", "english": "We’re on the same network, so file sharing is easy.", "thai": "เราอยู่ในเครือข่ายเดียวกัน ดังนั้นการแชร์ไฟล์จึงง่าย"}
{"word": "network", "english": "The network of clinics provides free healthcare.", "thai": "เครือข่ายคลินิกให้บริการด้านสุขภาพฟรี"}
{"word": "network", "english": "The network performance has improved this month.", "thai": "ประสิทธิภาพของเครือข่ายดีขึ้นในเดือนนี้"}
{"word": "network", "english": "He’s in a network of car enthusiasts.", "thai": "เขาอยู่ในเครือข่ายของผู้ที่ชื่นชอบรถยนต์"}
{"word": "network", "english": "The network of restaurants offers a loyalty program.", "thai": "เครือข่ายร้านอาหารเสนอโปรแกรมสะสมคะแนน"}
{"word": "network", "english": "I forgot the password for the network.", "thai": "ฉันลืมรหัสผ่านสำหรับเครือข่าย"}
{"word": "network", "english": "The network of schools collaborates on projects.", "thai": "เครือข่ายโรงเรียนทำงานร่วมกันในโครงการ"}
{"word": "network", "english": "The network is slow because of too many devices.", "thai": "เครือข่ายช้าเพราะมีอุปกรณ์มากเกินไป"}
{"word": "network", "english": "She’s leveraging her network to promote her book.", "thai": "เธอกำลังใช้เครือข่ายของเธอเพื่อโปรโมตหนังสือ"}
{"word": "network", "english": "The network of buses covers the entire city.", "thai": "เครือข่ายรถบัสครอบคลุมทั้งเมือง"}
{"word": "network", "english": "We need to reboot the network router.", "thai": "เราต้องรีบูตเราเตอร์เครือข่าย"}
{"word": "network", "english": "The network of farmers shares resources locally.", "thai": "เครือข่ายเกษตรกรแบ่งปันทรัพยากรในท้องถิ่น"}
{"word": "network", "english": "The network connection is unstable today.", "thai": "การเชื่อมต่อเครือข่ายไม่เสถียรในวันนี้"}
{"word": "network", "english": "He’s part of a network of coders working remotely.", "thai": "เขาเป็นส่วนหนึ่งของเครือข่ายนักเขียนโค้ดที่ทำงานระยะไกล"}
{"word": "network", "english": "The network airs reruns of old sitcoms.", "thai": "เครือข่ายออกอากาศซิทคอมเก่าๆ ซ้ำ"}
{"word": "network", "english": "Our network of clients is expanding rapidly.", "thai": "เครือข่ายลูกค้าของเราขยายตัวอย่างรวดเร็ว"}
{"word": "network", "english": "The network firewall blocked a suspicious site.", "thai": "ไฟร์วอลล์เครือข่ายบล็อกเว็บไซต์ที่น่าสงสัย"}
{"word": "network", "english": "She’s attending a network seminar for entrepreneurs.", "thai": "เธอกำลังเข้าร่วมสัมมนาสร้างเครือข่ายสำหรับผู้ประกอบการ"}
{"word": "network", "english": "The network of nonprofits works on climate change.", "thai": "เครือข่ายองค์กรไม่แสวงผลกำไรทำงานเกี่ยวกับการเปลี่ยนแปลงสภาพภูมิอากาศ"}
{"word": "network", "english": "I can’t log into the network with my credentials.", "thai": "ฉันไม่สามารถเข้าสู่ระบบเครือข่ายด้วยข้อมูลประจำตัวของฉันได้"}
{"word": "network", "english": "The network of cafes offers free Wi-Fi.", "thai": "เครือข่ายร้านกาแฟให้บริการ Wi-Fi ฟรี"}
{"word": "network", "english": "We’re testing a new network for faster internet.", "thai": "เรากำลังทดสอบเครือข่ายใหม่เพื่ออินเทอร์เน็ตที่เร็วขึ้น"}
{"word": "network", "english": "The network of mentors helped me grow my skills.", "thai": "เครือข่ายที่ปรึกษาช่วยฉันพัฒนาทักษะ"}
{"word": "database", "english": "I need to update the database with the new client information.", "thai": "ฉันต้องอัพเดตฐานข้อมูลด้วยข้อมูลลูกค้าใหม่"}
{"word": "database", "english": "The database crashed during the system upgrade.", "thai": "ฐานข้อมูลล่มระหว่างการอัพเกรดระบบ"}
{"word": "database", "english": "She’s working on a database for tracking inventory.", "thai": "เธอกำลังทำงานกับฐานข้อมูลสำหรับติดตามสินค้าคงคลัง"}
{"word": "database", "english": "Can you query the database for last month’s sales?", "thai": "คุณสามารถค้นหาฐานข้อมูลสำหรับยอดขายของเดือนที่แล้วได้ไหม"}
{"word": "database", "english": "The database is too large to process on this server.", "thai": "ฐานข้อมูลมีขนาดใหญ่เกินไปที่จะประมวลผลบนเซิร์ฟเวอร์นี้"}
{"word": "database", "english": "We’re migrating the database to a cloud platform.", "thai": "เรากำลังย้ายฐานข้อมูลไปยังแพลตฟอร์มคลาวด์"}
{"word": "database", "english": "He’s an expert in database management and security.", "thai": "เขาเป็นผู้เชี่ยวชาญด้านการจัดการและความปลอดภัยของฐานข้อมูล"}
{"word": "database", "english": "The database contains sensitive customer information.", "thai": "ฐานข้อมูลมีข้อมูลลูกค้าที่ละเอียดอ่อน"}
{"word": "database", "english": "I forgot the password to access the database.", "thai": "ฉันลืมรหัสผ่านสำหรับเข้าถึงฐานข้อมูล"}
{"word": "database", "english": "The team built a database to store research data.", "thai": "ทีมงานสร้างฐานข้อมูลเพื่อเก็บข้อมูลการวิจัย"}
{"word": "database", "english": "We need to back up the database tonight.", "thai": "เราต้องสำรองข้อมูลฐานข้อมูลคืนนี้"}
{"word": "database", "english": "The database error caused delays in processing orders.", "thai": "ข้อผิดพลาดของฐานข้อมูลทำให้เกิดความล่าช้าในการประมวลผลคำสั่งซื้อ"}
{"word": "database", "english": "She’s designing a database for the new app.", "thai": "เธอกำลังออกแบบฐานข้อมูลสำหรับแอปใหม่"}
{"word": "database", "english": "The database is hosted on a secure server.", "thai": "ฐานข้อมูลถูกโฮสต์บนเซิร์ฟเวอร์ที่ปลอดภัย"}
{"word": "database", "english": "I’m searching the database for employee records.", "thai": "ฉันกำลังค้นหาฐานข้อมูลสำหรับบันทึกพนักงาน"}
{"word": "database", "english": "The database needs regular maintenance to run smoothly.", "thai": "ฐานข้อมูลต้องการการบำรุงรักษาเป็นประจำเพื่อให้ทำงานได้อย่างราบรื่น"}
{"word": "database", "english": "He wrote a script to automate database updates.", "thai": "เขาเขียนสคริปต์เพื่ออัพเดตฐานข้อมูลโดยอัตโนมัติ"}
{"word": "database", "english": "The database is shared across multiple departments.", "thai": "ฐานข้อมูลถูกแชร์ระหว่างหลายแผนก"}
{"word": "database", "english": "We’re integrating a new database with our CRM system.", "thai": "เรากำลังรวมฐานข้อมูลใหม่เข้ากับระบบ CRM ของเรา"}
{"word": "database", "english": "The database performance slowed down this morning.", "thai": "ประสิทธิภาพของฐานข้อมูลช้าลงในเช้าวันนี้"}
{"word": "database", "english": "I need access to the database to run a report.", "thai": "ฉันต้องการเข้าถึงฐานข้อมูลเพื่อรันรายงาน"}
{"word": "database", "english": "The database administrator fixed the issue quickly.", "thai": "ผู้ดูแลฐานข้อมูลแก้ไขปัญหาได้อย่างรวดเร็ว"}
{"word": "database", "english": "Our database stores over a million records.", "thai": "ฐานข้อมูลของเราเก็บข้อมูลมากกว่าหนึ่งล้านรายการ"}
{"word": "database", "english": "She’s analyzing the database for customer trends.", "thai": "เธอกำลังวิเคราะห์ฐานข้อมูลเพื่อหาแนวโน้มของลูกค้า"}
{"word": "database", "english": "The database backup is scheduled for midnight.", "thai": "การสำรองฐานข้อมูลถูกกำหนดไว้ตอนเที่ยงคืน"}
{"word": "database", "english": "We’re cleaning up the database to remove duplicates.", "thai": "เรากำลังทำความสะอาดฐานข้อมูลเพื่อลบข้อมูลที่ซ้ำกัน"}
{"word": "database", "english": "The database is critical for our daily operations.", "thai": "ฐานข้อมูลมีความสำคัญต่อการดำเนินงานประจำวันของเรา"}
{"word": "database", "english": "He’s training the team on database management.", "thai": "เขากำลังฝึกอบรมทีมเกี่ยวกับการจัดการฐานข้อมูล"}
{"word": "database", "english": "The database was hacked, but no data was lost.", "thai": "ฐานข้อมูลถูกแฮ็ก แต่ไม่มีข้อมูลสูญหาย"}
{"word": "database", "english": "I’m adding new fields to the database today.", "thai": "ฉันกำลังเพิ่มฟิลด์ใหม่ในฐานข้อมูลวันนี้"}
{"word": "database", "english": "The database is optimized for faster queries.", "thai": "ฐานข้อมูลได้รับการปรับแต่งให้ค้นหาได้เร็วขึ้น"}
{"word": "database", "english": "We store all our client data in a secure database.", "thai": "เราเก็บข้อมูลลูกค้าทั้งหมดในฐานข้อมูลที่ปลอดภัย"}
{"word": "database", "english": "The database connection failed during the test.", "thai": "การเชื่อมต่อฐานข้อมูลล้มเหลวระหว่างการทดสอบ"}
{"word": "database", "english": "She’s querying the database for marketing insights.", "thai": "เธอกำลังค้นหาฐานข้อมูลเพื่อหาข้อมูลเชิงลึกด้านการตลาด"}
{"word": "database", "english": "The database is too old and needs an upgrade.", "thai": "ฐานข้อมูลเก่าเกินไปและต้องการการอัพเกรด"}
{"word": "database", "english": "I’m importing data into the database right now.", "thai": "ฉันกำลังนำเข้าข้อมูลลงในฐานข้อมูลตอนนี้"}
{"word": "database", "english": "The database schema was redesigned last week.", "thai": "โครงสร้างฐานข้อมูลถูกออกแบบใหม่เมื่อสัปดาห์ที่แล้ว"}
{"word": "database", "english": "We’re using a cloud database for better scalability.", "thai": "เราใช้ฐานข้อมูลคลาวด์เพื่อความสามารถในการขยายขนาดที่ดีขึ้น"}
{"word": "database", "english": "The database is locked until the audit is complete.", "thai": "ฐานข้อมูลถูกล็อกจนกว่าการตรวจสอบจะเสร็จสิ้น"}
{"word": "database", "english": "He’s troubleshooting a database performance issue.", "thai": "เขากำลังแก้ไขปัญหาด้านประสิทธิภาพของฐานข้อมูล"}
{"word": "database", "english": "The database is accessible only to authorized users.", "thai": "ฐานข้อมูลสามารถเข้าถึงได้เฉพาะผู้ใช้ที่ได้รับอนุญาต"}
{"word": "database", "english": "We’re building a database for tracking donations.", "thai": "เรากำลังสร้างฐานข้อมูลสำหรับติดตามการบริจาค"}
{"word": "database", "english": "The database server is down for maintenance.", "thai": "เซิร์ฟเวอร์ฐานข้อมูลหยุดทำงานเพื่อบำรุงรักษา"}
{"word": "database", "english": "I need to export data from the database for analysis.", "thai": "ฉันต้องส่งออกข้อมูลจากฐานข้อมูลเพื่อวิเคราะห์"}
{"word": "database", "english": "The database is synced with our mobile app.", "thai": "ฐานข้อมูลถูกซิงค์กับแอปมือถือของเรา"}
{"word": "database", "english": "She’s organizing the database for easier access.", "thai": "เธอกำลังจัดระเบียบฐานข้อมูลเพื่อให้เข้าถึงได้ง่ายขึ้น"}
{"word": "database", "english": "The database contains historical sales data.", "thai": "ฐานข้อมูลมีข้อมูลยอดขายในอดีต"}
{"word": "database", "english": "We’re testing the database for compatibility issues.", "thai": "เรากำลังทดสอบฐานข้อมูลเพื่อหาปัญหาความเข้ากันได้"}
{"word": "database", "english": "The database is encrypted to protect sensitive data.", "thai": "ฐานข้อมูลถูกเข้ารหัสเพื่อปกป้องข้อมูลที่ละเอียดอ่อน"}
{"word": "database", "english": "I’m learning how to manage a database this semester.", "thai": "ฉันกำลังเรียนรู้วิธีจัดการฐานข้อมูลในภาคเรียนนี้"}
{"word": "database", "english": "The database update caused some unexpected errors.", "thai": "การอัพเดตฐานข้อมูลทำให้เกิดข้อผิดพลาดที่ไม่คาดคิด"}
{"word": "database", "english": "We need a larger database to handle the growth.", "thai": "เราต้องการฐานข้อมูลที่ใหญ่ขึ้นเพื่อรองรับการเติบโต"}
{"word": "database", "english": "The database is linked to our analytics platform.", "thai": "ฐานข้อมูลเชื่อมโยงกับแพลตฟอร์มวิเคราะห์ของเรา"}
{"word": "database", "english": "He’s restoring the database from a backup.", "thai": "เขากำลังกู้คืนฐานข้อมูลจากข้อมูลสำรอง"}
{"word": "database", "english": "The database is used for customer relationship management.", "thai": "ฐานข้อมูลถูกใช้สำหรับการจัดการความสัมพันธ์กับลูกค้า"}
{"word": "database", "english": "I’m running a script to clean the database.", "thai": "ฉันกำลังรันสคริปต์เพื่อทำความสะอาดฐานข้อมูล"}
{"word": "database", "english": "The database is slow because of heavy traffic.", "thai": "ฐานข้อมูลช้าเพราะมีการใช้งานหนัก"}
{"word": "database", "english": "She’s developing a database for medical records.", "thai": "เธอกำลังพัฒนาฐานข้อมูลสำหรับบันทึกทางการแพทย์"}
{"word": "database", "english": "The database is backed up on an external drive.", "thai": "ฐานข้อมูลถูกสำรองไว้ในไดรฟ์ภายนอก"}
{"word": "database", "english": "We’re auditing the database for compliance issues.", "thai": "เรากำลังตรวจสอบฐานข้อมูลเพื่อหาปัญหาด้านการปฏิบัติตามกฎระเบียบ"}
{"word": "database", "english": "The database supports multiple users at once.", "thai": "ฐานข้อมูลรองรับผู้ใช้หลายคนพร้อมกัน"}
{"word": "database", "english": "I’m checking the database for missing entries.", "thai": "ฉันกำลังตรวจสอบฐานข้อมูลเพื่อหาข้อมูลที่หายไป"}
{"word": "database", "english": "The database is part of our new software system.", "thai": "ฐานข้อมูลเป็นส่วนหนึ่งของระบบซอฟต์แวร์ใหม่ของเรา"}
{"word": "database", "english": "He’s writing code to interact with the database.", "thai": "เขากำลังเขียนโค้ดเพื่อโต้ตอบกับฐานข้อมูล"}
{"word": "database", "english": "The database is stored on a remote server.", "thai": "ฐานข้อมูลถูกเก็บไว้ในเซิร์ฟเวอร์ระยะไกล"}
{"word": "database", "english": "We’re upgrading the database to handle more data.", "thai": "เรากำลังอัพเกรดฐานข้อมูลเพื่อจัดการข้อมูลที่มากขึ้น"}
{"word": "database", "english": "The database is critical for our reporting tools.", "thai": "ฐานข้อมูลมีความสำคัญต่อเครื่องมือรายงานของเรา"}
{"word": "database", "english": "She’s troubleshooting a database connection issue.", "thai": "เธอกำลังแก้ไขปัญหาการเชื่อมต่อฐานข้อมูล"}
{"word": "database", "english": "The database was corrupted during the power outage.", "thai": "ฐานข้อมูลเสียหายระหว่างไฟดับ"}
{"word": "database", "english": "I’m creating a database for tracking projects.", "thai": "ฉันกำลังสร้างฐานข้อมูลสำหรับติดตามโครงการ"}
{"word": "database", "english": "The database is designed for real-time updates.", "thai": "ฐานข้อมูลถูกออกแบบสำหรับการอัพเดตแบบเรียลไทม์"}
{"word": "database", "english": "We need to secure the database against attacks.", "thai": "เราต้องรักษาความปลอดภัยฐานข้อมูลจาก การโจมตี"}
{"word": "database", "english": "The database is shared with our partner companies.", "thai": "ฐานข้อมูลถูกแชร์กับบริษัทพันธมิตรของเรา"}
{"word": "database", "english": "He’s optimizing the database for faster performance.", "thai": "เขากำลังปรับแต่งฐานข้อมูลเพื่อประสิทธิภาพที่เร็วขึ้น"}
{"word": "database", "english": "The database contains all our transaction history.", "thai": "ฐานข้อมูลมีประวัติการทำธุรกรรมทั้งหมดของเรา"}
{"word": "database", "english": "I’m setting up a database for the new website.", "thai": "ฉันกำลังตั้งค่าฐานข้อมูลสำหรับเว็บไซต์ใหม่"}
{"word": "database", "english": "The database is down, so we can’t process orders.", "thai": "ฐานข้อมูลล่ม ทำให้เราไม่สามารถประมวลผลคำสั่งซื้อได้"}
{"word": "database", "english": "She’s exporting data from the database for a report.", "thai": "เธอกำลังส่งออกข้อมูลจากฐานข้อมูลสำหรับรายงาน"}
{"word": "database", "english": "The database is compatible with our old software.", "thai": "ฐานข้อมูลเข้ากันได้กับซอฟต์แวร์เก่าของเรา"}
{"word": "database", "english": "We’re analyzing the database for sales patterns.", "thai": "เรากำลังวิเคราะห์ฐานข้อมูลเพื่อหาแนวโน้มการขาย"}
{"word": "database", "english": "The database is updated every hour automatically.", "thai": "ฐานข้อมูลถูกอัพเดตทุกชั่วโมงโดยอัตโนมัติ"}
{"word": "database", "english": "He’s fixing a bug in the database system.", "thai": "เขากำลังแก้ไขข้อบกพร่องในระบบฐานข้อมูล"}
{"word": "database", "english": "The database is too slow for our needs.", "thai": "ฐานข้อมูลช้าเกินไปสำหรับความต้องการของเรา"}
{"word": "database", "english": "I’m backing up the database to a secure location.", "thai": "ฉันกำลังสำรองฐานข้อมูลไปยังสถานที่ที่ปลอดภัย"}
{"word": "database", "english": "The database is used for tracking customer feedback.", "thai": "ฐานข้อมูลถูกใช้สำหรับติดตามความคิดเห็นของลูกค้า"}
{"word": "database", "english": "We’re merging two databases into one system.", "thai": "เรากำลังรวมฐานข้อมูลสองฐานเข้าด้วยกันเป็นระบบเดียว"}
{"word": "database", "english": "The database is accessible through a web interface.", "thai": "ฐานข้อมูลสามารถเข้าถึงได้ผ่านอินเทอร์เฟซเว็บ"}
{"word": "database", "english": "She’s creating a database for employee schedules.", "thai": "เธอกำลังสร้างฐานข้อมูลสำหรับตารางงานของพนักงาน"}
{"word": "database", "english": "The database crashed because of a software glitch.", "thai": "ฐานข้อมูลล่มเพราะปัญหาซอฟต์แวร์"}
{"word": "database", "english": "I’m learning to query the database with SQL.", "thai": "ฉันกำลังเรียนรู้การค้นหาฐานข้อมูลด้วย SQL"}
{"word": "database", "english": "The database is stored in a cloud environment.", "thai": "ฐานข้อมูลถูกเก็บไว้ในสภาพแวดล้อมคลาวด์"}
{"word": "database", "english": "We’re using a database to track user activity.", "thai": "เราใช้ฐานข้อมูลเพื่อติดตามกิจกรรมของผู้ใช้"}
{"word": "database", "english": "The database needs a full rebuild next month.", "thai": "ฐานข้อมูลต้องการการสร้างใหม่ทั้งหมดในเดือนหน้า"}
{"word": "database", "english": "He’s managing a database for scientific research.", "thai": "เขากำลังจัดการฐานข้อมูลสำหรับการวิจัยทางวิทยาศาสตร์"}
{"word": "database", "english": "The database is linked to our payment system.", "thai": "ฐานข้อมูลเชื่อมโยงกับระบบการชำระเงินของเรา"}
{"word": "database", "english": "I’m checking the database for outdated records.", "thai": "ฉันกำลังตรวจสอบฐานข้อมูลเพื่อหาบันทึกที่ล้าสมัย"}
{"word": "database", "english": "The database supports our e-commerce platform.", "thai": "ฐานข้อมูลสนับสนุนแพลตฟอร์มอีคอมเมิร์ซของเรา"}
{"word": "database", "english": "She’s rebuilding the database after the crash.", "thai": "เธอกำลังสร้างฐานข้อมูลใหม่หลังจากที่ล่ม"}
{"word": "database", "english": "The database is critical for our analytics team.", "thai": "ฐานข้อมูลมีความสำคัญต่อทีมวิเคราะห์ของเรา"}
