{"word": "change", "english": "I need to change my clothes before we go out.", "thai": "ฉันต้องเปลี่ยนเสื้อผ้าก่อนที่เราจะออกไป"}
{"word": "change", "english": "Can you change the channel on the TV?", "thai": "คุณเปลี่ยนช่องทีวีได้ไหม?"}
{"word": "change", "english": "The weather is starting to change rapidly.", "thai": "สภาพอากาศเริ่มเปลี่ยนแปลงอย่างรวดเร็ว"}
{"word": "change", "english": "I want to change my hairstyle this weekend.", "thai": "ฉันอยากเปลี่ยนทรงผมสุดสัปดาห์นี้"}
{"word": "change", "english": "Do you have any spare change for the bus?", "thai": "คุณมีเงินทอนสำหรับรถบัสไหม?"}
{"word": "change", "english": "We need to change our plans for the trip.", "thai": "เราต้องเปลี่ยนแผนสำหรับการเดินทาง"}
{"word": "change", "english": "She decided to change her name after marriage.", "thai": "เธอตัดสินใจเปลี่ยนชื่อหลังแต่งงาน"}
{"word": "change", "english": "The store doesn't give change for large bills.", "thai": "ร้านนี้ไม่ให้เงินทอนสำหรับธนบัตรใบใหญ่"}
{"word": "change", "english": "Let's change the topic of this conversation.", "thai": "มาเปลี่ยนหัวข้อการสนทนานี้กันเถอะ"}
{"word": "change", "english": "He needs to change his attitude to succeed.", "thai": "เขาต้องเปลี่ยนทัศนคติเพื่อประสบความสำเร็จ"}
{"word": "change", "english": "Can you change this dollar into quarters?", "thai": "คุณเปลี่ยนเงินหนึ่งดอลลาร์เป็นเหรียญควอเตอร์ได้ไหม?"}
{"word": "change", "english": "The company plans to change its logo soon.", "thai": "บริษัทวางแผนจะเปลี่ยนโลโก้เร็วๆ นี้"}
{"word": "change", "english": "I forgot to change the batteries in the remote.", "thai": "ฉันลืมเปลี่ยนถ่านในรีโมท"}
{"word": "change", "english": "We should change the light bulbs in the kitchen.", "thai": "เราควรเปลี่ยนหลอดไฟในครัว"}
{"word": "change", "english": "Her decision could change everything for us.", "thai": "การตัดสินใจของเธออาจเปลี่ยนทุกอย่างสำหรับเรา"}
{"word": "change", "english": "I’m trying to change my bad habits.", "thai": "ฉันพยายามเปลี่ยนนิสัยไม่ดีของตัวเอง"}
{"word": "change", "english": "Can you change the time of our meeting?", "thai": "คุณเปลี่ยนเวลาการประชุมของเราได้ไหม?"}
{"word": "change", "english": "The rules might change next month.", "thai": "กฎอาจเปลี่ยนในเดือนหน้า"}
{"word": "change", "english": "He didn’t even notice the change in her mood.", "thai": "เขาไม่สังเกตเห็นการเปลี่ยนแปลงในอารมณ์ของเธอ"}
{"word": "change", "english": "We need to change the tires on the car.", "thai": "เราต้องเปลี่ยนยางรถยนต์"}
{"word": "change", "english": "I’ll change the sheets on the bed later.", "thai": "ฉันจะเปลี่ยนผ้าปูที่นอนในภายหลัง"}
{"word": "change", "english": "The teacher asked us to change partners.", "thai": "ครูขอให้เราเปลี่ยนคู่"}
{"word": "change", "english": "This policy could change the way we work.", "thai": "นโยบายนี้สามารถเปลี่ยนวิธีการทำงานของเรา"}
{"word": "change", "english": "I need to change my password again.", "thai": "ฉันต้องเปลี่ยนรหัสผ่านอีกครั้ง"}
{"word": "change", "english": "The city plans to change the bus routes.", "thai": "เมืองวางแผนจะเปลี่ยนเส้นทางรถบัส"}
{"word": "change", "english": "Can you change the baby’s diaper, please?", "thai": "คุณเปลี่ยนผ้าอ้อมเด็กได้ไหม?"}
{"word": "change", "english": "The seasons change so beautifully here.", "thai": "ฤดูกาลเปลี่ยนแปลงอย่างสวยงามที่นี่"}
{"word": "change", "english": "I want to change my order to a salad.", "thai": "ฉันอยากเปลี่ยนคำสั่งซื้อเป็นสลัด"}
{"word": "change", "english": "We need to change the way we communicate.", "thai": "เราต้องเปลี่ยนวิธีการสื่อสาร"}
{"word": "change", "english": "She’s hoping to change her career path.", "thai": "เธอหวังจะเปลี่ยนเส้นทางอาชีพ"}
{"word": "change", "english": "Can you change this document to PDF?", "thai": "คุณเปลี่ยนเอกสารนี้เป็น PDF ได้ไหม?"}
{"word": "change", "english": "The schedule might change due to weather.", "thai": "ตารางอาจเปลี่ยนแปลงเนื่องจากสภาพอากาศ"}
{"word": "change", "english": "I need to change my flight to tomorrow.", "thai": "ฉันต้องเปลี่ยนเที่ยวบินเป็นวันพรุ่งนี้"}
{"word": "change", "english": "He’s trying to change the world with his ideas.", "thai": "เขาพยายามเปลี่ยนโลกด้วยแนวคิดของเขา"}
{"word": "change", "english": "Let’s change the music to something upbeat.", "thai": "มาเปลี่ยนเพลงเป็นอะไรที่สนุกๆ กันเถอะ"}
{"word": "change", "english": "The price of gas continues to change daily.", "thai": "ราคาน้ำมันเปลี่ยนแปลงทุกวัน"}
{"word": "change", "english": "I can’t change the past, but I can move forward.", "thai": "ฉันเปลี่ยนอดีตไม่ได้ แต่ฉันก้าวต่อไปได้"}
{"word": "change", "english": "We should change the locks on the house.", "thai": "เราควรเปลี่ยนกุญแจบ้าน"}
{"word": "change", "english": "Her smile can change anyone’s mood.", "thai": "รอยยิ้มของเธอสามารถเปลี่ยนอารมณ์ของใครก็ได้"}
{"word": "change", "english": "Can you change the font on this poster?", "thai": "คุณเปลี่ยนฟอนต์บนโปสเตอร์นี้ได้ไหม?"}
{"word": "change", "english": "The team needs to change their strategy.", "thai": "ทีมต้องเปลี่ยนกลยุทธ์"}
{"word": "change", "english": "I’ll change the filter in the air conditioner.", "thai": "ฉันจะเปลี่ยนไส้กรองในเครื่องปรับอากาศ"}
{"word": "change", "english": "The laws need to change to protect everyone.", "thai": "กฎหมายต้องเปลี่ยนเพื่อปกป้องทุกคน"}
{"word": "change", "english": "Can you change this appointment to next week?", "thai": "คุณเปลี่ยนนัดนี้เป็นสัปดาห์หน้าได้ไหม?"}
{"word": "change", "english": "The colors of the leaves change in autumn.", "thai": "สีของใบไม้เปลี่ยนในฤดูใบไม้ร่วง"}
{"word": "change", "english": "I need to change the oil in my car.", "thai": "ฉันต้องเปลี่ยนน้ำมันในรถของฉัน"}
{"word": "change", "english": "We can’t change the facts, only our perspective.", "thai": "เราเปลี่ยนข้อเท็จจริงไม่ได้ แค่มุมมองของเรา"}
{"word": "change", "english": "Let’s change the layout of the room.", "thai": "มาเปลี่ยนการจัดวางของห้องกันเถอะ"}
{"word": "change", "english": "She wants to change her diet to be healthier.", "thai": "เธออยากเปลี่ยนอาหารเพื่อสุขภาพที่ดีขึ้น"}
{"word": "change", "english": "Can you change the settings on my phone?", "thai": "คุณเปลี่ยนการตั้งค่าในโทรศัพท์ของฉันได้ไหม?"}
{"word": "change", "english": "The government plans to change the tax system.", "thai": "รัฐบาลวางแผนจะเปลี่ยนระบบภาษี"}
{"word": "change", "english": "I need to change my shoes; these are wet.", "thai": "ฉันต้องเปลี่ยนรองเท้า คู่นี้เปียก"}
{"word": "change", "english": "The movie’s ending might change your opinion.", "thai": "ตอนจบของหนังอาจเปลี่ยนความคิดเห็นของคุณ"}
{"word": "change", "english": "We need to change the way we recycle.", "thai": "เราต้องเปลี่ยนวิธีการรีไซเคิล"}
{"word": "change", "english": "Can you change the date of the event?", "thai": "คุณเปลี่ยนวันที่ของงานได้ไหม?"}
{"word": "change", "english": "The coach decided to change the lineup.", "thai": "โค้ชตัดสินใจเปลี่ยนรายชื่อผู้เล่น"}
{"word": "change", "english": "I want to change my major in college.", "thai": "ฉันอยากเปลี่ยนสาขาวิชาในมหาวิทยาลัย"}
{"word": "change", "english": "The world is ready for positive change.", "thai": "โลกพร้อมสำหรับการเปลี่ยนแปลงในทางบวก"}
{"word": "change", "english": "Can you change this shirt for a larger size?", "thai": "คุณเปลี่ยนเสื้อตัวนี้เป็นไซซ์ใหญ่กว่าได้ไหม?"}
{"word": "change", "english": "The teacher wants us to change our answers.", "thai": "ครูอยากให้เราเปลี่ยนคำตอบ"}
{"word": "change", "english": "I’ll change the water in the fish tank.", "thai": "ฉันจะเปลี่ยนน้ำในตู้ปลา"}
{"word": "change", "english": "The market trends change every year.", "thai": "แนวโน้มของตลาดเปลี่ยนทุกปี"}
{"word": "change", "english": "We need to change the bandages daily.", "thai": "เราต้องเปลี่ยนผ้าพันแผลทุกวัน"}
{"word": "change", "english": "Can you change the background of this photo?", "thai": "คุณเปลี่ยนพื้นหลังของรูปนี้ได้ไหม?"}
{"word": "change", "english": "The company wants to change its policies.", "thai": "บริษัทอยากเปลี่ยนนโยบาย"}
{"word": "change", "english": "I need to change my email address.", "thai": "ฉันต้องเปลี่ยนที่อยู่อีเมล"}
{"word": "change", "english": "The mood in the room started to change.", "thai": "บรรยากาศในห้องเริ่มเปลี่ยน"}
{"word": "change", "english": "Let’s change the menu for the party.", "thai": "มาเปลี่ยนเมนูสำหรับงานปาร์ตี้กันเถอะ"}
{"word": "change", "english": "I want to change the color of my walls.", "thai": "ฉันอยากเปลี่ยนสีผนัง"}
{"word": "change", "english": "The app needs an update to change features.", "thai": "แอปนี้ต้องอัปเดตเพื่อเปลี่ยนฟีเจอร์"}
{"word": "change", "english": "Can you change the speed of the video?", "thai": "คุณเปลี่ยนความเร็วของวิดีโอได้ไหม?"}
{"word": "change", "english": "The culture here is starting to change.", "thai": "วัฒนธรรมที่นี่เริ่มเปลี่ยน"}
{"word": "change", "english": "I need to change the ink in the printer.", "thai": "ฉันต้องเปลี่ยนหมึกในเครื่องพิมพ์"}
{"word": "change", "english": "We should change our approach to this problem.", "thai": "เราควรเปลี่ยนวิธีการแก้ปัญหานี้"}
{"word": "change", "english": "Can you change the language to English?", "thai": "คุณเปลี่ยนภาษาเป็นอังกฤษได้ไหม?"}
{"word": "change", "english": "The kids want to change their school.", "thai": "เด็กๆ อยากเปลี่ยนโรงเรียน"}
{"word": "change", "english": "I’ll change the tablecloth for dinner.", "thai": "ฉันจะเปลี่ยนผ้าปูโต๊ะสำหรับมื้อเย็น"}
{"word": "change", "english": "The rules of the game might change.", "thai": "กฎของเกมอาจเปลี่ยน"}
{"word": "change", "english": "She’s working to change the community.", "thai": "เธอกำลังทำงานเพื่อเปลี่ยนชุมชน"}
{"word": "change", "english": "Can you change the order of these slides?", "thai": "คุณเปลี่ยนลำดับของสไลด์เหล่านี้ได้ไหม?"}
{"word": "change", "english": "The climate is causing crops to change.", "thai": "สภาพภูมิอากาศทำให้พืชผลเปลี่ยนแปลง"}
{"word": "change", "english": "I need to change my phone plan.", "thai": "ฉันต้องเปลี่ยนแผนโทรศัพท์"}
{"word": "change", "english": "Let’s change the location of the picnic.", "thai": "มาเปลี่ยนสถานที่ปิกนิกกันเถอะ"}
{"word": "change", "english": "The doctor advised her to change her habits.", "thai": "หมอแนะนำให้เธอเปลี่ยนนิสัย"}
{"word": "change", "english": "Can you change the volume on the speaker?", "thai": "คุณเปลี่ยนระดับเสียงของลำโพงได้ไหม?"}
{"word": "change", "english": "The design needs a change to look modern.", "thai": "การออกแบบต้องเปลี่ยนเพื่อให้ดูทันสมัย"}
{"word": "change", "english": "I want to change my seat on the plane.", "thai": "ฉันอยากเปลี่ยนที่นั่งบนเครื่องบิน"}
{"word": "change", "english": "The economy is starting to change slowly.", "thai": "เศรษฐกิจเริ่มเปลี่ยนแปลงอย่างช้าๆ"}
{"word": "change", "english": "Can you change the filter in the coffee maker?", "thai": "คุณเปลี่ยนตัวกรองในเครื่องชงกาแฟได้ไหม?"}
{"word": "change", "english": "We need to change our marketing approach.", "thai": "เราต้องเปลี่ยนวิธีการตลาด"}
{"word": "change", "english": "I’ll change the curtains in the living room.", "thai": "ฉันจะเปลี่ยนผ้าม่านในห้องนั่งเล่น"}
{"word": "change", "english": "The new law will change how we operate.", "thai": "กฎหมายใหม่จะเปลี่ยนวิธีการดำเนินงานของเรา"}
{"word": "change", "english": "Can you change this recipe to be vegan?", "thai": "คุณเปลี่ยนสูตรนี้ให้เป็นมังสวิรัติได้ไหม?"}
{"word": "change", "english": "The kids need to change for gym class.", "thai": "เด็กๆ ต้องเปลี่ยนเสื้อผ้าสำหรับชั้นเรียนพละ"}
{"word": "change", "english": "I want to change the tone of this email.", "thai": "ฉันอยากเปลี่ยนโทนของอีเมลนี้"}
{"word": "change", "english": "The market is forcing us to change prices.", "thai": "ตลาดกำลังบังคับให้เราเปลี่ยนราคา"}
{"word": "change", "english": "Can you change the layout of this website?", "thai": "คุณเปลี่ยนเลย์เอาต์ของเว็บไซต์นี้ได้ไหม?"}
{"word": "change", "english": "The project needs a change in leadership.", "thai": "โครงการนี้ต้องเปลี่ยนผู้นำ"}
{"word": "change", "english": "I need to change my address with the bank.", "thai": "ฉันต้องเปลี่ยนที่อยู่กับธนาคาร"}
