{"word":"manage","english":"I try to manage my time better by setting daily goals.","thai":"ฉันพยายามจัดการเวลาให้ดีขึ้นโดยตั้งเป้าหมายรายวัน"}
{"word":"time","english":"Spending time with friends at the coffee shop is always a blast.","thai":"การใช้เวลากับเพื่อนที่ร้านกาแฟสนุกมากเสมอ"}
{"word":"friends","english":"My friends and I love to check out new hiking trails on weekends.","thai":"ฉันและเพื่อนๆ ชอบไปสำรวจเส้นทางเดินป่าใหม่ๆ ในวันหยุดสุดสัปดาห์"}
{"word":"check","english":"I need to check out that new burger joint everyone’s talking about.","thai":"ฉันต้องไปลองร้านเบอร์เกอร์ใหม่ที่ทุกคนพูดถึง"}
{"word":"new","english":"Trying new recipes in the kitchen is my favorite way to unwind.","thai":"การลองสูตรอาหารใหม่ในครัวเป็นวิธีผ่อนคลายที่ฉันชอบ"}
{"word":"favorite","english":"Listening to my favorite podcast helps me stay motivated during workouts.","thai":"การฟังพอดแคสต์ที่ชอบช่วยให้ฉันมีแรงจูงใจระหว่างออกกำลังกาย"}
{"word":"stay","english":"I stay up late gaming with my online crew most nights.","thai":"ฉันนอนดึกเพื่อเล่นเกมกับกลุ่มเพื่อนออนไลน์เกือบทุกคืน"}
{"word":"late","english":"Running late for class always throws off my whole day.","thai":"การไปเรียนสายทำให้วันทั้งวันของฉันวุ่นวาย"}
{"word":"day","english":"A sunny day like this calls for a picnic in the park.","thai":"วันที่แดดออกแบบนี้เหมาะกับการไปปิกนิกที่สวนสาธารณะ"}
{"word":"park","english":"I ran into an old friend while jogging in the park yesterday.","thai":"ฉันบังเอิญเจอเพื่อนเก่าขณะวิ่งจ็อกกิ้งในสวนเมื่อวาน"}
{"word":"friend","english":"Helping a friend move into their new apartment is exhausting but fun.","thai":"การช่วยเพื่อนย้ายเข้าอพาร์ตเมนต์ใหม่เหนื่อยแต่สนุก"}
{"word":"fun","english":"Board games are so much fun at family gatherings.","thai":"เกมกระดานสนุกมากในงานรวมญาติ"}
{"word":"family","english":"My family always gets together to cook a big holiday meal.","thai":"ครอบครัวของฉันมักรวมตัวกันเพื่อทำอาหารมื้อใหญ่ในวันหยุด"}
{"word":"cook","english":"I love to cook spicy Thai dishes for my roommates.","thai":"ฉันชอบทำอาหารไทยรสเผ็ดให้เพื่อนร่วมห้อง"}
{"word":"love","english":"I love how music can lift your mood instantly.","thai":"ฉันชอบที่ดนตรีสามารถทำให้อารมณ์ดีขึ้นได้ทันที"}
{"word":"mood","english":"A bad mood can mess up your whole vibe at work.","thai":"อารมณ์ไม่ดีอาจทำให้บรรยากาศการทำงานเสียได้"}
{"word":"work","english":"Teamwork makes the dream work in our startup meetings.","thai":"การทำงานเป็นทีมทำให้ความฝันเป็นจริงในการประชุมสตาร์ทอัพของเรา"}
{"word":"team","english":"Our soccer team needs to step up for the championship.","thai":"ทีมฟุตบอลของเราต้องพยายามมากขึ้นเพื่อชิงแชมป์"}
{"word":"step","english":"I decided to step away from social media for a bit.","thai":"ฉันตัดสินใจพักจากการใช้โซเชียลมีเดียสักพัก"}
{"word":"social","english":"Social events like festivals bring the community together.","thai":"งานสังคมอย่างเทศกาลทำให้ชุมชนใกล้ชิดกัน"}
{"word":"community","english":"Volunteering in the community garden is so rewarding.","thai":"การเป็นอาสาสมัครในสวนชุมชนให้รางวัลมาก"}
{"word":"garden","english":"I picked up some fresh herbs from the garden for dinner.","thai":"ฉันเก็บสมุนไพรสดจากสวนมาทำอาหารเย็น"}
{"word":"fresh","english":"Fresh ideas in our brainstorming session really sparked creativity.","thai":"ไอเดียใหม่ในเซสชันระดมความคิดจุดประกายความสร้างสรรค์จริงๆ"}
{"word":"ideas","english":"Sharing ideas during a PhD seminar can be nerve-wracking.","thai":"การแบ่งปันไอเดียในสัมมนาปริญญาเอกอาจทำให้ตื่นเต้น"}
{"word":"share","english":"I love to share my photography on Instagram for feedback.","thai":"ฉันชอบแชร์ภาพถ่ายของฉันบนอินสตาแกรมเพื่อรับคำติชม"}
{"word":"feedback","english":"Getting constructive feedback helps me improve my writing.","thai":"การได้รับคำติชมที่เป็นประโยชน์ช่วยให้ฉันพัฒนาการเขียน"}
{"word":"improve","english":"I’m trying to improve my yoga skills with daily practice.","thai":"ฉันพยายามพัฒนาทักษะโยคะด้วยการฝึกทุกวัน"}
{"word":"practice","english":"Practice makes perfect when learning a new instrument.","thai":"การฝึกฝนทำให้สมบูรณ์แบบเมื่อเรียนเครื่องดนตรีใหม่"}
{"word":"learn","english":"I love to learn new slang from my younger cousins.","thai":"ฉันชอบเรียนรู้คำสแลงใหม่ๆ จากลูกพี่ลูกน้องที่อายุน้อยกว่า"}
{"word":"slang","english":"Using slang like ‘dope’ makes conversations more lively.","thai":"การใช้สแลงอย่าง ‘เจ๋ง’ ทำให้การสนทนาคึกคักขึ้น"}
{"word":"conversation","english":"A good conversation over coffee can brighten your day.","thai":"การสนทนาดีๆ พร้อมกาแฟสามารถทำให้วันของคุณสดใส"}
{"word":"coffee","english":"Spilling coffee on my laptop was a total disaster.","thai":"การทำกาแฟหกใส่แล็ปท็อปเป็นหายนะครั้งใหญ่"}
{"word":"disaster","english":"Forgetting lines in a play can feel like a disaster.","thai":"การลืมบทในละครรู้สึกเหมือนหายนะ"}
{"word":"feel","english":"I feel so relaxed stargazing on clear nights.","thai":"ฉันรู้สึกผ่อนคลายมากเมื่อดูดาวในคืนที่ฟ้าใส"}
{"word":"relax","english":"A hot bath helps me relax after a long shift.","thai":"การอาบน้ำร้อนช่วยให้ฉันผ่อนคลายหลังจากการทำงานกะยาว"}
{"word":"long","english":"Long road trips with good music are the best.","thai":"การเดินทางไกลพร้อมดนตรีดีๆ เป็นสิ่งที่ดีที่สุด"}
{"word":"music","english":"Live music at local bars always draws a crowd.","thai":"ดนตรีสดที่บาร์ท้องถิ่นมักดึงดูดฝูงชน"}
{"word":"crowd","english":"Pushing through a crowd at a concert can be intense.","thai":"การฝ่าฝูงชนในคอนเสิร์ตอาจตื่นเต้นมาก"}
{"word":"intense","english":"Intense workouts leave me feeling stronger every week.","thai":"การออกกำลังกายหนักทำให้ฉันรู้สึกแข็งแกร่งขึ้นทุกสัปดาห์"}
{"word":"feel","english":"I feel like cooking something special for date night.","thai":"ฉันอยากทำอาหารพิเศษสำหรับคืนเดท"}
{"word":"special","english":"Finding a special gift for my mom’s birthday is tough.","thai":"การหาของขวัญพิเศษสำหรับวันเกิดแม่ยากมาก"}
{"word":"gift","english":"I picked up a cool gift at the local craft fair.","thai":"ฉันซื้อของขวัญเจ๋งๆ จากงานคราฟต์ท้องถิ่น"}
{"word":"cool","english":"That new sci-fi movie was so cool, I watched it twice.","thai":"หนังไซไฟเรื่องใหม่นั้นเจ๋งมาก ฉันดูถึงสองรอบ"}
{"word":"movie","english":"Discussing a movie’s plot holes with friends is always fun.","thai":"การพูดคุยเกี่ยวกับจุดบกพร่องของพล็อตหนังกับเพื่อนสนุกเสมอ"}
{"word":"discuss","english":"We discuss new research methods in our weekly lab meetings.","thai":"เราคุยเกี่ยวกับวิธีวิจัยใหม่ๆ ในที่ประชุมแล็บประจำสัปดาห์"}
{"word":"research","english":"My research on sustainability is finally coming together.","thai":"งานวิจัยของฉันเกี่ยวกับความยั่งยืนกำลังลงตัว"}
{"word":"together","english":"Working together on a group project can be challenging.","thai":"การทำงานร่วมกันในโปรเจกต์กลุ่มอาจท้าทาย"}
{"word":"challenge","english":"Taking on a new challenge like marathon running is thrilling.","thai":"การรับมือกับความท้าทายใหม่เช่นการวิ่งมาราธอนน่าตื่นเต้น"}
{"word":"run","english":"I run into traffic every morning on my commute.","thai":"ฉันเจอรถติดทุกเช้าตอนเดินทางไปทำงาน"}
{"word":"morning","english":"Morning yoga classes help me start the day right.","thai":"คลาสโยคะตอนเช้าช่วยให้ฉันเริ่มวันได้ดี"}
{"word":"start","english":"I’m excited to start a new book club with my coworkers.","thai":"ฉันตื่นเต้นที่จะเริ่มคลับหนังสือใหม่กับเพื่อนร่วมงาน"}
{"word":"excited","english":"Getting excited about a music festival is half the fun.","thai":"การตื่นเต้นกับเทศกาลดนตรีเป็นความสนุกครึ่งหนึ่ง"}
{"word":"fun","english":"Hanging out with my dog is always so much fun.","thai":"การใช้เวลากับหมาเป็นอะไรที่สนุกมาก"}
{"word":"dog","english":"Training my dog to fetch was easier than I thought.","thai":"การฝึกหมาให้คาบของง่ายกว่าที่ฉันคิด"}
{"word":"think","english":"I think volunteering at the animal shelter is so fulfilling.","thai":"ฉันคิดว่าการเป็นอาสาสมัครที่ศูนย์พักพิงสัตว์ให้ความรู้สึกเติมเต็ม"}
{"word":"fulfill","english":"Helping others fulfill their goals is super rewarding.","thai":"การช่วยผู้อื่นให้บรรลุเป้าหมายให้รางวัลมาก"}
{"word":"goal","english":"Setting a goal to save money keeps me disciplined.","thai":"การตั้งเป้าหมายเพื่อเก็บเงินทำให้ฉันมีวินัย"}
{"word":"money","english":"Spending money on experiences beats buying stuff.","thai":"การใช้เงินไปกับประสบการณ์ดีกว่าการซื้อของ"}
{"word":"experience","english":"Traveling abroad is an experience I’ll never forget.","thai":"การเดินทางไปต่างประเทศเป็นประสบการณ์ที่ฉันจะไม่มีวันลืม"}
{"word":"forget","english":"I always forget to charge my phone before a trip.","thai":"ฉันมักลืมชาร์จโทรศัพท์ก่อนเดินทาง"}
{"word":"phone","english":"Texting on my phone keeps me connected with friends.","thai":"การส่งข้อความบนโทรศัพท์ทำให้ฉันติดต่อกับเพื่อนได้"}
{"word":"connect","english":"I love how art can connect people across cultures.","thai":"ฉันชอบที่ศิลปะสามารถเชื่อมโยงผู้คนข้ามวัฒนธรรม"}
{"word":"culture","english":"Exploring local culture during festivals is so enriching.","thai":"การสำรวจวัฒนธรรมท้องถิ่นในช่วงเทศกาลให้ความรู้สึกเติมเต็ม"}
{"word":"explore","english":"I want to explore new hiking spots this summer.","thai":"ฉันอยากสำรวจสถานที่เดินป่าใหม่ๆ ในฤดูร้อนนี้"}
{"word":"summer","english":"Summer barbecues with neighbors are always a hit.","thai":"บาร์บีคิวฤดูร้อนกับเพื่อนบ้านมักได้รับความนิยม"}
{"word":"neighbor","english":"My neighbor always shares their homegrown veggies.","thai":"เพื่อนบ้านของฉันมักแบ่งผักที่ปลูกเองให้"}
{"word":"share","english":"I share my workout playlist to keep the gym vibes high.","thai":"ฉันแชร์เพลย์ลิสต์ออกกำลังกายเพื่อรักษาบรรยากาศในยิมให้ดี"}
{"word":"vibe","english":"The vibe at the open mic night was super chill.","thai":"บรรยากาศในคืน open mic เจ๋งและผ่อนคลายมาก"}
{"word":"chill","english":"I like to chill with a good book on rainy days.","thai":"ฉันชอบพักผ่อนกับหนังสือดีๆ ในวันฝนตก"}
{"word":"book","english":"Finding a rare book at the thrift store feels like treasure.","thai":"การเจอหนังสือหายากที่ร้านมือสองรู้สึกเหมือนเจอสมบัติ"}
{"word":"feel","english":"I feel so accomplished after finishing a big project.","thai":"ฉันรู้สึกภูมิใจมากหลังจากทำโปรเจกต์ใหญ่เสร็จ"}
{"word":"accomplish","english":"Helping my team accomplish our sales targets is exciting.","thai":"การช่วยทีมบรรลุเป้าหมายการขายน่าตื่นเต้น"}
{"word":"team","english":"Our debate team always brings up strong arguments.","thai":"ทีมโต้วาทีของเรามักนำเสนอข้อโต้แย้งที่แข็งแกร่ง"}
{"word":"bring","english":"I bring snacks to movie night to keep everyone happy.","thai":"ฉันนำของว่างมาในคืนดูหนังเพื่อให้ทุกคนมีความสุข"}
{"word":"happy","english":"Seeing my plants grow makes me so happy.","thai":"การเห็นต้นไม้ของฉันเติบโตทำให้ฉันมีความสุขมาก"}
{"word":"grow","english":"I want to grow my small business with new strategies.","thai":"ฉันอยากขยายธุรกิจเล็กๆ ของฉันด้วยกลยุทธ์ใหม่"}
{"word":"strategy","english":"A good strategy for networking is being genuine.","thai":"กลยุทธ์ที่ดีสำหรับการสร้างเครือข่ายคือการเป็นตัวของตัวเอง"}
{"word":"genuine","english":"Genuine compliments can brighten someone’s day.","thai":"คำชมที่จริงใจสามารถทำให้วันของใครบางคนสดใสขึ้น"}
{"word":"day","english":"Starting the day with meditation sets a calm tone.","thai":"การเริ่มวันด้วยการทำสมาธิสร้างบรรยากาศที่สงบ"}
{"word":"calm","english":"A calm mindset helps me tackle tough problems.","thai":"จิตใจที่สงบช่วยให้ฉันจัดการปัญหายากๆ ได้"}
{"word":"tackle","english":"I love to tackle new recipes when I’m feeling creative.","thai":"ฉันชอบลองทำสูตรอาหารใหม่เมื่อรู้สึกมีแรงบันดาลใจ"}
{"word":"creative","english":"Getting creative with my bullet journal is so fun.","thai":"การใช้ความคิดสร้างสรรค์กับ bullet journal สนุกมาก"}
{"word":"fun","english":"Playing board games with friends is always fun.","thai":"การเล่นเกมกระดานกับเพื่อนสนุกเสมอ"}
{"word":"play","english":"I play pickup basketball at the park every Sunday.","thai":"ฉันเล่นบาสเกตบอลแบบไม่เป็นทางการที่สวนทุกวันอาทิตย์"}
{"word":"park","english":"Walking through the park during fall is breathtaking.","thai":"การเดินในสวนช่วงฤดูใบไม้ร่วงสวยงามมาก"}
{"word":"beautiful","english":"The sunset was so beautiful it stopped me in my tracks.","thai":"พระอาทิตย์ตกสวยมากจนทำให้ฉันต้องหยุดดู"}
{"word":"stop","english":"I had to stop and take a pic of that cool mural.","thai":"ฉันต้องหยุดเพื่อถ่ายรูปภาพจิตรกรรมฝาผนังเจ๋งๆ นั้น"}
{"word":"cool","english":"This cool new app helps me track my workouts.","thai":"แอปใหม่เจ๋งๆ นี้ช่วยฉันติดตามการออกกำลังกาย"}
{"word":"track","english":"Keeping track of my budget is harder than it looks.","thai":"การติดตามงบประมาณยากกว่าที่คิด"}
{"word":"budget","english":"Sticking to a budget lets me save for a big trip.","thai":"การยึดงบประมาณทำให้ฉันเก็บเงินสำหรับทริปใหญ่ได้"}
{"word":"save","english":"I save old photos to relive special memories.","thai":"ฉันเก็บรูปเก่าๆ เพื่อระลึกถึงความทรงจำพิเศษ"}
{"word":"memory","english":"Making a memory book for my kid’s first year was tough.","thai":"การทำสมุดความทรงจำสำหรับปีแรกของลูกยากมาก"}
{"word":"year","english":"This year, I’m focusing on mental health and balance.","thai":"ปีนี้ ฉันเน้นเรื่องสุขภาพจิตและความสมดุล"}
{"word":"health","english":"Eating clean is key to better health and energy.","thai":"การกินอาหารคลีนเป็นกุญแจสู่สุขภาพและพลังงานที่ดีขึ้น"}
{"word":"energy","english":"I’ve got so much energy after a good night’s sleep.","thai":"ฉันมีพลังงานเยอะมากหลังจากนอนหลับดี"}
{"word":"sleep","english":"I can’t sleep without some white noise in the background.","thai":"ฉันนอนไม่หลับถ้าไม่มีเสียงรบกวนเบาๆ เป็นพื้นหลัง"}
{"word":"background","english":"Her background in science makes her arguments solid.","thai":"พื้นหลังด้านวิทยาศาสตร์ของเธอทำให้ข้อโต้แย้งของเธอแข็งแกร่ง"}
{"word":"solid","english":"A solid plan is crucial for a successful event.","thai":"แผนที่แข็งแกร่งสำคัญต่อความสำเร็จของงาน"}
{"word":"plan","english":"I plan to take up pottery as a new hobby.","thai":"ฉันวางแผนจะเริ่มทำเครื่องปั้นดินเผาเป็นงานอดิเรกใหม่"}
