{"word": "desk", "english": "I left my book on the desk.", "thai": "ฉันวางหนังสือไว้บนโต๊ะ"}
{"word": "desk", "english": "The desk is too small for my computer.", "thai": "โต๊ะเล็กเกินไปสำหรับคอมพิวเตอร์ของฉัน"}
{"word": "desk", "english": "Can you clean the desk before the meeting?", "thai": "คุณช่วยทำความสะอาดโต๊ะก่อนการประชุมได้ไหม"}
{"word": "desk", "english": "She keeps her pens in the desk drawer.", "thai": "เธอเก็บปากกาไว้ในลิ้นชักโต๊ะ"}
{"word": "desk", "english": "The teacher stood behind the desk.", "thai": "ครูยืนอยู่ด้านหลังโต๊ะ"}
{"word": "desk", "english": "I need a new desk for my home office.", "thai": "ฉันต้องการโต๊ะใหม่สำหรับสำนักงานที่บ้าน"}
{"word": "desk", "english": "He slammed his fist on the desk in anger.", "thai": "เขาทุบกำปั้นลงบนโต๊ะด้วยความโกรธ"}
{"word": "desk", "english": "The desk wobbles because one leg is short.", "thai": "โต๊ะโยกเยกเพราะขาข้างหนึ่งสั้น"}
{"word": "desk", "english": "My cat loves sleeping on the desk.", "thai": "แมวของฉันชอบนอนบนโต๊ะ"}
{"word": "desk", "english": "The papers are scattered all over the desk.", "thai": "เอกสารกระจัดกระจายเต็มโต๊ะ"}
{"word": "desk", "english": "I found an old photo under the desk.", "thai": "ฉันเจอรูปถ่ายเก่าใต้โต๊ะ"}
{"word": "desk", "english": "This desk is made of solid oak.", "thai": "โต๊ะนี้ทำจากไม้โอ๊คแท้"}
{"word": "desk", "english": "She wrote a note and left it on the desk.", "thai": "เธอเขียนโน้ตและวางไว้บนโต๊ะ"}
{"word": "desk", "english": "The desk lamp is too dim to read by.", "thai": "โคมไฟบนโต๊ะสว่างน้อยเกินไปสำหรับการอ่าน"}
{"word": "desk", "english": "He’s been working at his desk all day.", "thai": "เขาทำงานที่โต๊ะทั้งวัน"}
{"word": "desk", "english": "The desk is covered with sticky notes.", "thai": "โต๊ะเต็มไปด้วยโน้ตติดหนึบ"}
{"word": "desk", "english": "I spilled coffee on the desk this morning.", "thai": "ฉันทำกาแฟหกบนโต๊ะเช้านี้"}
{"word": "desk", "english": "The receptionist sits at the front desk.", "thai": "พนักงานต้อนรับนั่งที่โต๊ะหน้า"}
{"word": "desk", "english": "We need to move the desk to the other room.", "thai": "เราต้องย้ายโต๊ะไปอีกห้อง"}
{"word": "desk", "english": "The desk is too heavy to lift alone.", "thai": "โต๊ะหนักเกินไปที่จะยกคนเดียว"}
{"word": "desk", "english": "I keep my laptop on the desk at night.", "thai": "ฉันวางแล็ปท็อปไว้บนโต๊ะตอนกลางคืน"}
{"word": "desk", "english": "There’s a scratch on the desk surface.", "thai": "มีรอยขีดข่วนบนผิวโต๊ะ"}
{"word": "desk", "english": "She organized her desk before leaving.", "thai": "เธอจัดโต๊ะก่อนออกไป"}
{"word": "desk", "english": "The desk is next to the window.", "thai": "โต๊ะอยู่ข้างหน้าต่าง"}
{"word": "desk", "english": "He hid his diary under the desk.", "thai": "เขาซ่อนไดอารี่ไว้ใต้โต๊ะ"}
{"word": "desk", "english": "The desk chair is really uncomfortable.", "thai": "เก้าอี้โต๊ะไม่สบายเลย"}
{"word": "desk", "english": "I bought a standing desk for better posture.", "thai": "ฉันซื้อโต๊ะยืนเพื่อท่าทางที่ดีขึ้น"}
{"word": "desk", "english": "The kids drew on the desk with crayons.", "thai": "เด็กๆ วาดบนโต๊ะด้วยสีเทียน"}
{"word": "desk", "english": "The desk is cluttered with books and papers.", "thai": "โต๊ะรกไปด้วยหนังสือและเอกสาร"}
{"word": "desk", "english": "I saw a spider crawling on the desk.", "thai": "ฉันเห็นแมงมุมคลานบนโต๊ะ"}
{"word": "desk", "english": "She leaned against the desk while talking.", "thai": "เธอพิงโต๊ะขณะพูดคุย"}
{"word": "desk", "english": "The desk is too tall for the kids.", "thai": "โต๊ะสูงเกินไปสำหรับเด็กๆ"}
{"word": "desk", "english": "I need to fix the drawer in the desk.", "thai": "ฉันต้องซ่อมลิ้นชักในโต๊ะ"}
{"word": "desk", "english": "He put his feet up on the desk.", "thai": "เขาเอาเท้าพาดบนโต๊ะ"}
{"word": "desk", "english": "The desk is painted a bright red color.", "thai": "โต๊ะถูกทาสีแดงสด"}
{"word": "desk", "english": "I found a pen under the desk.", "thai": "ฉันเจอปากกาใต้โต๊ะ"}
{"word": "desk", "english": "The desk has a glass top.", "thai": "โต๊ะมีพื้นผิวเป็นกระจก"}
{"word": "desk", "english": "She was reading a book at her desk.", "thai": "เธอกำลังอ่านหนังสือที่โต๊ะ"}
{"word": "desk", "english": "The desk is in the corner of the room.", "thai": "โต๊ะอยู่ในมุมห้อง"}
{"word": "desk", "english": "I dropped my phone behind the desk.", "thai": "ฉันทำโทรศัพท์ตกหลังโต๊ะ"}
{"word": "desk", "english": "The desk is made from recycled wood.", "thai": "โต๊ะทำจากไม้รีไซเคิล"}
{"word": "desk", "english": "He was typing furiously at his desk.", "thai": "เขาพิมพ์อย่างเมามันที่โต๊ะ"}
{"word": "desk", "english": "The desk is blocking the doorway.", "thai": "โต๊ะขวางทางเข้าประตู"}
{"word": "desk", "english": "I need a bigger desk for my projects.", "thai": "ฉันต้องการโต๊ะใหญ่ขึ้นสำหรับโปรเจกต์ของฉัน"}
{"word": "desk", "english": "The desk has a hidden compartment.", "thai": "โต๊ะมีช่องลับ"}
{"word": "desk", "english": "She decorated her desk with plants.", "thai": "เธอตกแต่งโต๊ะด้วยต้นไม้"}
{"word": "desk", "english": "The desk is too close to the heater.", "thai": "โต๊ะอยู่ใกล้เครื่องทำความร้อนเกินไป"}
{"word": "desk", "english": "I left my keys on the desk somewhere.", "thai": "ฉันวางกุญแจไว้บนโต๊ะที่ไหนสักแห่ง"}
{"word": "desk", "english": "The desk needs to be dusted.", "thai": "โต๊ะต้องเช็ดฝุ่น"}
{"word": "desk", "english": "He was sketching on a pad at the desk.", "thai": "เขากำลังร่างภาพบนสมุดที่โต๊ะ"}
{"word": "desk", "english": "The desk is too old and creaky.", "thai": "โต๊ะเก่าเกินไปและมีเสียงดังเอี๊ยด"}
{"word": "desk", "english": "I put a new lamp on the desk.", "thai": "ฉันวางโคมไฟใหม่บนโต๊ะ"}
{"word": "desk", "english": "The desk is wobbling on the uneven floor.", "thai": "โต๊ะโยกเยกบนพื้นไม่เรียบ"}
{"word": "desk", "english": "She was studying at her desk all night.", "thai": "เธอเรียนที่โต๊ะทั้งคืน"}
{"word": "desk", "english": "The desk is covered in paint stains.", "thai": "โต๊ะเต็มไปด้วยรอยเปื้อนสี"}
{"word": "desk", "english": "I need to replace the desk soon.", "thai": "ฉันต้องเปลี่ยนโต๊ะเร็วๆ นี้"}
{"word": "desk", "english": "The desk is perfect for my small apartment.", "thai": "โต๊ะนี้เหมาะสำหรับอพาร์ตเมนต์เล็กๆ ของฉัน"}
{"word": "desk", "english": "He was eating lunch at his desk.", "thai": "เขากินข้าวเที่ยงที่โต๊ะ"}
{"word": "desk", "english": "The desk has a built-in cable organizer.", "thai": "โต๊ะมีที่จัดสายเคเบิลในตัว"}
{"word": "desk", "english": "I tripped over the desk leg.", "thai": "ฉันสะดุดขาโต๊ะ"}
{"word": "desk", "english": "The desk is too cluttered to work on.", "thai": "โต๊ะรกเกินไปที่จะทำงาน"}
{"word": "desk", "english": "She keeps a photo frame on her desk.", "thai": "เธอวางกรอบรูปไว้บนโต๊ะ"}
{"word": "desk", "english": "The desk is made of metal and glass.", "thai": "โต๊ะทำจากโลหะและกระจก"}
{"word": "desk", "english": "I need to adjust the height of the desk.", "thai": "ฉันต้องปรับความสูงของโต๊ะ"}
{"word": "desk", "english": "The desk is scratched from moving it.", "thai": "โต๊ะมีรอยขีดข่วนจากการย้าย"}
{"word": "desk", "english": "He was sorting papers on the desk.", "thai": "เขากำลังคัดแยกเอกสารบนโต๊ะ"}
{"word": "desk", "english": "The desk is against the wall.", "thai": "โต๊ะชิดผนัง"}
{"word": "desk", "english": "I found a lost earring under the desk.", "thai": "ฉันเจอต่างหูที่หายไปใต้โต๊ะ"}
{"word": "desk", "english": "The desk is too narrow for my books.", "thai": "โต๊ะแคบเกินไปสำหรับหนังสือของฉัน"}
{"word": "desk", "english": "She was writing a letter at the desk.", "thai": "เธอกำลังเขียนจดหมายที่โต๊ะ"}
{"word": "desk", "english": "The desk is in the middle of the room.", "thai": "โต๊ะอยู่กลางห้อง"}
{"word": "desk", "english": "I keep my snacks in the desk drawer.", "thai": "ฉันเก็บของว่างไว้ในลิ้นชักโต๊ะ"}
{"word": "desk", "english": "The desk is too low for my chair.", "thai": "โต๊ะต่ำเกินไปสำหรับเก้าอี้ของฉัน"}
{"word": "desk", "english": "He was fixing his computer on the desk.", "thai": "เขากำลังซ่อมคอมพิวเตอร์บนโต๊ะ"}
{"word": "desk", "english": "The desk is covered with old stickers.", "thai": "โต๊ะเต็มไปด้วยสติกเกอร์เก่า"}
{"word": "desk", "english": "I need a desk with more storage.", "thai": "ฉันต้องการโต๊ะที่มีที่เก็บของมากขึ้น"}
{"word": "desk", "english": "The desk is brand new and shiny.", "thai": "โต๊ะใหม่เอี่ยมและเงางาม"}
{"word": "desk", "english": "She was painting her nails at the desk.", "thai": "เธอกำลังทาเล็บที่โต๊ะ"}
{"word": "desk", "english": "The desk is too big for this room.", "thai": "โต๊ะใหญ่เกินไปสำหรับห้องนี้"}
{"word": "desk", "english": "I left my glasses on the desk.", "thai": "ฉันวางแว่นตาไว้บนโต๊ะ"}
{"word": "desk", "english": "The desk is wobbly and needs repair.", "thai": "โต๊ะโยกเยกและต้องซ่อม"}
{"word": "desk", "english": "He was reading the news at his desk.", "thai": "เขากำลังอ่านข่าวที่โต๊ะ"}
{"word": "desk", "english": "The desk is made of cheap particle board.", "thai": "โต๊ะทำจากไม้อัดราคาถูก"}
{"word": "desk", "english": "I keep my calendar on the desk.", "thai": "ฉันวางปฏิทินไว้บนโต๊ะ"}
{"word": "desk", "english": "The desk is too dusty to work on.", "thai": "โต๊ะมีฝุ่นเยอะเกินไปที่จะทำงาน"}
{"word": "desk", "english": "She was doing her homework at the desk.", "thai": "เธอกำลังทำการบ้านที่โต๊ะ"}
{"word": "desk", "english": "The desk is placed under a skylight.", "thai": "โต๊ะถูกวางไว้ใต้ช่องแสง"}
{"word": "desk", "english": "I need to polish the desk this weekend.", "thai": "ฉันต้องขัดโต๊ะสุดสัปดาห์นี้"}
{"word": "desk", "english": "The desk is too far from the outlet.", "thai": "โต๊ะอยู่ห่างจากปลั๊กไฟเกินไป"}
{"word": "desk", "english": "He was assembling a model on the desk.", "thai": "เขากำลังประกอบโมเดลบนโต๊ะ"}
{"word": "desk", "english": "The desk is perfect for my art projects.", "thai": "โต๊ะนี้เหมาะสำหรับโปรเจกต์ศิลปะของฉัน"}
{"word": "desk", "english": "I found a sticky note on the desk.", "thai": "ฉันเจอโน้ตติดหนึบบนโต๊ะ"}
{"word": "desk", "english": "The desk is aligned with the bookshelf.", "thai": "โต๊ะวางชิดกับชั้นวางหนังสือ"}
{"word": "desk", "english": "She was sewing at her desk.", "thai": "เธอกำลังเย็บผ้าที่โต๊ะ"}
{"word": "desk", "english": "The desk is too scratched to refinish.", "thai": "โต๊ะมีรอยขีดข่วนมากเกินไปที่จะขัดใหม่"}
{"word": "desk", "english": "I left my coffee mug on the desk.", "thai": "ฉันวางแก้วกาแฟไว้บนโต๊ะ"}
{"word": "desk", "english": "The desk is part of a matching set.", "thai": "โต๊ะเป็นส่วนหนึ่งของชุดที่เข้าคู่กัน"}
{"word": "desk", "english": "He was napping with his head on the desk.", "thai": "เขางีบหลับโดยเอาหัวพิงโต๊ะ"}
{"word": "chair", "english": "I pulled up a chair to the table.", "thai": "ฉันดึงเก้าอี้มาที่โต๊ะ"}
{"word": "chair", "english": "The chair is too wobbly to sit on.", "thai": "เก้าอี้โยกเยกเกินกว่าจะนั่งได้"}
{"word": "chair", "english": "She sat on the chair by the window.", "thai": "เธอนั่งบนเก้าอี้ข้างหน้าต่าง"}
{"word": "chair", "english": "This chair is really comfortable.", "thai": "เก้าอี้นี้นั่งสบายมาก"}
{"word": "chair", "english": "I need a new chair for my desk.", "thai": "ฉันต้องการเก้าอี้ใหม่สำหรับโต๊ะของฉัน"}
{"word": "chair", "english": "He broke the chair when he leaned back.", "thai": "เขาทำเก้าอี้หักตอนเอนหลัง"}
{"word": "chair", "english": "The chair is covered in cat hair.", "thai": "เก้าอี้เต็มไปด้วยขนแมว"}
{"word": "chair", "english": "Can you grab a chair from the kitchen?", "thai": "คุณช่วยหยิบเก้าอี้จากครัวมาได้ไหม"}
{"word": "chair", "english": "The chair has a cushion for extra comfort.", "thai": "เก้าอี้มีเบาะเพื่อความสบายเพิ่มเติม"}
{"word": "chair", "english": "I tripped over the chair in the dark.", "thai": "ฉันสะดุดเก้าอี้ในความมืด"}
{"word": "chair", "english": "The chair is made of solid wood.", "thai": "เก้าอี้ทำจากไม้เนื้อแข็ง"}
{"word": "chair", "english": "She painted the chair bright blue.", "thai": "เธอทาสีเก้าอี้เป็นสีฟ้าสด"}
{"word": "chair", "english": "The chair squeaks when I move.", "thai": "เก้าอี้ส่งเสียงดังเอี๊ยดเมื่อฉันขยับ"}
{"word": "chair", "english": "I left my jacket on the chair.", "thai": "ฉันวางแจ็คเก็ตไว้บนเก้าอี้"}
{"word": "chair", "english": "The chair is too high for the table.", "thai": "เก้าอี้สูงเกินไปสำหรับโต๊ะ"}
{"word": "chair", "english": "He was rocking back and forth in the chair.", "thai": "เขาโยกเก้าอี้ไปมา"}
{"word": "chair", "english": "The chair is missing a leg.", "thai": "เก้าอี้ขาดขาไปหนึ่งข้าง"}
{"word": "chair", "english": "I bought a new chair for the office.", "thai": "ฉันซื้อเก้าอี้ใหม่สำหรับสำนักงาน"}
{"word": "chair", "english": "The chair is too heavy to move.", "thai": "เก้าอี้หนักเกินไปที่จะย้าย"}
{"word": "chair", "english": "She was knitting while sitting on the chair.", "thai": "เธอกำลังถักนิตติ้งขณะนั่งบนเก้าอี้"}
{"word": "chair", "english": "The chair is part of a dining set.", "thai": "เก้าอี้เป็นส่วนหนึ่งของชุดโต๊ะอาหาร"}
{"word": "chair", "english": "I found a coin under the chair.", "thai": "ฉันเจอเหรียญใต้เก้าอี้"}
{"word": "chair", "english": "The chair is upholstered in soft fabric.", "thai": "เก้าอี้บุด้วยผ้านุ่ม"}
{"word": "chair", "english": "He pushed the chair against the wall.", "thai": "เขาเข็นเก้าอี้ชิดผนัง"}
{"word": "chair", "english": "The chair is too small for him.", "thai": "เก้าอี้เล็กเกินไปสำหรับเขา"}
{"word": "chair", "english": "I need to fix the chair’s loose screws.", "thai": "ฉันต้องซ่อมสกรูที่หลวมของเก้าอี้"}
{"word": "chair", "english": "The chair is covered with a blanket.", "thai": "เก้าอี้ถูกคลุมด้วยผ้าห่ม"}
{"word": "chair", "english": "She stood on the chair to reach the shelf.", "thai": "เธอยืนบนเก้าอี้เพื่อเอื้อมถึงชั้นวาง"}
{"word": "chair", "english": "The chair is in the corner of the room.", "thai": "เก้าอี้อยู่ในมุมห้อง"}
{"word": "chair", "english": "I spilled juice on the chair cushion.", "thai": "ฉันทำน้ำผลไม้หกบนเบาะเก้าอี้"}
{"word": "chair", "english": "The chair has a modern design.", "thai": "เก้าอี้มีดีไซน์ทันสมัย"}
{"word": "chair", "english": "He was lounging in the chair all day.", "thai": "เขานอนเอนกายบนเก้าอี้ทั้งวัน"}
{"word": "chair", "english": "The chair is too old to keep using.", "thai": "เก้าอี้เก่าเกินไปที่จะใช้งานต่อ"}
{"word": "chair", "english": "I put a pillow on the chair for support.", "thai": "ฉันวางหมอนบนเก้าอี้เพื่อพยุง"}
{"word": "chair", "english": "The chair is scratched from the cat.", "thai": "เก้าอี้มีรอยขีดข่วนจากแมว"}
{"word": "chair", "english": "She was reading a book in the chair.", "thai": "เธอกำลังอ่านหนังสือบนเก้าอี้"}
{"word": "chair", "english": "The chair is part of an antique set.", "thai": "เก้าอี้เป็นส่วนหนึ่งของชุดโบราณ"}
{"word": "chair", "english": "I need a chair with better back support.", "thai": "ฉันต้องการเก้าอี้ที่รองรับหลังได้ดีกว่า"}
{"word": "chair", "english": "The chair is stuck under the table.", "thai": "เก้าอี้ติดอยู่ใต้โต๊ะ"}
{"word": "chair", "english": "He was painting the chair in the garage.", "thai": "เขากำลังทาสีเก้าอี้ในโรงรถ"}
{"word": "chair", "english": "The chair is too low for the desk.", "thai": "เก้าอี้เตี้ยเกินไปสำหรับโต๊ะ"}
{"word": "chair", "english": "I left my phone on the chair.", "thai": "ฉันวางโทรศัพท์ไว้บนเก้าอี้"}
{"word": "chair", "english": "The chair is made of recycled plastic.", "thai": "เก้าอี้ทำจากพลาสติกรีไซเคิล"}
{"word": "chair", "english": "She was rocking the baby in the chair.", "thai": "เธอกำลังโยกเด็กในเก้าอี้"}
{"word": "chair", "english": "The chair is too narrow for comfort.", "thai": "เก้าอี้แคบเกินไปสำหรับความสบาย"}
{"word": "chair", "english": "I need to clean the chair’s fabric.", "thai": "ฉันต้องทำความสะอาดผ้าของเก้าอี้"}
{"word": "chair", "english": "The chair is placed by the fireplace.", "thai": "เก้าอี้ถูกวางไว้ข้างเตาผิง"}
{"word": "chair", "english": "He was fixing the chair’s broken armrest.", "thai": "เขากำลังซ่อมที่วางแขนของเก้าอี้ที่หัก"}
{"word": "chair", "english": "The chair is too big for this room.", "thai": "เก้าอี้ใหญ่เกินไปสำหรับห้องนี้"}
{"word": "chair", "english": "I found a stain on the chair.", "thai": "ฉันเจอรอยเปื้อนบนเก้าอี้"}
{"word": "chair", "english": "The chair is perfect for my patio.", "thai": "เก้าอี้เหมาะสำหรับลานบ้านของฉัน"}
{"word": "chair", "english": "She was sewing a cushion for the chair.", "thai": "เธอกำลังเย็บเบาะสำหรับเก้าอี้"}
{"word": "chair", "english": "The chair is leaning against the wall.", "thai": "เก้าอี้พิงอยู่กับผนัง"}
{"word": "chair", "english": "I need a chair with adjustable height.", "thai": "ฉันต้องการเก้าอี้ที่ปรับความสูงได้"}
{"word": "chair", "english": "The chair is covered in dust.", "thai": "เก้าอี้เต็มไปด้วยฝุ่น"}
{"word": "chair", "english": "He was sleeping in the chair.", "thai": "เขากำลังนอนหลับบนเก้าอี้"}
{"word": "chair", "english": "The chair is part of a vintage collection.", "thai": "เก้าอี้เป็นส่วนหนึ่งของคอลเลกชันวินเทจ"}
{"word": "chair", "english": "I dropped my pen under the chair.", "thai": "ฉันทำปากกาตกใต้เก้าอี้"}
{"word": "chair", "english": "The chair is too hard to sit on for long.", "thai": "เก้าอี้นั่งแข็งเกินไปสำหรับการนั่งนาน"}
{"word": "chair", "english": "She decorated the chair with ribbons.", "thai": "เธอตกแต่งเก้าอี้ด้วยริบบิ้น"}
{"word": "chair", "english": "The chair is next to the couch.", "thai": "เก้าอี้อยู่ข้างโซฟา"}
{"word": "chair", "english": "I need to replace the chair soon.", "thai": "ฉันต้องเปลี่ยนเก้าอี้เร็วๆ นี้"}
{"word": "chair", "english": "The chair is made of metal and wood.", "thai": "เก้าอี้ทำจากโลหะและไม้"}
{"word": "chair", "english": "He was eating lunch while sitting on the chair.", "thai": "เขากินข้าวเที่ยงขณะนั่งบนเก้าอี้"}
{"word": "chair", "english": "The chair is too slippery to sit on.", "thai": "เก้าอี้ลื่นเกินกว่าจะนั่งได้"}
{"word": "chair", "english": "I put a blanket over the chair.", "thai": "ฉันคลุมผ้าห่มบนเก้าอี้"}
{"word": "chair", "english": "The chair is perfect for reading.", "thai": "เก้าอี้เหมาะสำหรับการอ่านหนังสือ"}
{"word": "chair", "english": "She was sketching while sitting on the chair.", "thai": "เธอกำลังร่างภาพขณะนั่งบนเก้าอี้"}
{"word": "chair", "english": "The chair is too fragile to lean on.", "thai": "เก้าอี้เปราะบางเกินกว่าจะพิงได้"}
{"word": "chair", "english": "I left my glasses on the chair.", "thai": "ฉันวางแว่นตาไว้บนเก้าอี้"}
{"word": "chair", "english": "The chair is part of a classroom set.", "thai": "เก้าอี้เป็นส่วนหนึ่งของชุดห้องเรียน"}
{"word": "chair", "english": "He was watching TV from the chair.", "thai": "เขาดูทีวีจากเก้าอี้"}
{"word": "chair", "english": "The chair is too close to the heater.", "thai": "เก้าอี้อยู่ใกล้เครื่องทำความร้อนเกินไป"}
{"word": "chair", "english": "I need a chair with wheels for mobility.", "thai": "ฉันต้องการเก้าอี้ที่มีล้อสำหรับการเคลื่อนย้าย"}
{"word": "chair", "english": "The chair is covered with a throw.", "thai": "เก้าอี้ถูกคลุมด้วยผ้าคลุม"}
{"word": "chair", "english": "She was writing a letter on the chair.", "thai": "เธอกำลังเขียนจดหมายบนเก้าอี้"}
{"word": "chair", "english": "The chair is too tall for the kids.", "thai": "เก้าอี้สูงเกินไปสำหรับเด็กๆ"}
{"word": "chair", "english": "I found a sock under the chair.", "thai": "ฉันเจอถุงเท้าใต้เก้าอี้"}
{"word": "chair", "english": "The chair is perfect for my porch.", "thai": "เก้าอี้เหมาะสำหรับระเบียงของฉัน"}
{"word": "chair", "english": "He was polishing the chair in the shed.", "thai": "เขากำลังขัดเก้าอี้ในโรงเก็บของ"}
{"word": "chair", "english": "The chair is too worn out to use.", "thai": "เก้าอี้ชำรุดเกินกว่าจะใช้งานได้"}
{"word": "chair", "english": "I need a chair with a higher backrest.", "thai": "ฉันต้องการเก้าอี้ที่มีพนักพิงสูงกว่า"}
{"word": "chair", "english": "The chair is placed under the window.", "thai": "เก้าอี้ถูกวางไว้ใต้หน้าต่าง"}
{"word": "chair", "english": "She was doing her makeup in the chair.", "thai": "เธอกำลังแต่งหน้าบนเก้าอี้"}
{"word": "chair", "english": "The chair is part of a garden set.", "thai": "เก้าอี้เป็นส่วนหนึ่งของชุดสวน"}
{"word": "chair", "english": "I need to tighten the chair’s bolts.", "thai": "ฉันต้องขันน็อตของเก้าอี้ให้แน่น"}
{"word": "chair", "english": "The chair is too cold to sit on.", "thai": "เก้าอี้นั่งเย็นเกินไป"}
{"word": "chair", "english": "He was playing guitar while sitting on the chair.", "thai": "เขากำลังเล่นกีตาร์ขณะนั่งบนเก้าอี้"}
{"word": "chair", "english": "The chair is aligned with the desk.", "thai": "เก้าอี้ถูกจัดวางให้ตรงกับโต๊ะ"}
{"word": "chair", "english": "I left my bag on the chair.", "thai": "ฉันวางกระเป๋าไว้บนเก้าอี้"}
{"word": "chair", "english": "The chair is too rickety to trust.", "thai": "เก้าอี้โยกเยกเกินกว่าจะไว้วางใจ"}
{"word": "chair", "english": "She was studying in the chair all night.", "thai": "เธอเรียนบนเก้าอี้ทั้งคืน"}
{"word": "chair", "english": "The chair is part of a conference room set.", "thai": "เก้าอี้เป็นส่วนหนึ่งของชุดห้องประชุม"}
{"word": "chair", "english": "I need a chair that swivels.", "thai": "ฉันต้องการเก้าอี้ที่หมุนได้"}
{"word": "chair", "english": "The chair is too scratched to refinish.", "thai": "เก้าอี้มีรอยขีดข่วนมากเกินไปที่จะขัดใหม่"}
{"word": "chair", "english": "He was eating a snack in the chair.", "thai": "เขากินของว่างขณะนั่งบนเก้าอี้"}
{"word": "chair", "english": "The chair is perfect for my study.", "thai": "เก้าอี้เหมาะสำหรับห้องอ่านหนังสือของฉัน"}
{"word": "chair", "english": "I found a book under the chair.", "thai": "ฉันเจอหนังสือใต้เก้าอี้"}
{"word": "chair", "english": "The chair is made for outdoor use.", "thai": "เก้าอี้ถูกออกแบบสำหรับใช้งานกลางแจ้ง"}
{"word": "chair", "english": "She was relaxing in the chair by the pool.", "thai": "เธอกำลังพักผ่อนบนเก้าอี้ข้างสระน้ำ"}
{"word": "table", "english": "I left my keys on the table.", "thai": "ฉันวางกุญแจไว้บนโต๊ะ"}
{"word": "table", "english": "The table is too small for dinner.", "thai": "โต๊ะเล็กเกินไปสำหรับมื้อเย็น"}
{"word": "table", "english": "She set the table for six guests.", "thai": "เธอจัดโต๊ะสำหรับแขกหกคน"}
{"word": "table", "english": "The table is wobbly and needs fixing.", "thai": "โต๊ะโยกเยกและต้องซ่อม"}
{"word": "table", "english": "We gathered around the table to eat.", "thai": "เรารวมตัวกันรอบโต๊ะเพื่อกินข้าว"}
{"word": "table", "english": "The table is covered with a cloth.", "thai": "โต๊ะถูกคลุมด้วยผ้าปูโต๊ะ"}
{"word": "table", "english": "I spilled juice on the table.", "thai": "ฉันทำน้ำผลไม้หกบนโต๊ะ"}
{"word": "table", "english": "The table is made of solid oak.", "thai": "โต๊ะทำจากไม้โอ๊คแท้"}
{"word": "table", "english": "He was reading a book at the table.", "thai": "เขากำลังอ่านหนังสือที่โต๊ะ"}
{"word": "table", "english": "The table is too big for this room.", "thai": "โต๊ะใหญ่เกินไปสำหรับห้องนี้"}
{"word": "table", "english": "I found a pen under the table.", "thai": "ฉันเจอปากกาใต้โต๊ะ"}
{"word": "table", "english": "The table has a glass top.", "thai": "โต๊ะมีพื้นผิวเป็นกระจก"}
{"word": "table", "english": "She was writing a letter on the table.", "thai": "เธอกำลังเขียนจดหมายบนโต๊ะ"}
{"word": "table", "english": "The table is scratched from moving.", "thai": "โต๊ะมีรอยขีดข่วนจากการย้าย"}
{"word": "table", "english": "We need a new table for the kitchen.", "thai": "เราต้องการโต๊ะใหม่สำหรับครัว"}
{"word": "table", "english": "The table is covered in paint stains.", "thai": "โต๊ะเต็มไปด้วยรอยเปื้อนสี"}
{"word": "table", "english": "I put a vase of flowers on the table.", "thai": "ฉันวางแจกันดอกไม้ไว้บนโต๊ะ"}
{"word": "table", "english": "The table is next to the window.", "thai": "โต๊ะอยู่ข้างหน้าต่าง"}
{"word": "table", "english": "He was working on his laptop at the table.", "thai": "เขากำลังทำงานบนแล็ปท็อปที่โต๊ะ"}
{"word": "table", "english": "The table is too low for the chairs.", "thai": "โต๊ะเตี้ยเกินไปสำหรับเก้าอี้"}
{"word": "table", "english": "I dropped my phone under the table.", "thai": "ฉันทำโทรศัพท์ตกใต้โต๊ะ"}
{"word": "table", "english": "The table is made from recycled wood.", "thai": "โต๊ะทำจากไม้รีไซเคิล"}
{"word": "table", "english": "She was studying at the table all night.", "thai": "เธอเรียนที่โต๊ะทั้งคืน"}
{"word": "table", "english": "The table is cluttered with papers.", "thai": "โต๊ะรกไปด้วยเอกสาร"}
{"word": "table", "english": "I need to clean the table before dinner.", "thai": "ฉันต้องทำความสะอาดโต๊ะก่อนมื้อเย็น"}
{"word": "table", "english": "The table is perfect for board games.", "thai": "โต๊ะเหมาะสำหรับเล่นเกมกระดาน"}
{"word": "table", "english": "He was eating breakfast at the table.", "thai": "เขากินอาหารเช้าที่โต๊ะ"}
{"word": "table", "english": "The table is too heavy to move alone.", "thai": "โต๊ะหนักเกินไปที่จะย้ายคนเดียว"}
{"word": "table", "english": "She decorated the table with candles.", "thai": "เธอตกแต่งโต๊ะด้วยเทียน"}
{"word": "table", "english": "The table is in the dining room.", "thai": "โต๊ะอยู่ในห้องอาหาร"}
{"word": "table", "english": "I left my glasses on the table.", "thai": "ฉันวางแว่นตาไว้บนโต๊ะ"}
{"word": "table", "english": "The table has a hidden drawer.", "thai": "โต๊ะมีลิ้นชักลับ"}
{"word": "table", "english": "He was drawing on the table with crayons.", "thai": "เขาวาดบนโต๊ะด้วยสีเทียน"}
{"word": "table", "english": "The table is too old to keep using.", "thai": "โต๊ะเก่าเกินไปที่จะใช้งานต่อ"}
{"word": "table", "english": "I need a bigger table for my projects.", "thai": "ฉันต้องการโต๊ะใหญ่ขึ้นสำหรับโปรเจกต์ของฉัน"}
{"word": "table", "english": "The table is covered with sticky notes.", "thai": "โต๊ะเต็มไปด้วยโน้ตติดหนึบ"}
{"word": "table", "english": "She was sewing at the table.", "thai": "เธอกำลังเย็บผ้าที่โต๊ะ"}
{"word": "table", "english": "The table is placed in the corner.", "thai": "โต๊ะถูกวางไว้ในมุม"}
{"word": "table", "english": "I found a coin under the table.", "thai": "ฉันเจอเหรียญใต้โต๊ะ"}
{"word": "table", "english": "The table is made of metal and glass.", "thai": "โต๊ะทำจากโลหะและกระจก"}
{"word": "table", "english": "He was fixing his computer on the table.", "thai": "เขากำลังซ่อมคอมพิวเตอร์บนโต๊ะ"}
{"word": "table", "english": "The table is too narrow for my books.", "thai": "โต๊ะแคบเกินไปสำหรับหนังสือของฉัน"}
{"word": "table", "english": "I need to polish the table this weekend.", "thai": "ฉันต้องขัดโต๊ะสุดสัปดาห์นี้"}
{"word": "table", "english": "The table is blocking the doorway.", "thai": "โต๊ะขวางทางเข้าประตู"}
{"word": "table", "english": "She was painting her nails at the table.", "thai": "เธอกำลังทาเล็บที่โต๊ะ"}
{"word": "table", "english": "The table is perfect for my small apartment.", "thai": "โต๊ะเหมาะสำหรับอพาร์ตเมนต์เล็กๆ ของฉัน"}
{"word": "table", "english": "I spilled coffee on the table this morning.", "thai": "ฉันทำกาแฟหกบนโต๊ะเช้านี้"}
{"word": "table", "english": "The table is too close to the wall.", "thai": "โต๊ะอยู่ใกล้ผนังเกินไป"}
{"word": "table", "english": "He was sorting papers on the table.", "thai": "เขากำลังคัดแยกเอกสารบนโต๊ะ"}
{"word": "table", "english": "The table is part of a matching set.", "thai": "โต๊ะเป็นส่วนหนึ่งของชุดที่เข้าคู่กัน"}
{"word": "table", "english": "I need a table with more storage.", "thai": "ฉันต้องการโต๊ะที่มีที่เก็บของมากขึ้น"}
{"word": "table", "english": "The table is covered in dust.", "thai": "โต๊ะเต็มไปด้วยฝุ่น"}
{"word": "table", "english": "She was doing her homework at the table.", "thai": "เธอกำลังทำการบ้านที่โต๊ะ"}
{"word": "table", "english": "The table is too scratched to refinish.", "thai": "โต๊ะมีรอยขีดข่วนมากเกินไปที่จะขัดใหม่"}
{"word": "table", "english": "I left my laptop on the table.", "thai": "ฉันวางแล็ปท็อปไว้บนโต๊ะ"}
{"word": "table", "english": "The table is made for outdoor use.", "thai": "โต๊ะถูกออกแบบสำหรับใช้งานกลางแจ้ง"}
{"word": "table", "english": "He was playing cards on the table.", "thai": "เขากำลังเล่นไพ่บนโต๊ะ"}
{"word": "table", "english": "The table is too tall for the kids.", "thai": "โต๊ะสูงเกินไปสำหรับเด็กๆ"}
{"word": "table", "english": "I found a sock under the table.", "thai": "ฉันเจอถุงเท้าใต้โต๊ะ"}
{"word": "table", "english": "The table is perfect for my patio.", "thai": "โต๊ะเหมาะสำหรับลานบ้านของฉัน"}
{"word": "table", "english": "She was sketching on the table.", "thai": "เธอกำลังร่างภาพบนโต๊ะ"}
{"word": "table", "english": "The table is too fragile to lean on.", "thai": "โต๊ะเปราะบางเกินกว่าจะพิงได้"}
{"word": "table", "english": "I need to adjust the table’s legs.", "thai": "ฉันต้องปรับขาของโต๊ะ"}
{"word": "table", "english": "The table is aligned with the chairs.", "thai": "โต๊ะถูกจัดวางให้ตรงกับเก้าอี้"}
{"word": "table", "english": "He was eating a snack at the table.", "thai": "เขากินของว่างที่โต๊ะ"}
{"word": "table", "english": "The table is covered with a runner.", "thai": "โต๊ะถูกคลุมด้วยผ้าปูโต๊ะยาว"}
{"word": "table", "english": "I left my bag on the table.", "thai": "ฉันวางกระเป๋าไว้บนโต๊ะ"}
{"word": "table", "english": "The table is too cold to touch.", "thai": "โต๊ะเย็นเกินกว่าจะสัมผัส"}
{"word": "table", "english": "She was wrapping gifts on the table.", "thai": "เธอกำลังห่อของขวัญบนโต๊ะ"}
{"word": "table", "english": "The table is part of a conference room set.", "thai": "โต๊ะเป็นส่วนหนึ่งของชุดห้องประชุม"}
{"word": "table", "english": "I need a table that folds for storage.", "thai": "ฉันต้องการโต๊ะที่พับเก็บได้"}
{"word": "table", "english": "The table is too worn out to use.", "thai": "โต๊ะชำรุดเกินกว่าจะใช้งานได้"}
{"word": "table", "english": "He was assembling a model on the table.", "thai": "เขากำลังประกอบโมเดลบนโต๊ะ"}
{"word": "table", "english": "The table is perfect for my study.", "thai": "โต๊ะเหมาะสำหรับห้องอ่านหนังสือของฉัน"}
{"word": "table", "english": "I found a book under the table.", "thai": "ฉันเจอหนังสือใต้โต๊ะ"}
{"word": "table", "english": "The table is placed under a chandelier.", "thai": "โต๊ะถูกวางไว้ใต้โคมระย้า"}
{"word": "table", "english": "She was doing puzzles on the table.", "thai": "เธอกำลังต่อจิ๊กซอว์บนโต๊ะ"}
{"word": "table", "english": "The table is too shiny to write on.", "thai": "โต๊ะเงาเกินไปที่จะเขียน"}
{"word": "table", "english": "I need a table with a larger surface.", "thai": "ฉันต้องการโต๊ะที่มีพื้นผิวใหญ่ขึ้น"}
{"word": "table", "english": "The table is part of a vintage set.", "thai": "โต๊ะเป็นส่วนหนึ่งของชุดวินเทจ"}
{"word": "table", "english": "He was polishing the table in the shed.", "thai": "เขากำลังขัดโต๊ะในโรงเก็บของ"}
{"word": "table", "english": "The table is too close to the heater.", "thai": "โต๊ะอยู่ใกล้เครื่องทำความร้อนเกินไป"}
{"word": "table", "english": "I left my coffee mug on the table.", "thai": "ฉันวางแก้วกาแฟไว้บนโต๊ะ"}
{"word": "table", "english": "The table is perfect for outdoor dining.", "thai": "โต๊ะเหมาะสำหรับการรับประทานอาหารกลางแจ้ง"}
{"word": "table", "english": "She was reading the news at the table.", "thai": "เธอกำลังอ่านข่าวที่โต๊ะ"}
{"word": "table", "english": "The table is made of cheap particle board.", "thai": "โต๊ะทำจากไม้อัดราคาถูก"}
{"word": "table", "english": "I need to tighten the table’s bolts.", "thai": "ฉันต้องขันน็อตของโต๊ะให้แน่น"}
{"word": "table", "english": "The table is covered with a plastic sheet.", "thai": "โต๊ะถูกคลุมด้วยแผ่นพลาสติก"}
{"word": "table", "english": "He was playing chess on the table.", "thai": "เขากำลังเล่นหมากรุกบนโต๊ะ"}
{"word": "table", "english": "The table is too rickety to trust.", "thai": "โต๊ะโยกเยกเกินกว่าจะไว้วางใจ"}
{"word": "table", "english": "I found a sticky note on the table.", "thai": "ฉันเจอโน้ตติดหนึบบนโต๊ะ"}
{"word": "table", "english": "The table is perfect for my art projects.", "thai": "โต๊ะเหมาะสำหรับโปรเจกต์ศิลปะของฉัน"}
{"word": "table", "english": "She was organizing her notes on the table.", "thai": "เธอกำลังจัดระเบียบโน้ตบนโต๊ะ"}
{"word": "table", "english": "The table is placed by the fireplace.", "thai": "โต๊ะถูกวางไว้ข้างเตาผิง"}
{"word": "table", "english": "I need a table with adjustable height.", "thai": "ฉันต้องการโต๊ะที่ปรับความสูงได้"}
{"word": "table", "english": "The table is too dusty to work on.", "thai": "โต๊ะมีฝุ่นเยอะเกินไปที่จะทำงาน"}
{"word": "table", "english": "He was napping with his head on the table.", "thai": "เขางีบหลับโดยเอาหัวพิงโต๊ะ"}
{"word": "table", "english": "The table is part of a garden set.", "thai": "โต๊ะเป็นส่วนหนึ่งของชุดสวน"}
{"word": "table", "english": "I left my scarf on the table.", "thai": "ฉันวางผ้าพันคอไว้บนโต๊ะ"}
{"word": "table", "english": "The table is perfect for family gatherings.", "thai": "โต๊ะเหมาะสำหรับการรวมตัวของครอบครัว"}
{"word": "door", "english": "I left my keys by the door.", "thai": "ฉันวางกุญแจไว้ข้างประตู"}
{"word": "door", "english": "The door is locked from the inside.", "thai": "ประตูล็อกจากด้านใน"}
{"word": "door", "english": "She knocked on the door loudly.", "thai": "เธอเคาะประตูดังมาก"}
{"word": "door", "english": "The door creaks when you open it.", "thai": "ประตูส่งเสียงเอี๊ยดเมื่อเปิด"}
{"word": "door", "english": "I need to paint the door this weekend.", "thai": "ฉันต้องทาสีประตูสุดสัปดาห์นี้"}
{"word": "door", "english": "He slammed the door in anger.", "thai": "เขาปิดประตูแรงด้วยความโกรธ"}
{"word": "door", "english": "The door is too heavy to open easily.", "thai": "ประตูหนักเกินกว่าจะเปิดได้ง่าย"}
{"word": "door", "english": "I heard someone at the door.", "thai": "ฉันได้ยินเสียงคนอยู่ที่ประตู"}
{"word": "door", "english": "The door is stuck and won’t budge.", "thai": "ประตูติดและไม่ขยับ"}
{"word": "door", "english": "She left the door wide open.", "thai": "เธอปล่อยประตูเปิดกว้าง"}
{"word": "door", "english": "The door has a new lock installed.", "thai": "ประตูมีการติดตั้งกุญแจใหม่"}
{"word": "door", "english": "I found a note taped to the door.", "thai": "ฉันเจอโน้ตติดอยู่ที่ประตู"}
{"word": "door", "english": "The door is made of solid wood.", "thai": "ประตูทำจากไม้เนื้อแข็ง"}
{"word": "door", "english": "He was standing by the door.", "thai": "เขายืนอยู่ข้างประตู"}
{"word": "door", "english": "The door handle is loose.", "thai": "ที่จับประตูหลวม"}
{"word": "door", "english": "I need to fix the door hinge.", "thai": "ฉันต้องซ่อมบานพับประตู"}
{"word": "door", "english": "The door is scratched from the cat.", "thai": "ประตูมีรอยขีดข่วนจากแมว"}
{"word": "door", "english": "She closed the door quietly.", "thai": "เธอปิดประตูเงียบๆ"}
{"word": "door", "english": "The door is painted bright red.", "thai": "ประตูถูกทาสีแดงสด"}
{"word": "door", "english": "I left my shoes by the door.", "thai": "ฉันวางรองเท้าไว้ข้างประตู"}
{"word": "door", "english": "The door won’t close properly.", "thai": "ประตูปิดไม่สนิท"}
{"word": "door", "english": "He was leaning against the door.", "thai": "เขาพิงประตูอยู่"}
{"word": "door", "english": "The door is too narrow for the couch.", "thai": "ประตูแคบเกินไปสำหรับโซฟา"}
{"word": "door", "english": "I heard a knock at the door.", "thai": "ฉันได้ยินเสียงเคาะที่ประตู"}
{"word": "door", "english": "The door is made of glass.", "thai": "ประตูทำจากกระจก"}
{"word": "door", "english": "She hung a wreath on the door.", "thai": "เธอแขวนพวงหรีดที่ประตู"}
{"word": "door", "english": "The door is blocked by a chair.", "thai": "ประตูถูกเก้าอี้ขวางไว้"}
{"word": "door", "english": "I need a new door for the bedroom.", "thai": "ฉันต้องการประตูใหม่สำหรับห้องนอน"}
{"word": "door", "english": "The door is too old to repair.", "thai": "ประตูเก่าเกินไปที่จะซ่อม"}
{"word": "door", "english": "He opened the door for me.", "thai": "เขาเปิดประตูให้ฉัน"}
{"word": "door", "english": "The door has a peephole for safety.", "thai": "ประตูมีช่องมองเพื่อความปลอดภัย"}
{"word": "door", "english": "I saw a spider on the door.", "thai": "ฉันเห็นแมงมุมบนประตู"}
{"word": "door", "english": "The door is too tall for this frame.", "thai": "ประตูสูงเกินไปสำหรับกรอบนี้"}
{"word": "door", "english": "She was standing in the door frame.", "thai": "เธอยืนอยู่ในกรอบประตู"}
{"word": "door", "english": "The door is covered in stickers.", "thai": "ประตูเต็มไปด้วยสติกเกอร์"}
{"word": "door", "english": "I left my bag by the door.", "thai": "ฉันวางกระเป๋าไว้ข้างประตู"}
{"word": "door", "english": "The door is squeaking again.", "thai": "ประตูส่งเสียงเอี๊ยดอีกแล้ว"}
{"word": "door", "english": "He was polishing the door handle.", "thai": "เขากำลังขัดที่จับประตู"}
{"word": "door", "english": "The door is too cold to touch.", "thai": "ประตูเย็นเกินกว่าจะสัมผัส"}
{"word": "door", "english": "I need to replace the door soon.", "thai": "ฉันต้องเปลี่ยนประตูเร็วๆ นี้"}
{"word": "door", "english": "The door is part of a vintage set.", "thai": "ประตูเป็นส่วนหนึ่งของชุดวินเทจ"}
{"word": "door", "english": "She was decorating the door for Christmas.", "thai": "เธอกำลังตกแต่งประตูสำหรับคริสต์มาส"}
{"word": "door", "english": "The door is too heavy for the kids.", "thai": "ประตูหนักเกินไปสำหรับเด็กๆ"}
{"word": "door", "english": "I found a scratch on the door.", "thai": "ฉันเจอรอยขีดข่วนบนประตู"}
{"word": "door", "english": "The door is slightly ajar.", "thai": "ประตูแง้มอยู่นิดหน่อย"}
{"word": "door", "english": "He was fixing the door lock.", "thai": "เขากำลังซ่อมกุญแจประตู"}
{"word": "door", "english": "The door is made of steel.", "thai": "ประตูทำจากเหล็ก"}
{"word": "door", "english": "I left a package by the door.", "thai": "ฉันวางพัสดุไว้ข้างประตู"}
{"word": "door", "english": "The door is too wide for this hallway.", "thai": "ประตูกว้างเกินไปสำหรับโถงทางเดินนี้"}
{"word": "door", "english": "She was cleaning the door with a cloth.", "thai": "เธอกำลังทำความสะอาดประตูด้วยผ้า"}
{"word": "door", "english": "The door is stuck in the frame.", "thai": "ประตูติดอยู่ในกรอบ"}
{"word": "door", "english": "I heard the door slam shut.", "thai": "ฉันได้ยินประตูปิดดังปัง"}
{"word": "door", "english": "The door has a frosted glass panel.", "thai": "ประตูมีแผงกระจกฝ้า"}
{"word": "door", "english": "He was knocking on the door repeatedly.", "thai": "เขาเคาะประตูซ้ำๆ"}
{"word": "door", "english": "The door is too short for the frame.", "thai": "ประตูสั้นเกินไปสำหรับกรอบ"}
{"word": "door", "english": "I left my umbrella by the door.", "thai": "ฉันวางร่มไว้ข้างประตู"}
{"word": "door", "english": "The door is part of a sliding set.", "thai": "ประตูเป็นส่วนหนึ่งของชุดบานเลื่อน"}
{"word": "door", "english": "She was hanging a sign on the door.", "thai": "เธอกำลังแขวนป้ายที่ประตู"}
{"word": "door", "english": "The door is too noisy when it opens.", "thai": "ประตูส่งเสียงดังเกินไปเมื่อเปิด"}
{"word": "door", "english": "I need a door with better insulation.", "thai": "ฉันต้องการประตูที่มีฉนวนดีกว่า"}
{"word": "door", "english": "The door is covered in dust.", "thai": "ประตูเต็มไปด้วยฝุ่น"}
{"word": "door", "english": "He was waiting outside the door.", "thai": "เขารออยู่หน้าประตู"}
{"word": "door", "english": "The door is painted to match the walls.", "thai": "ประตูถูกทาสีให้เข้ากับผนัง"}
{"word": "door", "english": "I found a mark on the door frame.", "thai": "ฉันเจอรอยบนกรอบประตู"}
{"word": "door", "english": "The door is too rusty to use.", "thai": "ประตูขึ้นสนิมเกินกว่าจะใช้งานได้"}
{"word": "door", "english": "She was standing behind the door.", "thai": "เธอยืนอยู่หลังประตู"}
{"word": "door", "english": "The door is part of a double set.", "thai": "ประตูเป็นส่วนหนึ่งของชุดประตูคู่"}
{"word": "door", "english": "I need to oil the door hinges.", "thai": "ฉันต้องหยอดน้ำมันที่บานพับประตู"}
{"word": "door", "english": "The door is too thin for soundproofing.", "thai": "ประตูบางเกินไปสำหรับการกันเสียง"}
{"word": "door", "english": "He was pushing the door open.", "thai": "เขากำลังผลักประตูให้เปิด"}
{"word": "door", "english": "The door has a decorative knob.", "thai": "ประตูมีลูกบิดตกแต่ง"}
{"word": "door", "english": "I left my coat by the door.", "thai": "ฉันวางเสื้อโค้ทไว้ข้างประตู"}
{"word": "door", "english": "The door is too damaged to fix.", "thai": "ประตูเสียหายเกินกว่าจะซ่อม"}
{"word": "door", "english": "She was peeking through the door.", "thai": "เธอกำลังแอบมองผ่านประตู"}
{"word": "door", "english": "The door is made of reclaimed wood.", "thai": "ประตูทำจากไม้รีไซเคิล"}
{"word": "door", "english": "I heard the door being unlocked.", "thai": "ฉันได้ยินเสียงปลดล็อกประตู"}
{"word": "door", "english": "The door is too stiff to open.", "thai": "ประตูแข็งเกินกว่าจะเปิด"}
{"word": "door", "english": "He was installing a new door.", "thai": "เขากำลังติดตั้งประตูใหม่"}
{"word": "door", "english": "The door is part of a modern design.", "thai": "ประตูเป็นส่วนหนึ่งของดีไซน์ทันสมัย"}
{"word": "door", "english": "I left a letter by the door.", "thai": "ฉันวางจดหมายไว้ข้างประตู"}
{"word": "door", "english": "The door is too warped to close.", "thai": "ประตูบิดงอเกินกว่าจะปิดได้"}
{"word": "door", "english": "She was taping a poster to the door.", "thai": "เธอกำลังติดโปสเตอร์ที่ประตู"}
{"word": "door", "english": "The door is too wide for the frame.", "thai": "ประตูกว้างเกินไปสำหรับกรอบ"}
{"word": "door", "english": "I need a door with a better seal.", "thai": "ฉันต้องการประตูที่มีซีลดีกว่า"}
{"word": "door", "english": "The door is covered with fingerprints.", "thai": "ประตูเต็มไปด้วยรอยนิ้วมือ"}
{"word": "door", "english": "He was sitting by the door.", "thai": "เขานั่งอยู่ข้างประตู"}
{"word": "door", "english": "The door is too shiny from polishing.", "thai": "ประตูเงาเกินไปจากการขัด"}
{"word": "door", "english": "I found a key under the door mat.", "thai": "ฉันเจอกุญแจใต้พรมหน้าประตู"}
{"word": "door", "english": "The door is part of a barn-style set.", "thai": "ประตูเป็นส่วนหนึ่งของชุดสไตล์โรงนา"}
{"word": "door", "english": "She was holding the door open.", "thai": "เธอกำลังจับประตูให้เปิดอยู่"}
{"word": "door", "english": "The door is too creaky to use quietly.", "thai": "ประตูส่งเสียงเอี๊ยดเกินกว่าจะใช้เงียบๆ"}
{"word": "door", "english": "I need to replace the door knob.", "thai": "ฉันต้องเปลี่ยนลูกบิดประตู"}
{"word": "door", "english": "The door is made of frosted glass.", "thai": "ประตูทำจากกระจกฝ้า"}
{"word": "door", "english": "He was scratching his name on the door.", "thai": "เขากำลังขูดชื่อของเขาบนประตู"}
{"word": "door", "english": "The door is too loose in the frame.", "thai": "ประตูหลวมเกินไปในกรอบ"}
{"word": "door", "english": "I left my scarf by the door.", "thai": "ฉันวางผ้าพันคอไว้ข้างประตู"}
{"word": "door", "english": "The door is part of an antique collection.", "thai": "ประตูเป็นส่วนหนึ่งของคอลเลกชันโบราณ"}
{"word": "door", "english": "She was knocking softly on the door.", "thai": "เธอเคาะประตูเบาๆ"}
{"word": "door", "english": "The door is too scratched to refinish.", "thai": "ประตูมีรอยขีดข่วนมากเกินไปที่จะขัดใหม่"}
{"word": "door", "english": "I heard the door being opened slowly.", "thai": "ฉันได้ยินเสียงประตูถูกเปิดช้าๆ"}
{"word": "door", "english": "The door is perfect for my new office.", "thai": "ประตูเหมาะสำหรับสำนักงานใหม่ของฉัน"}
{"word": "window", "english": "I left the window open last night.", "thai": "ฉันปล่อยหน้าต่างเปิดไว้เมื่อคืน"}
{"word": "window", "english": "The window is too dirty to see through.", "thai": "หน้าต่างสกปรกเกินกว่าจะมองผ่านได้"}
{"word": "window", "english": "She was staring out the window.", "thai": "เธอกำลังมองออกไปนอกหน้าต่าง"}
{"word": "window", "english": "The window is cracked and needs replacing.", "thai": "หน้าต่างแตกและต้องเปลี่ยน"}
{"word": "window", "english": "I heard a bird hit the window.", "thai": "ฉันได้ยินเสียงนกชนหน้าต่าง"}
{"word": "window", "english": "The window is stuck and won’t open.", "thai": "หน้าต่างติดและเปิดไม่ได้"}
{"word": "window", "english": "He was cleaning the window this morning.", "thai": "เขากำลังทำความสะอาดหน้าต่างเช้านี้"}
{"word": "window", "english": "The window has a great view of the park.", "thai": "หน้าต่างมีวิวสวนสวยมาก"}
{"word": "window", "english": "I need to close the window; it’s cold.", "thai": "ฉันต้องปิดหน้าต่าง มันหนาว"}
{"word": "window", "english": "The window is too high to reach.", "thai": "หน้าต่างสูงเกินไปที่จะเอื้อมถึง"}
{"word": "window", "english": "She hung curtains over the window.", "thai": "เธอแขวนผ้าม่านที่หน้าต่าง"}
{"word": "window", "english": "The window is fogged up from the rain.", "thai": "หน้าต่างมีฝ้าจากฝน"}
{"word": "window", "english": "I saw a cat sitting on the window sill.", "thai": "ฉันเห็นแมวนั่งบนขอบหน้าต่าง"}
{"word": "window", "english": "The window is made of frosted glass.", "thai": "หน้าต่างทำจากกระจกฝ้า"}
{"word": "window", "english": "He was leaning out the window.", "thai": "เขากำลังโน้มตัวออกนอกหน้าต่าง"}
{"word": "window", "english": "The window is too small for this room.", "thai": "หน้าต่างเล็กเกินไปสำหรับห้องนี้"}
{"word": "window", "english": "I need a new window for the kitchen.", "thai": "ฉันต้องการหน้าต่างใหม่สำหรับครัว"}
{"word": "window", "english": "The window is rattling in the wind.", "thai": "หน้าต่างสั่นในลม"}
{"word": "window", "english": "She was painting the window frame.", "thai": "เธอกำลังทาสีกรอบหน้าต่าง"}
{"word": "window", "english": "The window is covered in stickers.", "thai": "หน้าต่างเต็มไปด้วยสติกเกอร์"}
{"word": "window", "english": "I left my coffee on the window sill.", "thai": "ฉันวางกาแฟไว้บนขอบหน้าต่าง"}
{"word": "window", "english": "The window is too old to open smoothly.", "thai": "หน้าต่างเก่าเกินไปที่จะเปิดได้ลื่น"}
{"word": "window", "english": "He was sitting by the window reading.", "thai": "เขานั่งอ่านหนังสือข้างหน้าต่าง"}
{"word": "window", "english": "The window is letting in a draft.", "thai": "หน้าต่างปล่อยให้ลมเย็นเข้ามา"}
{"word": "window", "english": "I saw raindrops on the window.", "thai": "ฉันเห็นหยดฝนบนหน้าต่าง"}
{"word": "window", "english": "The window is made of stained glass.", "thai": "หน้าต่างทำจากกระจกสี"}
{"word": "window", "english": "She was knocking on the window.", "thai": "เธอกำลังเคาะหน้าต่าง"}
{"word": "window", "english": "The window is too big for curtains.", "thai": "หน้าต่างใหญ่เกินไปสำหรับผ้าม่าน"}
{"word": "window", "english": "I need to fix the window lock.", "thai": "ฉันต้องซ่อมกุญแจหน้าต่าง"}
{"word": "window", "english": "The window is scratched from branches.", "thai": "หน้าต่างมีรอยขีดข่วนจากกิ่งไม้"}
{"word": "window", "english": "He was looking through the window.", "thai": "เขากำลังมองผ่านหน้าต่าง"}
{"word": "window", "english": "The window is part of a bay design.", "thai": "หน้าต่างเป็นส่วนหนึ่งของดีไซน์โค้ง"}
{"word": "window", "english": "I left a plant on the window sill.", "thai": "ฉันวางต้นไม้ไว้บนขอบหน้าต่าง"}
{"word": "window", "english": "The window is too narrow for sunlight.", "thai": "หน้าต่างแคบเกินไปสำหรับแสงแดด"}
{"word": "window", "english": "She was decorating the window for Halloween.", "thai": "เธอกำลังตกแต่งหน้าต่างสำหรับฮาโลวีน"}
{"word": "window", "english": "The window is fogging up in the cold.", "thai": "หน้าต่างมีฝ้าในอากาศหนาว"}
{"word": "window", "english": "I heard a tap on the window.", "thai": "ฉันได้ยินเสียงเคาะที่หน้าต่าง"}
{"word": "window", "english": "The window is too heavy to lift.", "thai": "หน้าต่างหนักเกินไปที่จะยก"}
{"word": "window", "english": "He was installing a new window.", "thai": "เขากำลังติดตั้งหน้าต่างใหม่"}
{"word": "window", "english": "The window is part of a modern design.", "thai": "หน้าต่างเป็นส่วนหนึ่งของดีไซน์ทันสมัย"}
{"word": "window", "english": "I need to clean the window panes.", "thai": "ฉันต้องทำความสะอาดบานหน้าต่าง"}
{"word": "window", "english": "The window is covered with frost.", "thai": "หน้าต่างเต็มไปด้วยน้ำค้างแข็ง"}
{"word": "window", "english": "She was sitting on the window ledge.", "thai": "เธอนั่งบนขอบหน้าต่าง"}
{"word": "window", "english": "The window is too high for the kids.", "thai": "หน้าต่างสูงเกินไปสำหรับเด็กๆ"}
{"word": "window", "english": "I saw a shadow outside the window.", "thai": "ฉันเห็นเงานอกหน้าต่าง"}
{"word": "window", "english": "The window is made of double glass.", "thai": "หน้าต่างทำจากกระจกสองชั้น"}
{"word": "window", "english": "He was taping a sign to the window.", "thai": "เขากำลังติดป้ายที่หน้าต่าง"}
{"word": "window", "english": "The window is too old to insulate well.", "thai": "หน้าต่างเก่าเกินไปที่จะกันความร้อนได้ดี"}
{"word": "window", "english": "I left my book on the window sill.", "thai": "ฉันวางหนังสือไว้บนขอบหน้าต่าง"}
{"word": "window", "english": "The window is rattling from the storm.", "thai": "หน้าต่างสั่นจากพายุ"}
{"word": "window", "english": "She was drawing on the window with markers.", "thai": "เธอกำลังวาดบนหน้าต่างด้วยปากกามาร์กเกอร์"}
{"word": "window", "english": "The window is too small for ventilation.", "thai": "หน้าต่างเล็กเกินไปสำหรับการระบายอากาศ"}
{"word": "window", "english": "I need a window with better sealing.", "thai": "ฉันต้องการหน้าต่างที่มีซีลดีกว่า"}
{"word": "window", "english": "The window is covered in fingerprints.", "thai": "หน้าต่างเต็มไปด้วยรอยนิ้วมือ"}
{"word": "window", "english": "He was standing by the window.", "thai": "เขายืนอยู่ข้างหน้าต่าง"}
{"word": "window", "english": "The window is part of a sliding design.", "thai": "หน้าต่างเป็นส่วนหนึ่งของดีไซน์บานเลื่อน"}
{"word": "window", "english": "I heard the window being opened.", "thai": "ฉันได้ยินเสียงหน้าต่างถูกเปิด"}
{"word": "window", "english": "The window is too foggy to see clearly.", "thai": "หน้าต่างมีฝ้ามากเกินกว่าจะมองเห็นชัดเจน"}
{"word": "window", "english": "She was placing flowers by the window.", "thai": "เธอกำลังวางดอกไม้ข้างหน้าต่าง"}
{"word": "window", "english": "The window is too stiff to close.", "thai": "หน้าต่างแข็งเกินไปที่จะปิด"}
{"word": "window", "english": "I need to replace the window frame.", "thai": "ฉันต้องเปลี่ยนกรอบหน้าต่าง"}
{"word": "window", "english": "The window is part of an antique set.", "thai": "หน้าต่างเป็นส่วนหนึ่งของชุดโบราณ"}
{"word": "window", "english": "He was leaning against the window.", "thai": "เขาพิงหน้าต่างอยู่"}
{"word": "window", "english": "The window is too scratched to repair.", "thai": "หน้าต่างมีรอยขีดข่วนมากเกินไปที่จะซ่อม"}
{"word": "window", "english": "I left my glasses on the window sill.", "thai": "ฉันวางแว่นตาไว้บนขอบหน้าต่าง"}
{"word": "window", "english": "The window is letting in too much light.", "thai": "หน้าต่างปล่อยให้แสงเข้ามามากเกินไป"}
{"word": "window", "english": "She was taping decorations to the window.", "thai": "เธอกำลังติดของตกแต่งที่หน้าต่าง"}
{"word": "window", "english": "The window is too wide for the room.", "thai": "หน้าต่างกว้างเกินไปสำหรับห้อง"}
{"word": "window", "english": "I heard a noise outside the window.", "thai": "ฉันได้ยินเสียงนอกหน้าต่าง"}
{"word": "window", "english": "The window is part of a double set.", "thai": "หน้าต่างเป็นส่วนหนึ่งของชุดคู่"}
{"word": "window", "english": "He was fixing the window latch.", "thai": "เขากำลังซ่อมสลักหน้าต่าง"}
{"word": "window", "english": "The window is too cold to touch.", "thai": "หน้าต่างเย็นเกินกว่าจะสัมผัส"}
{"word": "window", "english": "I need a window with better insulation.", "thai": "ฉันต้องการหน้าต่างที่มีฉนวนดีกว่า"}
{"word": "window", "english": "The window is covered with condensation.", "thai": "หน้าต่างเต็มไปด้วยไอน้ำ"}
{"word": "window", "english": "She was sitting by the window knitting.", "thai": "เธอนั่งถักนิตติ้งข้างหน้าต่าง"}
{"word": "window", "english": "The window is too tall for the blinds.", "thai": "หน้าต่างสูงเกินไปสำหรับม่านบังตา"}
{"word": "window", "english": "I saw a bug on the window.", "thai": "ฉันเห็นแมลงบนหน้าต่าง"}
{"word": "window", "english": "The window is part of a vintage design.", "thai": "หน้าต่างเป็นส่วนหนึ่งของดีไซน์วินเทจ"}
{"word": "window", "english": "He was polishing the window frame.", "thai": "เขากำลังขัดกรอบหน้าต่าง"}
{"word": "window", "english": "The window is too loose in the frame.", "thai": "หน้าต่างหลวมเกินไปในกรอบ"}
{"word": "window", "english": "I left a candle on the window sill.", "thai": "ฉันวางเทียนไว้บนขอบหน้าต่าง"}
{"word": "window", "english": "The window is perfect for my office.", "thai": "หน้าต่างเหมาะสำหรับสำนักงานของฉัน"}
{"word": "window", "english": "She was looking out the window at the stars.", "thai": "เธอกำลังมองดาวนอกหน้าต่าง"}
{"word": "window", "english": "The window is too dusty to see through.", "thai": "หน้าต่างมีฝุ่นมากเกินกว่าจะมองผ่านได้"}
{"word": "window", "english": "I need to repair the window screen.", "thai": "ฉันต้องซ่อมมุ้งลวดหน้าต่าง"}
{"word": "window", "english": "The window is part of a skylight design.", "thai": "หน้าต่างเป็นส่วนหนึ่งของดีไซน์ช่องแสง"}
{"word": "window", "english": "He was taping a poster to the window.", "thai": "เขากำลังติดโปสเตอร์ที่หน้าต่าง"}
{"word": "window", "english": "The window is too warped to close.", "thai": "หน้าต่างบิดงอเกินกว่าจะปิดได้"}
{"word": "window", "english": "I left my phone on the window sill.", "thai": "ฉันวางโทรศัพท์ไว้บนขอบหน้าต่าง"}
{"word": "window", "english": "The window is letting in a breeze.", "thai": "หน้าต่างปล่อยให้ลมพัดเข้ามา"}
{"word": "window", "english": "She was placing a lamp by the window.", "thai": "เธอกำลังวางโคมไฟข้างหน้าต่าง"}
{"word": "window", "english": "The window is too noisy when it opens.", "thai": "หน้าต่างส่งเสียงดังเกินไปเมื่อเปิด"}
{"word": "window", "english": "I need a window that slides easily.", "thai": "ฉันต้องการหน้าต่างที่เลื่อนได้ง่าย"}
{"word": "window", "english": "The window is covered with rain streaks.", "thai": "หน้าต่างเต็มไปด้วยรอยน้ำฝน"}
{"word": "window", "english": "He was standing outside the window.", "thai": "เขายืนอยู่นอกหน้าต่าง"}
{"word": "window", "english": "The window is part of a French design.", "thai": "หน้าต่างเป็นส่วนหนึ่งของดีไซน์สไตล์ฝรั่งเศส"}
{"word": "window", "english": "I saw a reflection in the window.", "thai": "ฉันเห็นภาพสะท้อนในหน้าต่าง"}
{"word": "window", "english": "The window is perfect for my bedroom.", "thai": "หน้าต่างเหมาะสำหรับห้องนอนของฉัน"}
