{"word": "stay up", "english": "I decided to stay up all night to finish my project.", "thai": "ฉันตัดสินใจอยู่ดึกทั้งคืนเพื่อทำโปรเจกต์ให้เสร็จ"}
{"word": "stay up", "english": "We should stay up and watch the meteor shower tonight.", "thai": "เราควรอยู่ดึกเพื่อดูฝนดาวตกคืนนี้"}
{"word": "stay up", "english": "Why do you always stay up so late playing video games?", "thai": "ทำไมคุณถึงอยู่ดึกเล่นวิดีโอเกมทุกครั้ง?"}
{"word": "stay up", "english": "I can’t stay up past midnight anymore; I’m too tired.", "thai": "ฉันอยู่ดึกเกินเที่ยงคืนไม่ได้แล้ว ฉันเหนื่อยเกินไป"}
{"word": "stay up", "english": "Let’s stay up and binge-watch that new series.", "thai": "มาอยู่ดึกดูซีรีส์ใหม่แบบมาราธอนกันเถอะ"}
{"word": "stay up", "english": "She stayed up to help me study for my exam.", "thai": "เธออยู่ดึกเพื่อช่วยฉันทบทวนสอบ"}
{"word": "stay up", "english": "If you stay up too late, you’ll be exhausted tomorrow.", "thai": "ถ้าคุณอยู่ดึกเกินไป คุณจะเหนื่อยมากพรุ่งนี้"}
{"word": "stay up", "english": "I’m going to stay up and finish this book tonight.", "thai": "ฉันจะอยู่ดึกเพื่ออ่านหนังสือเล่มนี้ให้จบคืนนี้"}
{"word": "stay up", "english": "He stayed up all night worrying about the results.", "thai": "เขาอยู่ดึกทั้งคืนเพราะกังวลเรื่องผลลัพธ์"}
{"word": "stay up", "english": "We stayed up talking about our dreams until dawn.", "thai": "เราอยู่ดึกคุยเรื่องความฝันจนถึงเช้า"}
{"word": "stay up", "english": "I don’t want to stay up, but this movie is too good.", "thai": "ฉันไม่อยากอยู่ดึก แต่หนังเรื่องนี้ดีเกินไป"}
{"word": "stay up", "english": "They stayed up to watch the election results live.", "thai": "พวกเขาอยู่ดึกเพื่อดูผลการเลือกตั้งแบบสด"}
{"word": "stay up", "english": "Can you stay up with me to finish this puzzle?", "thai": "คุณอยู่ดึกกับฉันเพื่อทำปริศนานี้ให้เสร็จได้ไหม?"}
{"word": "stay up", "english": "I stayed up late to catch up on emails.", "thai": "ฉันอยู่ดึกเพื่อตามอ่านอีเมล"}
{"word": "stay up", "english": "We’ll stay up and have a game night this weekend.", "thai": "เราจะอยู่ดึกและจัดคืนเล่นเกมในสุดสัปดาห์นี้"}
{"word": "stay up", "english": "She can’t stay up late because she has work early.", "thai": "เธออยู่ดึกไม่ได้เพราะต้องทำงานแต่เช้า"}
{"word": "stay up", "english": "I stayed up to see the sunrise with my friends.", "thai": "ฉันอยู่ดึกเพื่อดูพระอาทิตย์ขึ้นกับเพื่อนๆ"}
{"word": "stay up", "english": "Don’t stay up too late; you have school tomorrow.", "thai": "อย่าอยู่ดึกเกินไป คุณต้องไปโรงเรียนพรุ่งนี้"}
{"word": "stay up", "english": "He stayed up working on his art project.", "thai": "เขาอยู่ดึกเพื่อทำงานศิลปะของเขา"}
{"word": "stay up", "english": "Let’s stay up and talk about our plans for the trip.", "thai": "มาอยู่ดึกคุยเรื่องแผนการเดินทางกันเถอะ"}
{"word": "stay up", "english": "I stayed up to watch the game, and it was worth it.", "thai": "ฉันอยู่ดึกเพื่อดูเกม และมันคุ้มค่า"}
{"word": "stay up", "english": "They stayed up all night partying at the club.", "thai": "พวกเขาอยู่ดึกทั้งคืนเพื่อปาร์ตี้ที่คลับ"}
{"word": "stay up", "english": "I can stay up if you need someone to talk to.", "thai": "ฉันอยู่ดึกได้ถ้าคุณต้องการคนคุยด้วย"}
{"word": "stay up", "english": "She stayed up to bake cookies for the party.", "thai": "เธออยู่ดึกเพื่ออบคุกกี้สำหรับงานปาร์ตี้"}
{"word": "stay up", "english": "We stayed up late laughing at old videos.", "thai": "เราอยู่ดึกหัวเราะกับวิดีโอเก่าๆ"}
{"word": "stay up", "english": "I’m too excited to sleep, so I’ll stay up.", "thai": "ฉันตื่นเต้นเกินกว่าจะนอน เลยจะอยู่ดึก"}
{"word": "stay up", "english": "He stayed up to fix the computer before the deadline.", "thai": "เขาอยู่ดึกเพื่อซ่อมคอมพิวเตอร์ก่อนถึงกำหนด"}
{"word": "stay up", "english": "Let’s stay up and make some midnight snacks.", "thai": "มาอยู่ดึกทำของว่างเที่ยงคืนกันเถอะ"}
{"word": "stay up", "english": "I stayed up to listen to the new album release.", "thai": "ฉันอยู่ดึกเพื่อฟังอัลบั้มใหม่ที่ปล่อยออกมา"}
{"word": "stay up", "english": "They stayed up to plan the surprise party.", "thai": "พวกเขาอยู่ดึกเพื่อวางแผนงานปาร์ตี้เซอร์ไพรส์"}
{"word": "stay up", "english": "I can’t stay up late tonight; I’m exhausted.", "thai": "ฉันอยู่ดึกคืนนี้ไม่ได้ ฉันเหนื่อยมาก"}
{"word": "stay up", "english": "She stayed up to finish her homework.", "thai": "เธออยู่ดึกเพื่อทำการบ้านให้เสร็จ"}
{"word": "stay up", "english": "We stayed up watching horror movies all night.", "thai": "เราอยู่ดึกดูหนังสยองขวัญทั้งคืน"}
{"word": "stay up", "english": "I stayed up to call my friend overseas.", "thai": "ฉันอยู่ดึกเพื่อโทรหาเพื่อนที่อยู่ต่างประเทศ"}
{"word": "stay up", "english": "He stayed up late reading a thriller novel.", "thai": "เขาอยู่ดึกเพื่ออ่านนิยายระทึกขวัญ"}
{"word": "stay up", "english": "Let’s stay up and play some board games.", "thai": "มาอยู่ดึกเล่นเกมกระดานกันเถอะ"}
{"word": "stay up", "english": "I stayed up to watch the live concert stream.", "thai": "ฉันอยู่ดึกเพื่อดูสตรีมคอนเสิร์ตสด"}
{"word": "stay up", "english": "They stayed up to finish the group project.", "thai": "พวกเขาอยู่ดึกเพื่อทำโปรเจกต์กลุ่มให้เสร็จ"}
{"word": "stay up", "english": "I’m going to stay up and edit these photos.", "thai": "ฉันจะอยู่ดึกเพื่อตัดต่อรูปเหล่านี้"}
{"word": "stay up", "english": "She stayed up to practice her speech.", "thai": "เธออยู่ดึกเพื่อฝึกซ้อมการพูด"}
{"word": "stay up", "english": "We stayed up late chatting on the phone.", "thai": "เราอยู่ดึกคุยโทรศัพท์กัน"}
{"word": "stay up", "english": "I stayed up to catch the late-night talk show.", "thai": "ฉันอยู่ดึกเพื่อดูรายการทอล์กโชว์ดึก"}
{"word": "stay up", "english": "He stayed up to debug the code for his app.", "thai": "เขาอยู่ดึกเพื่อแก้บั๊กโค้ดสำหรับแอปของเขา"}
{"word": "stay up", "english": "Let’s stay up and stargaze in the backyard.", "thai": "มาอยู่ดึกดูดาวที่สวนหลังบ้านกันเถอะ"}
{"word": "stay up", "english": "I stayed up to help my sister with her essay.", "thai": "ฉันอยู่ดึกเพื่อช่วยน้องสาวเขียนเรียงความ"}
{"word": "stay up", "english": "They stayed up to watch the championship game.", "thai": "พวกเขาอยู่ดึกเพื่อดูเกมชิงแชมป์"}
{"word": "stay up", "english": "I can stay up if we’re having a deep conversation.", "thai": "ฉันอยู่ดึกได้ถ้าเราคุยเรื่องลึกซึ้ง"}
{"word": "stay up", "english": "She stayed up to sew her costume for the party.", "thai": "เธออยู่ดึกเพื่อเย็บชุดสำหรับงานปาร์ตี้"}
{"word": "stay up", "english": "We stayed up late planning our road trip.", "thai": "เราอยู่ดึกวางแผนทริปขับรถเที่ยว"}
{"word": "stay up", "english": "I stayed up to finish knitting a scarf.", "thai": "ฉันอยู่ดึกเพื่อถักผ้าพันคอให้เสร็จ"}
{"word": "stay up", "english": "He stayed up to watch the lunar eclipse.", "thai": "เขาอยู่ดึกเพื่อดูจันทรุปราคา"}
{"word": "stay up", "english": "Let’s stay up and have a karaoke night.", "thai": "มาอยู่ดึกจัดคืนคาราโอเกะกันเถอะ"}
{"word": "stay up", "english": "I stayed up to organize my desk.", "thai": "ฉันอยู่ดึกเพื่อจัดโต๊ะทำงาน"}
{"word": "stay up", "english": "They stayed up to rehearse for the play.", "thai": "พวกเขาอยู่ดึกเพื่อซ้อมละคร"}
{"word": "stay up", "english": "I’m going to stay up and write in my journal.", "thai": "ฉันจะอยู่ดึกเพื่อเขียนบันทึก"}
{"word": "stay up", "english": "She stayed up to paint her room.", "thai": "เธออยู่ดึกเพื่อทาสีห้อง"}
{"word": "stay up", "english": "We stayed up late decorating for the holidays.", "thai": "เราอยู่ดึกเพื่อตกแต่งบ้านสำหรับวันหยุด"}
{"word": "stay up", "english": "I stayed up to watch a documentary.", "thai": "ฉันอยู่ดึกเพื่อดูสารคดี"}
{"word": "stay up", "english": "He stayed up to prepare for his presentation.", "thai": "เขาอยู่ดึกเพื่อเตรียมงานนำเสนอ"}
{"word": "stay up", "english": "Let’s stay up and tell ghost stories.", "thai": "มาอยู่ดึกเล่าเรื่องผีกันเถอะ"}
{"word": "stay up", "english": "I stayed up to finish a crossword puzzle.", "thai": "ฉันอยู่ดึกเพื่อทำปริศนาอักษรไขว้ให้เสร็จ"}
{"word": "stay up", "english": "They stayed up to plan their wedding.", "thai": "พวกเขาอยู่ดึกเพื่อวางแผนงานแต่งงาน"}
{"word": "stay up", "english": "I can stay up if you want to keep chatting.", "thai": "ฉันอยู่ดึกได้ถ้าคุณอยากคุยต่อ"}
{"word": "stay up", "english": "She stayed up to learn a new recipe.", "thai": "เธออยู่ดึกเพื่อเรียนรู้สูตรอาหารใหม่"}
{"word": "stay up", "english": "We stayed up late playing card games.", "thai": "เราอยู่ดึกเล่นเกมไพ่"}
{"word": "stay up", "english": "I stayed up to watch the fireworks show.", "thai": "ฉันอยู่ดึกเพื่อดูการแสดงพลุ"}
{"word": "stay up", "english": "He stayed up to fix his bike.", "thai": "เขาอยู่ดึกเพื่อซ่อมจักรยาน"}
{"word": "stay up", "english": "Let’s stay up and make a scrapbook.", "thai": "มาอยู่ดึกทำสมุดภาพกันเถอะ"}
{"word": "stay up", "english": "I stayed up to catch up on my favorite podcast.", "thai": "ฉันอยู่ดึกเพื่อตามฟังพอดแคสต์ที่ชอบ"}
{"word": "stay up", "english": "They stayed up to finish a jigsaw puzzle.", "thai": "พวกเขาอยู่ดึกเพื่อต่อจิ๊กซอว์ให้เสร็จ"}
{"word": "stay up", "english": "I’m going to stay up and clean the house.", "thai": "ฉันจะอยู่ดึกเพื่อทำความสะอาดบ้าน"}
{"word": "stay up", "english": "She stayed up to practice her guitar.", "thai": "เธออยู่ดึกเพื่อฝึกกีตาร์"}
{"word": "stay up", "english": "We stayed up late reminiscing about high school.", "thai": "เราอยู่ดึกนึกถึงความหลังสมัยมัธยม"}
{"word": "stay up", "english": "I stayed up to watch a classic movie.", "thai": "ฉันอยู่ดึกเพื่อดูหนังคลาสสิก"}
{"word": "stay up", "english": "He stayed up to study for his math test.", "thai": "เขาอยู่ดึกเพื่ออ่านหนังสือสอบคณิตศาสตร์"}
{"word": "stay up", "english": "Let’s stay up and bake some cupcakes.", "thai": "มาอยู่ดึกอบคัพเค้กกันเถอะ"}
{"word": "stay up", "english": "I stayed up to plan my birthday party.", "thai": "ฉันอยู่ดึกเพื่อวางแผนงานวันเกิด"}
{"word": "stay up", "english": "They stayed up to watch a comedy special.", "thai": "พวกเขาอยู่ดึกเพื่อดูรายการตลกพิเศษ"}
{"word": "stay up", "english": "I can stay up to help you with your project.", "thai": "ฉันอยู่ดึกเพื่อช่วยคุณทำโปรเจกต์ได้"}
{"word": "stay up", "english": "She stayed up to write a blog post.", "thai": "เธออยู่ดึกเพื่อเขียนโพสต์บล็อก"}
{"word": "stay up", "english": "We stayed up late catching up after years apart.", "thai": "เราอยู่ดึกเพื่ออัปเดตชีวิตหลังจากห่างกันหลายปี"}
{"word": "stay up", "english": "I stayed up to finish a painting.", "thai": "ฉันอยู่ดึกเพื่อวาดภาพให้เสร็จ"}
{"word": "stay up", "english": "He stayed up to watch a sci-fi marathon.", "thai": "เขาอยู่ดึกเพื่อดูมาราธอนหนังไซไฟ"}
{"word": "stay up", "english": "Let’s stay up and have a movie marathon.", "thai": "มาอยู่ดึกดูหนังมาราธอนกันเถอะ"}
{"word": "stay up", "english": "I stayed up to organize my photo collection.", "thai": "ฉันอยู่ดึกเพื่อจัดระเบียบคอลเลกชันรูปภาพ"}
{"word": "stay up", "english": "They stayed up to prepare for the charity event.", "thai": "พวกเขาอยู่ดึกเพื่อเตรียมงานการกุศล"}
{"word": "stay up", "english": "I’m going to stay up and read some articles.", "thai": "ฉันจะอยู่ดึกเพื่ออ่านบทความ"}
{"word": "stay up", "english": "She stayed up to practice her dance routine.", "thai": "เธออยู่ดึกเพื่อฝึกท่าเต้น"}
{"word": "stay up", "english": "We stayed up late discussing politics.", "thai": "เราอยู่ดึกคุยเรื่องการเมือง"}
{"word": "stay up", "english": "I stayed up to watch a live sports event.", "thai": "ฉันอยู่ดึกเพื่อดูการแข่งขันกีฬาสด"}
{"word": "stay up", "english": "He stayed up to finish his novel draft.", "thai": "เขาอยู่ดึกเพื่อเขียนร่างนิยายให้เสร็จ"}
{"word": "stay up", "english": "Let’s stay up and play some online games.", "thai": "มาอยู่ดึกเล่นเกมออนไลน์กันเถอะ"}
{"word": "stay up", "english": "I stayed up to sort through old letters.", "thai": "ฉันอยู่ดึกเพื่อคัดแยกจดหมายเก่าๆ"}
{"word": "stay up", "english": "They stayed up to watch a meteor shower.", "thai": "พวกเขาอยู่ดึกเพื่อดูฝนดาวตก"}
{"word": "stay up", "english": "I can stay up to help you pack for your trip.", "thai": "ฉันอยู่ดึกเพื่อช่วยคุณเก็บกระเป๋าเดินทางได้"}
{"word": "stay up", "english": "She stayed up to finish her knitting project.", "thai": "เธออยู่ดึกเพื่อทำโปรเจกต์ถักนิตติ้งให้เสร็จ"}
{"word": "stay up", "english": "We stayed up late singing around the campfire.", "thai": "เราอยู่ดึกร้องเพลงรอบกองไฟ"}
{"word": "stay up", "english": "I stayed up to watch a new TV episode.", "thai": "ฉันอยู่ดึกเพื่อดูตอนใหม่ของรายการทีวี"}
{"word": "stay up", "english": "He stayed up to practice his lines for the play.", "thai": "เขาอยู่ดึกเพื่อฝึกบทสำหรับละคร"}
{"word": "sleep in", "english": "I’m going to sleep in tomorrow since it’s Saturday.", "thai": "ฉันจะนอนตื่นสายพรุ่งนี้เพราะเป็นวันเสาร์"}
{"word": "sleep in", "english": "She loves to sleep in on weekends.", "thai": "เธอชอบนอนตื่นสายในวันหยุดสุดสัปดาห์"}
{"word": "sleep in", "english": "Don’t call me early; I want to sleep in.", "thai": "อย่าโทรหาฉันเช้าๆ ฉันอยากนอนตื่นสาย"}
{"word": "sleep in", "english": "He slept in and missed his morning class.", "thai": "เขานอนตื่นสายและพลาดคลาสเช้า"}
{"word": "sleep in", "english": "Let’s sleep in after staying up so late.", "thai": "มานอนตื่นสายกันเถอะหลังจากอยู่ดึกมาก"}
{"word": "sleep in", "english": "I can finally sleep in now that the project is done.", "thai": "ในที่สุดฉันก็นอนตื่นสายได้เพราะโปรเจกต์เสร็จแล้ว"}
{"word": "sleep in", "english": "They slept in and forgot about the brunch plans.", "thai": "พวกเขานอนตื่นสายและลืมแผนกินบรันช์"}
{"word": "sleep in", "english": "I’m too tired to get up early, so I’ll sleep in.", "thai": "ฉันเหนื่อยเกินกว่าจะตื่นเช้า เลยจะนอนตื่นสาย"}
{"word": "sleep in", "english": "She slept in because she was up all night studying.", "thai": "เธอนอนตื่นสายเพราะอ่านหนังสือทั้งคืน"}
{"word": "sleep in", "english": "We can sleep in tomorrow; there’s no rush.", "thai": "เรานอนตื่นสายได้พรุ่งนี้ ไม่ต้องรีบ"}
{"word": "sleep in", "english": "I slept in and missed the sunrise hike.", "thai": "ฉันนอนตื่นสายและพลาดการเดินป่าเพื่อดูพระอาทิตย์ขึ้น"}
{"word": "sleep in", "english": "He always sleeps in when he’s on vacation.", "thai": "เขามักจะนอนตื่นสายตอนไปพักร้อน"}
{"word": "sleep in", "english": "Let me sleep in; I had a rough week.", "thai": "ให้ฉันนอนตื่นสายหน่อย ฉันมีสัปดาห์ที่หนัก"}
{"word": "sleep in", "english": "They slept in after the late-night party.", "thai": "พวกเขานอนตื่นสายหลังจากปาร์ตี้ดึก"}
{"word": "sleep in", "english": "I want to sleep in, but I have an early meeting.", "thai": "ฉันอยากนอนตื่นสาย แต่มีประชุมเช้า"}
{"word": "sleep in", "english": "She slept in and was late for her appointment.", "thai": "เธอนอนตื่นสายและไปนัดช้า"}
{"word": "sleep in", "english": "We’ll sleep in and have a lazy Sunday.", "thai": "เราจะนอนตื่นสายและมีวันอาทิตย์แบบขี้เกียจ"}
{"word": "sleep in", "english": "I slept in because I forgot to set my alarm.", "thai": "ฉันนอนตื่นสายเพราะลืมตั้งนาฬิกาปลุก"}
{"word": "sleep in", "english": "He’s planning to sleep in after his night shift.", "thai": "เขาวางแผนจะนอนตื่นสายหลังจากทำงานกะดึก"}
{"word": "sleep in", "english": "Let’s sleep in and skip the morning workout.", "thai": "มานอนตื่นสายและข้ามการออกกำลังกายตอนเช้ากัน"}
{"word": "sleep in", "english": "I slept in and missed the bus to work.", "thai": "ฉันนอนตื่นสายและพลาดรถบัสไปทำงาน"}
{"word": "sleep in", "english": "She loves to sleep in when it’s raining outside.", "thai": "เธอชอบนอนตื่นสายตอนฝนตก"}
{"word": "sleep in", "english": "They slept in and started the day slowly.", "thai": "พวกเขานอนตื่นสายและเริ่มวันแบบช้าๆ"}
{"word": "sleep in", "english": "I can’t sleep in because my kids wake up early.", "thai": "ฉันนอนตื่นสายไม่ได้เพราะลูกๆตื่นเช้า"}
{"word": "sleep in", "english": "He slept in after a long day of traveling.", "thai": "เขานอนตื่นสายหลังจากเดินทางมาทั้งวัน"}
{"word": "sleep in", "english": "Let’s sleep in and have breakfast in bed.", "thai": "มานอนตื่นสายและกินอาหารเช้าบนเตียงกัน"}
{"word": "sleep in", "english": "I slept in because I was feeling under the weather.", "thai": "ฉันนอนตื่นสายเพราะรู้สึกไม่ค่อยสบาย"}
{"word": "sleep in", "english": "She slept in and missed her yoga class.", "thai": "เธอนอนตื่นสายและพลาดคลาสโยคะ"}
{"word": "sleep in", "english": "We slept in and enjoyed a relaxed morning.", "thai": "เรานอนตื่นสายและเพลิดเพลินกับเช้าที่ผ่อนคลาย"}
{"word": "sleep in", "english": "I want to sleep in, but I have errands to run.", "thai": "ฉันอยากนอนตื่นสาย แต่มีธุระต้องทำ"}
{"word": "sleep in", "english": "He slept in after staying up to watch the game.", "thai": "เขานอนตื่นสายหลังจากอยู่ดึกดูเกม"}
{"word": "sleep in", "english": "Let’s sleep in and watch movies all day.", "thai": "มานอนตื่นสายและดูหนังทั้งวันกัน"}
{"word": "sleep in", "english": "I slept in and forgot about my dentist appointment.", "thai": "ฉันนอนตื่นสายและลืมนัดทันตแพทย์"}
{"word": "sleep in", "english": "She slept in because she had no plans today.", "thai": "เธอนอนตื่นสายเพราะวันนี้ไม่มีแผน"}
{"word": "sleep in", "english": "They slept in after a fun night out.", "thai": "พวกเขานอนตื่นสายหลังจากเที่ยวสนุกทั้งคืน"}
{"word": "sleep in", "english": "I can sleep in tomorrow since I’m on vacation.", "thai": "ฉันนอนตื่นสายได้พรุ่งนี้เพราะฉันพักร้อน"}
{"word": "sleep in", "english": "He slept in and missed his flight.", "thai": "เขานอนตื่นสายและพลาดเที่ยวบิน"}
{"word": "sleep in", "english": "Let’s sleep in and have a late brunch.", "thai": "มานอนตื่นสายและกินบรันช์ตอนสายกัน"}
{"word": "sleep in", "english": "I slept in because the bed was too cozy.", "thai": "ฉันนอนตื่นสายเพราะเตียงนอนสบายเกินไป"}
{"word": "sleep in", "english": "She slept in and skipped her morning run.", "thai": "เธอนอนตื่นสายและข้ามการวิ่งตอนเช้า"}
{"word": "sleep in", "english": "We slept in and missed the early market.", "thai": "เรานอนตื่นสายและพลาดตลาดเช้า"}
{"word": "sleep in", "english": "I want to sleep in, but my dog won’t let me.", "thai": "ฉันอยากนอนตื่นสาย แต่หมาของฉันไม่ยอม"}
{"word": "sleep in", "english": "He slept in after a late-night study session.", "thai": "เขานอนตื่นสายหลังจากอ่านหนังสือดึก"}
{"word": "sleep in", "english": "Let’s sleep in and order takeout for lunch.", "thai": "มานอนตื่นสายและสั่งอาหารเดลิเวอรี่กินตอนเที่ยง"}
{"word": "sleep in", "english": "I slept in because I stayed up watching movies.", "thai": "ฉันนอนตื่นสายเพราะอยู่ดึกดูหนัง"}
{"word": "sleep in", "english": "She slept in and felt so refreshed.", "thai": "เธอนอนตื่นสายและรู้สึกสดชื่นมาก"}
{"word": "sleep in", "english": "They slept in after hosting a big party.", "thai": "พวกเขานอนตื่นสายหลังจากจัดปาร์ตี้ใหญ่"}
{"word": "sleep in", "english": "I can’t sleep in because I have to catch a train.", "thai": "ฉันนอนตื่นสายไม่ได้เพราะต้องขึ้นรถไฟ"}
{"word": "sleep in", "english": "He slept in and was late for his shift.", "thai": "เขานอนตื่นสายและไปทำงานกะช้า"}
{"word": "sleep in", "english": "Let’s sleep in and spend the day relaxing.", "thai": "มานอนตื่นสายและใช้เวลาทั้งวันพักผ่อน"}
{"word": "sleep in", "english": "I slept in and missed my morning coffee run.", "thai": "ฉันนอนตื่นสายและพลาดไปซื้อกาแฟตอนเช้า"}
{"word": "sleep in", "english": "She slept in because she was jet-lagged.", "thai": "เธอนอนตื่นสายเพราะเจ็ทแล็ก"}
{"word": "sleep in", "english": "We slept in and started the day with pancakes.", "thai": "เรานอนตื่นสายและเริ่มวันด้วยแพนเค้ก"}
{"word": "sleep in", "english": "I want to sleep in, but I have a deadline.", "thai": "ฉันอยากนอนตื่นสาย แต่มีงานต้องส่ง"}
{"word": "sleep in", "english": "He slept in after a long week at work.", "thai": "เขานอนตื่นสายหลังจากทำงานหนักมาทั้งสัปดาห์"}
{"word": "sleep in", "english": "Let’s sleep in and go hiking in the afternoon.", "thai": "มานอนตื่นสายและไปเดินป่าตอนบ่าย"}
{"word": "sleep in", "english": "I slept in because it was so cold outside.", "thai": "ฉันนอนตื่นสายเพราะข้างนอกหนาวมาก"}
{"word": "sleep in", "english": "She slept in and missed her online class.", "thai": "เธอนอนตื่นสายและพลาดคลาสออนไลน์"}
{"word": "sleep in", "english": "They slept in after a late-night road trip.", "thai": "พวกเขานอนตื่นสายหลังจากขับรถเที่ยวดึก"}
{"word": "sleep in", "english": "I can sleep in since my boss gave me the day off.", "thai": "ฉันนอนตื่นสายได้เพราะเจ้านายให้หยุด"}
{"word": "sleep in", "english": "He slept in and forgot his gym session.", "thai": "เขานอนตื่นสายและลืมไปยิม"}
{"word": "sleep in", "english": "Let’s sleep in and have a cozy movie day.", "thai": "มานอนตื่นสายและจัดวันดูหนังแบบอบอุ่น"}
{"word": "sleep in", "english": "I slept in because I was up late reading.", "thai": "ฉันนอนตื่นสายเพราะอ่านหนังสือดึก"}
{"word": "sleep in", "english": "She slept in and felt much better afterward.", "thai": "เธอนอนตื่นสายและรู้สึกดีขึ้นมาก"}
{"word": "sleep in", "english": "We slept in and missed the morning ferry.", "thai": "เรานอนตื่นสายและพลาดเรือข้ามฟากตอนเช้า"}
{"word": "sleep in", "english": "I want to sleep in, but I have to walk the dog.", "thai": "ฉันอยากนอนตื่นสาย แต่ต้องพาหมาไปเดินเล่น"}
{"word": "sleep in", "english": "He slept in after staying up to finish his project.", "thai": "เขานอนตื่นสายหลังจากอยู่ดึกทำโปรเจกต์"}
{"word": "sleep in", "english": "Let’s sleep in and make a big breakfast.", "thai": "มานอนตื่นสายและทำอาหารเช้ามื้อใหญ่"}
{"word": "sleep in", "english": "I slept in and missed my morning workout.", "thai": "ฉันนอนตื่นสายและพลาดออกกำลังกายตอนเช้า"}
{"word": "sleep in", "english": "She slept in because she was exhausted.", "thai": "เธอนอนตื่นสายเพราะเหนื่อยมาก"}
{"word": "sleep in", "english": "They slept in after a late-night concert.", "thai": "พวกเขานอนตื่นสายหลังจากไปคอนเสิร์ตดึก"}
{"word": "sleep in", "english": "I can sleep in because it’s a holiday tomorrow.", "thai": "ฉันนอนตื่นสายได้เพราะพรุ่งนี้เป็นวันหยุด"}
{"word": "sleep in", "english": "He slept in and was late for his meeting.", "thai": "เขานอนตื่นสายและไปประชุมช้า"}
{"word": "sleep in", "english": "Let’s sleep in and go to the beach later.", "thai": "มานอนตื่นสายและไปทะเลตอนบ่าย"}
{"word": "sleep in", "english": "I slept in because I stayed up gaming.", "thai": "ฉันนอนตื่นสายเพราะอยู่ดึกเล่นเกม"}
{"word": "sleep in", "english": "She slept in and missed her train.", "thai": "เธอนอนตื่นสายและพลาดรถไฟ"}
{"word": "sleep in", "english": "We slept in and had a slow morning at home.", "thai": "เรานอนตื่นสายและมีเช้าที่ช้าๆที่บ้าน"}
{"word": "sleep in", "english": "I want to sleep in, but I have to finish my homework.", "thai": "ฉันอยากนอนตื่นสาย แต่ต้องทำการบ้านให้เสร็จ"}
{"word": "sleep in", "english": "He slept in after a long day at the office.", "thai": "เขานอนตื่นสายหลังจากทำงานหนักที่ออฟฟิศ"}
{"word": "sleep in", "english": "Let’s sleep in and visit the museum later.", "thai": "มานอนตื่นสายและไปพิพิธภัณฑ์ตอนบ่าย"}
{"word": "sleep in", "english": "I slept in because I was up late chatting.", "thai": "ฉันนอนตื่นสายเพราะอยู่ดึกคุยแชท"}
{"word": "sleep in", "english": "She slept in and felt super relaxed.", "thai": "เธอนอนตื่นสายและรู้สึกผ่อนคลายสุดๆ"}
{"word": "sleep in", "english": "They slept in after a night of dancing.", "thai": "พวกเขานอนตื่นสายหลังจากเต้นทั้งคืน"}
{"word": "sleep in", "english": "I can sleep in since my class got canceled.", "thai": "ฉันนอนตื่นสายได้เพราะคลาสถูกยกเลิก"}
{"word": "sleep in", "english": "He slept in and missed his morning call.", "thai": "เขานอนตื่นสายและพลาดสายตอนเช้า"}
{"word": "sleep in", "english": "Let’s sleep in and have a picnic in the afternoon.", "thai": "มานอนตื่นสายและไปปิกนิกตอนบ่าย"}
{"word": "sleep in", "english": "I slept in because I was up late painting.", "thai": "ฉันนอนตื่นสายเพราะอยู่ดึกวาดภาพ"}
{"word": "sleep in", "english": "She slept in and skipped her morning errands.", "thai": "เธอนอนตื่นสายและข้ามธุระตอนเช้า"}
{"word": "sleep in", "english": "We slept in and missed the early movie show.", "thai": "เรานอนตื่นสายและพลาดรอบหนังเช้า"}
{"word": "sleep in", "english": "I want to sleep in, but I have to babysit.", "thai": "ฉันอยากนอนตื่นสาย แต่ต้องดูแลเด็ก"}
{"word": "sleep in", "english": "He slept in after a late-night rehearsal.", "thai": "เขานอนตื่นสายหลังจากซ้อมดึก"}
{"word": "sleep in", "english": "Let’s sleep in and make homemade pizza for lunch.", "thai": "มานอนตื่นสายและทำพิซซ่าโฮมเมดกินตอนเที่ยง"}
{"word": "sleep in", "english": "I slept in because I stayed up writing.", "thai": "ฉันนอนตื่นสายเพราะอยู่ดึกเขียนงาน"}
{"word": "sleep in", "english": "She slept in and missed her workout class.", "thai": "เธอนอนตื่นสายและพลาดคลาสออกกำลังกาย"}
{"word": "sleep in", "english": "They slept in after a night of board games.", "thai": "พวกเขานอนตื่นสายหลังจากเล่นเกมกระดานทั้งคืน"}
{"word": "sleep in", "english": "I can sleep in because I finished my work early.", "thai": "ฉันนอนตื่นสายได้เพราะทำงานเสร็จเร็ว"}
{"word": "sleep in", "english": "He slept in and was late for his interview.", "thai": "เขานอนตื่นสายและไปสัมภาษณ์งานช้า"}
{"word": "sleep in", "english": "Let’s sleep in and go shopping in the afternoon.", "thai": "มานอนตื่นสายและไปช็อปปิ้งตอนบ่าย"}
{"word": "sleep in", "english": "I slept in because I was up late editing photos.", "thai": "ฉันนอนตื่นสายเพราะอยู่ดึกตัดต่อรูป"}
{"word": "work out", "english": "I try to work out at the gym three times a week.", "thai": "ฉันพยายามออกกำลังกายที่ยิมสามครั้งต่อสัปดาห์"}
{"word": "work out", "english": "Let’s work out a plan to finish this project on time.", "thai": "มาวางแผนเพื่อให้โปรเจกต์นี้เสร็จทันเวลากัน"}
{"word": "work out", "english": "Things will work out; don’t worry too much.", "thai": "ทุกอย่างจะลงตัว ไม่ต้องกังวลมาก"}
{"word": "work out", "english": "She works out every morning to stay in shape.", "thai": "เธอออกกำลังกายทุกเช้าเพื่อรักษาหุ่น"}
{"word": "work out", "english": "I hope our schedule conflicts work out before the trip.", "thai": "ฉันหวังว่าปัญหาตารางเวลาจะคลี่คลายก่อนทริป"}
{"word": "work out", "english": "He’s been trying to work out to build more muscle.", "thai": "เขาเพียรออกกำลังกายเพื่อสร้างกล้ามเนื้อ"}
{"word": "work out", "english": "We need to work out the details of the party.", "thai": "เราต้องจัดการรายละเอียดของงานปาร์ตี้"}
{"word": "work out", "english": "I’m sure everything will work out in the end.", "thai": "ฉันแน่ใจว่าทุกอย่างจะลงตัวในที่สุด"}
{"word": "work out", "english": "They work out together at the park every weekend.", "thai": "พวกเขาออกกำลังกายด้วยกันที่สวนสาธารณะทุกสุดสัปดาห์"}
{"word": "work out", "english": "Let’s work out a budget for our vacation.", "thai": "มาจัดงบประมาณสำหรับวันหยุดของเรากัน"}
{"word": "work out", "english": "I didn’t think it would work out, but it did.", "thai": "ฉันไม่คิดว่ามันจะสำเร็จ แต่ก็สำเร็จ"}
{"word": "work out", "english": "She’s working out to prepare for the marathon.", "thai": "เธอกำลังออกกำลังกายเพื่อเตรียมตัววิ่งมาราธอน"}
{"word": "work out", "english": "We need to work out who’s driving to the event.", "thai": "เราต้องตกลงว่าใครจะขับรถไปงาน"}
{"word": "work out", "english": "I’m confident this deal will work out perfectly.", "thai": "ฉันมั่นใจว่าดีลนี้จะลงตัวอย่างสมบูรณ์"}
{"word": "work out", "english": "He works out at home with a set of dumbbells.", "thai": "เขาออกกำลังกายที่บ้านด้วยดัมเบล"}
{"word": "work out", "english": "Let’s work out a solution to this problem.", "thai": "มาแก้ปัญหานี้ด้วยกัน"}
{"word": "work out", "english": "I hope my new job works out as planned.", "thai": "ฉันหวังว่างานใหม่จะเป็นไปตามแผน"}
{"word": "work out", "english": "They’re working out at the new fitness center.", "thai": "พวกเขากำลังออกกำลังกายที่ศูนย์ฟิตเนสแห่งใหม่"}
{"word": "work out", "english": "We’ll work out the logistics for the move tomorrow.", "thai": "เราจะจัดการเรื่องการย้ายของพรุ่งนี้"}
{"word": "work out", "english": "It didn’t work out between them, so they broke up.", "thai": "มันไม่ลงตัวระหว่างพวกเขา เลยเลิกกัน"}
{"word": "work out", "english": "I work out in the evenings to relieve stress.", "thai": "ฉันออกกำลังกายตอนเย็นเพื่อคลายเครียด"}
{"word": "work out", "english": "Let’s work out how to split the bill fairly.", "thai": "มาแบ่งบิลกันอย่างยุติธรรม"}
{"word": "work out", "english": "I’m sure your plans will work out beautifully.", "thai": "ฉันแน่ใจว่าแผนของคุณจะออกมาดีเยี่ยม"}
{"word": "work out", "english": "She works out with a personal trainer twice a week.", "thai": "เธอออกกำลังกายกับเทรนเนอร์ส่วนตัวสองครั้งต่อสัปดาห์"}
{"word": "work out", "english": "We need to work out a compromise on this issue.", "thai": "เราต้องหาทางประนีประนอมในเรื่องนี้"}
{"word": "work out", "english": "The new system didn’t work out as expected.", "thai": "ระบบใหม่ไม่ได้ผลตามที่คาด"}
{"word": "work out", "english": "He works out by running along the beach.", "thai": "เขาออกกำลังกายด้วยการวิ่งตามชายหาด"}
{"word": "work out", "english": "Let’s work out the schedule for next week.", "thai": "มาจัดตารางสำหรับสัปดาห์หน้าสิ"}
{"word": "work out", "english": "I hope this relationship works out for them.", "thai": "ฉันหวังว่าความสัมพันธ์นี้จะไปได้ดีสำหรับพวกเขา"}
{"word": "work out", "english": "I work out early in the morning to start my day.", "thai": "ฉันออกกำลังกายตอนเช้าเพื่อเริ่มวัน"}
{"word": "work out", "english": "We’ll work out the payment plan tomorrow.", "thai": "เราจะจัดการแผนการชำระเงินพรุ่งนี้"}
{"word": "work out", "english": "It’ll work out; just give it some time.", "thai": "มันจะลงตัว แค่ให้เวลาหน่อย"}
{"word": "work out", "english": "She’s working out to improve her stamina.", "thai": "เธอกำลังออกกำลังกายเพื่อเพิ่มความอึด"}
{"word": "work out", "english": "Let’s work out a deal that benefits both sides.", "thai": "มาทำข้อตกลงที่เป็นประโยชน์ทั้งสองฝ่าย"}
{"word": "work out", "english": "The plan didn’t work out, so we need a new one.", "thai": "แผนนี้ไม่สำเร็จ เราต้องหาแผนใหม่"}
{"word": "work out", "english": "They work out together to stay motivated.", "thai": "พวกเขาออกกำลังกายด้วยกันเพื่อรักษาแรงจูงใจ"}
{"word": "work out", "english": "We need to work out what went wrong.", "thai": "เราต้องหาว่าอะไรผิดพลาด"}
{"word": "work out", "english": "I’m hoping this investment will work out well.", "thai": "ฉันหวังว่าการลงทุนนี้จะได้ผลดี"}
{"word": "work out", "english": "He works out with a yoga class on weekends.", "thai": "เขาออกกำลังกายกับคลาสโยคะในวันหยุด"}
{"word": "work out", "english": "Let’s work out the menu for the dinner party.", "thai": "มาจัดเมนูสำหรับงานเลี้ยงมื้อค่ำ"}
{"word": "work out", "english": "I think this will work out better than we thought.", "thai": "ฉันคิดว่ามันจะออกมาดีกว่าที่เราคิด"}
{"word": "work out", "english": "She works out by swimming laps every day.", "thai": "เธอออกกำลังกายด้วยการว่ายน้ำทุกวัน"}
{"word": "work out", "english": "We’ll work out the travel itinerary tonight.", "thai": "เราจะจัดกำหนดการเดินทางคืนนี้"}
{"word": "work out", "english": "The job didn’t work out, so he’s looking again.", "thai": "งานนั้นไม่ลงตัว เขากำลังหางานใหม่"}
{"word": "work out", "english": "I work out to music to make it more fun.", "thai": "ฉันออกกำลังกายพร้อมฟังเพลงเพื่อให้สนุกขึ้น"}
{"word": "work out", "english": "Let’s work out a way to share the workload.", "thai": "มาหาวิธีแบ่งงานกัน"}
{"word": "work out", "english": "I’m sure it’ll work out if we stay patient.", "thai": "ฉันแน่ใจว่ามันจะลงตัวถ้าเราอดทน"}
{"word": "work out", "english": "He works out at the community center.", "thai": "เขาออกกำลังกายที่ศูนย์ชุมชน"}
{"word": "work out", "english": "We need to work out the seating arrangement.", "thai": "เราต้องจัดที่นั่ง"}
{"word": "work out", "english": "I hope this decision works out for everyone.", "thai": "ฉันหวังว่าการตัดสินใจนี้จะดีสำหรับทุกคน"}
{"word": "work out", "english": "She works out with a jump rope for cardio.", "thai": "เธอออกกำลังกายด้วยเชือกกระโดดเพื่อคาร์ดิโอ"}
{"word": "work out", "english": "Let’s work out a time to meet next week.", "thai": "มาหาเวลานัดเจอกันสัปดาห์หน้า"}
{"word": "work out", "english": "The experiment didn’t work out as planned.", "thai": "การทดลองไม่เป็นไปตามแผน"}
{"word": "work out", "english": "They work out in the backyard with kettlebells.", "thai": "พวกเขาออกกำลังกายที่สวนหลังบ้านด้วยกาต้มน้ำ"}
{"word": "work out", "english": "We’ll work out the contract terms tomorrow.", "thai": "เราจะจัดการเงื่อนไขสัญญาพรุ่งนี้"}
{"word": "work out", "english": "I’m optimistic that it’ll work out fine.", "thai": "ฉันมองโลกในแง่ดีว่ามันจะลงตัว"}
{"word": "work out", "english": "I work out to feel stronger every day.", "thai": "ฉันออกกำลังกายเพื่อรู้สึกแข็งแรงขึ้นทุกวัน"}
{"word": "work out", "english": "Let’s work out how to fix this issue.", "thai": "มาแก้ไขปัญหานี้กัน"}
{"word": "work out", "english": "The new strategy should work out well.", "thai": "กลยุทธ์ใหม่น่าจะได้ผลดี"}
{"word": "work out", "english": "She works out by cycling through the park.", "thai": "เธอออกกำลังกายด้วยการปั่นจักรยานในสวน"}
{"word": "work out", "english": "We need to work out the project timeline.", "thai": "เราต้องจัดไทม์ไลน์ของโปรเจกต์"}
{"word": "work out", "english": "I hope this plan works out for the team.", "thai": "ฉันหวังว่าแผนนี้จะได้ผลสำหรับทีม"}
{"word": "work out", "english": "He works out to stay healthy and fit.", "thai": "เขาออกกำลังกายเพื่อสุขภาพและความฟิต"}
{"word": "work out", "english": "Let’s work out a fair division of chores.", "thai": "มาจัดแบ่งงานบ้านอย่างยุติธรรม"}
{"word": "work out", "english": "The meeting didn’t work out as we hoped.", "thai": "การประชุมไม่เป็นไปตามที่หวัง"}
{"word": "work out", "english": "I work out with a fitness app at home.", "thai": "ฉันออกกำลังกายด้วยแอปฟิตเนสที่บ้าน"}
{"word": "work out", "english": "We’ll work out the delivery schedule later.", "thai": "เราจะจัดการตารางส่งของทีหลัง"}
{"word": "work out", "english": "I think this will work out better than last time.", "thai": "ฉันคิดว่าครั้งนี้จะดีกว่าครั้งก่อน"}
{"word": "work out", "english": "She works out by doing Pilates every day.", "thai": "เธอออกกำลังกายด้วยการทำพิลาทิสทุกวัน"}
{"word": "work out", "english": "Let’s work out a way to save money.", "thai": "มาหาวิธีประหยัดเงินกัน"}
{"word": "work out", "english": "The negotiations didn’t work out this time.", "thai": "การเจรจาครั้งนี้ไม่ลงตัว"}
{"word": "work out", "english": "They work out together to train for a race.", "thai": "พวกเขาออกกำลังกายด้วยกันเพื่อฝึกซ้อมแข่งขัน"}
{"word": "work out", "english": "We need to work out the event’s budget.", "thai": "เราต้องจัดงบประมาณของงาน"}
{"word": "work out", "english": "I’m sure it’ll work out with a bit of effort.", "thai": "ฉันแน่ใจว่ามันจะลงตัวถ้าพยายามหน่อย"}
{"word": "work out", "english": "He works out by lifting weights at the gym.", "thai": "เขาออกกำลังกายด้วยการยกน้ำหนักที่ยิม"}
{"word": "work out", "english": "Let’s work out a plan for the weekend.", "thai": "มาวางแผนสำหรับสุดสัปดาห์"}
{"word": "work out", "english": "The new design should work out perfectly.", "thai": "ดีไซน์ใหม่น่าจะลงตัวสุดๆ"}
{"word": "work out", "english": "I work out in the park to get fresh air.", "thai": "ฉันออกกำลังกายในสวนเพื่อสูดอากาศบริสุทธิ์"}
{"word": "work out", "english": "We’ll work out the room assignments later.", "thai": "เราจะจัดการเรื่องการแบ่งห้องทีหลัง"}
{"word": "work out", "english": "I hope this move works out for our family.", "thai": "ฉันหวังว่าการย้ายครั้งนี้จะดีสำหรับครอบครัว"}
{"word": "work out", "english": "She works out to improve her flexibility.", "thai": "เธอออกกำลังกายเพื่อเพิ่มความยืดหยุ่น"}
{"word": "work out", "english": "Let’s work out a deal for the car.", "thai": "มาทำข้อตกลงเรื่องรถกัน"}
{"word": "work out", "english": "The software update didn’t work out well.", "thai": "การอัปเดตซอฟต์แวร์ไม่ได้ผลดี"}
{"word": "work out", "english": "They work out by hiking in the mountains.", "thai": "พวกเขาออกกำลังกายด้วยการเดินป่าในเขา"}
{"word": "work out", "english": "We need to work out the payment schedule.", "thai": "เราต้องจัดการตารางชำระเงิน"}
{"word": "work out", "english": "I’m confident this will work out for us.", "thai": "ฉันมั่นใจว่ามันจะลงตัวสำหรับเรา"}
{"word": "work out", "english": "I work out to boost my energy levels.", "thai": "ฉันออกกำลังกายเพื่อเพิ่มพลัง"}
{"word": "work out", "english": "Let’s work out how to handle the situation.", "thai": "มาจัดการสถานการณ์นี้กัน"}
{"word": "work out", "english": "The collaboration should work out smoothly.", "thai": "การร่วมงานน่าจะราบรื่น"}
{"word": "work out", "english": "She works out with a dance fitness class.", "thai": "เธอออกกำลังกายด้วยคลาสเต้นฟิตเนส"}
{"word": "work out", "english": "We’ll work out the final details tomorrow.", "thai": "เราจะจัดการรายละเอียดสุดท้ายพรุ่งนี้"}
{"word": "work out", "english": "I hope this idea works out as planned.", "thai": "ฉันหวังว่าไอเดียนี้จะเป็นไปตามแผน"}
{"word": "work out", "english": "He works out to prepare for the competition.", "thai": "เขาออกกำลังกายเพื่อเตรียมตัวแข่งขัน"}
{"word": "work out", "english": "Let’s work out a strategy for the campaign.", "thai": "มาวางกลยุทธ์สำหรับแคมเปญ"}
{"word": "work out", "english": "The plan didn’t work out, but we’ll try again.", "thai": "แผนนี้ไม่สำเร็จ แต่เราจะลองใหม่"}
{"word": "work out", "english": "I work out by jogging around the neighborhood.", "thai": "ฉันออกกำลังกายด้วยการวิ่งรอบละแวก"}
{"word": "work out", "english": "We need to work out the transportation plan.", "thai": "เราต้องจัดการแผนการเดินทาง"}
{"word": "work out", "english": "I’m sure everything will work out eventually.", "thai": "ฉันแน่ใจว่าทุกอย่างจะลงตัวในที่สุด"}
{"word": "work out", "english": "She works out to stay in top condition.", "thai": "เธอออกกำลังกายเพื่อรักษาสภาพร่างกายให้ดี"}
{"word": "work out", "english": "Let’s work out a solution before the deadline.", "thai": "มาแก้ปัญหาก่อนถึงกำหนด"}
{"word": "work out", "english": "The event should work out great with this setup.", "thai": "งานนี้น่าจะออกมาดีด้วยการจัดเตรียมนี้"}
{"word": "chill out", "english": "Hey, just chill out and enjoy the party.", "thai": "เฮ้ ผ่อนคลายหน่อยแล้วสนุกกับปาร์ตี้สิ"}
{"word": "chill out", "english": "You need to chill out; it’s not a big deal.", "thai": "คุณต้องใจเย็นหน่อย มันไม่ใช่เรื่องใหญ่"}
{"word": "chill out", "english": "Let’s chill out and watch a movie tonight.", "thai": "มาผ่อนคลายดูหนังกันคืนนี้เถอะ"}
{"word": "chill out", "english": "She told him to chill out after he got upset.", "thai": "เธอบอกให้เขาใจเย็นหลังจากที่เขาโมโห"}
{"word": "chill out", "english": "I just want to chill out by the pool this weekend.", "thai": "ฉันแค่อยากพักผ่อนชิลๆ ข้างสระว่ายน้ำสุดสัปดาห์นี้"}
{"word": "chill out", "english": "He needs to chill out before he makes a rash decision.", "thai": "เขาต้องใจเย็นก่อนจะตัดสินใจอะไรผลีผลาม"}
{"word": "chill out", "english": "We’re going to chill out at the beach all day.", "thai": "เราจะไปพักผ่อนชิลๆ ที่ชายหาดทั้งวัน"}
{"word": "chill out", "english": "Chill out, man, it’s just a game.", "thai": "ใจเย็นหน่อยเพื่อน มันแค่เกม"}
{"word": "chill out", "english": "I like to chill out with some music after work.", "thai": "ฉันชอบผ่อนคลายด้วยการฟังเพลงหลังเลิกงาน"}
{"word": "chill out", "english": "She’s chilling out with a book in the backyard.", "thai": "เธอกำลังพักผ่อนชิลๆ ด้วยการอ่านหนังสือที่สวนหลังบ้าน"}
{"word": "chill out", "english": "Just chill out and let me handle it.", "thai": "ผ่อนคลายหน่อยแล้วให้ฉันจัดการ"}
{"word": "chill out", "english": "They chilled out at the café all afternoon.", "thai": "พวกเขาพักผ่อนชิลๆ ที่ร้านกาแฟทั้งบ่าย"}
{"word": "chill out", "english": "You should chill out; stressing won’t help.", "thai": "คุณควรใจเย็น ความเครียดไม่ช่วยอะไร"}
{"word": "chill out", "english": "Let’s chill out with some pizza and video games.", "thai": "มาผ่อนคลายด้วยพิซซ่าและวิดีโอเกมกัน"}
{"word": "chill out", "english": "He’s chilling out after a long day at work.", "thai": "เขากำลังพักผ่อนชิลๆ หลังจากทำงานหนักมาทั้งวัน"}
{"word": "chill out", "english": "Chill out, we’ll figure this out together.", "thai": "ใจเย็นหน่อย เราจะแก้ปัญหานี้ด้วยกัน"}
{"word": "chill out", "english": "I’m going to chill out with a cold drink tonight.", "thai": "ฉันจะผ่อนคลายด้วยเครื่องดื่มเย็นๆ คืนนี้"}
{"word": "chill out", "english": "She told the kids to chill out during the car ride.", "thai": "เธอบอกให้เด็กๆ ใจเย็นระหว่างนั่งรถ"}
{"word": "chill out", "english": "We chilled out by the campfire last night.", "thai": "เมื่อคืนเราพักผ่อนชิลๆ ข้างกองไฟ"}
{"word": "chill out", "english": "Just chill out and enjoy the music festival.", "thai": "ผ่อนคลายหน่อยแล้วสนุกกับเทศกาลดนตรีสิ"}
{"word": "chill out", "english": "He needs to chill out before he gets too angry.", "thai": "เขาต้องใจเย็นก่อนจะโกรธมากเกินไป"}
{"word": "chill out", "english": "Let’s chill out at home with some takeout.", "thai": "มาผ่อนคลายที่บ้านด้วยอาหารเดลิเวอรี่กัน"}
{"word": "chill out", "english": "I’m chilling out with my favorite podcast.", "thai": "ฉันกำลังพักผ่อนชิลๆ กับพอดแคสต์ที่ชอบ"}
{"word": "chill out", "english": "She’s trying to chill out after a stressful week.", "thai": "เธอกำลังพยายามผ่อนคลายหลังจากสัปดาห์ที่เครียด"}
{"word": "chill out", "english": "Chill out, we’re not in a rush today.", "thai": "ใจเย็นหน่อย วันนี้เราไม่รีบ"}
{"word": "chill out", "english": "They chilled out on the porch with iced tea.", "thai": "พวกเขาพักผ่อนชิลๆ ที่ระเบียงพร้อมชาเย็น"}
{"word": "chill out", "english": "I just need to chill out for a bit before we go.", "thai": "ฉันแค่ต้องผ่อนคลายสักพักก่อนเราไป"}
{"word": "chill out", "english": "He told his friend to chill out during the argument.", "thai": "เขาบอกให้เพื่อนใจเย็นระหว่างการโต้เถียง"}
{"word": "chill out", "english": "Let’s chill out at the park this afternoon.", "thai": "มาผ่อนคลายที่สวนสาธารณะบ่ายนี้กัน"}
{"word": "chill out", "english": "She’s chilling out with her cat on the couch.", "thai": "เธอกำลังพักผ่อนชิลๆ กับแมวบนโซฟา"}
{"word": "chill out", "english": "Chill out, the meeting isn’t until tomorrow.", "thai": "ใจเย็นหน่อย การประชุมคือพรุ่งนี้"}
{"word": "chill out", "english": "We’re going to chill out with some board games.", "thai": "เราจะผ่อนคลายด้วยการเล่นเกมกระดาน"}
{"word": "chill out", "english": "I’m chilling out with a good book tonight.", "thai": "ฉันกำลังพักผ่อนชิลๆ กับหนังสือดีๆ คืนนี้"}
{"word": "chill out", "english": "He needs to chill out and stop overthinking.", "thai": "เขาต้องใจเย็นและหยุดคิดมาก"}
{"word": "chill out", "english": "Let’s chill out by the lake this weekend.", "thai": "มาผ่อนคลายที่ริมทะเลสาบสุดสัปดาห์นี้"}
{"word": "chill out", "english": "She chilled out with a yoga session this morning.", "thai": "เธอผ่อนคลายด้วยการเล่นโยคะเช้านี้"}
{"word": "chill out", "english": "Just chill out, we’ll get there on time.", "thai": "ใจเย็นหน่อย เราจะไปถึงทันเวลา"}
{"word": "chill out", "english": "They chilled out at the rooftop bar last night.", "thai": "เมื่อคืนพวกเขาพักผ่อนชิลๆ ที่บาร์บนดาดฟ้า"}
{"word": "chill out", "english": "I’m going to chill out with some Netflix tonight.", "thai": "ฉันจะผ่อนคลายด้วยการดูเน็ตฟลิกซ์คืนนี้"}
{"word": "chill out", "english": "She told him to chill out about the exam results.", "thai": "เธอบอกให้เขาใจเย็นเรื่องผลสอบ"}
{"word": "chill out", "english": "We chilled out with some snacks and a movie.", "thai": "เราพักผ่อนชิลๆ ด้วยของว่างและหนัง"}
{"word": "chill out", "english": "Chill out, it’s just a small mistake.", "thai": "ใจเย็นหน่อย มันแค่ความผิดพลาดเล็กๆ"}
{"word": "chill out", "english": "He’s chilling out with his guitar this evening.", "thai": "เขากำลังพักผ่อนชิลๆ กับกีตาร์เย็นนี้"}
{"word": "chill out", "english": "Let’s chill out and listen to some music.", "thai": "มาผ่อนคลายฟังเพลงกัน"}
{"word": "chill out", "english": "I need to chill out after that crazy day.", "thai": "ฉันต้องผ่อนคลายหลังจากวันที่บ้าคลั่ง"}
{"word": "chill out", "english": "She’s chilling out with a cup of tea.", "thai": "เธอกำลังพักผ่อนชิลๆ กับชาหนึ่งถ้วย"}
{"word": "chill out", "english": "Chill out, we’ll fix this problem later.", "thai": "ใจเย็นหน่อย เดี๋ยวเราจะแก้ปัญหานี้ทีหลัง"}
{"word": "chill out", "english": "They chilled out at the spa all day.", "thai": "พวกเขาพักผ่อนชิลๆ ที่สปาทั้งวัน"}
{"word": "chill out", "english": "I’m going to chill out with a nap this afternoon.", "thai": "ฉันจะผ่อนคลายด้วยการงีบหลับบ่ายนี้"}
{"word": "chill out", "english": "He told her to chill out about the deadline.", "thai": "เขาบอกให้เธอใจเย็นเรื่องเดดไลน์"}
{"word": "chill out", "english": "Let’s chill out and have a barbecue.", "thai": "มาผ่อนคลายด้วยการจัดบาร์บีคิวกัน"}
{"word": "chill out", "english": "She’s chilling out with some ice cream.", "thai": "เธอกำลังพักผ่อนชิลๆ กับไอศกรีม"}
{"word": "chill out", "english": "Chill out, we’ve got plenty of time.", "thai": "ใจเย็นหน่อย เรามีเวลาเหลือเฟือ"}
{"word": "chill out", "english": "We chilled out with a picnic in the park.", "thai": "เราพักผ่อนชิลๆ ด้วยการปิกนิกในสวน"}
{"word": "chill out", "english": "I’m chilling out with my dog on the couch.", "thai": "ฉันกำลังพักผ่อนชิลๆ กับหมาบนโซฟา"}
{"word": "chill out", "english": "He needs to chill out and stop arguing.", "thai": "เขาต้องใจเย็นและหยุดเถียง"}
{"word": "chill out", "english": "Let’s chill out at the coffee shop later.", "thai": "มาผ่อนคลายที่ร้านกาแฟทีหลังนะ"}
{"word": "chill out", "english": "She’s chilling out with a glass of wine.", "thai": "เธอกำลังพักผ่อนชิลๆ กับไวน์หนึ่งแก้ว"}
{"word": "chill out", "english": "Just chill out and enjoy the sunset.", "thai": "ผ่อนคลายหน่อยแล้วสนุกกับพระอาทิตย์ตก"}
{"word": "chill out", "english": "They chilled out by playing card games.", "thai": "พวกเขาพักผ่อนชิลๆ ด้วยการเล่นไพ่"}
{"word": "chill out", "english": "I’m going to chill out with some video games.", "thai": "ฉันจะผ่อนคลายด้วยการเล่นวิดีโอเกม"}
{"word": "chill out", "english": "He told his sister to chill out about the mess.", "thai": "เขาบอกน้องสาวให้ใจเย็นเรื่องความรก"}
{"word": "chill out", "english": "We chilled out with a bonfire on the beach.", "thai": "เราพักผ่อนชิลๆ ด้วยกองไฟที่ชายหาด"}
{"word": "chill out", "english": "Chill out, the project isn’t due yet.", "thai": "ใจเย็นหน่อย โปรเจกต์ยังไม่ถึงกำหนด"}
{"word": "chill out", "english": "She’s chilling out with her favorite playlist.", "thai": "เธอกำลังพักผ่อนชิลๆ กับเพลย์ลิสต์โปรด"}
{"word": "chill out", "english": "Let’s chill out and have a lazy Sunday.", "thai": "มาผ่อนคลายและมีวันอาทิตย์แบบขี้เกียจ"}
{"word": "chill out", "english": "I’m chilling out with a smoothie by the pool.", "thai": "ฉันกำลังพักผ่อนชิลๆ กับสมูทตี้ข้างสระ"}
{"word": "chill out", "english": "He needs to chill out before the big meeting.", "thai": "เขาต้องใจเย็นก่อนการประชุมใหญ่"}
{"word": "chill out", "english": "We chilled out at the arcade last night.", "thai": "เมื่อคืนเราพักผ่อนชิลๆ ที่ตู้เกม"}
{"word": "chill out", "english": "Just chill out and let things happen naturally.", "thai": "ใจเย็นหน่อย ปล่อยให้ทุกอย่างเกิดขึ้นเอง"}
{"word": "chill out", "english": "She’s chilling out with a puzzle on the table.", "thai": "เธอกำลังพักผ่อนชิลๆ กับปริศนาบนโต๊ะ"}
{"word": "chill out", "english": "Chill out, we’ll get it done on time.", "thai": "ใจเย็นหน่อย เราจะทำเสร็จทันเวลา"}
{"word": "chill out", "english": "They chilled out with some drinks at the bar.", "thai": "พวกเขาพักผ่อนชิลๆ กับเครื่องดื่มที่บาร์"}
{"word": "chill out", "english": "I’m going to chill out with a hot bath tonight.", "thai": "ฉันจะผ่อนคลายด้วยการแช่น้ำร้อนคืนนี้"}
{"word": "chill out", "english": "He told his team to chill out before the game.", "thai": "เขาบอกทีมให้ใจเย็นก่อนแข่ง"}
{"word": "chill out", "english": "Let’s chill out and go stargazing tonight.", "thai": "มาผ่อนคลายและ去看ดาวคืนนี้"}
{"word": "chill out", "english": "She’s chilling out with a face mask and music.", "thai": "เธอกำลังพักผ่อนชิลๆ ด้วยมาสก์หน้าและเพลง"}
{"word": "chill out", "english": "Chill out, it’s not worth getting upset over.", "thai": "ใจเย็นหน่อย มันไม่คุ้มที่จะโมโห"}
{"word": "chill out", "english": "We chilled out with a walk in the park.", "thai": "เราพักผ่อนชิลๆ ด้วยการเดินในสวน"}
{"word": "chill out", "english": "I’m chilling out with some snacks and TV.", "thai": "ฉันกำลังพักผ่อนชิลๆ กับของว่างและทีวี"}
{"word": "chill out", "english": "He needs to chill out about the test results.", "thai": "เขาต้องใจเย็นเรื่องผลสอบ"}
{"word": "chill out", "english": "Let’s chill out with some ice cream tonight.", "thai": "มาผ่อนคลายด้วยไอศกรีมคืนนี้"}
{"word": "chill out", "english": "She’s chilling out with her sketchbook.", "thai": "เธอกำลังพักผ่อนชิลๆ กับสมุดสเก็ตช์"}
{"word": "chill out", "english": "Just chill out and enjoy the day off.", "thai": "ผ่อนคลายหน่อยและสนุกกับวันหยุด"}
{"word": "chill out", "english": "They chilled out with a campfire and marshmallows.", "thai": "พวกเขาพักผ่อนชิลๆ ด้วยกองไฟและมาร์ชเมลโลว์"}
{"word": "chill out", "english": "I’m going to chill out with a magazine.", "thai": "ฉันจะผ่อนคลายด้วยการอ่านนิตยสาร"}
{"word": "chill out", "english": "He told his friend to chill out about the delay.", "thai": "เขาบอกให้เพื่อนใจเย็นเรื่องความล่าช้า"}
{"word": "chill out", "english": "We chilled out at the lake house yesterday.", "thai": "เมื่อวานเราพักผ่อนชิลๆ ที่บ้านริมทะเลสาบ"}
{"word": "chill out", "english": "Chill out, we’ll handle it together.", "thai": "ใจเย็นหน่อย เราจะจัดการด้วยกัน"}
{"word": "chill out", "english": "She’s chilling out with a knitting project.", "thai": "เธอกำลังพักผ่อนชิลๆ กับงานถัก"}
{"word": "chill out", "english": "Let’s chill out and have a game night.", "thai": "มาผ่อนคลายด้วยคืนเล่นเกมกัน"}
{"word": "chill out", "english": "I’m chilling out with a cold soda.", "thai": "ฉันกำลังพักผ่อนชิลๆ กับโซดาเย็น"}
{"word": "chill out", "english": "He needs to chill out before he snaps.", "thai": "เขาต้องใจเย็นก่อนจะโมโหหนัก"}
{"word": "chill out", "english": "We chilled out with some live music at the bar.", "thai": "เราพักผ่อนชิลๆ กับดนตรีสดที่บาร์"}
{"word": "chill out", "english": "Just chill out and let’s talk it over.", "thai": "ใจเย็นหน่อยแล้วมาคุยกัน"}
{"word": "chill out", "english": "She’s chilling out with a coloring book.", "thai": "เธอกำลังพักผ่อนชิลๆ กับสมุดระบายสี"}
{"word": "chill out", "english": "Chill out, we’ll make it work somehow.", "thai": "ใจเย็นหน่อย เดี๋ยวเราจะทำให้มันสำเร็จ"}
{"word": "chill out", "english": "They chilled out with a sunset boat ride.", "thai": "พวกเขาพักผ่อนชิลๆ ด้วยการนั่งเรือดูพระอาทิตย์ตก"}
{"word": "chill out", "english": "I’m going to chill out with a good novel.", "thai": "ฉันจะผ่อนคลายด้วยการอ่านนิยายดีๆ"}
{"word": "chill out", "english": "He told his boss to chill out about the report.", "thai": "เขาบอกเจ้านายให้ใจเย็นเรื่องรายงาน"}
{"word": "chill out", "english": "Let’s chill out and watch the stars tonight.", "thai": "มาผ่อนคลายและดูดาวคืนนี้"}
{"word": "hang on", "english": "Hang on, I need to grab my phone.", "thai": "เดี๋ยวก่อน ฉันต้องไปหยิบโทรศัพท์"}
{"word": "hang on", "english": "Can you hang on for a second while I check this?", "thai": "รอสักครู่ได้ไหม ฉันจะเช็คเรื่องนี้ก่อน"}
{"word": "hang on", "english": "Hang on, I’m almost done with this email.", "thai": "เดี๋ยวก่อน ฉันเกือบเสร็จอีเมลแล้ว"}
{"word": "hang on", "english": "She told me to hang on while she got the keys.", "thai": "เธอบอกให้ฉันรอก่อนตอนที่เธอไปหยิบกุญแจ"}
{"word": "hang on", "english": "Hang on tight, this ride’s going to be bumpy!", "thai": "จับแน่นๆ นะ การขับจะสะเทือน!"}
{"word": "hang on", "english": "Just hang on, we’ll get through this together.", "thai": "อดทนหน่อย เราจะผ่านมันไปด้วยกัน"}
{"word": "hang on", "english": "Hang on, I forgot where I parked the car.", "thai": "เดี๋ยวก่อน ฉันลืมว่าจอดรถไว้ไหน"}
{"word": "hang on", "english": "He’s trying to hang on to his job despite the layoffs.", "thai": "เขาพยายามยึดงานไว้แม้จะมีการปลดพนักงาน"}
{"word": "hang on", "english": "Hang on, let me finish this sentence.", "thai": "รอก่อน ขอฉันเขียนประโยคนี้ให้จบ"}
{"word": "hang on", "english": "They told us to hang on during the turbulence.", "thai": "พวกเขาบอกให้เราจับแน่นระหว่างความปั่นป่วน"}
{"word": "hang on", "english": "Hang on, I’ll be right back with the drinks.", "thai": "เดี๋ยวก่อน ฉันจะกลับมาพร้อมเครื่องดื่ม"}
{"word": "hang on", "english": "She’s hanging on to hope despite the bad news.", "thai": "เธอยังคงยึดมั่นในความหวังแม้มีข่าวร้าย"}
{"word": "hang on", "english": "Hang on, I need to tie my shoe.", "thai": "รอก่อน ฉันต้องผูกรองเท้า"}
{"word": "hang on", "english": "Can you hang on while I take this call?", "thai": "รอหน่อยได้ไหม ฉันต้องรับโทรศัพท์"}
{"word": "hang on", "english": "Hang on to your hat, it’s getting windy!", "thai": "จับหมวกให้แน่น ลมแรงแล้ว!"}
{"word": "hang on", "english": "He’s hanging on to his old phone for nostalgia.", "thai": "เขายังเก็บโทรศัพท์เก่าไว้เพราะความทรงจำ"}
{"word": "hang on", "english": "Hang on, I’m looking for my glasses.", "thai": "เดี๋ยวก่อน ฉันกำลังหาแว่น"}
{"word": "hang on", "english": "Just hang on, we’re almost at the finish line.", "thai": "อดทนหน่อย เราใกล้ถึงเส้นชัยแล้ว"}
{"word": "hang on", "english": "Hang on, I need to check the directions.", "thai": "รอก่อน ฉันต้องเช็คเส้นทาง"}
{"word": "hang on", "english": "She’s hanging on to her dreams of being an artist.", "thai": "เธอยังยึดมั่นในความฝันที่จะเป็นศิลปิน"}
{"word": "hang on", "english": "Hang on, let me grab a pen to write this down.", "thai": "เดี๋ยวก่อน ขอฉันหยิบปากกาจดหน่อย"}
{"word": "hang on", "english": "They’re hanging on through the tough times.", "thai": "พวกเขายังอดทนผ่านช่วงเวลายากลำบาก"}
{"word": "hang on", "english": "Hang on, I’ll open the door for you.", "thai": "รอก่อน ฉันจะเปิดประตูให้"}
{"word": "hang on", "english": "He told me to hang on while he found his wallet.", "thai": "เขาบอกให้ฉันรอก่อนตอนที่เขาหากระเป๋าเงิน"}
{"word": "hang on", "english": "Hang on tight, the boat’s about to speed up!", "thai": "จับแน่นๆ เรือจะเร่งความเร็วแล้ว!"}
{"word": "hang on", "english": "She’s hanging on to her favorite childhood book.", "thai": "เธอยังเก็บหนังสือเด็กเล่มโปรดไว้"}
{"word": "hang on", "english": "Hang on, I need to answer this text.", "thai": "เดี๋ยวก่อน ฉันต้องตอบข้อความนี้"}
{"word": "hang on", "english": "Just hang on, we’ll sort this mess out.", "thai": "อดทนหน่อย เราจะจัดการเรื่องวุ่นวายนี้"}
{"word": "hang on", "english": "Hang on, I’m trying to find my keys.", "thai": "รอก่อน ฉันกำลังหากุญแจ"}
{"word": "hang on", "english": "He’s hanging on to his old habits.", "thai": "เขายังยึดติดกับนิสัยเก่าๆ"}
{"word": "hang on", "english": "Hang on, let me check the time.", "thai": "เดี๋ยวก่อน ขอฉันเช็คเวลา"}
{"word": "hang on", "english": "They’re hanging on to make it through the storm.", "thai": "พวกเขายังอดทนเพื่อผ่านพายุ"}
{"word": "hang on", "english": "Hang on, I’ll get you a glass of water.", "thai": "รอก่อน ฉันจะไปเอาน้ำมาให้"}
{"word": "hang on", "english": "She told him to hang on while she parked the car.", "thai": "เธอบอกให้เขารอก่อนตอนที่เธอจอดรถ"}
{"word": "hang on", "english": "Hang on tight, we’re going down a steep hill!", "thai": "จับแน่นๆ เราจะลงเนินชัน!"}
{"word": "hang on", "english": "He’s hanging on to his grandfather’s watch.", "thai": "เขายังเก็บนาฬิกาของปู่ไว้"}
{"word": "hang on", "english": "Hang on, I need to save this document.", "thai": "เดี๋ยวก่อน ฉันต้องเซฟเอกสารนี้"}
{"word": "hang on", "english": "Just hang on, we’re almost out of traffic.", "thai": "อดทนหน่อย เราใกล้พ้นรถติดแล้ว"}
{"word": "hang on", "english": "Hang on, let me put my shoes on.", "thai": "รอก่อน ขอฉันใส่รองเท้า"}
{"word": "hang on", "english": "She’s hanging on to her optimism despite the setbacks.", "thai": "เธอยังยึดมั่นในแง่บวกแม้จะเจออุปสรรค"}
{"word": "hang on", "english": "Hang on, I’m checking the menu.", "thai": "เดี๋ยวก่อน ฉันกำลังดูเมนู"}
{"word": "hang on", "english": "They’re hanging on to finish the marathon.", "thai": "พวกเขายังอดทนเพื่อวิ่งมาราธอนให้จบ"}
{"word": "hang on", "english": "Hang on, I’ll grab a jacket.", "thai": "รอก่อน ฉันจะไปหยิบแจ็คเก็ต"}
{"word": "hang on", "english": "He told me to hang on while he tied his tie.", "thai": "เขาบอกให้ฉันรอก่อนตอนที่เขาผูกเนคไท"}
{"word": "hang on", "english": "Hang on tight, the roller coaster is starting!", "thai": "จับแน่นๆ รถไฟเหาะกำลังเริ่ม!"}
{"word": "hang on", "english": "She’s hanging on to her family traditions.", "thai": "เธอยังยึดมั่นในประเพณีครอบครัว"}
{"word": "hang on", "english": "Hang on, I need to lock the door.", "thai": "เดี๋ยวก่อน ฉันต้องล็อกประตู"}
{"word": "hang on", "english": "Just hang on, we’ll find a solution soon.", "thai": "อดทนหน่อย เดี๋ยวเราจะหาทางแก้"}
{"word": "hang on", "english": "Hang on, I’m grabbing my wallet.", "thai": "รอก่อน ฉันกำลังหยิบกระเป๋าเงิน"}
{"word": "hang on", "english": "He’s hanging on to his old vinyl records.", "thai": "เขายังเก็บแผ่นเสียงเก่าๆ ไว้"}
{"word": "hang on", "english": "Hang on, let me find my sunglasses.", "thai": "เดี๋ยวก่อน ขอฉันหาแว่นกันแดด"}
{"word": "hang on", "english": "They’re hanging on through the tough project.", "thai": "พวกเขายังอดทนผ่านโปรเจกต์ที่ยาก"}
{"word": "hang on", "english": "Hang on, I’ll get the door for you.", "thai": "รอก่อน ฉันจะเปิดประตูให้"}
{"word": "hang on", "english": "She told me to hang on while she grabbed her bag.", "thai": "เธอบอกให้ฉันรอก่อนตอนที่เธอหยิบกระเป๋า"}
{"word": "hang on", "english": "Hang on tight, we’re about to take off!", "thai": "จับแน่นๆ เราจะบินขึ้นแล้ว!"}
{"word": "hang on", "english": "He’s hanging on to his favorite jacket.", "thai": "เขายังเก็บแจ็คเก็ตตัวโปรดไว้"}
{"word": "hang on", "english": "Hang on, I need to send a quick message.", "thai": "เดี๋ยวก่อน ฉันต้องส่งข้อความด่วน"}
{"word": "hang on", "english": "Just hang on, we’re almost at the campsite.", "thai": "อดทนหน่อย เราใกล้ถึงแคมป์แล้ว"}
{"word": "hang on", "english": "Hang on, let me check my calendar.", "thai": "รอก่อน ขอฉันเช็คปฏิทิน"}
{"word": "hang on", "english": "She’s hanging on to her childhood memories.", "thai": "เธอยังยึดมั่นในความทรงจำวัยเด็ก"}
{"word": "hang on", "english": "Hang on, I’ll grab us some coffee.", "thai": "รอก่อน ฉันจะไปหยิบกาแฟมาให้"}
{"word": "hang on", "english": "They’re hanging on to finish the deadline.", "thai": "พวกเขายังอดทนเพื่อให้งานเสร็จตามกำหนด"}
{"word": "hang on", "english": "Hang on, I need to turn off the stove.", "thai": "เดี๋ยวก่อน ฉันต้องปิดเตา"}
{"word": "hang on", "english": "He told me to hang on while he found his phone.", "thai": "เขาบอกให้ฉันรอก่อนตอนที่เขาหาโทรศัพท์"}
{"word": "hang on", "english": "Hang on tight, we’re going around a sharp curve!", "thai": "จับแน่นๆ เราจะเลี้ยวโค้งหักศอก!"}
{"word": "hang on", "english": "She’s hanging on to her old love letters.", "thai": "เธอยังเก็บจดหมายรักเก่าๆ ไว้"}
{"word": "hang on", "english": "Hang on, I’m looking for my earbuds.", "thai": "รอก่อน ฉันกำลังหาหูฟัง"}
{"word": "hang on", "english": "Just hang on, we’ll get this sorted out.", "thai": "อดทนหน่อย เราจะจัดการให้เรียบร้อย"}
{"word": "hang on", "english": "Hang on, let me get my notebook.", "thai": "รอก่อน ขอฉันหยิบสมุดจด"}
{"word": "hang on", "english": "He’s hanging on to his dream of starting a business.", "thai": "เขายังยึดมั่นในความฝันที่จะเริ่มธุรกิจ"}
{"word": "hang on", "english": "Hang on, I’ll check the weather for you.", "thai": "รอก่อน ฉันจะเช็คสภาพอากาศให้"}
{"word": "hang on", "english": "They’re hanging on through the financial crisis.", "thai": "พวกเขายังอดทนผ่านวิกฤตการเงิน"}
{"word": "hang on", "english": "Hang on, I need to feed the dog.", "thai": "เดี๋ยวก่อน ฉันต้องให้อาหารหมา"}
{"word": "hang on", "english": "She told me to hang on while she finished her call.", "thai": "เธอบอกให้ฉันรอก่อนตอนที่เธอคุยโทรศัพท์เสร็จ"}
{"word": "hang on", "english": "Hang on tight, the swing is going high!", "thai": "จับแน่นๆ ชิงช้าจะเหวี่ยงสูง!"}
{"word": "hang on", "english": "He’s hanging on to his old baseball cards.", "thai": "เขายังเก็บการ์ดเบสบอลเก่าๆ ไว้"}
{"word": "hang on", "english": "Hang on, I’m turning on the light.", "thai": "รอก่อน ฉันกำลังเปิดไฟ"}
{"word": "hang on", "english": "Just hang on, we’re almost at the top of the hill.", "thai": "อดทนหน่อย เราใกล้ถึงยอดเขาแล้ว"}
{"word": "hang on", "english": "Hang on, let me find my ID.", "thai": "รอก่อน ขอฉันหาบัตรประจำตัว"}
{"word": "hang on", "english": "She’s hanging on to her passion for music.", "thai": "เธอยังยึดมั่นในความหลงใหลในดนตรี"}
{"word": "hang on", "english": "Hang on, I’ll grab some snacks for us.", "thai": "รอก่อน ฉันจะไปหยิบของว่างมาให้"}
{"word": "hang on", "english": "They’re hanging on to make it through the exam.", "thai": "พวกเขายังอดทนเพื่อสอบให้ผ่าน"}
{"word": "hang on", "english": "Hang on, I need to close the window.", "thai": "เดี๋ยวก่อน ฉันต้องปิดหน้าต่าง"}
{"word": "hang on", "english": "He told me to hang on while he checked the map.", "thai": "เขาบอกให้ฉันรอก่อนตอนที่เขาดูแผนที่"}
{"word": "hang on", "english": "Hang on tight, we’re crossing a rough bridge!", "thai": "จับแน่นๆ เราจะข้ามสะพานที่ขรุขระ!"}
{"word": "hang on", "english": "She’s hanging on to her grandmother’s necklace.", "thai": "เธอยังเก็บสร้อยคอของคุณย่าไว้"}
{"word": "hang on", "english": "Hang on, I’m checking my email.", "thai": "รอก่อน ฉันกำลังเช็คอีเมล"}
{"word": "hang on", "english": "Just hang on, we’ll figure out the plan.", "thai": "อดทนหน่อย เราจะหาแผนกัน"}
{"word": "hang on", "english": "Hang on, let me grab my charger.", "thai": "รอก่อน ขอฉันหยิบที่ชาร์จ"}
{"word": "hang on", "english": "He’s hanging on to his goal of running a marathon.", "thai": "เขายังยึดมั่นในเป้าหมายวิ่งมาราธอน"}
{"word": "hang on", "english": "Hang on, I’ll find the remote for you.", "thai": "รอก่อน ฉันจะหาリモコンให้"}
{"word": "hang on", "english": "They’re hanging on through the tough season.", "thai": "พวกเขายังอดทนผ่านฤดูกาลที่ยากลำบาก"}
{"word": "hang on", "english": "Hang on, I need to water the plants.", "thai": "เดี๋ยวก่อน ฉันต้องรดน้ำต้นไม้"}
{"word": "hang on", "english": "She told me to hang on while she got her coat.", "thai": "เธอบอกให้ฉันรอก่อนตอนที่เธอหยิบโค้ท"}
{"word": "hang on", "english": "Hang on tight, we’re about to jump!", "thai": "จับแน่นๆ เราจะกระโดดแล้ว!"}
{"word": "hang on", "english": "He’s hanging on to his old comic books.", "thai": "เขายังเก็บการ์ตูนเก่าๆ ไว้"}
{"word": "hang on", "english": "Hang on, I’m looking for my headphones.", "thai": "รอก่อน ฉันกำลังหาหูฟัง"}
{"word": "hang on", "english": "Just hang on, we’ll make it to the end.", "thai": "อดทนหน่อย เราจะถึงจุดจบ"}
{"word": "hang on", "english": "Hang on, let me check the score.", "thai": "รอก่อน ขอฉันเช็คสกอร์"}
{"word": "hang on", "english": "She’s hanging on to her love for painting.", "thai": "เธอยังยึดมั่นในความรักในการวาดภาพ"}
{"word": "hang on", "english": "Hang on, I’ll get us some drinks.", "thai": "รอก่อน ฉันจะไปหยิบเครื่องดื่มมา"}
{"word": "turn on", "english": "Can you turn on the light in the kitchen?", "thai": "คุณช่วยเปิดไฟในครัวได้ไหม?"}
{"word": "turn on", "english": "I forgot to turn on the fan before leaving.", "thai": "ฉันลืมเปิดพัดลมก่อนออกไป"}
{"word": "turn on", "english": "Please turn on the TV, the game is starting.", "thai": "กรุณาเปิดทีวี เกมกำลังจะเริ่ม"}
{"word": "turn on", "english": "Why did you turn on the heater? It's so warm!", "thai": "ทำไมคุณถึงเปิดเครื่องทำความร้อน? มันอุ่นมากแล้ว!"}
{"word": "turn on", "english": "I’ll turn on the music to set the mood.", "thai": "ฉันจะเปิดเพลงเพื่อสร้างบรรยากาศ"}
{"word": "turn on", "english": "Don’t forget to turn on the dishwasher tonight.", "thai": "อย่าลืมเปิดเครื่องล้างจานคืนนี้"}
{"word": "turn on", "english": "Can someone turn on the AC? It’s getting hot.", "thai": "มีใครช่วยเปิดแอร์ได้ไหม? มันเริ่มร้อนแล้ว"}
{"word": "turn on", "english": "She loves to turn on the radio while cooking.", "thai": "เธอชอบเปิดวิทยุขณะทำอาหาร"}
{"word": "turn on", "english": "I need to turn on my laptop to check emails.", "thai": "ฉันต้องเปิดแล็ปท็อปเพื่อเช็คอีเมล"}
{"word": "turn on", "english": "Who forgot to turn on the porch light?", "thai": "ใครลืมเปิดไฟที่ระเบียง?"}
{"word": "turn on", "english": "Let’s turn on the projector for the presentation.", "thai": "มาเปิดโปรเจคเตอร์สำหรับการนำเสนอกัน"}
{"word": "turn on", "english": "I always turn on the GPS when driving somewhere new.", "thai": "ฉันมักจะเปิด GPS เมื่อขับรถไปที่ใหม่"}
{"word": "turn on", "english": "Can you turn on the oven? I’m ready to bake.", "thai": "คุณช่วยเปิดเตาอบได้ไหม? ฉันพร้อมอบแล้ว"}
{"word": "turn on", "english": "He didn’t turn on the camera for the video call.", "thai": "เขาไม่ได้เปิดกล้องสำหรับวิดีโอคอล"}
{"word": "turn on", "english": "Turn on the sprinkler, the lawn needs water.", "thai": "เปิดสปริงเกลอร์ สนามหญ้าต้องการน้ำ"}
{"word": "turn on", "english": "I’ll turn on the coffee maker in the morning.", "thai": "ฉันจะเปิดเครื่องชงกาแฟในตอนเช้า"}
{"word": "turn on", "english": "Did you turn on the security system before leaving?", "thai": "คุณเปิดระบบรักษาความปลอดภัยก่อนออกไปหรือเปล่า?"}
{"word": "turn on", "english": "Let’s turn on some lights, it’s getting dark.", "thai": "มาเปิดไฟกันเถอะ มันเริ่มมืดแล้ว"}
{"word": "turn on", "english": "She likes to turn on the humidifier at night.", "thai": "เธอชอบเปิดเครื่องทำความชื้นตอนกลางคืน"}
{"word": "turn on", "english": "Can you turn on the Bluetooth speaker?", "thai": "คุณช่วยเปิดลำโพงบลูทูธได้ไหม?"}
{"word": "turn on", "english": "I forgot to turn on the alarm clock.", "thai": "ฉันลืมเปิดนาฬิกาปลุก"}
{"word": "turn on", "english": "Turn on the vacuum cleaner, the floor’s a mess.", "thai": "เปิดเครื่องดูดฝุ่น พื้นสกปรกมาก"}
{"word": "turn on", "english": "He always forgets to turn on the webcam.", "thai": "เขามักจะลืมเปิดเว็บแคม"}
{"word": "turn on", "english": "Let’s turn on the Christmas lights tonight!", "thai": "มาเปิดไฟคริสต์มาสคืนนี้กันเถอะ!"}
{"word": "turn on", "english": "I’ll turn on the air purifier; it’s dusty in here.", "thai": "ฉันจะเปิดเครื่องฟอกอากาศ มันมีฝุ่นเยอะในนี้"}
{"word": "turn on", "english": "Can you turn on the water heater for the shower?", "thai": "คุณช่วยเปิดเครื่องทำน้ำอุ่นสำหรับอาบน้ำได้ไหม?"}
{"word": "turn on", "english": "She didn’t turn on her phone after the flight.", "thai": "เธอไม่ได้เปิดโทรศัพท์หลังจากลงเครื่อง"}
{"word": "turn on", "english": "Turn on the ceiling fan, it’s stuffy.", "thai": "เปิดพัดลมเพดาน มันอบอ้าว"}
{"word": "turn on", "english": "I need to turn on the printer to scan this.", "thai": "ฉันต้องเปิดเครื่องพิมพ์เพื่อสแกนอันนี้"}
{"word": "turn on", "english": "Who’s going to turn on the stage lights?", "thai": "ใครจะเปิดไฟเวที?"}
{"word": "turn on", "english": "I’ll turn on the flashlight, it’s too dark.", "thai": "ฉันจะเปิดไฟฉาย มันมืดเกินไป"}
{"word": "turn on", "english": "Can you turn on the car’s headlights?", "thai": "คุณช่วยเปิดไฟหน้ารถได้ไหม?"}
{"word": "turn on", "english": "Let’s turn on the patio heater for the party.", "thai": "มาเปิดเครื่องทำความร้อนที่ลานบ้านสำหรับงานปาร์ตี้กัน"}
{"word": "turn on", "english": "I forgot to turn on the slow cooker this morning.", "thai": "ฉันลืมเปิดหม้อหุงช้าตอนเช้า"}
{"word": "turn on", "english": "Turn on the gaming console, let’s play!", "thai": "เปิดเครื่องเล่นเกม มาเล่นกัน!"}
{"word": "turn on", "english": "She likes to turn on the lamp while reading.", "thai": "เธอชอบเปิดโคมไฟขณะอ่านหนังสือ"}
{"word": "turn on", "english": "Can you turn on the microwave for me?", "thai": "คุณช่วยเปิดไมโครเวฟให้ฉันได้ไหม?"}
{"word": "turn on", "english": "I’ll turn on the Wi-Fi router now.", "thai": "ฉันจะเปิดเราเตอร์ Wi-Fi ตอนนี้"}
{"word": "turn on", "english": "Did you turn on the garage light?", "thai": "คุณเปิดไฟโรงรถหรือยัง?"}
{"word": "turn on", "english": "Let’s turn on the fountain in the garden.", "thai": "มาเปิดน้ำพุในสวนกัน"}
{"word": "turn on", "english": "I need to turn on my tablet to take notes.", "thai": "ฉันต้องเปิดแท็บเล็ตเพื่อจดบันทึก"}
{"word": "turn on", "english": "Turn on the electric kettle for tea.", "thai": "เปิดกาต้มน้ำไฟฟ้าสำหรับชงชา"}
{"word": "turn on", "english": "He forgot to turn on the monitor.", "thai": "เขาลืมเปิดจอมอนิเตอร์"}
{"word": "turn on", "english": "Can you turn on the outdoor lights?", "thai": "คุณช่วยเปิดไฟด้านนอกได้ไหม?"}
{"word": "turn on", "english": "I’ll turn on the dehumidifier in the basement.", "thai": "ฉันจะเปิดเครื่องลดความชื้นในชั้นใต้ดิน"}
{"word": "turn on", "english": "Turn on the blender, let’s make smoothies.", "thai": "เปิดเครื่องปั่น มาทำสมูทตี้กัน"}
{"word": "turn on", "english": "She didn’t turn on the GPS tracker.", "thai": "เธอไม่ได้เปิดเครื่องติดตาม GPS"}
{"word": "turn on", "english": "Let’s turn on the karaoke machine!", "thai": "มาเปิดเครื่องคาราโอเกะกัน!"}
{"word": "turn on", "english": "I forgot to turn on the humidifier last night.", "thai": "ฉันลืมเปิดเครื่องทำความชื้นเมื่อคืน"}
{"word": "turn on", "english": "Can you turn on the car’s air conditioning?", "thai": "คุณช่วยเปิดแอร์ในรถได้ไหม?"}
{"word": "turn on", "english": "I’ll turn on the space heater in the room.", "thai": "ฉันจะเปิดเครื่องทำความร้อนในห้อง"}
{"word": "turn on", "english": "Turn on the smart bulb with your phone.", "thai": "เปิดหลอดไฟอัจฉริยะด้วยโทรศัพท์ของคุณ"}
{"word": "turn on", "english": "She likes to turn on the fairy lights at night.", "thai": "เธอชอบเปิดไฟประดับตอนกลางคืน"}
{"word": "turn on", "english": "Can you turn on the exhaust fan in the bathroom?", "thai": "คุณช่วยเปิดพัดลมดูดอากาศในห้องน้ำได้ไหม?"}
{"word": "turn on", "english": "I need to turn on the backup generator.", "thai": "ฉันต้องเปิดเครื่องกำเนิดไฟสำรอง"}
{"word": "turn on", "english": "Turn on the electric blanket, it’s freezing!", "thai": "เปิดผ้าห่มไฟฟ้า มันหนาวมาก!"}
{"word": "turn on", "english": "He forgot to turn on the coffee machine.", "thai": "เขาลืมเปิดเครื่องชงกาแฟ"}
{"word": "turn on", "english": "Let’s turn on the fog machine for the party.", "thai": "มาเปิดเครื่องพ่นหมอกสำหรับงานปาร์ตี้กัน"}
{"word": "turn on", "english": "I’ll turn on the navigation system in the car.", "thai": "ฉันจะเปิดระบบนำทางในรถ"}
{"word": "turn on", "english": "Can you turn on the ceiling light in the living room?", "thai": "คุณช่วยเปิดไฟเพดานในห้องนั่งเล่นได้ไหม?"}
{"word": "turn on", "english": "She didn’t turn on the baby monitor.", "thai": "เธอไม่ได้เปิดเครื่องตรวจจับเด็ก"}
{"word": "turn on", "english": "Turn on the hair dryer, I’m in a rush.", "thai": "เปิดไดร์เป่าผม ฉันรีบ"}
{"word": "turn on", "english": "I forgot to turn on the sprinklers this morning.", "thai": "ฉันลืมเปิดสปริงเกลอร์เช้านี้"}
{"word": "turn on", "english": "Let’s turn on the disco ball for fun!", "thai": "มาเปิดลูกบอลดิสโก้เพื่อความสนุกกัน!"}
{"word": "turn on", "english": "Can you turn on the water pump for the pool?", "thai": "คุณช่วยเปิดปั๊มน้ำสำหรับสระว่ายน้ำได้ไหม?"}
{"word": "turn on", "english": "I’ll turn on the smart TV for the movie.", "thai": "ฉันจะเปิดสมาร์ททีวีสำหรับดูหนัง"}
{"word": "turn on", "english": "Turn on the air fryer, let’s make wings.", "thai": "เปิดหม้อทอดไร้น้ำมัน มาทำปีกไก่กัน"}
{"word": "turn on", "english": "She forgot to turn on the porch camera.", "thai": "เธอลืมเปิดกล้องที่ระเบียง"}
{"word": "turn on", "english": "Can you turn on the soundbar for better audio?", "thai": "คุณช่วยเปิดซาวด์บาร์เพื่อเสียงที่ดีขึ้นได้ไหม?"}
{"word": "turn on", "english": "I need to turn on the external hard drive.", "thai": "ฉันต้องเปิดฮาร์ดไดรฟ์ภายนอก"}
{"word": "turn on", "english": "Turn on the electric stove for dinner.", "thai": "เปิดเตาไฟฟ้าสำหรับมื้อเย็น"}
{"word": "turn on", "english": "Let’s turn on the holiday decorations!", "thai": "มาเปิดของตกแต่งวันหยุดกัน!"}
{"word": "turn on", "english": "I forgot to turn on the humidifier in the bedroom.", "thai": "ฉันลืมเปิดเครื่องทำความชื้นในห้องนอน"}
{"word": "turn on", "english": "Can you turn on the car’s fog lights?", "thai": "คุณช่วยเปิดไฟตัดหมอกของรถได้ไหม?"}
{"word": "turn on", "english": "She likes to turn on the scented diffuser.", "thai": "เธอชอบเปิดเครื่องกระจายกลิ่น"}
{"word": "turn on", "english": "Turn on the portable speaker for the picnic.", "thai": "เปิดลำโพงพกพาสำหรับปิกนิก"}
{"word": "turn on", "english": "I’ll turn on the security cameras now.", "thai": "ฉันจะเปิดกล้องรักษาความปลอดภัยตอนนี้"}
{"word": "turn on", "english": "Can you turn on the overhead projector?", "thai": "คุณช่วยเปิดโปรเจคเตอร์เหนือศีรษะได้ไหม?"}
{"word": "turn on", "english": "He forgot to turn on the smart plug.", "thai": "เขาลืมเปิดปลั๊กอัจฉริยะ"}
{"word": "turn on", "english": "Let’s turn on the string lights outside.", "thai": "มาเปิดไฟประดับด้านนอกกัน"}
{"word": "turn on", "english": "I need to turn on the backup battery.", "thai": "ฉันต้องเปิดแบตเตอรี่สำรอง"}
{"word": "turn on", "english": "Turn on the toaster oven for breakfast.", "thai": "เปิดเตาอบขนมปังสำหรับอาหารเช้า"}
{"word": "turn on", "english": "She didn’t turn on the fitness tracker.", "thai": "เธอไม่ได้เปิดเครื่องติดตามฟิตเนส"}
{"word": "turn on", "english": "Can you turn on the electric fireplace?", "thai": "คุณช่วยเปิดเตาผิงไฟฟ้าได้ไหม?"}
{"word": "turn on", "english": "I’ll turn on the voice assistant to help.", "thai": "ฉันจะเปิดผู้ช่วยเสียงเพื่อช่วย"}
{"word": "turn on", "english": "Turn on the neon sign for the shop.", "thai": "เปิดป้ายนีออนสำหรับร้าน"}
{"word": "turn on", "english": "I forgot to turn on the video recorder.", "thai": "ฉันลืมเปิดเครื่องบันทึกวิดีโอ"}
{"word": "turn on", "english": "Let’s turn on the pool lights tonight.", "thai": "มาเปิดไฟสระว่ายน้ำคืนนี้กัน"}
{"word": "turn on", "english": "Can you turn on the car’s heated seats?", "thai": "คุณช่วยเปิดที่นั่งอุ่นในรถได้ไหม?"}
{"word": "turn on", "english": "She likes to turn on the white noise machine.", "thai": "เธอชอบเปิดเครื่องทำเสียงสีขาว"}
{"word": "turn on", "english": "Turn on the electric drill, let’s build this.", "thai": "เปิดสว่านไฟฟ้า มาสร้างสิ่งนี้กัน"}
{"word": "turn on", "english": "I need to turn on the backup camera.", "thai": "ฉันต้องเปิดกล้องสำรอง"}
{"word": "turn on", "english": "Can you turn on the smart thermostat?", "thai": "คุณช่วยเปิดเทอร์โมสตัทอัจฉริยะได้ไหม?"}
{"word": "turn on", "english": "Let’s turn on the LED strips for ambiance.", "thai": "มาเปิดแถบ LED เพื่อสร้างบรรยากาศกัน"}
{"word": "turn on", "english": "I forgot to turn on the sprinkler system.", "thai": "ฉันลืมเปิดระบบสปริงเกลอร์"}
{"word": "turn on", "english": "Turn on the electric fan, it’s too warm.", "thai": "เปิดพัดลมไฟฟ้า มันร้อนเกินไป"}
{"word": "turn on", "english": "She didn’t turn on the sleep tracker.", "thai": "เธอไม่ได้เปิดเครื่องติดตามการนอน"}
{"word": "turn on", "english": "Can you turn on the stage spotlight?", "thai": "คุณช่วยเปิดไฟสปอตไลท์บนเวทีได้ไหม?"}
{"word": "turn on", "english": "I’ll turn on the home theater system.", "thai": "ฉันจะเปิดระบบโฮมเธียเตอร์"}
{"word": "turn off", "english": "Can you turn off the light before you leave?", "thai": "คุณช่วยปิดไฟก่อนออกไปได้ไหม?"}
{"word": "turn off", "english": "I forgot to turn off the fan last night.", "thai": "ฉันลืมปิดพัดลมเมื่อคืนนี้"}
{"word": "turn off", "english": "Please turn off the TV, it’s too loud.", "thai": "กรุณาปิดทีวี มันดังเกินไป"}
{"word": "turn off", "english": "Why didn’t you turn off the heater?", "thai": "ทำไมคุณไม่ปิดเครื่องทำความร้อน?"}
{"word": "turn off", "english": "I’ll turn off the music so we can talk.", "thai": "ฉันจะปิดเพลงเพื่อที่เราจะได้คุยกัน"}
{"word": "turn off", "english": "Don’t forget to turn off the dishwasher after it’s done.", "thai": "อย่าลืมปิดเครื่องล้างจานหลังจากมันทำงานเสร็จ"}
{"word": "turn off", "english": "Can someone turn off the AC? It’s freezing!", "thai": "มีใครช่วยปิดแอร์ได้ไหม? มันหนาวมาก!"}
{"word": "turn off", "english": "She always forgets to turn off the radio.", "thai": "เธอมักจะลืมปิดวิทยุ"}
{"word": "turn off", "english": "I need to turn off my laptop to save battery.", "thai": "ฉันต้องปิดแล็ปท็อปเพื่อประหยัดแบตเตอรี่"}
{"word": "turn off", "english": "Who forgot to turn off the porch light?", "thai": "ใครลืมปิดไฟที่ระเบียง?"}
{"word": "turn off", "english": "Let’s turn off the projector after the meeting.", "thai": "มาปิดโปรเจคเตอร์หลังการประชุมกัน"}
{"word": "turn off", "english": "I always turn off the GPS after arriving.", "thai": "ฉันมักจะปิด GPS หลังจากถึงที่หมาย"}
{"word": "turn off", "english": "Can you turn off the oven? The cake’s done.", "thai": "คุณช่วยปิดเตาอบได้ไหม? เค้กเสร็จแล้ว"}
{"word": "turn off", "english": "He didn’t turn off the camera after the call.", "thai": "เขาไม่ได้ปิดกล้องหลังจากการโทร"}
{"word": "turn off", "english": "Turn off the sprinkler, the lawn’s soaked.", "thai": "ปิดสปริงเกลอร์ สนามหญ้าเปียกโชกแล้ว"}
{"word": "turn off", "english": "I’ll turn off the coffee maker now.", "thai": "ฉันจะปิดเครื่องชงกาแฟตอนนี้"}
{"word": "turn off", "english": "Did you turn off the security system?", "thai": "คุณปิดระบบรักษาความปลอดภัยหรือยัง?"}
{"word": "turn off", "english": "Let’s turn off the lights to save energy.", "thai": "มาปิดไฟเพื่อประหยัดพลังงานกัน"}
{"word": "turn off", "english": "She likes to turn off the humidifier during the day.", "thai": "เธอชอบปิดเครื่องทำความชื้นในช่วงกลางวัน"}
{"word": "turn off", "english": "Can you turn off the Bluetooth speaker?", "thai": "คุณช่วยปิดลำโพงบลูทูธได้ไหม?"}
{"word": "turn off", "english": "I forgot to turn off the alarm clock.", "thai": "ฉันลืมปิดนาฬิกาปลุก"}
{"word": "turn off", "english": "Turn off the vacuum cleaner, it’s too noisy.", "thai": "ปิดเครื่องดูดฝุ่น มันดังเกินไป"}
{"word": "turn off", "english": "He always forgets to turn off the webcam.", "thai": "เขามักจะลืมปิดเว็บแคม"}
{"word": "turn off", "english": "Let’s turn off the Christmas lights before bed.", "thai": "มาปิดไฟคริสต์มาสก่อนนอนกัน"}
{"word": "turn off", "english": "I’ll turn off the air purifier tonight.", "thai": "ฉันจะปิดเครื่องฟอกอากาศคืนนี้"}
{"word": "turn off", "english": "Can you turn off the water heater after your shower?", "thai": "คุณช่วยปิดเครื่องทำน้ำอุ่นหลังอาบน้ำได้ไหม?"}
{"word": "turn off", "english": "She didn’t turn off her phone during the movie.", "thai": "เธอไม่ได้ปิดโทรศัพท์ระหว่างดูหนัง"}
{"word": "turn off", "english": "Turn off the ceiling fan, it’s too cold.", "thai": "ปิดพัดลมเพดาน มันหนาวเกินไป"}
{"word": "turn off", "english": "I need to turn off the printer after scanning.", "thai": "ฉันต้องปิดเครื่องพิมพ์หลังจากสแกน"}
{"word": "turn off", "english": "Who’s going to turn off the stage lights?", "thai": "ใครจะปิดไฟเวที?"}
{"word": "turn off", "english": "I’ll turn off the flashlight to save battery.", "thai": "ฉันจะปิดไฟฉายเพื่อประหยัดแบตเตอรี่"}
{"word": "turn off", "english": "Can you turn off the car’s headlights?", "thai": "คุณช่วยปิดไฟหน้ารถได้ไหม?"}
{"word": "turn off", "english": "Let’s turn off the patio heater after the party.", "thai": "มาปิดเครื่องทำความร้อนที่ลานบ้านหลังงานปาร์ตี้กัน"}
{"word": "turn off", "english": "I forgot to turn off the slow cooker.", "thai": "ฉันลืมปิดหม้อหุงช้า"}
{"word": "turn off", "english": "Turn off the gaming console when you’re done.", "thai": "ปิดเครื่องเล่นเกมเมื่อคุณเล่นเสร็จ"}
{"word": "turn off", "english": "She likes to turn off the lamp after reading.", "thai": "เธอชอบปิดโคมไฟหลังจากอ่านหนังสือ"}
{"word": "turn off", "english": "Can you turn off the microwave after heating?", "thai": "คุณช่วยปิดไมโครเวฟหลังจากอุ่นอาหารได้ไหม?"}
{"word": "turn off", "english": "I’ll turn off the Wi-Fi router tonight.", "thai": "ฉันจะปิดเราเตอร์ Wi-Fi คืนนี้"}
{"word": "turn off", "english": "Did you turn off the garage light?", "thai": "คุณปิดไฟโรงรถหรือยัง?"}
{"word": "turn off", "english": "Let’s turn off the fountain in the garden.", "thai": "มาปิดน้ำพุในสวนกัน"}
{"word": "turn off", "english": "I need to turn off my tablet to charge it.", "thai": "ฉันต้องปิดแท็บเล็ตเพื่อชาร์จ"}
{"word": "turn off", "english": "Turn off the electric kettle after boiling.", "thai": "ปิดกาต้มน้ำไฟฟ้าหลังจากน้ำเดือด"}
{"word": "turn off", "english": "He forgot to turn off the monitor.", "thai": "เขาลืมปิดจอมอนิเตอร์"}
{"word": "turn off", "english": "Can you turn off the outdoor lights?", "thai": "คุณช่วยปิดไฟด้านนอกได้ไหม?"}
{"word": "turn off", "english": "I’ll turn off the dehumidifier now.", "thai": "ฉันจะปิดเครื่องลดความชื้นตอนนี้"}
{"word": "turn off", "english": "Turn off the blender after making smoothies.", "thai": "ปิดเครื่องปั่นหลังจากทำสมูทตี้"}
{"word": "turn off", "english": "She didn’t turn off the GPS tracker.", "thai": "เธอไม่ได้ปิดเครื่องติดตาม GPS"}
{"word": "turn off", "english": "Let’s turn off the karaoke machine now.", "thai": "มาปิดเครื่องคาราโอเกะกัน"}
{"word": "turn off", "english": "I forgot to turn off the humidifier.", "thai": "ฉันลืมปิดเครื่องทำความชื้น"}
{"word": "turn off", "english": "Can you turn off the car’s air conditioning?", "thai": "คุณช่วยปิดแอร์ในรถได้ไหม?"}
{"word": "turn off", "english": "I’ll turn off the space heater before bed.", "thai": "ฉันจะปิดเครื่องทำความร้อนก่อนนอน"}
{"word": "turn off", "english": "Turn off the smart bulb with your phone.", "thai": "ปิดหลอดไฟอัจฉริยะด้วยโทรศัพท์ของคุณ"}
{"word": "turn off", "english": "She likes to turn off the fairy lights in the morning.", "thai": "เธอชอบปิดไฟประดับในตอนเช้า"}
{"word": "turn off", "english": "Can you turn off the exhaust fan in the bathroom?", "thai": "คุณช่วยปิดพัดลมดูดอากาศในห้องน้ำได้ไหม?"}
{"word": "turn off", "english": "I need to turn off the backup generator.", "thai": "ฉันต้องปิดเครื่องกำเนิดไฟสำรอง"}
{"word": "turn off", "english": "Turn off the electric blanket, it’s too warm.", "thai": "ปิดผ้าห่มไฟฟ้า มันอุ่นเกินไป"}
{"word": "turn off", "english": "He forgot to turn off the coffee machine.", "thai": "เขาลืมปิดเครื่องชงกาแฟ"}
{"word": "turn off", "english": "Let’s turn off the fog machine after the party.", "thai": "มาปิดเครื่องพ่นหมอกหลังงานปาร์ตี้กัน"}
{"word": "turn off", "english": "I’ll turn off the navigation system now.", "thai": "ฉันจะปิดระบบนำทางตอนนี้"}
{"word": "turn off", "english": "Can you turn off the ceiling light in the living room?", "thai": "คุณช่วยปิดไฟเพดานในห้องนั่งเล่นได้ไหม?"}
{"word": "turn off", "english": "She didn’t turn off the baby monitor.", "thai": "เธอไม่ได้ปิดเครื่องตรวจจับเด็ก"}
{"word": "turn off", "english": "Turn off the hair dryer when you’re done.", "thai": "ปิดไดร์เป่าผมเมื่อคุณใช้เสร็จ"}
{"word": "turn off", "english": "I forgot to turn off the sprinklers.", "thai": "ฉันลืมปิดสปริงเกลอร์"}
{"word": "turn off", "english": "Let’s turn off the disco ball now.", "thai": "มาปิดลูกบอลดิสโก้กัน"}
{"word": "turn off", "english": "Can you turn off the water pump for the pool?", "thai": "คุณช่วยปิดปั๊มน้ำสำหรับสระว่ายน้ำได้ไหม?"}
{"word": "turn off", "english": "I’ll turn off the smart TV after the movie.", "thai": "ฉันจะปิดสมาร์ททีวีหลังจากดูหนัง"}
{"word": "turn off", "english": "Turn off the air fryer when it’s done.", "thai": "ปิดหม้อทอดไร้น้ำมันเมื่อมันเสร็จ"}
{"word": "turn off", "english": "She forgot to turn off the porch camera.", "thai": "เธอลืมปิดกล้องที่ระเบียง"}
{"word": "turn off", "english": "Can you turn off the soundbar after the show?", "thai": "คุณช่วยปิดซาวด์บาร์หลังจากรายการจบได้ไหม?"}
{"word": "turn off", "english": "I need to turn off the external hard drive.", "thai": "ฉันต้องปิดฮาร์ดไดรฟ์ภายนอก"}
{"word": "turn off", "english": "Turn off the electric stove after cooking.", "thai": "ปิดเตาไฟฟ้าหลังจากทำอาหาร"}
{"word": "turn off", "english": "Let’s turn off the holiday decorations now.", "thai": "มาปิดของตกแต่งวันหยุดกัน"}
{"word": "turn off", "english": "I forgot to turn off the humidifier in the bedroom.", "thai": "ฉันลืมปิดเครื่องทำความชื้นในห้องนอน"}
{"word": "turn off", "english": "Can you turn off the car’s fog lights?", "thai": "คุณช่วยปิดไฟตัดหมอกของรถได้ไหม?"}
{"word": "turn off", "english": "She likes to turn off the scented diffuser at night.", "thai": "เธอชอบปิดเครื่องกระจายกลิ่นตอนกลางคืน"}
{"word": "turn off", "english": "Turn off the portable speaker after the picnic.", "thai": "ปิดลำโพงพกพาหลังจากปิกนิก"}
{"word": "turn off", "english": "I’ll turn off the security cameras now.", "thai": "ฉันจะปิดกล้องรักษาความปลอดภัยตอนนี้"}
{"word": "turn off", "english": "Can you turn off the overhead projector?", "thai": "คุณช่วยปิดโปรเจคเตอร์เหนือศีรษะได้ไหม?"}
{"word": "turn off", "english": "He forgot to turn off the smart plug.", "thai": "เขาลืมปิดปลั๊กอัจฉริยะ"}
{"word": "turn off", "english": "Let’s turn off the string lights outside.", "thai": "มาปิดไฟประดับด้านนอกกัน"}
{"word": "turn off", "english": "I need to turn off the backup battery.", "thai": "ฉันต้องปิดแบตเตอรี่สำรอง"}
{"word": "turn off", "english": "Turn off the toaster oven after breakfast.", "thai": "ปิดเตาอบขนมปังหลังอาหารเช้า"}
{"word": "turn off", "english": "She didn’t turn off the fitness tracker.", "thai": "เธอไม่ได้ปิดเครื่องติดตามฟิตเนส"}
{"word": "turn off", "english": "Can you turn off the electric fireplace?", "thai": "คุณช่วยปิดเตาผิงไฟฟ้าได้ไหม?"}
{"word": "turn off", "english": "I’ll turn off the voice assistant now.", "thai": "ฉันจะปิดผู้ช่วยเสียงตอนนี้"}
{"word": "turn off", "english": "Turn off the neon sign after closing the shop.", "thai": "ปิดป้ายนีออนหลังจากปิดร้าน"}
{"word": "turn off", "english": "I forgot to turn off the video recorder.", "thai": "ฉันลืมปิดเครื่องบันทึกวิดีโอ"}
{"word": "turn off", "english": "Let’s turn off the pool lights tonight.", "thai": "มาปิดไฟสระว่ายน้ำคืนนี้กัน"}
{"word": "turn off", "english": "Can you turn off the car’s heated seats?", "thai": "คุณช่วยปิดที่นั่งอุ่นในรถได้ไหม?"}
{"word": "turn off", "english": "She likes to turn off the white noise machine in the morning.", "thai": "เธอชอบปิดเครื่องทำเสียงสีขาวในตอนเช้า"}
{"word": "turn off", "english": "Turn off the electric drill when you’re done.", "thai": "ปิดสว่านไฟฟ้าเมื่อคุณใช้เสร็จ"}
{"word": "turn off", "english": "I need to turn off the backup camera.", "thai": "ฉันต้องปิดกล้องสำรอง"}
{"word": "turn off", "english": "Can you turn off the smart thermostat?", "thai": "คุณช่วยปิดเทอร์โมสตัทอัจฉริยะได้ไหม?"}
{"word": "turn off", "english": "Let’s turn off the LED strips now.", "thai": "มาปิดแถบ LED กัน"}
{"word": "turn off", "english": "I forgot to turn off the sprinkler system.", "thai": "ฉันลืมปิดระบบสปริงเกลอร์"}
{"word": "turn off", "english": "Turn off the electric fan, it’s cool enough.", "thai": "ปิดพัดลมไฟฟ้า มันเย็นพอแล้ว"}
{"word": "turn off", "english": "She didn’t turn off the sleep tracker.", "thai": "เธอไม่ได้ปิดเครื่องติดตามการนอน"}
{"word": "turn off", "english": "Can you turn off the stage spotlight?", "thai": "คุณช่วยปิดไฟสปอตไลท์บนเวทีได้ไหม?"}
{"word": "turn off", "english": "I’ll turn off the home theater system now.", "thai": "ฉันจะปิดระบบโฮมเธียเตอร์ตอนนี้"}
{"word": "tune in", "english": "Hey, tune in to the radio at 7 PM for the live show!", "thai": "เฮ้ เปิดวิทยุตอนหนึ่งทุ่มเพื่อฟังรายการสด!"}
{"word": "tune in", "english": "Don’t forget to tune in to the game tonight on Channel 5.", "thai": "อย่าลืมเปิดช่อง 5 เพื่อดูเกมคืนนี้"}
{"word": "tune in", "english": "I always tune in to her podcast on my commute.", "thai": "ฉันมักจะฟังพอดแคสต์ของเธอระหว่างเดินทาง"}
{"word": "tune in", "english": "Can you tune in to NPR for the news update?", "thai": "คุณช่วยเปิด NPR เพื่อฟังข่าวอัปเดตได้ไหม?"}
{"word": "tune in", "english": "Let’s tune in to the awards show at 8 PM.", "thai": "มาเปิดดูงานประกาศรางวัลตอนสองทุ่มกัน"}
{"word": "tune in", "english": "I’m going to tune in to the live stream on YouTube.", "thai": "ฉันจะดูสตรีมสดบนยูทูบ"}
{"word": "tune in", "english": "Tune in to the morning show for a chance to win tickets.", "thai": "เปิดรายการตอนเช้าเพื่อลุ้นรับตั๋ว"}
{"word": "tune in", "english": "She loves to tune in to classic rock on the radio.", "thai": "เธอชอบเปิดฟังเพลงร็อคคลาสสิกทางวิทยุ"}
{"word": "tune in", "english": "Why don’t we tune in to the debate tonight?", "thai": "ทำไมเราไม่เปิดดูการดีเบตคืนนี้ล่ะ?"}
{"word": "tune in", "english": "I forgot to tune in to the talk show yesterday.", "thai": "ฉันลืมเปิดดูรายการทอล์คโชว์เมื่อวาน"}
{"word": "tune in", "english": "Tune in to the sports channel for the highlights.", "thai": "เปิดช่องกีฬาเพื่อดูไฮไลต์"}
{"word": "tune in", "english": "He always tunes in to the weather report before work.", "thai": "เขามักจะฟังรายงานสภาพอากาศก่อนไปทำงาน"}
{"word": "tune in", "english": "Let’s tune in to the concert broadcast tonight.", "thai": "มาเปิดดูการถ่ายทอดคอนเสิร์ตคืนนี้กัน"}
{"word": "tune in", "english": "Can you tune in to the local station for traffic updates?", "thai": "คุณช่วยเปิดสถานีท้องถิ่นเพื่อฟังอัปเดตการจราจรได้ไหม?"}
{"word": "tune in", "english": "I’ll tune in to the webinar at 3 PM.", "thai": "ฉันจะเข้าร่วมสัมมนาออนไลน์ตอนบ่ายสาม"}
{"word": "tune in", "english": "Tune in to the cooking show for some great recipes.", "thai": "เปิดดูรายการทำอาหารเพื่อหาสูตรเด็ดๆ"}
{"word": "tune in", "english": "She didn’t tune in to the live Q&A session.", "thai": "เธอไม่ได้เข้าร่วมเซสชันถามตอบสด"}
{"word": "tune in", "english": "Let’s tune in to the comedy special on Netflix.", "thai": "มาเปิดดูรายการตลกพิเศษบนเน็ตฟลิกซ์กัน"}
{"word": "tune in", "english": "I always tune in to the evening news at 6.", "thai": "ฉันมักจะดูข่าวตอนเย็นตอนหกโมง"}
{"word": "tune in", "english": "Can you tune in to the jazz station tonight?", "thai": "คุณช่วยเปิดสถานีแจ๊สคืนนี้ได้ไหม?"}
{"word": "tune in", "english": "Tune in to the podcast for the latest episode.", "thai": "ฟังพอดแคสต์เพื่อตอนล่าสุด"}
{"word": "tune in", "english": "He forgot to tune in to the live interview.", "thai": "เขาลืมเปิดดูการสัมภาษณ์สด"}
{"word": "tune in", "english": "Let’s tune in to the reality show finale.", "thai": "มาเปิดดูตอนจบของรายการเรียลลิตี้กัน"}
{"word": "tune in", "english": "I’ll tune in to the radio for the sports commentary.", "thai": "ฉันจะฟังวิทยุเพื่อฟังการวิจารณ์กีฬา"}
{"word": "tune in", "english": "Tune in to Channel 7 for the movie premiere.", "thai": "เปิดช่อง 7 เพื่อดูรอบปฐมทัศน์ของภาพยนตร์"}
{"word": "tune in", "english": "She loves to tune in to the gardening show on weekends.", "thai": "เธอชอบดูรายการทำสวนในวันหยุดสุดสัปดาห์"}
{"word": "tune in", "english": "Can you tune in to the live podcast at 5?", "thai": "คุณช่วยฟังพอดแคสต์สดตอนห้าโมงได้ไหม?"}
{"word": "tune in", "english": "I forgot to tune in to the political debate.", "thai": "ฉันลืมเปิดดูการดีเบตทางการเมือง"}
{"word": "tune in", "english": "Tune in to the music channel for the countdown.", "thai": "เปิดช่องเพลงเพื่อดูการนับถอยหลัง"}
{"word": "tune in", "english": "He always tunes in to the morning talk show.", "thai": "เขามักจะฟังรายการทอล์คโชว์ตอนเช้า"}
{"word": "tune in", "english": "Let’s tune in to the live election coverage.", "thai": "มาเปิดดูการถ่ายทอดสดการเลือกตั้งกัน"}
{"word": "tune in", "english": "Can you tune in to the kids’ channel for the cartoon?", "thai": "คุณช่วยเปิดช่องเด็กเพื่อดูการ์ตูนได้ไหม?"}
{"word": "tune in", "english": "I’ll tune in to the tech podcast later.", "thai": "ฉันจะฟังพอดแคสต์เทคโนโลยีทีหลัง"}
{"word": "tune in", "english": "Tune in to the sports talk show at 9 PM.", "thai": "เปิดฟังรายการทอล์คโชว์กีฬาตอนสามทุ่ม"}
{"word": "tune in", "english": "She didn’t tune in to the live concert stream.", "thai": "เธอไม่ได้ดูสตรีมคอนเสิร์ตสด"}
{"word": "tune in", "english": "Let’s tune in to the science channel tonight.", "thai": "มาเปิดดูช่องวิทยาศาสตร์คืนนี้กัน"}
{"word": "tune in", "english": "I always tune in to the traffic report before driving.", "thai": "ฉันมักจะฟังรายงานการจราจรก่อนขับรถ"}
{"word": "tune in", "english": "Can you tune in to the classical music station?", "thai": "คุณช่วยเปิดสถานีเพลงคลาสสิกได้ไหม?"}
{"word": "tune in", "english": "Tune in to the cooking stream for tips.", "thai": "ดูสตรีมทำอาหารเพื่อหาเคล็ดลับ"}
{"word": "tune in", "english": "He forgot to tune in to the radio contest.", "thai": "เขาลืมฟังการแข่งขันทางวิทยุ"}
{"word": "tune in", "english": "Let’s tune in to the live Q&A on Instagram.", "thai": "มาเข้าร่วมถามตอบสดบนอินสตาแกรมกัน"}
{"word": "tune in", "english": "I’ll tune in to the news channel at 10.", "thai": "ฉันจะดูช่องข่าวตอนสี่ทุ่ม"}
{"word": "tune in", "english": "Tune in to the comedy podcast for a laugh.", "thai": "ฟังพอดแคสต์ตลกเพื่อหัวเราะ"}
{"word": "tune in", "english": "She loves to tune in to the fashion show stream.", "thai": "เธอชอบดูสตรีมแฟชั่นโชว์"}
{"word": "tune in", "english": "Can you tune in to the local radio station?", "thai": "คุณช่วยเปิดสถานีวิทยุท้องถิ่นได้ไหม?"}
{"word": "tune in", "english": "I forgot to tune in to the sports recap show.", "thai": "ฉันลืมดูรายการสรุปกีฬา"}
{"word": "tune in", "english": "Tune in to the history channel for the documentary.", "thai": "เปิดช่องประวัลัยเพื่อดูสารคดี"}
{"word": "tune in", "english": "He always tunes in to the financial news.", "thai": "เขามักจะฟังข่าวการเงิน"}
{"word": "tune in", "english": "Let’s tune in to the talent show tonight.", "thai": "มาเปิดดูรายการประกวดความสามารถคืนนี้กัน"}
{"word": "tune in", "english": "Can you tune in to the weather channel now?", "thai": "คุณช่วยเปิดช่องพยากรณ์อากาศตอนนี้ได้ไหม?"}
{"word": "tune in", "english": "I’ll tune in to the gaming stream later.", "thai": "ฉันจะดูสตรีมเกมทีหลัง"}
{"word": "tune in", "english": "Tune in to the talk radio for the discussion.", "thai": "ฟังวิทยุทอล์คโชว์เพื่อการสนทนา"}
{"word": "tune in", "english": "She didn’t tune in to the live tutorial.", "thai": "เธอไม่ได้ดูบทเรียนสด"}
{"word": "tune in", "english": "Let’s tune in to the movie marathon tonight.", "thai": "มาเปิดดูมาราธอนภาพยนตร์คืนนี้กัน"}
{"word": "tune in", "english": "I always tune in to the fitness podcast.", "thai": "ฉันมักจะฟังพอดแคสต์ฟิตเนส"}
{"word": "tune in", "english": "Can you tune in to the pop music station?", "thai": "คุณช่วยเปิดสถานีเพลงป็อปได้ไหม?"}
{"word": "tune in", "english": "Tune in to the live event on Facebook.", "thai": "เข้าร่วมงานสดบนเฟซบุ๊ก"}
{"word": "tune in", "english": "He forgot to tune in to the charity stream.", "thai": "เขาลืมดูสตรีมการกุศล"}
{"word": "tune in", "english": "Let’s tune in to the cooking competition show.", "thai": "มาเปิดดูรายการแข่งขันทำอาหารกัน"}
{"word": "tune in", "english": "I’ll tune in to the radio for the interview.", "thai": "ฉันจะฟังวิทยุเพื่อฟังการสัมภาษณ์"}
{"word": "tune in", "english": "Tune in to the science podcast for updates.", "thai": "ฟังพอดแคสต์วิทยาศาสตร์เพื่ออัปเดต"}
{"word": "tune in", "english": "She loves to tune in to the travel channel.", "thai": "เธอชอบดูช่องท่องเที่ยว"}
{"word": "tune in", "english": "Can you tune in to the sports radio station?", "thai": "คุณช่วยเปิดสถานีวิทยุกีฬาได้ไหม?"}
{"word": "tune in", "english": "I forgot to tune in to the live workout session.", "thai": "ฉันลืมเข้าร่วมเซสชันออกกำลังกายสด"}
{"word": "tune in", "english": "Tune in to the news podcast for the headlines.", "thai": "ฟังพอดแคสต์ข่าวเพื่อพาดหัวข่าว"}
{"word": "tune in", "english": "He always tunes in to the business channel.", "thai": "เขามักจะดูช่องธุรกิจ"}
{"word": "tune in", "english": "Let’s tune in to the reality TV premiere.", "thai": "มาเปิดดูรอบปฐมทัศน์รายการเรียลลิตี้กัน"}
{"word": "tune in", "english": "Can you tune in to the kids’ radio show?", "thai": "คุณช่วยเปิดรายการวิทยุสำหรับเด็กได้ไหม?"}
{"word": "tune in", "english": "I’ll tune in to the tech conference stream.", "thai": "ฉันจะดูสตรีมการประชุมเทคโนโลยี"}
{"word": "tune in", "english": "Tune in to the comedy channel for the special.", "thai": "เปิดช่องตลกเพื่อดูรายการพิเศษ"}
{"word": "tune in", "english": "She didn’t tune in to the live book reading.", "thai": "เธอไม่ได้ฟังการอ่านหนังสือสด"}
{"word": "tune in", "english": "Let’s tune in to the music awards tonight.", "thai": "มาเปิดดูงานประกาศรางวัลเพลงคืนนี้กัน"}
{"word": "tune in", "english": "I always tune in to the morning weather update.", "thai": "ฉันมักจะฟังอัปเดตสภาพอากาศตอนเช้า"}
{"word": "tune in", "english": "Can you tune in to the country music station?", "thai": "คุณช่วยเปิดสถานีเพลงคันทรีได้ไหม?"}
{"word": "tune in", "english": "Tune in to the live cooking class online.", "thai": "เข้าร่วมคลาสทำอาหารสดออนไลน์"}
{"word": "tune in", "english": "He forgot to tune in to the tech talk show.", "thai": "เขาลืมฟังรายการทอล์คโชว์เทคโนโลยี"}
{"word": "tune in", "english": "Let’s tune in to the nature documentary tonight.", "thai": "มาเปิดดูสารคดีธรรมชาติคืนนี้กัน"}
{"word": "tune in", "english": "I’ll tune in to the fitness stream later.", "thai": "ฉันจะดูสตรีมฟิตเนสทีหลัง"}
{"word": "tune in", "english": "Tune in to the radio for the giveaway.", "thai": "ฟังวิทยุเพื่อลุ้นรับของรางวัล"}
{"word": "tune in", "english": "She loves to tune in to the lifestyle podcast.", "thai": "เธอชอบฟังพอดแคสต์ไลฟ์สไตล์"}
{"word": "tune in", "english": "Can you tune in to the local news channel?", "thai": "คุณช่วยเปิดช่องข่าวท้องถิ่นได้ไหม?"}
{"word": "tune in", "english": "I forgot to tune in to the live art stream.", "thai": "ฉันลืมดูสตรีมศิลปะสด"}
{"word": "tune in", "english": "Tune in to the movie channel for the classic film.", "thai": "เปิดช่องภาพยนตร์เพื่อดูหนังคลาสสิก"}
{"word": "tune in", "english": "He always tunes in to the political podcast.", "thai": "เขามักจะฟังพอดแคสต์การเมือง"}
{"word": "tune in", "english": "Let’s tune in to the holiday special tonight.", "thai": "มาเปิดดูรายการพิเศษวันหยุดคืนนี้กัน"}
{"word": "tune in", "english": "Can you tune in to the hip-hop radio station?", "thai": "คุณช่วยเปิดสถานีวิทยุฮิปฮอปได้ไหม?"}
{"word": "tune in", "english": "I’ll tune in to the live gaming tournament.", "thai": "ฉันจะดูการแข่งขันเกมสด"}
{"word": "tune in", "english": "Tune in to the science talk show at 8.", "thai": "ฟังรายการทอล์คโชว์วิทยาศาสตร์ตอนสองทุ่ม"}
{"word": "tune in", "english": "She didn’t tune in to the live yoga session.", "thai": "เธอไม่ได้เข้าร่วมเซสชันโยคะสด"}
{"word": "tune in", "english": "Let’s tune in to the travel podcast tonight.", "thai": "มาฟังพอดแคสต์ท่องเที่ยวคืนนี้กัน"}
{"word": "tune in", "english": "I always tune in to the sports news at 7.", "thai": "ฉันมักจะดูข่าวกีฬาตอนหนึ่งทุ่ม"}
{"word": "tune in", "english": "Can you tune in to the rock music channel?", "thai": "คุณช่วยเปิดช่องเพลงร็อคได้ไหม?"}
{"word": "tune in", "english": "Tune in to the live charity event online.", "thai": "เข้าร่วมงานการกุศลสดออนไลน์"}
{"word": "tune in", "english": "He forgot to tune in to the business webinar.", "thai": "เขาลืมนเข้าร่วมสัมมนาธุรกิจ"}
{"word": "tune in", "english": "Let’s tune in to the late-night talk show.", "thai": "มาเปิดดูรายการทอล์คโชว์ดึกๆ กัน"}
{"word": "tune in", "english": "I’ll tune in to the history podcast later.", "thai": "ฉันจะฟังพอดแคสต์ประวัติศาสตร์ทีหลัง"}
{"word": "tune in", "english": "Tune in to the kids’ show for the new episode.", "thai": "เปิดดูรายการเด็กเพื่อตอนใหม่"}
{"word": "tune in", "english": "She loves to tune in to the morning radio.", "thai": "เธอชอบฟังวิทยุตอนเช้า"}
{"word": "tune in", "english": "Can you tune in to the news stream now?", "thai": "คุณช่วยดูสตรีมข่าวตอนนี้ได้ไหม?"}
{"word": "tune in", "english": "I forgot to tune in to the live music stream.", "thai": "ฉันลืมดูสตรีมดนตรีสด"}
{"word": "zone out", "english": "I tend to zone out during long meetings.", "thai": "ฉันมักจะเหม่อลอยในระหว่างการประชุมยาวๆ"}
{"word": "zone out", "english": "Don’t zone out while I’m explaining this!", "thai": "อย่าเหม่อลอยขณะที่ฉันกำลังอธิบาย!"}
{"word": "zone out", "english": "She zoned out watching the rain fall.", "thai": "เธอเหม่อลอยขณะมองฝนตก"}
{"word": "zone out", "english": "I zoned out during the boring lecture.", "thai": "ฉันเหม่อลอยในระหว่างการบรรยายที่น่าเบื่อ"}
{"word": "zone out", "english": "He tends to zone out when he’s tired.", "thai": "เขามักจะเหม่อลอยเมื่อรู้สึกเหนื่อย"}
{"word": "zone out", "english": "I didn’t mean to zone out; it just happened.", "thai": "ฉันไม่ได้ตั้งใจเหม่อลอย มันเกิดขึ้นเอง"}
{"word": "zone out", "english": "She zones out when she’s stressed out.", "thai": "เธอเหม่อลอยเมื่อรู้สึกเครียด"}
{"word": "zone out", "english": "I always zone out during math class.", "thai": "ฉันมักจะเหม่อลอยในชั้นเรียนคณิตศาสตร์"}
{"word": "zone out", "english": "Don’t zone out while driving, okay?", "thai": "อย่าเหม่อลอยขณะขับรถนะ!"}
{"word": "zone out", "english": "He zoned out staring at his phone screen.", "thai": "เขาเหม่อลอยขณะจ้องหน้าจอโทรศัพท์"}
{"word": "zone out", "english": "I zoned out while watching that movie.", "thai": "ฉันเหม่อลอยขณะดูหนังเรื่องนั้น"}
{"word": "zone out", "english": "She tends to zone out during long car rides.", "thai": "เธอมักจะเหม่อลอยระหว่างการเดินทางโดยรถยนต์นานๆ"}
{"word": "zone out", "english": "I didn’t hear you; I zoned out for a second.", "thai": "ฉันไม่ได้ยินคุณ ฉันเหม่อลอยไปชั่วขณะ"}
{"word": "zone out", "english": "He zones out when he’s listening to music.", "thai": "เขาเหม่อลอยเมื่อฟังเพลง"}
{"word": "zone out", "english": "I zoned out during the history lesson.", "thai": "ฉันเหม่อลอยในระหว่างบทเรียนประวัติศาสตร์"}
{"word": "zone out", "english": "She zoned out while reading her book.", "thai": "เธอเหม่อลอยขณะอ่านหนังสือ"}
{"word": "zone out", "english": "Don’t zone out during the presentation!", "thai": "อย่าเหม่อลอยระหว่างการนำเสนอ!"}
{"word": "zone out", "english": "I tend to zone out when I’m bored.", "thai": "ฉันมักจะเหม่อลอยเมื่อรู้สึกเบื่อ"}
{"word": "zone out", "english": "He zoned out during the team meeting.", "thai": "เขาเหม่อลอยในระหว่างการประชุมทีม"}
{"word": "zone out", "english": "I zoned out staring at the ocean waves.", "thai": "ฉันเหม่อลอยขณะมองคลื่นทะเล"}
{"word": "zone out", "english": "She zones out when she’s overworked.", "thai": "เธอเหม่อลอยเมื่อทำงานหนักเกินไป"}
{"word": "zone out", "english": "I always zone out during long flights.", "thai": "ฉันมักจะเหม่อลอยระหว่างการบินนานๆ"}
{"word": "zone out", "english": "He zoned out while waiting at the doctor’s office.", "thai": "เขาเหม่อลอยขณะรอที่คลินิกหมอ"}
{"word": "zone out", "english": "Don’t zone out; this part is important!", "thai": "อย่าเหม่อลอย ส่วนนี้สำคัญ!"}
{"word": "zone out", "english": "I zoned out during the science lecture.", "thai": "ฉันเหม่อลอยในระหว่างการบรรยายวิทยาศาสตร์"}
{"word": "zone out", "english": "She zoned out while doing her homework.", "thai": "เธอเหม่อลอยขณะทำการบ้าน"}
{"word": "zone out", "english": "I tend to zone out in quiet rooms.", "thai": "ฉันมักจะเหม่อลอยในห้องเงียบๆ"}
{"word": "zone out", "english": "He zones out when he’s daydreaming.", "thai": "เขาเหม่อลอยเมื่อฝันกลางวัน"}
{"word": "zone out", "english": "I zoned out during the long speech.", "thai": "ฉันเหม่อลอยในระหว่างสุนทรพจน์ยาวๆ"}
{"word": "zone out", "english": "She zoned out looking at the clouds.", "thai": "เธอเหม่อลอยขณะมองเมฆ"}
{"word": "zone out", "english": "Don’t zone out while I’m talking to you!", "thai": "อย่าเหม่อลอยขณะที่ฉันกำลังคุยกับคุณ!"}
{"word": "zone out", "english": "I zoned out during the training session.", "thai": "ฉันเหม่อลอยในระหว่างการฝึกอบรม"}
{"word": "zone out", "english": "He tends to zone out in crowded places.", "thai": "เขามักจะเหม่อลอยในสถานที่แออัด"}
{"word": "zone out", "english": "I zoned out while washing the dishes.", "thai": "ฉันเหม่อลอยขณะล้างจาน"}
{"word": "zone out", "english": "She zones out when she’s really tired.", "thai": "เธอเหม่อลอยเมื่อรู้สึกเหนื่อยมาก"}
{"word": "zone out", "english": "I always zone out during long webinars.", "thai": "ฉันมักจะเหม่อลอยระหว่างสัมมนาออนไลน์นานๆ"}
{"word": "zone out", "english": "He zoned out during the boring movie.", "thai": "เขาเหม่อลอยในระหว่างหนังที่น่าเบื่อ"}
{"word": "zone out", "english": "I zoned out staring at the fireplace.", "thai": "ฉันเหม่อลอยขณะมองเตาผิง"}
{"word": "zone out", "english": "She zoned out during the group discussion.", "thai": "เธอเหม่อลอยในระหว่างการสนทนากลุ่ม"}
{"word": "zone out", "english": "Don’t zone out while studying for the exam!", "thai": "อย่าเหม่อลอยขณะอ่านหนังสือสอบ!"}
{"word": "zone out", "english": "I tend to zone out when I’m hungry.", "thai": "ฉันมักจะเหม่อลอยเมื่อหิว"}
{"word": "zone couple of minutes.", "thai": "ฉันเหม่อลอยไปสองสามนาที"}
{"word": "zone out", "english": "She zones out when she’s on the bus.", "thai": "เธอเหม่อลอยเมื่ออยู่บนรถบัส"}
{"word": "zone out", "english": "I zoned out during the online class.", "thai": "ฉันเหม่อลอยในระหว่างชั้นเรียนออนไลน์"}
{"word": "zone out", "english": "He zoned out while mowing the lawn.", "thai": "เขาเหม่อลอยขณะตัดหญ้า"}
{"word": "zone out", "english": "I always zone out in waiting rooms.", "thai": "ฉันมักจะเหม่อลอยในห้องรอ"}
{"word": "zone out", "english": "She zoned out during the long commute.", "thai": "เธอเหม่อลอยในระหว่างการเดินทางนานๆ"}
{"word": "zone out", "english": "Don’t zone out during the safety briefing!", "thai": "อย่าเหม่อลอยในระหว่างการบรรยายความปลอดภัย!"}
{"word": "zone out", "english": "I zoned out while folding laundry.", "thai": "ฉันเหม่อลอยขณะพับผ้า"}
{"word": "zone out", "english": "He tends to zone out during long calls.", "thai": "เขามักจะเหม่อลอยในระหว่างการโทรนานๆ"}
{"word": "zone out", "english": "I zoned out staring at the stars.", "thai": "ฉันเหม่อลอยขณะมองดวงดาว"}
{"word": "zone out", "english": "She zoned out during the boring podcast.", "thai": "เธอเหม่อลอยในระหว่างพอดแคสต์ที่น่าเบื่อ"}
{"word": "zone out", "english": "I tend to zone out when I’m nervous.", "thai": "ฉันมักจะเหม่อลอยเมื่อรู้สึกประหม่า"}
{"word": "zone out", "english": "He zoned out during the staff meeting.", "thai": "เขาเหม่อลอยในระหว่างการประชุมพนักงาน"}
{"word": "zone out", "english": "I zoned out while painting the wall.", "thai": "ฉันเหม่อลอยขณะทาสีผนัง"}
{"word": "zone out", "english": "She zones out when she’s deep in thought.", "thai": "เธอเหม่อลอยเมื่อจมอยู่ในความคิด"}
{"word": "zone out", "english": "Don’t zone out during the driving lesson!", "thai": "อย่าเหม่อลอยในระหว่างบทเรียนขับรถ!"}
{"word": "zone out", "english": "I zoned out during the chemistry class.", "thai": "ฉันเหม่อลอยในระหว่างชั้นเรียนเคมี"}
{"word": "zone out", "english": "He zoned out while watching TV.", "thai": "เขาเหม่อลอยขณะดูทีวี"}
{"word": "zone out", "english": "I always zone out during long sermons.", "thai": "ฉันมักจะเหม่อลอยในระหว่างเทศนานานๆ"}
{"word": "zone out", "english": "She zoned out staring at the sunset.", "thai": "เธอเหม่อลอยขณะมองพระอาทิตย์ตก"}
{"word": "zone out", "english": "I zoned out during the project briefing.", "thai": "ฉันเหม่อลอยในระหว่างการบรรยายโครงการ"}
{"word": "zone out", "english": "He tends to zone out in noisy places.", "thai": "เขามักจะเหม่อลอยในสถานที่ที่มีเสียงดัง"}
{"word": "zone out", "english": "Don’t zone out while I’m giving directions!", "thai": "อย่าเหม่อลอยขณะที่ฉันกำลังบอกทาง!"}
{"word": "zone out", "english": "I zoned out while cleaning the house.", "thai": "ฉันเหม่อลอยขณะทำความสะอาดบ้าน"}
{"word": "zone out", "english": "She zoned out during the long movie.", "thai": "เธอเหม่อลอยในระหว่างหนังยาวๆ"}
{"word": "zone out", "english": "I tend to zone out when I’m relaxed.", "thai": "ฉันมักจะเหม่อลอยเมื่อรู้สึกผ่อนคลาย"}
{"word": "zone out", "english": "He zoned out during the board meeting.", "thai": "เขาเหม่อลอยในระหว่างการประชุมคณะกรรมการ"}
{"word": "zone out", "english": "I zoned out while gardening this morning.", "thai": "ฉันเหม่อลอยขณะทำสวนเช้านี้"}
{"word": "zone out", "english": "She zones out when she’s feeling overwhelmed.", "thai": "เธอเหม่อลอยเมื่อรู้สึกหนักใจ"}
{"word": "zone out", "english": "I always zone out during long train rides.", "thai": "ฉันมักจะเหม่อลอยในระหว่างการนั่งรถไฟนานๆ"}
{"word": "zone out", "english": "He zoned out while doing paperwork.", "thai": "เขาเหม่อลอยขณะทำเอกสาร"}
{"word": "zone out", "english": "Don’t zone out during the cooking class!", "thai": "อย่าเหม่อลอยในระหว่างคลาสทำอาหาร!"}
{"word": "zone out", "english": "I zoned out staring at the raindrops.", "thai": "ฉันเหม่อลอยขณะมองหยดฝน"}
{"word": "zone out", "english": "She zoned out during the online meeting.", "thai": "เธอเหม่อลอยในระหว่างการประชุมออนไลน์"}
{"word": "zone out", "english": "I tend to zone out when I’m distracted.", "thai": "ฉันมักจะเหม่อลอยเมื่อเสียสมาธิ"}
{"word": "zone out", "english": "He zoned out while waiting for the bus.", "thai": "เขาเหม่อลอยขณะรอรถบัส"}
{"word": "zone out", "english": "I zoned out during the long podcast.", "thai": "ฉันเหม่อลอยในระหว่างพอดแคสต์ยาวๆ"}
{"word": "zone out", "english": "She zoned out while knitting a scarf.", "thai": "เธอเหม่อลอยขณะถักผ้าพันคอ"}
{"word": "zone out", "english": "Don’t zone out during the team huddle!", "thai": "อย่าเหม่อลอยในระหว่างการรวมตัวทีม!"}
{"word": "zone out", "english": "I zoned out while watching the clouds.", "thai": "ฉันเหม่อลอยขณะมองเมฆ"}
{"word": "zone out", "english": "He tends to zone out during long walks.", "thai": "เขามักจะเหม่อลอยในระหว่างการเดินนานๆ"}
{"word": "zone out", "english": "I always zone out in boring classes.", "thai": "ฉันมักจะเหม่อลอยในชั้นเรียนที่น่าเบื่อ"}
{"word": "zone out", "english": "She zoned out during the seminar.", "thai": "เธอเหม่อลอยในระหว่างสัมมนา"}
{"word": "zone out", "english": "I zoned out while ironing clothes.", "thai": "ฉันเหม่อลอยขณะรีดผ้า"}
{"word": "zone out", "english": "Don’t zone out while I’m explaining the rules!", "thai": "อย่าเหม่อลอยขณะที่ฉันกำลังอธิบายกติกา!"}
{"word": "zone out", "english": "He zoned out during the long drive.", "thai": "เขาเหม่อลอยในระหว่างการขับรถนานๆ"}
{"word": "zone out", "english": "I zoned out while listening to the radio.", "thai": "ฉันเหม่อลอยขณะฟังวิทยุ"}
{"word": "zone out", "english": "She tends to zone out in quiet moments.", "thai": "เธอมักจะเหม่อลอยในช่วงเวลาที่เงียบสงบ"}
{"word": "zone out", "english": "I zoned out during the team call.", "thai": "ฉันเหม่อลอยในระหว่างการโทรทีม"}
{"word": "zone out", "english": "He zoned out while watching the game.", "thai": "เขาเหม่อลอยขณะดูเกม"}
{"word": "zone out", "english": "I always zone out during long emails.", "thai": "ฉันมักจะเหม่อลอยเมื่ออ่านอีเมลยาวๆ"}
{"word": "zone out", "english": "She zoned out while painting the room.", "thai": "เธอเหม่อลอยขณะทาสีห้อง"}
{"word": "zone out", "english": "Don’t zone out during the lecture!", "thai": "อย่าเหม่อลอยในระหว่างการบรรยาย!"}
{"word": "zone out", "english": "I zoned out while cooking dinner.", "thai": "ฉันเหม่อลอยขณะทำอาหารเย็น"}
{"word": "zone out", "english": "He zoned out during the movie credits.", "thai": "เขาเหม่อลอยในระหว่างเครดิตหนัง"}
{"word": "zone out", "english": "I tend to zone out when I’m sleepy.", "thai": "ฉันมักจะเหม่อลอยเมื่อง่วงนอน"}
{"word": "zone out", "english": "She zoned out while sitting on the porch.", "thai": "เธอเหม่อลอยขณะนั่งที่ระเบียง"}
{"word": "space out", "english": "I always space out during long lectures.", "thai": "ฉันมักจะเหม่อลอยในระหว่างการบรรยายยาวๆ"}
{"word": "space out", "english": "Don’t space out while I’m talking to you!", "thai": "อย่าเหม่อลอยขณะที่ฉันกำลังคุยกับคุณ!"}
{"word": "space out", "english": "She spaced out staring at the ceiling.", "thai": "เธอเหม่อลอยขณะจ้องเพดาน"}
{"word": "space out", "english": "I spaced out during the math class today.", "thai": "ฉันเหม่อลอยในชั้นเรียนคณิตศาสตร์วันนี้"}
{"word": "space out", "english": "He tends to space out when he’s bored.", "thai": "เขามักจะเหม่อลอยเมื่อรู้สึกเบื่อ"}
{"word": "space out", "english": "I didn’t mean to space out; I was just tired.", "thai": "ฉันไม่ได้ตั้งใจเหม่อลอย ฉันแค่เหนื่อย"}
{"word": "space out", "english": "She spaces out when she’s stressed.", "thai": "เธอเหม่อลอยเมื่อรู้สึกเครียด"}
{"word": "space out", "english": "I spaced out while watching that documentary.", "thai": "ฉันเหม่อลอยขณะดูสารคดีนั้น"}
{"word": "space out", "english": "Don’t space out while driving, it’s dangerous!", "thai": "อย่าเหม่อลอยขณะขับรถ มันอันตราย!"}
{"word": "space out", "english": "He spaced out during the team call.", "thai": "เขาเหม่อลอยในระหว่างการโทรทีม"}
{"word": "space out", "english": "I spaced out looking at the sunset.", "thai": "ฉันเหม่อลอยขณะมองพระอาทิตย์ตก"}
{"word": "space out", "english": "She tends to space out on long bus rides.", "thai": "เธอมักจะเหม่อลอยในระหว่างการนั่งรถบัสยาวๆ"}
{"word": "space out", "english": "I spaced out for a moment during the meeting.", "thai": "ฉันเหม่อลอยชั่วขณะในระหว่างการประชุม"}
{"word": "space out", "english": "He spaces out when he’s listening to podcasts.", "thai": "เขาเหม่อลอยเมื่อฟังพอดแคสต์"}
{"word": "space out", "english": "I spaced out during the history presentation.", "thai": "ฉันเหม่อลอยในระหว่างการนำเสนอประวัติศาสตร์"}
{"word": "space out", "english": "She spaced out while scrolling on her phone.", "thai": "เธอเหม่อลอยขณะเลื่อนโทรศัพท์"}
{"word": "space out", "english": "Don’t space out during the exam review!", "thai": "อย่าเหม่อลอยในระหว่างการทบทวนสอบ!"}
{"word": "space out", "english": "I tend to space out when I’m hungry.", "thai": "ฉันมักจะเหม่อลอยเมื่อหิว"}
{"word": "space out", "english": "He spaced out during the long webinar.", "thai": "เขาเหม่อลอยในระหว่างสัมมนาออนไลน์ยาวๆ"}
{"word": "space out", "english": "I spaced out staring at the snow falling.", "thai": "ฉันเหม่อลอยขณะมองหิมะตก"}
{"word": "space out", "english": "She spaces out when she’s feeling anxious.", "thai": "เธอเหม่อลอยเมื่อรู้สึกกังวล"}
{"word": "space out", "english": "I always space out during long flights.", "thai": "ฉันมักจะเหม่อลอยในระหว่างการบินยาวๆ"}
{"word": "space out", "english": "He spaced out while waiting in line.", "thai": "เขาเหม่อลอยขณะรอคิว"}
{"word": "space out", "english": "Don’t space out during the safety training!", "thai": "อย่าเหม่อลอยในระหว่างการฝึกอบรมความปลอดภัย!"}
{"word": "space out", "english": "I spaced out while doing the dishes.", "thai": "ฉันเหม่อลอยขณะล้างจาน"}
{"word": "space out", "english": "She spaced out during the boring movie.", "thai": "เธอเหม่อลอยในระหว่างหนังที่น่าเบื่อ"}
{"word": "space out", "english": "I tend to space out in quiet places.", "thai": "ฉันมักจะเหม่อลอยในสถานที่เงียบๆ"}
{"word": "space out", "english": "He spaces out when he’s daydreaming.", "thai": "เขาเหม่อลอยเมื่อฝันกลางวัน"}
{"word": "space out", "english": "I spaced out during the science lecture.", "thai": "ฉันเหม่อลอยในระหว่างการบรรยายวิทยาศาสตร์"}
{"word": "space out", "english": "She spaced out while reading her emails.", "thai": "เธอเหม่อลอยขณะอ่านอีเมล"}
{"word": "space out", "english": "Don’t space out while I’m giving instructions!", "thai": "อย่าเหม่อลอยขณะที่ฉันกำลังให้คำแนะนำ!"}
{"word": "space out", "english": "I spaced out during the group discussion.", "thai": "ฉันเหม่อลอยในระหว่างการสนทนากลุ่ม"}
{"word": "space out", "english": "He spaced out while watching the clouds.", "thai": "เขาเหม่อลอยขณะมองเมฆ"}
{"word": "space out", "english": "I spaced out while folding clothes.", "thai": "ฉันเหม่อลอยขณะพับผ้า"}
{"word": "space out", "english": "She tends to space out during long calls.", "thai": "เธอมักจะเหม่อลอยในระหว่างการโทรนานๆ"}
{"word": "space out", "english": "I always space out in boring meetings.", "thai": "ฉันมักจะเหม่อลอยในระหว่างการประชุมที่น่าเบื่อ"}
{"word": "space out", "english": "He spaced out during the long commute.", "thai": "เขาเหม่อลอยในระหว่างการเดินทางยาวๆ"}
{"word": "space out", "english": "Don’t space out while I’m explaining the plan!", "thai": "อย่าเหม่อลอยขณะที่ฉันกำลังอธิบายแผน!"}
{"word": "space out", "english": "I spaced out staring at the lake.", "thai": "ฉันเหม่อลอยขณะมองทะเลสาบ"}
{"word": "space out", "english": "She spaced out during the online class.", "thai": "เธอเหม่อลอยในระหว่างชั้นเรียนออนไลน์"}
{"word": "space out", "english": "I tend to space out when I’m exhausted.", "thai": "ฉันมักจะเหม่อลอยเมื่อเหนื่อยมาก"}
{"word": "space out", "english": "He spaced out while mowing the lawn.", "thai": "เขาเหม่อลอยขณะตัดหญ้า"}
{"word": "space out", "english": "I spaced out during the team briefing.", "thai": "ฉันเหม่อลอยในระหว่างการบรรยายทีม"}
{"word": "space out", "english": "She spaced out while knitting a sweater.", "thai": "เธอเหม่อลอยขณะถักสเวตเตอร์"}
{"word": "space out", "english": "Don’t space out during the cooking lesson!", "thai": "อย่าเหม่อลอยในระหว่างบทเรียนทำอาหาร!"}
{"word": "space out", "english": "I spaced out while cleaning the kitchen.", "thai": "ฉันเหม่อลอยขณะทำความสะอาดครัว"}
{"word": "space out", "english": "He tends to space out in crowded rooms.", "thai": "เขามักจะเหม่อลอยในห้องที่แออัด"}
{"word": "space out", "english": "I spaced out staring at the fireplace.", "thai": "ฉันเหม่อลอยขณะมองเตาผิง"}
{"word": "space out", "english": "She spaced out during the long podcast.", "thai": "เธอเหม่อลอยในระหว่างพอดแคสต์ยาวๆ"}
{"word": "space out", "english": "I always space out during long train rides.", "thai": "ฉันมักจะเหม่อลอยในระหว่างการนั่งรถไฟยาวๆ"}
{"word": "space out", "english": "He spaced out while waiting at the airport.", "thai": "เขาเหม่อลอยขณะรอที่สนามบิน"}
{"word": "space out", "english": "Don’t space out during the project meeting!", "thai": "อย่าเหม่อลอยในระหว่างการประชุมโครงการ!"}
{"word": "space out", "english": "I spaced out while gardening this morning.", "thai": "ฉันเหม่อลอยขณะทำสวนเช้านี้"}
{"word": "space out", "english": "She spaced out during the boring seminar.", "thai": "เธอเหม่อลอยในระหว่างสัมมนาที่น่าเบื่อ"}
{"word": "space out", "english": "I tend to space out when I’m nervous.", "thai": "ฉันมักจะเหม่อลอยเมื่อรู้สึกประหม่า"}
{"word": "space out", "english": "He spaced out while watching TV.", "thai": "เขาเหม่อลอยขณะดูทีวี"}
{"word": "space out", "english": "I spaced out during the staff meeting.", "thai": "ฉันเหม่อลอยในระหว่างการประชุมพนักงาน"}
{"word": "space out", "english": "She spaced out while painting the fence.", "thai": "เธอเหม่อลอยขณะทาสีรั้ว"}
{"word": "space out", "english": "Don’t space out while studying for the test!", "thai": "อย่าเหม่อลอยขณะอ่านหนังสือสอบ!"}
{"word": "space out", "english": "I spaced out staring at the stars.", "thai": "ฉันเหม่อลอยขณะมองดวงดาว"}
{"word": "space out", "english": "He tends to space out during long walks.", "thai": "เขามักจะเหม่อลอยในระหว่างการเดินยาวๆ"}
{"word": "space out", "english": "I spaced out while doing paperwork.", "thai": "ฉันเหม่อลอยขณะทำเอกสาร"}
{"word": "space out", "english": "She spaced out during the long drive.", "thai": "เธอเหม่อลอยในระหว่างการขับรถยาวๆ"}
{"word": "space out", "english": "I always space out in waiting rooms.", "thai": "ฉันมักจะเหม่อลอยในห้องรอ"}
{"word": "space out", "english": "Don’t space out during the safety briefing!", "thai": "อย่าเหม่อลอยในระหว่างการบรรยายความปลอดภัย!"}
{"word": "space out", "english": "I spaced out while ironing clothes.", "thai": "ฉันเหม่อลอยขณะรีดผ้า"}
{"word": "space out", "english": "He spaced out during the movie credits.", "thai": "เขาเหม่อลอยในระหว่างเครดิตหนัง"}
{"word": "space out", "english": "I spaced out while listening to music.", "thai": "ฉันเหม่อลอยขณะฟังเพลง"}
{"word": "space out", "english": "She tends to space out in quiet moments.", "thai": "เธอมักจะเหม่อลอยในช่วงเวลาที่เงียบสงบ"}
{"word": "space out", "english": "I spaced out during the online meeting.", "thai": "ฉันเหม่อลอยในระหว่างการประชุมออนไลน์"}
{"word": "space out", "english": "He spaced out while waiting for the train.", "thai": "เขาเหม่อลอยขณะรอรถไฟ"}
{"word": "space out", "english": "Don’t space out while I’m giving directions!", "thai": "อย่าเหม่อลอยขณะที่ฉันกำลังบอกทาง!"}
{"word": "space out", "english": "I spaced out while cooking dinner.", "thai": "ฉันเหม่อลอยขณะทำอาหารเย็น"}
{"word": "space out", "english": "She spaced out during the team huddle.", "thai": "เธอเหม่อลอยในระหว่างการรวมตัวทีม"}
{"word": "space out", "english": "I tend to space out when I’m relaxed.", "thai": "ฉันมักจะเหม่อลอยเมื่อรู้สึกผ่อนคลาย"}
{"word": "space out", "english": "He spaced out staring at the ocean.", "thai": "เขาเหม่อลอยขณะมองมหาสมุทร"}
{"word": "space out", "english": "I spaced out during the long speech.", "thai": "ฉันเหม่อลอยในระหว่างสุนทรพจน์ยาวๆ"}
{"word": "space out", "english": "She spaced out while doing her homework.", "thai": "เธอเหม่อลอยขณะทำการบ้าน"}
{"word": "space out", "english": "Don’t space out during the fitness class!", "thai": "อย่าเหม่อลอยในระหว่างคลาสฟิตเนส!"}
{"word": "space out", "english": "I spaced out while sweeping the floor.", "thai": "ฉันเหม่อลอยขณะกวาดพื้น"}
{"word": "space out", "english": "He tends to space out in noisy places.", "thai": "เขามักจะเหม่อลอยในสถานที่ที่มีเสียงดัง"}
{"word": "space out", "english": "I spaced out staring at the rain.", "thai": "ฉันเหม่อลอยขณะมองฝน"}
{"word": "space out", "english": "She spaced out during the long flight.", "thai": "เธอเหม่อลอยในระหว่างการบินยาวๆ"}
{"word": "space out", "english": "I always space out during long sermons.", "thai": "ฉันมักจะเหม่อลอยในระหว่างเทศนานานๆ"}
{"word": "space out", "english": "He spaced out while reading a book.", "thai": "เขาเหม่อลอยขณะอ่านหนังสือ"}
{"word": "space out", "english": "Don’t space out during the driving lesson!", "thai": "อย่าเหม่อลอยในระหว่างบทเรียนขับรถ!"}
{"word": "space out", "english": "I spaced out while watching the game.", "thai": "ฉันเหม่อลอยขณะดูเกม"}
{"word": "space out", "english": "She spaced out during the board meeting.", "thai": "เธอเหม่อลอยในระหว่างการประชุมคณะกรรมการ"}
{"word": "space out", "english": "I spaced out while watering the plants.", "thai": "ฉันเหม่อลอยขณะรดน้ำต้นไม้"}
{"word": "space out", "english": "He tends to space out when he’s tired.", "thai": "เขามักจะเหม่อลอยเมื่อรู้สึกเหนื่อย"}
{"word": "space out", "english": "I spaced out during the chemistry lecture.", "thai": "ฉันเหม่อลอยในระหว่างการบรรยายเคมี"}
{"word": "space out", "english": "She spaced out while sitting on the porch.", "thai": "เธอเหม่อลอยขณะนั่งที่ระเบียง"}
{"word": "space out", "english": "Don’t space out while I’m explaining the rules!", "thai": "อย่าเหม่อลอยขณะที่ฉันกำลังอธิบายกติกา!"}
{"word": "space out", "english": "I spaced out while organizing my desk.", "thai": "ฉันเหม่อลอยขณะจัดโต๊ะทำงาน"}
{"word": "space out", "english": "He spaced out during the long podcast.", "thai": "เขาเหม่อลอยในระหว่างพอดแคสต์ยาวๆ"}
{"word": "space out", "english": "I tend to space out when I’m sleepy.", "thai": "ฉันมักจะเหม่อลอยเมื่อง่วงนอน"}
{"word": "space out", "english": "She spaced out while waiting at the doctor’s.", "thai": "เธอเหม่อลอยขณะรอที่คลินิกหมอ"}
{"word": "space out", "english": "I spaced out during the online tutorial.", "thai": "ฉันเหม่อลอยในระหว่างบทเรียนออนไลน์"}
{"word": "space out", "english": "He spaced out while doing yard work.", "thai": "เขาเหม่อลอยขณะทำงานในสวน"}
{"word": "space out", "english": "Don’t space out during the team presentation!", "thai": "อย่าเหม่อลอยในระหว่างการนำเสนอทีม!"}
{"word": "space out", "english": "I spaced out while watching the sunrise.", "thai": "ฉันเหม่อลอยขณะมองพระอาทิตย์ขึ้น"}
{"word": "pack up", "english": "I need to pack up my stuff before the movers arrive.", "thai": "ฉันต้องเก็บของก่อนที่คนย้ายของจะมาถึง。"}
{"word": "pack up", "english": "Let's pack up the picnic and head home.", "thai": "มาเก็บของปิกนิกแล้วกลับบ้านกันเถอะ。"}
{"word": "pack up", "english": "She decided to pack up and leave town for good.", "thai": "เธอตัดสินใจเก็บของและออกจากเมืองไปเลย。"}
{"word": "pack up", "english": "We should pack up the camping gear before it gets dark.", "thai": "เราควรเก็บอุปกรณ์แคมป์ก่อนที่มันจะมืด。"}
{"word": "pack up", "english": "He told the kids to pack up their toys after playtime.", "thai": "เขาบอกเด็กๆ ให้เก็บของเล่นหลังจากเล่นเสร็จ。"}
{"word": "pack up", "english": "It's time to pack up the office for the weekend.", "thai": "ถึงเวลาเก็บของในออฟฟิศสำหรับวันหยุดสุดสัปดาห์แล้ว。"}
{"word": "pack up", "english": "They had to pack up quickly to catch the last train.", "thai": "พวกเขาต้องเก็บของอย่างรวดเร็วเพื่อขึ้นรถไฟขบวนสุดท้าย。"}
{"word": "pack up", "english": "I'll pack up the leftovers and put them in the fridge.", "thai": "ฉันจะเก็บอาหารที่เหลือและใส่ไว้ในตู้เย็น。"}
{"word": "pack up", "english": "The team needs to pack up the equipment after the game.", "thai": "ทีมต้องเก็บอุปกรณ์หลังจากจบเกม。"}
{"word": "pack up", "english": "She helped her parents pack up for their big move.", "thai": "เธอช่วยพ่อแม่เก็บของสำหรับการย้ายครั้งใหญ่。"}
{"word": "pack up", "english": "Let's pack up the car and hit the road.", "thai": "มาเก็บของใส่รถแล้วออกเดินทางกันเถอะ。"}
{"word": "pack up", "english": "He started to pack up his desk after quitting his job.", "thai": "เขาเริ่มเก็บของบนโต๊ะทำงานหลังจากลาออก。"}
{"word": "pack up", "english": "We need to pack up the decorations after the party.", "thai": "เราต้องเก็บของตกแต่งหลังจากงานปาร์ตี้。"}
{"word": "pack up", "english": "The band will pack up their instruments after the gig.", "thai": "วงดนตรีจะเก็บเครื่องดนตรีหลังจากคอนเสิร์ต。"}
{"word": "pack up", "english": "I forgot to pack up my laptop before leaving the office.", "thai": "ฉันลืมเก็บแล็ปท็อปก่อนออกจากออฟฟิศ。"}
{"word": "pack up", "english": "They decided to pack up early due to the storm.", "thai": "พวกเขาตัดสินใจเก็บของ早くเพราะพายุ。"}
{"word": "pack up", "english": "Can you help me pack up these books for donation?", "thai": "ช่วยฉันเก็บหนังสือเหล่านี้เพื่อบริจาคได้ไหม?"}
{"word": "pack up", "english": "The crew needs to pack up the set after filming.", "thai": "ทีมงานต้องเก็บฉากหลังจากการถ่ายทำ。"}
{"word": "pack up", "english": "Let's pack up the beach gear and head back.", "thai": "มาเก็บอุปกรณ์ชายหาดแล้วกลับกันเถอะ。"}
{"word": "pack up", "english": "She was told to pack up her things and leave the dorm.", "thai": "เธอถูกบอกให้เก็บของและออกจากหอพัก。"}
{"word": "pack up", "english": "I'll pack up my clothes tonight for the trip.", "thai": "ฉันจะเก็บเสื้อผ้าคืนนี้สำหรับการเดินทาง。"}
{"word": "pack up", "english": "The market vendors started to pack up at dusk.", "thai": "พ่อค้าในตลาดเริ่มเก็บของตอนพลบค่ำ。"}
{"word": "pack up", "english": "We should pack up the tent before it starts raining.", "thai": "เราควรเก็บเต็นท์ก่อนที่ฝนจะตก。"}
{"word": "pack up", "english": "He had to pack up his art supplies after class.", "thai": "เขาต้องเก็บอุปกรณ์ศิลปะหลังจากเรียนจบ。"}
{"word": "pack up", "english": "The movers will help us pack up the furniture tomorrow.", "thai": "คนย้ายของจะช่วยเรานเก็บเฟอร์นิเจอร์พรุ่งนี้。"}
{"word": "pack up", "english": "Let's pack up the tools and clean the garage.", "thai": "มาเก็บเครื่องมือแล้วทำความสะอาดโรงรถกันเถอะ。"}
{"word": "pack up", "english": "She didn’t want to pack up her childhood memories.", "thai": "เธอไม่อยากเก็บความทรงจำวัยเด็กของเธอ。"}
{"word": "pack up", "english": "We need to pack up the kitchen before the remodel.", "thai": "เราต้องเก็บของในครัวก่อนการปรับปรุง。"}
{"word": "pack up", "english": "The festival organizers began to pack up the stalls.", "thai": "ผู้จัดงานเทศกาลเริ่มเก็บร้านค้า。"}
{"word": "pack up", "english": "He told his team to pack up and head to the next site.", "thai": "เขาบอกทีมให้เก็บของและไปยังสถานที่ต่อไป。"}
{"word": "pack up", "english": "I’ll pack up the board games after we’re done.", "thai": "ฉันจะเก็บเกมกระดานหลังจากเราเล่นเสร็จ。"}
{"word": "pack up", "english": "They had to pack up their booth at the trade show.", "thai": "พวกเขาต้องเก็บบูธในงานแสดงสินค้า。"}
{"word": "pack up", "english": "Let’s pack up the groceries and start cooking.", "thai": "มาเก็บของชำแล้วเริ่มทำอาหารกันเถอะ。"}
{"word": "pack up", "english": "She started to pack up her office after the layoff.", "thai": "เธอเริ่มเก็บของในออฟฟิศหลังจากถูกเลิกจ้าง。"}
{"word": "pack up", "english": "We need to pack up the sound system after the event.", "thai": "เราต้องเก็บระบบเสียงหลังจากงาน。"}
{"word": "pack up", "english": "He decided to pack up his dreams and start fresh.", "thai": "เขาตัดสินใจเก็บความฝันและเริ่มต้นใหม่。"}
{"word": "pack up", "english": "The hikers had to pack up their gear quickly.", "thai": "นักเดินป่าต้องเก็บอุปกรณ์อย่างรวดเร็ว。"}
{"word": "pack up", "english": "I’ll pack up the kids’ lunchboxes for tomorrow.", "thai": "ฉันจะเก็บกล่องข้าวของเด็กๆ สำหรับพรุ่งนี้。"}
{"word": "pack up", "english": "The shop owner began to pack up for the night.", "thai": "เจ้าของร้านเริ่มเก็บของสำหรับคืนนี้。"}
{"word": "pack up", "english": "Let’s pack up the fishing gear and call it a day.", "thai": "มาเก็บอุปกรณ์ตกปลาแล้วเลิกงานวันนี้กันเถอะ。"}
{"word": "pack up", "english": "She had to pack up her apartment in one weekend.", "thai": "เธอต้องเก็บของในอพาร์ตเมนต์ในหนึ่งสัปดาห์。"}
{"word": "pack up", "english": "We’ll pack up the holiday decorations tomorrow.", "thai": "เราจะเก็บของตกแต่งวันหยุดพรุ่งนี้。"}
{"word": "pack up", "english": "The volunteers helped pack up the charity event.", "thai": "อาสาสมัครช่วยเก็บของในงานการกุศล。"}
{"word": "pack up", "english": "I need to pack up my gym bag for tomorrow’s workout.", "thai": "ฉันต้องเก็บกระเป๋ายิมสำหรับออกกำลังกายพรุ่งนี้。"}
{"word": "pack up", "english": "They had to pack up the stage after the play.", "thai": "พวกเขาต้องเก็บเวทีหลังจากการแสดง。"}
{"word": "pack up", "english": "Let’s pack up the art project before dinner.", "thai": "มาเก็บโปรเจกต์ศิลปะก่อนอาหารเย็นกันเถอะ。"}
{"word": "pack up", "english": "He started to pack up his tools after the job.", "thai": "เขาเริ่มเก็บเครื่องมือหลังจากทำงานเสร็จ。"}
{"word": "pack up", "english": "We should pack up the barbecue grill now.", "thai": "เราควรเก็บเตาบาร์บีคิวตอนนี้。"}
{"word": "pack up", "english": "She told her roommate to pack up and move out.", "thai": "เธอบอกเพื่อนร่วมห้องให้เก็บของและย้ายออก。"}
{"word": "pack up", "english": "I’ll pack up the camera gear after the shoot.", "thai": "ฉันจะเก็บอุปกรณ์กล้องหลังจากการถ่ายทำ。"}
{"word": "pack up", "english": "The workers had to pack up the construction site.", "thai": "คนงานต้องเก็บของในสถานที่ก่อสร้าง。"}
{"word": "pack up", "english": "Let’s pack up the blankets and leave the park.", "thai": "มาเก็บผ้าห่มแล้วออกจากสวนสาธารณะกันเถอะ。"}
{"word": "pack up", "english": "He forgot to pack up his charger before leaving.", "thai": "เขาลืมเก็บที่ชาร์จก่อนออกไป。"}
{"word": "pack up", "english": "We need to pack up the classroom supplies today.", "thai": "เราต้องเก็บอุปกรณ์ในห้องเรียนวันนี้。"}
{"word": "pack up", "english": "The band had to pack up in a hurry after the show.", "thai": "วงดนตรีต้องเก็บของอย่างรีบร้อนหลังการแสดง。"}
{"word": "pack up", "english": "I’ll pack up the picnic basket for the outing.", "thai": "ฉันจะเก็บตะกร้าปิกนิกสำหรับการออกนอกบ้าน。"}
{"word": "pack up", "english": "They started to pack up the market stalls early.", "thai": "พวกเขาเริ่มเก็บร้านในตลาด早く。"}
{"word": "pack up", "english": "She had to pack up her art studio for the move.", "thai": "เธอต้องเก็บสตูดิโอศิลปะสำหรับการย้าย。"}
{"word": "pack up", "english": "Let’s pack up the sports equipment after practice.", "thai": "มาเก็บอุปกรณ์กีฬาหลังการฝึกซ้อมกันเถอะ。"}
{"word": "pack up", "english": "He decided to pack up his old life and start anew.", "thai": "เขาตัดสินใจเก็บชีวิตเก่าและเริ่มต้นใหม่。"}
{"word": "pack up", "english": "We should pack up the tailgate before the game starts.", "thai": "เราควรเก็บของท้ายรถก่อนเกมเริ่ม。"}
{"word": "pack up", "english": "The crew will pack up the film equipment tonight.", "thai": "ทีมงานจะเก็บอุปกรณ์ถ่ายทำคืนนี้。"}
{"word": "pack up", "english": "I need to pack up my backpack for school tomorrow.", "thai": "ฉันต้องเก็บกระเป๋าเป้สำหรับโรงเรียนพรุ่งนี้。"}
{"word": "pack up", "english": "They had to pack up the event space after the wedding.", "thai": "พวกเขาต้องเก็บสถานที่จัดงานหลังงานแต่ง。"}
{"word": "pack up", "english": "Let’s pack up the craft supplies after the workshop.", "thai": "มาเก็บอุปกรณ์งานฝีมือหลังเวิร์คช็อปกันเถอะ。"}
{"word": "pack up", "english": "She started to pack up her suitcase for the vacation.", "thai": "เธอเริ่มเก็บกระเป๋าเดินทางสำหรับวันหยุด。"}
{"word": "pack up", "english": "We need to pack up the merchandise after the sale.", "thai": "เราต้องเก็บสินค้าหลังจากการขาย。"}
{"word": "pack up", "english": "He told his team to pack up the lab equipment.", "thai": "เขาบอกทีมให้เก็บอุปกรณ์ในห้องแล็บ。"}
{"word": "pack up", "english": "Let’s pack up the outdoor furniture before winter.", "thai": "มาเก็บเฟอร์นิเจอร์กลางแจ้งก่อนหน้าหนาวกันเถอะ。"}
{"word": "pack up", "english": "The volunteers began to pack up the donation boxes.", "thai": "อาสาสมัครเริ่มเก็บกล่องบริจาค。"}
{"word": "pack up", "english": "I’ll pack up my notes after the meeting.", "thai": "ฉันจะเก็บโน้ตหลังจากการประชุม。"}
{"word": "pack up", "english": "They had to pack up the parade floats after the event.", "thai": "พวกเขาต้องเก็บขบวนพาเหรดหลังงาน。"}
{"word": "pack up", "english": "She decided to pack up her old clothes for charity.", "thai": "เธอตัดสินใจเก็บเสื้อผ้าเก่าสำหรับบริจาค。"}
{"word": "pack up", "english": "We should pack up the picnic table before leaving.", "thai": "เราควรเก็บโต๊ะปิกนิกก่อนออกไป。"}
{"word": "pack up", "english": "He started to pack up his gaming console for the move.", "thai": "เขาเริ่มเก็บเครื่องเล่นเกมสำหรับการย้าย。"}
{"word": "pack up", "english": "Let’s pack up the party supplies and clean up.", "thai": "มาเก็บอุปกรณ์ปาร์ตี้แล้วทำความสะอาดกันเถอะ。"}
{"word": "pack up", "english": "The team had to pack up the broadcast equipment.", "thai": "ทีมต้องเก็บอุปกรณ์ออกอากาศ。"}
{"word": "pack up", "english": "I’ll pack up my hiking gear for the weekend.", "thai": "ฉันจะเก็บอุปกรณ์เดินป่าสำหรับวันหยุดสุดสัปดาห์。"}
{"word": "pack up", "english": "They started to pack up the conference materials.", "thai": "พวกเขาเริ่มเก็บเอกสารการประชุม。"}
{"word": "pack up", "english": "She had to pack up her kitchen appliances quickly.", "thai": "เธอต้องเก็บเครื่องใช้ในครัวอย่างรวดเร็ว。"}
{"word": "pack up", "english": "We need to pack up the soundstage after the shoot.", "thai": "เราต้องเก็บสตูดิโอหลังการถ่ายทำ。"}
{"word": "pack up", "english": "Let’s pack up the camping stove before we leave.", "thai": "มาเก็บเตาแคมป์ก่อนที่เราจะออกไปกันเถอะ。"}
{"word": "pack up", "english": "He forgot to pack up his headphones before the trip.", "thai": "เขาลืมเก็บหูฟังก่อนการเดินทาง。"}
{"word": "pack up", "english": "The organizers will pack up the festival tents tomorrow.", "thai": "ผู้จัดงานจะเก็บเต็นท์งานเทศกาลพรุ่งนี้。"}
{"word": "pack up", "english": "I’ll pack up the baby’s toys before bedtime.", "thai": "ฉันจะเก็บของเล่นเด็กก่อนเข้านอน。"}
{"word": "pack up", "english": "They had to pack up the outdoor market due to rain.", "thai": "พวกเขาต้องเก็บตลาดกลางแจ้งเพราะฝนตก。"}
{"word": "pack up", "english": "She started to pack up her sewing supplies after class.", "thai": "เธอเริ่มเก็บอุปกรณ์เย็บผ้าหลังจากเรียนจบ。"}
{"word": "pack up", "english": "We should pack up the beach chairs before heading home.", "thai": "เราควรเก็บเก้าอี้ชายหาดก่อนกลับบ้าน。"}
{"word": "pack up", "english": "He told his crew to pack up the lighting equipment.", "thai": "เขาบอกทีมงานให้เก็บอุปกรณ์ไฟ。"}
{"word": "pack up", "english": "Let’s pack up the tailgate party stuff now.", "thai": "มาเก็บของปาร์ตี้ท้ายรถตอนนี้กันเถอะ。"}
{"word": "pack up", "english": "I need to pack up my art portfolio for the interview.", "thai": "ฉันต้องเก็บผลงานศิลปะสำหรับการสัมภาษณ์。"}
{"word": "pack up", "english": "They had to pack up the carnival rides after the fair.", "thai": "พวกเขาต้องเก็บเครื่องเล่นงานคาร์นิวัลหลังงาน。"}
{"word": "pack up", "english": "She decided to pack up her jewelry for safekeeping.", "thai": "เธอตัดสินใจเก็บเครื่องประดับเพื่อความปลอดภัย。"}
{"word": "pack up", "english": "We’ll pack up the picnic cooler before leaving.", "thai": "เราจะเก็บกล่องเย็นปิกนิกก่อนออกไป。"}
{"word": "pack up", "english": "He started to pack up his bike gear after the race.", "thai": "เขาเริ่มเก็บอุปกรณ์จักรยานหลังการแข่งขัน。"}
{"word": "pack up", "english": "Let’s pack up the classroom decorations today.", "thai": "มาเก็บของตกแต่งห้องเรียนวันนี้กันเถอะ。"}
{"word": "pack up", "english": "The team will pack up the sports gear after the match.", "thai": "ทีมจะเก็บอุปกรณ์กีฬาหลังการแข่งขัน。"}
{"word": "pack up", "english": "I’ll pack up my study materials for the exam.", "thai": "ฉันจะเก็บเอกสารการเรียนสำหรับสอบ。"}
{"word": "pack up", "english": "They had to pack up the trade show booth early.", "thai": "พวกเขาต้องเก็บบูธงานแสดงสินค้า早く。"}
{"word": "pack up", "english": "She started to pack up her winter clothes for storage.", "thai": "เธอเริ่มเก็บเสื้อผ้าฤดูหนาวสำหรับเก็บ。"}
{"word": "move out", "english": "I need to move out of my apartment by next week.", "thai": "ฉันต้องย้ายออกจากอพาร์ตเมนต์ภายในสัปดาห์หน้า。"}
{"word": "move out", "english": "She decided to move out and live on her own.", "thai": "เธอตัดสินใจย้ายออกไปอยู่คนเดียว。"}
{"word": "move out", "english": "We should move out before the new tenants arrive.", "thai": "เราควรย้ายออกก่อนที่ผู้เช่ารายใหม่จะมาถึง。"}
{"word": "move out", "english": "He’s planning to move out of his parents’ house soon.", "thai": "เขาวางแผนจะย้ายออกจากบ้านพ่อแม่เร็วๆ นี้。"}
{"word": "move out", "english": "They had to move out because of the renovation.", "thai": "พวกเขาต้องย้ายออกเพราะการปรับปรุง。"}
{"word": "move out", "english": "Let’s move out of this place; it’s too noisy.", "thai": "ย้ายออกจากที่นี่กันเถอะ มันเสียงดังเกินไป。"}
{"word": "move out", "english": "She told her roommate to move out by the weekend.", "thai": "เธอบอกเพื่อนร่วมห้องให้ย้ายออกภายในวันหยุดสุดสัปดาห์。"}
{"word": "move out", "english": "I can’t wait to move out and start fresh.", "thai": "ฉันรอไม่ไหวที่จะย้ายออกและเริ่มต้นใหม่。"}
{"word": "move out", "english": "The landlord asked us to move out next month.", "thai": "เจ้าของบ้านขอให้เราย้ายออกเดือนหน้า。"}
{"word": "move out", "english": "He helped his sister move out of her dorm.", "thai": "เขาช่วยน้องสาวย้ายออกจากหอพัก。"}
{"word": "move out", "english": "We need to move out before the lease expires.", "thai": "เราต้องย้ายออกก่อนที่สัญญาเช่าจะหมดอายุ。"}
{"word": "move out", "english": "They decided to move out to a bigger house.", "thai": "พวกเขาตัดสินใจย้ายออกไปอยู่บ้านที่ใหญ่กว่า。"}
{"word": "move out", "english": "I’m ready to move out of this small town.", "thai": "ฉันพร้อมที่จะย้ายออกจากเมืองเล็กๆ นี้แล้ว。"}
{"word": "move out", "english": "She had to move out after the breakup.", "thai": "เธอต้องย้ายออกหลังจากการเลิกกัน。"}
{"word": "move out", "english": "Let’s move out of this neighborhood; it’s not safe.", "thai": "ย้ายออกจากย่านนี้กันเถอะ มันไม่ปลอดภัย。"}
{"word": "move out", "english": "He’s excited to move out and go to college.", "thai": "เขาตื่นเต้นที่จะย้ายออกไปเรียนมหาวิทยาลัย。"}
{"word": "move out", "english": "They need to move out of the old office by Friday.", "thai": "พวกเขาต้องย้ายออกจากออฟฟิศเก่าภายในวันศุกร์。"}
{"word": "move out", "english": "I’ll help you move out if you need a hand.", "thai": "ฉันจะช่วยคุณย้ายออกถ้าคุณต้องการความช่วยเหลือ。"}
{"word": "move out", "english": "She wants to move out to a place with a garden.", "thai": "เธออยากย้ายออกไปอยู่ที่ที่มีสวน。"}
{"word": "move out", "english": "We had to move out because of the flood.", "thai": "เราต้องย้ายออกเพราะน้ำท่วม。"}
{"word": "move out", "english": "He’s trying to move out before the rent increases.", "thai": "เขาพยายามย้ายออกก่อนที่ค่าเช่าจะขึ้น。"}
{"word": "move out", "english": "They’re planning to move out to the suburbs.", "thai": "พวกเขาวางแผนจะย้ายออกไปอยู่ชานเมือง。"}
{"word": "move out", "english": "I need to move out of this shared house soon.", "thai": "ฉันต้องย้ายออกจากบ้านที่แชร์นี้เร็วๆ นี้。"}
{"word": "move out", "english": "She helped her friend move out last weekend.", "thai": "เธอช่วยเพื่อนย้ายออกเมื่อสุดสัปดาห์ที่แล้ว。"}
{"word": "move out", "english": "We should move out before the construction starts.", "thai": "เราควรย้ายออกก่อนที่การก่อสร้างจะเริ่ม。"}
{"word": "move out", "english": "He decided to move out after getting a new job.", "thai": "เขาตัดสินใจย้ายออกหลังจากได้งานใหม่。"}
{"word": "move out", "english": "They had to move out due to the noisy neighbors.", "thai": "พวกเขาต้องย้ายออกเพราะเพื่อนบ้านเสียงดัง。"}
{"word": "move out", "english": "Let’s move out of this apartment; it’s too small.", "thai": "ย้ายออกจากอพาร์ตเมนต์นี้กันเถอะ มันเล็กเกินไป。"}
{"word": "move out", "english": "She’s ready to move out and live independently.", "thai": "เธอพร้อมที่จะย้ายออกไปอยู่ด้วยตัวเอง。"}
{"word": "move out", "english": "We need to move out of the old warehouse soon.", "thai": "เราต้องย้ายออกจากโกดังเก่าเร็วๆ นี้。"}
{"word": "move out", "english": "He told his kids to move out when they’re ready.", "thai": "เขาบอกลูกๆ ให้ย้ายออกเมื่อพวกเขาพร้อม。"}
{"word": "move out", "english": "They’re excited to move out to a new city.", "thai": "พวกเขาตื่นเต้นที่จะย้ายออกไปเมืองใหม่。"}
{"word": "move out", "english": "I had to move out because of the bad landlord.", "thai": "ฉันต้องย้ายออกเพราะเจ้าของบ้านแย่。"}
{"word": "move out", "english": "She’s planning to move out after graduation.", "thai": "เธอวางแผนจะย้ายออกหลังจากจบการศึกษา。"}
{"word": "move out", "english": "We’ll move out once we find a better place.", "thai": "เราจะย้ายออกเมื่อเราเจอที่ที่ดีกว่า。"}
{"word": "move out", "english": "He helped his cousin move out of the old house.", "thai": "เขาช่วยลูกพี่ลูกน้องย้ายออกจากบ้านเก่า。"}
{"word": "move out", "english": "They had to move out due to the building repairs.", "thai": "พวกเขาต้องย้ายออกเพราะการซ่อมแซมอาคาร。"}
{"word": "move out", "english": "Let’s move out of this place before winter.", "thai": "ย้ายออกจากที่นี่กันเถอะก่อนหน้าหนาว。"}
{"word": "move out", "english": "She’s nervous about having to move out soon.", "thai": "เธอกังวลเกี่ยวกับการต้องย้ายออกเร็วๆ นี้。"}
{"word": "move out", "english": "We need to move out of the rental by tomorrow.", "thai": "เราต้องย้ายออกจากบ้านเช่าภายในวันพรุ่งนี้。"}
{"word": "move out", "english": "He’s eager to move out and start his career.", "thai": "เขากระตือรือร้นที่จะย้ายออกและเริ่มต้นอาชีพ。"}
{"word": "move out", "english": "They decided to move out to a quieter area.", "thai": "พวกเขาตัดสินใจย้ายออกไปยังพื้นที่ที่เงียบกว่า。"}
{"word": "move out", "english": "I’ll move out as soon as I save enough money.", "thai": "ฉันจะย้ายออกทันทีที่ฉันเก็บเงินได้พอ。"}
{"word": "move out", "english": "She had to move out after the lease was canceled.", "thai": "เธอต้องย้ายออกหลังจากสัญญาเช่าถูกยกเลิก。"}
{"word": "move out", "english": "We should move out of this house; it’s too old.", "thai": "เราควรย้ายออกจากบ้านนี้ มันเก่าเกินไป。"}
{"word": "move out", "english": "He’s helping his friend move out this weekend.", "thai": "เขากำลังช่วยเพื่อนย้ายออกสุดสัปดาห์นี้。"}
{"word": "move out", "english": "They need to move out before the new owner arrives.", "thai": "พวกเขาต้องย้ายออกก่อนที่เจ้าของใหม่จะมาถึง。"}
{"word": "move out", "english": "I want to move out to a place near the beach.", "thai": "ฉันอยากย้ายออกไปอยู่ใกล้ชายหาด。"}
{"word": "move out", "english": "She’s excited to move out of her old apartment.", "thai": "เธอตื่นเต้นที่จะย้ายออกจากอพาร์ตเมนต์เก่า。"}
{"word": "move out", "english": "We had to move out because of the pest problem.", "thai": "เราต้องย้ายออกเพราะปัญหาแมลง。"}
{"word": "move out", "english": "He plans to move out after finishing school.", "thai": "เขาวางแผนจะย้ายออกหลังจากเรียนจบ。"}
{"word": "move out", "english": "They’re ready to move out to a bigger space.", "thai": "พวกเขาพร้อมที่จะย้ายออกไปยังพื้นที่ที่ใหญ่กว่า。"}
{"word": "move out", "english": "I need to move out of this dorm by next month.", "thai": "ฉันต้องย้ายออกจากหอพักนี้ภายในเดือนหน้า。"}
{"word": "move out", "english": "She helped her parents move out of their old home.", "thai": "เธอช่วยพ่อแม่ย้ายออกจากบ้านเก่า。"}
{"word": "move out", "english": "We should move out before the rent goes up.", "thai": "เราควรย้ายออกก่อนที่ค่าเช่าจะขึ้น。"}
{"word": "move out", "english": "He’s thinking about when to move out of the city.", "thai": "เขากำลังคิดว่าจะย้ายออกจากเมืองเมื่อไหร่。"}
{"word": "move out", "english": "They had to move out due to safety concerns.", "thai": "พวกเขาต้องย้ายออกเพราะปัญหาความปลอดภัย。"}
{"word": "move out", "english": "Let’s move out of this apartment; it’s too cramped.", "thai": "ย้ายออกจากอพาร์ตเมนต์นี้กันเถอะ มันคับแคบเกินไป。"}
{"word": "move out", "english": "She’s planning to move out after her wedding.", "thai": "เธอวางแผนจะย้ายออกหลังจากงานแต่งงาน。"}
{"word": "move out", "english": "We need to move out of the old building soon.", "thai": "เราต้องย้ายออกจากอาคารเก่าเร็วๆ นี้。"}
{"word": "move out", "english": "He’s helping his brother move out tomorrow.", "thai": "เขาจะช่วยพี่น้องย้ายออกพรุ่งนี้。"}
{"word": "move out", "english": "They decided to move out to a rural area.", "thai": "พวกเขาตัดสินใจย้ายออกไปยังพื้นที่ชนบท。"}
{"word": "move out", "english": "I’ll move out once I find a new apartment.", "thai": "ฉันจะย้ายออกเมื่อฉันหาอพาร์ตเมนต์ใหม่ได้。"}
{"word": "move out", "english": "She had to move out because of the high rent.", "thai": "เธอต้องย้ายออกเพราะค่าเช่าสูง。"}
{"word": "move out", "english": "We should move out of this place before summer.", "thai": "เราควรย้ายออกจากที่นี่ก่อนหน้าร้อน。"}
{"word": "move out", "english": "He’s excited to move out and live with friends.", "thai": "เขาตื่นเต้นที่จะย้ายออกไปอยู่กับเพื่อนๆ。"}
{"word": "move out", "english": "They need to move out of the condo by next week.", "thai": "พวกเขาต้องย้ายออกจากคอนโดภายในสัปดาห์หน้า。"}
{"word": "move out", "english": "I want to move out to a place with better views.", "thai": "ฉันอยากย้ายออกไปอยู่ที่ที่มีวิวดีกว่า。"}
{"word": "move out", "english": "She’s helping her cousin move out this weekend.", "thai": "เธอกำลังช่วยลูกพี่ลูกน้องย้ายออกสุดสัปดาห์นี้。"}
{"word": "move out", "english": "We had to move out because of the mold issue.", "thai": "เราต้องย้ายออกเพราะปัญหาเชื้อรา。"}
{"word": "move out", "english": "He plans to move out after getting married.", "thai": "เขาวางแผนจะย้ายออกหลังจากแต่งงาน。"}
{"word": "move out", "english": "They’re ready to move out to a new state.", "thai": "พวกเขาพร้อมที่จะย้ายออกไปยังรัฐใหม่。"}
{"word": "move out", "english": "I need to move out of this house by tomorrow.", "thai": "ฉันต้องย้ายออกจากบ้านนี้ภายในวันพรุ่งนี้。"}
{"word": "move out", "english": "She helped her friend move out of the city.", "thai": "เธอช่วยเพื่อนย้ายออกจากเมือง。"}
{"word": "move out", "english": "We should move out before the new rules start.", "thai": "เราควรย้ายออกก่อนที่กฎใหม่จะเริ่ม。"}
{"word": "move out", "english": "He’s thinking about how to move out quickly.", "thai": "เขากำลังคิดว่าจะย้ายออกอย่างรวดเร็วได้อย่างไร。"}
{"word": "move out", "english": "They had to move out due to a job transfer.", "thai": "พวกเขาต้องย้ายออกเพราะการโยกย้ายงาน。"}
{"word": "move out", "english": "Let’s move out of this place; it’s falling apart.", "thai": "ย้ายออกจากที่นี่กันเถอะ มันพังยับเยิน。"}
{"word": "move out", "english": "She’s nervous about having to move out alone.", "thai": "เธอกังวลเกี่ยวกับการต้องย้ายออกคนเดียว。"}
{"word": "move out", "english": "We need to move out of the rental house soon.", "thai": "เราต้องย้ายออกจากบ้านเช่าเร็วๆ นี้。"}
{"word": "move out", "english": "He’s eager to move out and explore the world.", "thai": "เขากระตือรือร้นที่จะย้ายออกและสำรวจโลก。"}
{"word": "move out", "english": "They decided to move out to a cheaper area.", "thai": "พวกเขาตัดสินใจย้ายออกไปยังพื้นที่ที่ถูกกว่า。"}
{"word": "move out", "english": "I’ll move out as soon as I get a new job.", "thai": "ฉันจะย้ายออกทันทีที่ฉันได้งานใหม่。"}
{"word": "move out", "english": "She had to move out after the eviction notice.", "thai": "เธอต้องย้ายออกหลังจากได้รับแจ้งให้ออก。"}
{"word": "move out", "english": "We should move out of this building; it’s unsafe.", "thai": "เราควรย้ายออกจากอาคารนี้ มันไม่ปลอดภัย。"}
{"word": "move out", "english": "He’s helping his parents move out next month.", "thai": "เขาจะช่วยพ่อแม่ย้ายออกเดือนหน้า。"}
{"word": "move out", "english": "They’re excited to move out to a coastal town.", "thai": "พวกเขาตื่นเต้นที่จะย้ายออกไปยังเมืองชายฝั่ง。"}
{"word": "move out", "english": "I need to move out of this place by next Friday.", "thai": "ฉันต้องย้ายออกจากที่นี่ภายในวันศุกร์หน้า。"}
{"word": "move out", "english": "She helped her sibling move out of their apartment.", "thai": "เธอช่วยพี่น้องย้ายออกจากอพาร์ตเมนต์。"}
{"word": "move out", "english": "We had to move out because of the new regulations.", "thai": "เราต้องย้ายออกเพราะกฎระเบียบใหม่。"}
{"word": "move out", "english": "He plans to move out after saving some money.", "thai": "เขาวางแผนจะย้ายออกหลังจากเก็บเงินได้บ้าง。"}
{"word": "move out", "english": "They’re ready to move out to a new country.", "thai": "พวกเขาพร้อมที่จะย้ายออกไปยังประเทศใหม่。"}
{"word": "move out", "english": "I want to move out to a place with more space.", "thai": "ฉันอยากย้ายออกไปยังที่ที่มีพื้นที่มากขึ้น。"}
{"word": "move out", "english": "She’s excited to move out of her parents’ home.", "thai": "เธอตื่นเต้นที่จะย้ายออกจากบ้านพ่อแม่。"}
{"word": "move out", "english": "We need to move out of this condo by next month.", "thai": "เราต้องย้ายออกจากคอนโดนี้ภายในเดือนหน้า。"}
{"word": "move out", "english": "He’s helping his friend move out of the old house.", "thai": "เขากำลังช่วยเพื่อนย้ายออกจากบ้านเก่า。"}
{"word": "move out", "english": "They decided to move out to a mountain cabin.", "thai": "พวกเขาตัดสินใจย้ายออกไปยังกระท่อมบนเขา。"}
{"word": "move out", "english": "I’ll move out once I find a better location.", "thai": "ฉันจะย้ายออกเมื่อฉันหาทำเลที่ดีกว่าได้。"}
{"word": "move out", "english": "She had to move out because of the noisy area.", "thai": "เธอต้องย้ายออกเพราะพื้นที่นั้นเสียงดัง。"}
{"word": "move out", "english": "We should move out before the new tenants move in.", "thai": "เราควรย้ายออกก่อนที่ผู้เช่ารายใหม่จะย้ายเข้ามา。"}
{"word": "move in", "english": "We’re planning to move in to our new house next week.", "thai": "เราวางแผนจะย้ายเข้าไปอยู่ในบ้านใหม่สัปดาห์หน้า。"}
{"word": "move in", "english": "She’s excited to move in with her best friend.", "thai": "เธอตื่นเต้นที่จะย้ายเข้าไปอยู่กับเพื่อนสนิทของเธอ。"}
{"word": "move in", "english": "They can move in once the apartment is ready.", "thai": "พวกเขาสามารถย้ายเข้าไปได้เมื่ออพาร์ตเมนต์พร้อม。"}
{"word": "move in", "english": "I helped my brother move in to his new place.", "thai": "ฉันช่วยน้องชายย้ายเข้าไปในที่ใหม่ของเขา。"}
{"word": "move in", "english": "We need to move in before the school year starts.", "thai": "เราต้องย้ายเข้าไปก่อนที่ปีการศึกษาจะเริ่ม。"}
{"word": "move in", "english": "He’s ready to move in with his girlfriend.", "thai": "เขาพร้อมที่จะย้ายเข้าไปอยู่กับแฟนสาวของเขา。"}
{"word": "move in", "english": "Let’s move in to the new office by next month.", "thai": "ย้ายเข้าไปในออฟฟิศใหม่ภายในเดือนหน้าสิ。"}
{"word": "move in", "english": "She can’t wait to move in to her dream home.", "thai": "เธอรอไม่ไหวที่จะย้ายเข้าไปอยู่ในบ้านในฝันของเธอ。"}
{"word": "move in", "english": "They decided to move in together after dating.", "thai": "พวกเขาตัดสินใจย้ายเข้าไปอยู่ด้วยกันหลังจากคบกัน。"}
{"word": "move in", "english": "I’ll move in once the landlord fixes the leaks.", "thai": "ฉันจะย้ายเข้าไปเมื่อเจ้าของบ้านซ่อมรอยรั่วแล้ว。"}
{"word": "move in", "english": "We’re helping our friends move in this weekend.", "thai": "เราจะช่วยเพื่อนย้ายเข้าไปในสุดสัปดาห์นี้。"}
{"word": "move in", "english": "He plans to move in to a bigger apartment soon.", "thai": "เขาวางแผนจะย้ายเข้าไปในอพาร์ตเมนต์ที่ใหญ่กว่าสoon。"}
{"word": "move in", "english": "They’re excited to move in to their new condo.", "thai": "พวกเขาตื่นเต้นที่จะย้ายเข้าไปอยู่ในคอนโดใหม่。"}
{"word": "move in", "english": "I need to move in before the rent goes up.", "thai": "ฉันต้องย้ายเข้าไปก่อนที่ค่าเช่าจะขึ้น。"}
{"word": "move in", "english": "She’s nervous about having to move in alone.", "thai": "เธอกังวลเกี่ยวกับการต้องย้ายเข้าไปอยู่คนเดียว。"}
{"word": "move in", "english": "We can move in after the renovations are done.", "thai": "เราสามารถย้ายเข้าไปได้หลังจากการปรับปรุงเสร็จสิ้น。"}
{"word": "move in", "english": "He helped his parents move in to their new home.", "thai": "เขาช่วยพ่อแม่ย้ายเข้าไปในบ้านใหม่ของพวกเขา。"}
{"word": "move in", "english": "They want to move in to a place near the beach.", "thai": "พวกเขาอยากย้ายเข้าไปอยู่ในที่ใกล้ชายหาด。"}
{"word": "move in", "english": "I’m ready to move in to my new dorm room.", "thai": "ฉันพร้อมที่จะย้ายเข้าไปในห้องหอพักใหม่ของฉัน。"}
{"word": "move in", "english": "She’s planning to move in with her fiancé.", "thai": "เธอวางแผนจะย้ายเข้าไปอยู่กับคู่หมั้นของเธอ。"}
{"word": "move in", "english": "We need to move in before the winter starts.", "thai": "เราต้องย้ายเข้าไปก่อนที่หน้าหนาวจะเริ่ม。"}
{"word": "move in", "english": "He’s helping his cousin move in tomorrow.", "thai": "เขาจะช่วยลูกพี่ลูกน้องย้ายเข้าไปพรุ่งนี้。"}
{"word": "move in", "english": "They decided to move in to a quieter neighborhood.", "thai": "พวกเขาตัดสินใจย้ายเข้าไปอยู่ในย่านที่เงียบกว่า。"}
{"word": "move in", "english": "I’ll move in as soon as I get the keys.", "thai": "ฉันจะย้ายเข้าไปทันทีที่ได้กุญแจ。"}
{"word": "move in", "english": "She’s excited to move in to her first apartment.", "thai": "เธอตื่นเต้นที่จะย้ายเข้าไปในอพาร์ตเมนต์แรกของเธอ。"}
{"word": "move in", "english": "We had to wait to move in because of delays.", "thai": "เราต้องรอย้ายเข้าไปเพราะความล่าช้า。"}
{"word": "move in", "english": "He plans to move in after finishing college.", "thai": "เขาวางแผนจะย้ายเข้าไปหลังจากเรียนจบมหาวิทยาลัย。"}
{"word": "move in", "english": "They’re ready to move in to their new house.", "thai": "พวกเขาพร้อมที่จะย้ายเข้าไปอยู่ในบ้านใหม่。"}
{"word": "move in", "english": "I need to move in to the new place by Friday.", "thai": "ฉันต้องย้ายเข้าไปในที่ใหม่ภายในวันศุกร์。"}
{"word": "move in", "english": "She helped her friend move in to a new condo.", "thai": "เธอช่วยเพื่อนย้ายเข้าไปในคอนโดใหม่。"}
{"word": "move in", "english": "We should move in before the new tenants arrive.", "thai": "เราควรย้ายเข้าไปก่อนที่ผู้เช่ารายใหม่จะมาถึง。"}
{"word": "move in", "english": "He’s thinking about when to move in with his partner.", "thai": "เขากำลังคิดว่าจะย้ายเข้าไปอยู่กับคู่ของเขาเมื่อไหร่。"}
{"word": "move in", "english": "They had to move in quickly due to the lease.", "thai": "พวกเขาต้องย้ายเข้าไปอย่างรวดเร็วเพราะสัญญาเช่า。"}
{"word": "move in", "english": "Let’s move in to this apartment; it’s perfect.", "thai": "ย้ายเข้าไปในอพาร์ตเมนต์นี้กันเถอะ มันสมบูรณ์แบบ。"}
{"word": "move in", "english": "She’s planning to move in after her wedding.", "thai": "เธอวางแผนจะย้ายเข้าไปหลังจากงานแต่งงาน。"}
{"word": "move in", "english": "We need to move in to the new building soon.", "thai": "เราต้องย้ายเข้าไปในอาคารใหม่เร็วๆ นี้。"}
{"word": "move in", "english": "He’s helping his sister move in this weekend.", "thai": "เขาจะช่วยน้องสาวย้ายเข้าไปในสุดสัปดาห์นี้。"}
{"word": "move in", "english": "They’re excited to move in to a rural area.", "thai": "พวกเขาตื่นเต้นที่จะย้ายเข้าไปอยู่ในพื้นที่ชนบท。"}
{"word": "move in", "english": "I’ll move in once the furniture is delivered.", "thai": "ฉันจะย้ายเข้าไปเมื่อเฟอร์นิเจอร์ถูกส่งมา。"}
{"word": "move in", "english": "She had to move in before the semester starts.", "thai": "เธอต้องย้ายเข้าไปก่อนที่เทอมจะเริ่ม。"}
{"word": "move in", "english": "We should move in to a place with more space.", "thai": "เราควรย้ายเข้าไปอยู่ในที่ที่มีพื้นที่มากขึ้น。"}
{"word": "move in", "english": "He’s eager to move in and start his new job.", "thai": "เขากระตือรือร้นที่จะย้ายเข้าไปและเริ่มงานใหม่。"}
{"word": "move in", "english": "They decided to move in to a cheaper apartment.", "thai": "พวกเขาตัดสินใจย้ายเข้าไปในอพาร์ตเมนต์ที่ถูกกว่า。"}
{"word": "move in", "english": "I need to move in to my new place tomorrow.", "thai": "ฉันต้องย้ายเข้าไปในที่ใหม่ของฉันพรุ่งนี้。"}
{"word": "move in", "english": "She’s helping her parents move in to their condo.", "thai": "เธอกำลังช่วยพ่อแม่ย้ายเข้าไปในคอนโดของพวกเขา。"}
{"word": "move in", "english": "We had to move in because the old place sold.", "thai": "เราต้องย้ายเข้าไปเพราะที่เก่าถูกขายแล้ว。"}
{"word": "move in", "english": "He plans to move in after getting married.", "thai": "เขาวางแผนจะย้ายเข้าไปหลังจากแต่งงาน。"}
{"word": "move in", "english": "They’re ready to move in to a new city.", "thai": "พวกเขาพร้อมที่จะย้ายเข้าไปในเมืองใหม่。"}
{"word": "move in", "english": "I want to move in to a place with a view.", "thai": "ฉันอยากย้ายเข้าไปอยู่ในที่ที่มีวิวสวย。"}
{"word": "move in", "english": "She’s excited to move in with her roommates.", "thai": "เธอตื่นเต้นที่จะย้ายเข้าไปอยู่กับเพื่อนร่วมห้อง。"}
{"word": "move in", "english": "We need to move in to the rental by next week.", "thai": "เราต้องย้ายเข้าไปในบ้านเช่าภายในสัปดาห์หน้า。"}
{"word": "move in", "english": "He’s helping his friend move in to a new house.", "thai": "เขากำลังช่วยเพื่อนย้ายเข้าไปในบ้านใหม่。"}
{"word": "move in", "english": "They decided to move in to a modern apartment.", "thai": "พวกเขาตัดสินใจย้ายเข้าไปในอพาร์ตเมนต์ทันสมัย。"}
{"word": "move in", "english": "I’ll move in as soon as the repairs are done.", "thai": "ฉันจะย้ายเข้าไปทันทีที่การซ่อมแซมเสร็จสิ้น。"}
{"word": "move in", "english": "She had to move in before the new job starts.", "thai": "เธอต้องย้ายเข้าไปก่อนที่งานใหม่จะเริ่ม。"}
{"word": "move in", "english": "We should move in to a place near downtown.", "thai": "เราควรย้ายเข้าไปอยู่ในที่ใกล้ตัวเมือง。"}
{"word": "move in", "english": "He’s thinking about when to move in with his family.", "thai": "เขากำลังคิดว่าจะย้ายเข้าไปอยู่กับครอบครัวเมื่อไหร่。"}
{"word": "move in", "english": "They had to move in due to a job transfer.", "thai": "พวกเขาต้องย้ายเข้าไปเพราะการโยกย้ายงาน。"}
{"word": "move in", "english": "Let’s move in to this house; it’s perfect.", "thai": "ย้ายเข้าไปในบ้านนี้กันเถอะ มันสมบูรณ์แบบ。"}
{"word": "move in", "english": "She’s nervous about having to move in by herself.", "thai": "เธอกังวลเกี่ยวกับการต้องย้ายเข้าไปอยู่ด้วยตัวเอง。"}
{"word": "move in", "english": "We need to move in to the new condo soon.", "thai": "เราต้องย้ายเข้าไปในคอนโดใหม่เร็วๆ นี้。"}
{"word": "move in", "english": "He’s helping his brother move in next month.", "thai": "เขาจะช่วยน้องชายย้ายเข้าไปในเดือนหน้า。"}
{"word": "move in", "english": "They’re excited to move in to a coastal town.", "thai": "พวกเขาตื่นเต้นที่จะย้ายเข้าไปในเมืองชายฝั่ง。"}
{"word": "move in", "english": "I need to move in to my new apartment by tomorrow.", "thai": "ฉันต้องย้ายเข้าไปในอพาร์ตเมนต์ใหม่ภายในวันพรุ่งนี้。"}
{"word": "move in", "english": "She helped her sibling move in to their new place.", "thai": "เธอช่วยพี่น้องย้ายเข้าไปในที่ใหม่ของพวกเขา。"}
{"word": "move in", "english": "We had to move in because of a lease agreement.", "thai": "เราต้องย้ายเข้าไปเพราะสัญญาเช่า。"}
{"word": "move in", "english": "He plans to move in after saving some money.", "thai": "เขาวางแผนจะย้ายเข้าไปหลังจากเก็บเงินได้บ้าง。"}
{"word": "move in", "english": "They’re ready to move in to a new state.", "thai": "พวกเขาพร้อมที่จะย้ายเข้าไปในรัฐใหม่。"}
{"word": "move in", "english": "I want to move in to a place with a garden.", "thai": "ฉันอยากย้ายเข้าไปอยู่ในที่ที่มีสวน。"}
{"word": "move in", "english": "She’s excited to move in to her new dorm.", "thai": "เธอตื่นเต้นที่จะย้ายเข้าไปในหอพักใหม่ของเธอ。"}
{"word": "move in", "english": "We need to move in to the house by next month.", "thai": "เราต้องย้ายเข้าไปในบ้านภายในเดือนหน้า。"}
{"word": "move in", "english": "He’s helping his friend move in to a new apartment.", "thai": "เขากำลังช่วยเพื่อนย้ายเข้าไปในอพาร์ตเมนต์ใหม่。"}
{"word": "move in", "english": "They decided to move in to a mountain cabin.", "thai": "พวกเขาตัดสินใจย้ายเข้าไปในกระท่อมบนเขา。"}
{"word": "move in", "english": "I’ll move in once I get the lease signed.", "thai": "ฉันจะย้ายเข้าไปเมื่อฉันเซ็นสัญญาเช่าแล้ว。"}
{"word": "move in", "english": "She had to move in before the holidays.", "thai": "เธอต้องย้ายเข้าไปก่อนวันหยุด。"}
{"word": "move in", "english": "We should move in to a place with better neighbors.", "thai": "เราควรย้ายเข้าไปอยู่ในที่ที่มีเพื่อนบ้านดีกว่า。"}
{"word": "move in", "english": "He’s eager to move in and start his new life.", "thai": "เขากระตือรือร้นที่จะย้ายเข้าไปและเริ่มชีวิตใหม่。"}
{"word": "move in", "english": "They decided to move in to a smaller house.", "thai": "พวกเขาตัดสินใจย้ายเข้าไปในบ้านที่เล็กกว่า。"}
{"word": "move in", "english": "I need to move in to my new place next week.", "thai": "ฉันต้องย้ายเข้าไปในที่ใหม่ของฉันสัปดาห์หน้า。"}
{"word": "move in", "english": "She’s helping her cousin move in to their condo.", "thai": "เธอกำลังช่วยลูกพี่ลูกน้องย้ายเข้าไปในคอนโดของพวกเขา。"}
{"word": "move in", "english": "We had to move in because the old lease ended.", "thai": "เราต้องย้ายเข้าไปเพราะสัญญาเช่าเก่าหมดลง。"}
{"word": "move in", "english": "He plans to move in after his promotion.", "thai": "เขาวางแผนจะย้ายเข้าไปหลังจากได้เลื่อนตำแหน่ง。"}
{"word": "move in", "english": "They’re ready to move in to a new country.", "thai": "พวกเขาพร้อมที่จะย้ายเข้าไปในประเทศใหม่。"}
{"word": "move in", "english": "I want to move in to a place near the park.", "thai": "ฉันอยากย้ายเข้าไปอยู่ในที่ใกล้สวนสาธารณะ。"}
{"word": "move in", "english": "She’s excited to move in with her new roommates.", "thai": "เธอตื่นเต้นที่จะย้ายเข้าไปอยู่กับเพื่อนร่วมห้องใหม่。"}
{"word": "move in", "english": "We need to move in to the new rental by tomorrow.", "thai": "เราต้องย้ายเข้าไปในบ้านเช่าใหม่ภายในวันพรุ่งนี้。"}
{"word": "move in", "english": "He’s helping his parents move in to their new place.", "thai": "เขากำลังช่วยพ่อแม่ย้ายเข้าไปในที่ใหม่ของพวกเขา。"}
{"word": "move in", "english": "They decided to move in to a historic home.", "thai": "พวกเขาตัดสินใจย้ายเข้าไปในบ้านเก่าแก่。"}
{"word": "move in", "english": "I’ll move in once the painting is finished.", "thai": "ฉันจะย้ายเข้าไปเมื่อการทาสีเสร็จแล้ว。"}
{"word": "move in", "english": "She had to move in before the new school year.", "thai": "เธอต้องย้ายเข้าไปก่อนปีการศึกษาใหม่。"}
{"word": "move in", "english": "We should move in to a place with a garage.", "thai": "เราควรย้ายเข้าไปอยู่ในที่ที่มีโรงรถ。"}
{"word": "move in", "english": "He’s thinking about when to move in with his girlfriend.", "thai": "เขากำลังคิดว่าจะย้ายเข้าไปอยู่กับแฟนสาวเมื่อไหร่。"}
{"word": "move in", "english": "They had to move in due to a family emergency.", "thai": "พวกเขาต้องย้ายเข้าไปเพราะเหตุฉุกเฉินในครอบครัว。"}
{"word": "move in", "english": "Let’s move in to this condo; it’s amazing.", "thai": "ย้ายเข้าไปในคอนโดนี้กันเถอะ มันสุดยอดมาก。"}
{"word": "move in", "english": "She’s nervous about having to move in alone.", "thai": "เธอกังวลเกี่ยวกับการต้องย้ายเข้าไปอยู่คนเดียว。"}
{"word": "move in", "english": "We need to move in to the new house by next week.", "thai": "เราต้องย้ายเข้าไปในบ้านใหม่ภายในสัปดาห์หน้า。"}
{"word": "move in", "english": "He’s helping his friend move in to a new rental.", "thai": "เขากำลังช่วยเพื่อนย้ายเข้าไปในบ้านเช่าใหม่。"}
{"word": "move in", "english": "They’re excited to move in to a suburban home.", "thai": "พวกเขาตื่นเต้นที่จะย้ายเข้าไปในบ้านชานเมือง。"}
{"word": "move in", "english": "I need to move in to my new place by next month.", "thai": "ฉันต้องย้ายเข้าไปในที่ใหม่ของฉันภายในเดือนหน้า。"}
{"word": "move in", "english": "She helped her brother move in to his new apartment.", "thai": "เธอช่วยน้องชายย้ายเข้าไปในอพาร์ตเมนต์ใหม่ของเขา。"}
{"word": "kick back", "english": "I just want to kick back and watch a movie tonight.", "thai": "ฉันแค่อยากผ่อนคลายและดูหนังคืนนี้。"}
{"word": "kick back", "english": "Let’s kick back at the beach this weekend.", "thai": "มาผ่อนคลายที่ชายหาดสุดสัปดาห์นี้กันเถอะ。"}
{"word": "kick back", "english": "He likes to kick back with a beer after work.", "thai": "เขาชอบผ่อนคลายด้วยเบียร์หลังเลิกงาน。"}
{"word": "kick back", "english": "We should kick back and enjoy the sunny day.", "thai": "เราควรผ่อนคลายและเพลิดเพลินกับวันที่มีแดด。"}
{"word": "kick back", "english": "She plans to kick back by the pool all afternoon.", "thai": "เธอวางแผนจะผ่อนคลายข้างสระน้ำทั้งบ่าย。"}
{"word": "kick back", "english": "After the exam, I’m going to kick back for a bit.", "thai": "หลังสอบ ฉันจะผ่อนคลายสักพัก。"}
{"word": "kick back", "english": "They love to kick back with friends on Fridays.", "thai": "พวกเขาชอบผ่อนคลายกับเพื่อนๆ ในวันศุกร์。"}
{"word": "kick back", "english": "I’ll kick back with a good book this evening.", "thai": "ฉันจะผ่อนคลายด้วยหนังสือดีๆ คืนนี้。"}
{"word": "kick back", "english": "Let’s kick back and listen to some music.", "thai": "มาผ่อนคลายและฟังเพลงกันเถอะ。"}
{"word": "kick back", "english": "He’s just going to kick back at home today.", "thai": "เขาจะแค่ผ่อนคลายที่บ้านวันนี้。"}
{"word": "kick back", "english": "We can kick back on the porch with some iced tea.", "thai": "เราสามารถผ่อนคลายที่ระเบียงพร้อมชาเย็น。"}
{"word": "kick back", "english": "She wants to kick back after a long week.", "thai": "เธออยากผ่อนคลายหลังจากสัปดาห์ที่ยาวนาน。"}
{"word": "kick back", "english": "They decided to kick back at the park.", "thai": "พวกเขาตัดสินใจผ่อนคลายที่สวนสาธารณะ。"}
{"word": "kick back", "english": "I’m ready to kick back and forget about work.", "thai": "ฉันพร้อมที่จะผ่อนคลายและลืมเรื่องงานไปเลย。"}
{"word": "kick back", "english": "He loves to kick back with a video game.", "thai": "เขาชอบผ่อนคลายด้วยการเล่นวิดีโอเกม。"}
{"word": "kick back", "english": "Let’s kick back with some snacks and a show.", "thai": "มาผ่อนคลายกับของว่างและรายการทีวีกันเถอะ。"}
{"word": "kick back", "english": "She’s going to kick back in the hammock today.", "thai": "เธอจะผ่อนคลายในเปลญวนวันนี้。"}
{"word": "kick back", "english": "We should kick back and enjoy the campfire.", "thai": "เราควรผ่อนคลายและเพลิดเพลินกับกองไฟ。"}
{"word": "kick back", "english": "He plans to kick back after finishing his project.", "thai": "เขาวางแผนจะผ่อนคลายหลังจากเสร็จงานโปรเจกต์。"}
{"word": "kick back", "english": "They’re going to kick back at the lake house.", "thai": "พวกเขาจะผ่อนคลายที่บ้านพักริมทะเลสาบ。"}
{"word": "kick back", "english": "I just need to kick back for a few hours.", "thai": "ฉันแค่ต้องการผ่อนคลายสักสองสามชั่วโมง。"}
{"word": "kick back", "english": "Let’s kick back with some pizza tonight.", "thai": "มาผ่อนคลายกับพิซซ่าคืนนี้กันเถอะ。"}
{"word": "kick back", "english": "She loves to kick back with her favorite podcast.", "thai": "เธอชอบผ่อนคลายกับพอดแคสต์ที่ชื่นชอบ。"}
{"word": "kick back", "english": "We can kick back on the couch all day.", "thai": "เราสามารถผ่อนคลายบนโซฟาทั้งวันได้。"}
{"word": "kick back", "english": "He’s going to kick back with his guitar tonight.", "thai": "เขาจะผ่อนคลายกับกีตาร์ของเขาคืนนี้。"}
{"word": "kick back", "english": "They want to kick back at the barbecue.", "thai": "พวกเขาอยากผ่อนคลายที่งานปิ้งย่าง。"}
{"word": "kick back", "english": "I’ll kick back with a coffee and a magazine.", "thai": "ฉันจะผ่อนคลายด้วยกาแฟและนิตยสาร。"}
{"word": "kick back", "english": "Let’s kick back and watch the sunset.", "thai": "มาผ่อนคลายและดูพระอาทิตย์ตกกันเถอะ。"}
{"word": "kick back", "english": "She’s ready to kick back after her shift.", "thai": "เธอพร้อมที่จะผ่อนคลายหลังจากกะทำงาน。"}
{"word": "kick back", "english": "We should kick back at the cabin this weekend.", "thai": "เราควรผ่อนคลายที่กระท่อมสุดสัปดาห์นี้。"}
{"word": "kick back", "english": "He likes to kick back with a board game.", "thai": "เขาชอบผ่อนคลายด้วยเกมกระดาน。"}
{"word": "kick back", "english": "They’re going to kick back by the fireplace.", "thai": "พวกเขาจะผ่อนคลายข้างเตาผิง。"}
{"word": "kick back", "english": "I want to kick back and catch up on sleep.", "thai": "ฉันอยากผ่อนคลายและนอนชดเชย。"}
{"word": "kick back", "english": "Let’s kick back with some cold drinks.", "thai": "มาผ่อนคลายกับเครื่องดื่มเย็นๆ กันเถอะ。"}
{"word": "kick back", "english": "She plans to kick back with her yoga mat.", "thai": "เธอวางแผนจะผ่อนคลายกับเสื่อโยคะของเธอ。"}
{"word": "kick back", "english": "We can kick back and play some cards.", "thai": "เราสามารถผ่อนคลายและเล่นไพ่ได้。"}
{"word": "kick back", "english": "He’s going to kick back after the long drive.", "thai": "เขาจะผ่อนคลายหลังจากขับรถนาน。"}
{"word": "kick back", "english": "They love to kick back at the rooftop bar.", "thai": "พวกเขาชอบผ่อนคลายที่บาร์บนดาดฟ้า。"}
{"word": "kick back", "english": "I’ll just kick back with my phone for a bit.", "thai": "ฉันจะแค่ผ่อนคลายกับโทรศัพท์สักพัก。"}
{"word": "kick back", "english": "Let’s kick back and enjoy the live music.", "thai": "มาผ่อนคลายและเพลิดเพลินกับดนตรีสดกันเถอะ。"}
{"word": "kick back", "english": "She wants to kick back in the backyard.", "thai": "เธออยากผ่อนคลายในสวนหลังบ้าน。"}
{"word": "kick back", "english": "We should kick back with some old movies.", "thai": "เราควรผ่อนคลายกับหนังเก่าๆ บ้าง。"}
{"word": "kick back", "english": "He’s ready to kick back after his workout.", "thai": "เขาพร้อมที่จะผ่อนคลายหลังจากออกกำลังกาย。"}
{"word": "kick back", "english": "They’re going to kick back at the festival.", "thai": "พวกเขาจะผ่อนคลายที่งานเทศกาล。"}
{"word": "kick back", "english": "I need to kick back and clear my mind.", "thai": "ฉันต้องผ่อนคลายและปลดปล่อยความคิด。"}
{"word": "kick back", "english": "Let’s kick back with a picnic in the park.", "thai": "มาผ่อนคลายกับปิกนิกในสวนกันเถอะ。"}
{"word": "kick back", "english": "She loves to kick back with her sketchbook.", "thai": "เธอชอบผ่อนคลายกับสมุดสเก็ตช์ของเธอ。"}
{"word": "kick back", "english": "We can kick back by the river this afternoon.", "thai": "เราสามารถผ่อนคลายริมแม่น้ำบ่ายนี้ได้。"}
{"word": "kick back", "english": "He plans to kick back with his favorite show.", "thai": "เขาวางแผนจะผ่อนคลายกับรายการโปรดของเขา。"}
{"word": "kick back", "english": "They’re going to kick back at the coffee shop.", "thai": "พวกเขาจะผ่อนคลายที่ร้านกาแฟ。"}
{"word": "kick back", "english": "I’ll kick back with some music and snacks.", "thai": "ฉันจะผ่อนคลายด้วยเพลงและของว่าง。"}
{"word": "kick back", "english": "Let’s kick back and enjoy the cool breeze.", "thai": "มาผ่อนคลายและเพลิดเพลินกับสายลมเย็นๆ กันเถอะ。"}
{"word": "kick back", "english": "She’s going to kick back after her classes.", "thai": "เธอจะผ่อนคลายหลังจากเรียนจบ。"}
{"word": "kick back", "english": "We should kick back with a game night.", "thai": "เราควรผ่อนคลายด้วยค่ำคืนเล่นเกม。"}
{"word": "kick back", "english": "He likes to kick back on the balcony.", "thai": "เขาชอบผ่อนคลายที่ระเบียง。"}
{"word": "kick back", "english": "They want to kick back at the beach house.", "thai": "พวกเขาอยากผ่อนคลายที่บ้านพักชายหาด。"}
{"word": "kick back", "english": "I’ll just kick back and scroll through my phone.", "thai": "ฉันจะแค่ผ่อนคลายและเลื่อนดูโทรศัพท์。"}
{"word": "kick back", "english": "Let’s kick back with some ice cream tonight.", "thai": "มาผ่อนคลายกับไอศกรีมคืนนี้กันเถอะ。"}
{"word": "kick back", "english": "She plans to kick back with her knitting.", "thai": "เธอวางแผนจะผ่อนคลายด้วยการถักนิตติ้ง。"}
{"word": "kick back", "english": "We can kick back and watch the stars.", "thai": "เราสามารถผ่อนคลายและดูดาวได้。"}
{"word": "kick back", "english": "He’s going to kick back after his meeting.", "thai": "เขาจะผ่อนคลายหลังจากการประชุม。"}
{"word": "kick back", "english": "They love to kick back with a barbecue.", "thai": "พวกเขาชอบผ่อนคลายด้วยการปิ้งย่าง。"}
{"word": "kick back", "english": "I need to kick back and take a nap.", "thai": "ฉันต้องผ่อนคลายและงีบหลับสักหน่อย。"}
{"word": "kick back", "english": "Let’s kick back with some board games.", "thai": "มาผ่อนคลายด้วยเกมกระดานกันเถอะ。"}
{"word": "kick back", "english": "She’s ready to kick back with her journal.", "thai": "เธอพร้อมที่จะผ่อนคลายกับสมุดบันทึกของเธอ。"}
{"word": "kick back", "english": "We should kick back at the lake this weekend.", "thai": "เราควรผ่อนคลายที่ทะเลสาบสุดสัปดาห์นี้。"}
{"word": "kick back", "english": "He likes to kick back with his comic books.", "thai": "เขาชอบผ่อนคลายกับหนังสือการ์ตูนของเขา。"}
{"word": "kick back", "english": "They’re going to kick back at the picnic.", "thai": "พวกเขาจะผ่อนคลายที่ปิกนิก。"}
{"word": "kick back", "english": "I’ll kick back with a smoothie and a book.", "thai": "ฉันจะผ่อนคลายด้วยสมูทตี้และหนังสือ。"}
{"word": "kick back", "english": "Let’s kick back and enjoy the evening breeze.", "thai": "มาผ่อนคลายและเพลิดเพลินกับสายลมยามเย็นกันเถอะ。"}
{"word": "kick back", "english": "She wants to kick back after her presentation.", "thai": "เธออยากผ่อนคลายหลังจากการนำเสนอ。"}
{"word": "kick back", "english": "We can kick back with some hot chocolate.", "thai": "เราสามารถผ่อนคลายด้วยช็อกโกแลตร้อน。"}
{"word": "kick back", "english": "He’s going to kick back with his playlist.", "thai": "เขาจะผ่อนคลายกับเพลย์ลิสต์ของเขา。"}
{"word": "kick back", "english": "They love to kick back at the local café.", "thai": "พวกเขาชอบผ่อนคลายที่คาเฟ่ในท้องถิ่น。"}
{"word": "kick back", "english": "I just want to kick back and do nothing.", "thai": "ฉันแค่อยากผ่อนคลายและไม่ทำอะไรเลย。"}
{"word": "kick back", "english": "Let’s kick back with a movie marathon.", "thai": "มาผ่อนคลายกับมาราธอนหนังกันเถอะ。"}
{"word": "kick back", "english": "She plans to kick back with her painting.", "thai": "เธอวางแผนจะผ่อนคลายด้วยการวาดภาพ。"}
{"word": "kick back", "english": "We should kick back by the pool tomorrow.", "thai": "เราควรผ่อนคลายข้างสระน้ำพรุ่งนี้。"}
{"word": "kick back", "english": "He’s ready to kick back after his exam.", "thai": "เขาพร้อมที่จะผ่อนคลายหลังจากการสอบ。"}
{"word": "kick back", "english": "They’re going to kick back at the campground.", "thai": "พวกเขาจะผ่อนคลายที่แคมป์ปิ้ง。"}
{"word": "kick back", "english": "I’ll kick back with a podcast and coffee.", "thai": "ฉันจะผ่อนคลายด้วยพอดแคสต์และกาแฟ。"}
{"word": "kick back", "english": "Let’s kick back with some popcorn tonight.", "thai": "มาผ่อนคลายกับป๊อปคอร์นคืนนี้กันเถอะ。"}
{"word": "kick back", "english": "She loves to kick back with her guitar.", "thai": "เธอชอบผ่อนคลายกับกีตาร์ของเธอ。"}
{"word": "kick back", "english": "We can kick back and watch the game.", "thai": "เราสามารถผ่อนคลายและดูการแข่งขันได้。"}
{"word": "kick back", "english": "He plans to kick back after his shift.", "thai": "เขาวางแผนจะผ่อนคลายหลังจากกะทำงาน。"}
{"word": "kick back", "english": "They’re going to kick back at the resort.", "thai": "พวกเขาจะผ่อนคลายที่รีสอร์ต。"}
{"word": "kick back", "english": "I need to kick back and relax this evening.", "thai": "ฉันต้องผ่อนคลายและพักผ่อนคืนนี้。"}
{"word": "kick back", "english": "Let’s kick back with some smoothies.", "thai": "มาผ่อนคลายกับสมูทตี้กันเถอะ。"}
{"word": "kick back", "english": "She’s going to kick back with her journal tonight.", "thai": "เธอจะผ่อนคลายกับสมุดบันทึกของเธอคืนนี้。"}
{"word": "kick back", "english": "We should kick back at the rooftop tonight.", "thai": "เราควรผ่อนคลายที่ดาดฟ้าคืนนี้。"}
{"word": "kick back", "english": "He likes to kick back with his sketchbook.", "thai": "เขาชอบผ่อนคลายกับสมุดสเก็ตช์ของเขา。"}
{"word": "kick back", "english": "They want to kick back by the ocean.", "thai": "พวกเขาอยากผ่อนคลายริมมหาสมุทร。"}
{"word": "kick back", "english": "I’ll kick back with a book and some tea.", "thai": "ฉันจะผ่อนคลายด้วยหนังสือและชา。"}
{"word": "kick back", "english": "Let’s kick back and enjoy the festival.", "thai": "มาผ่อนคลายและเพลิดเพลินกับงานเทศกาลกันเถอะ。"}
{"word": "kick back", "english": "She’s ready to kick back after her project.", "thai": "เธอพร้อมที่จะผ่อนคลายหลังจากโปรเจกต์ของเธอ。"}
{"word": "kick back", "english": "We can kick back with some live music.", "thai": "เราสามารถผ่อนคลายกับดนตรีสดได้。"}
{"word": "kick back", "english": "He’s going to kick back with his headphones.", "thai": "เขาจะผ่อนคลายกับหูฟังของเขา。"}
{"word": "kick back", "english": "They love to kick back at the park.", "thai": "พวกเขาชอบผ่อนคลายที่สวนสาธารณะ。"}
{"word": "kick back", "english": "I just want to kick back and chill tonight.", "thai": "ฉันแค่อยากผ่อนคลายและสบายๆ คืนนี้。"}
{"word": "kick back", "english": "Let’s kick back with a campfire tonight.", "thai": "มาผ่อนคลายกับกองไฟคืนนี้กันเถอะ。"}
{"word": "kick back", "english": "She plans to kick back with her favorite movie.", "thai": "เธอวางแผนจะผ่อนคลายกับหนังเรื่องโปรดของเธอ。"}
{"word": "wind down", "english": "I like to wind down with a cup of tea at night.", "thai": "ฉันชอบผ่อนคลายด้วยชาแก้วหนึ่งตอนกลางคืน。"}
{"word": "wind down", "english": "Let’s wind down by watching a movie tonight.", "thai": "มาผ่อนคลายด้วยการดูหนังคืนนี้กันเถอะ。"}
{"word": "wind down", "english": "She needs to wind down after a stressful day.", "thai": "เธอต้องผ่อนคลายหลังจากวันที่ตึงเครียด。"}
{"word": "wind down", "english": "He plans to wind down with some soft music.", "thai": "เขาวางแผนจะผ่อนคลายด้วยเพลงเบาๆ。"}
{"word": "wind down", "english": "We should wind down before the big meeting.", "thai": "เราควรผ่อนคลายก่อนการประชุมใหญ่。"}
{"word": "wind down", "english": "I’m going to wind down with a good book.", "thai": "ฉันจะผ่อนคลายด้วยหนังสือดีๆ สักเล่ม。"}
{"word": "wind down", "english": "They like to wind down at the park after work.", "thai": "พวกเขาชอบผ่อนคลายที่สวนสาธารณะหลังเลิกงาน。"}
{"word": "wind down", "english": "Let’s wind down with some yoga tonight.", "thai": "มาผ่อนคลายด้วยโยคะคืนนี้กันเถอะ。"}
{"word": "wind down", "english": "She wants to wind down by the fireplace.", "thai": "เธออยากผ่อนคลายข้างเตาผิง。"}
{"word": "wind down", "english": "He’s ready to wind down after his workout.", "thai": "เขาพร้อมจะผ่อนคลายหลังจากออกกำลังกาย。"}
{"word": "wind down", "english": "We can wind down with a glass of wine.", "thai": "เราสามารถผ่อนคลายด้วยไวน์สักแก้ว。"}
{"word": "wind down", "english": "I need to wind down before going to bed.", "thai": "ฉันต้องผ่อนคลายก่อนเข้านอน。"}
{"word": "wind down", "english": "They’re going to wind down at the beach.", "thai": "พวกเขาจะผ่อนคลายที่ชายหาด。"}
{"word": "wind down", "english": "Let’s wind down with some calm music.", "thai": "มาผ่อนคลายด้วยเพลงสงบๆ กันเถอะ。"}
{"word": "wind down", "english": "She loves to wind down with her journal.", "thai": "เธอชอบผ่อนคลายด้วยการเขียนสมุดบันทึก。"}
{"word": "wind down", "english": "He plans to wind down after the long day.", "thai": "เขาวางแผนจะผ่อนคลายหลังจากวันที่ยาวนาน。"}
{"word": "wind down", "english": "We should wind down with a walk tonight.", "thai": "เราควรผ่อนคลายด้วยการเดินเล่นคืนนี้。"}
{"word": "wind down", "english": "I’ll wind down by reading a magazine.", "thai": "ฉันจะผ่อนคลายด้วยการอ่านนิตยสาร。"}
{"word": "wind down", "english": "They want to wind down at the café.", "thai": "พวกเขาอยากผ่อนคลายที่ร้านกาแฟ。"}
{"word": "wind down", "english": "Let’s wind down with a hot bath.", "thai": "มาผ่อนคลாயด้วยการอาบน้ำร้อนกันเถอะ。"}
{"word": "wind down", "english": "She’s going to wind down with her knitting.", "thai": "เธอจะผ่อนคลายด้วยการถักนิตติ้ง。"}
{"word": "wind down", "english": "He likes to wind down with a podcast.", "thai": "เขาชอบผ่อนคลายด้วยการฟังพอดแคสต์。"}
{"word": "wind down", "english": "We can wind down by the lake this evening.", "thai": "เราสามารถผ่อนคลายริมทะเลสาบคืนนี้ได้。"}
{"word": "wind down", "english": "I need to wind down after all that work.", "thai": "ฉันต้องผ่อนคลายหลังจากงานหนักทั้งหมดนั้น。"}
{"word": "wind down", "english": "They’re going to wind down with a card game.", "thai": "พวกเขาจะผ่อนคลายด้วยการเล่นไพ่。"}
{"word": "wind down", "english": "Let’s wind down with some herbal tea.", "thai": "มาผ่อนคลายด้วยชาสมุนไพรกันเถอะ。"}
{"word": "wind down", "english": "She plans to wind down after her presentation.", "thai": "เธอวางแผนจะผ่อนคลายหลังจากการนำเสนอ。"}
{"word": "wind down", "english": "He’s ready to wind down with a nap.", "thai": "เขาพร้อมจะผ่อนคลายด้วยการงีบหลับ。"}
{"word": "wind down", "english": "We should wind down at the rooftop bar.", "thai": "เราควรผ่อนคลายที่บาร์บนดาดฟ้า。"}
{"word": "wind down", "english": "I’ll wind down with some meditation tonight.", "thai": "ฉันจะผ่อนคลายด้วยการนั่งสมาธิคืนนี้。"}
{"word": "wind down", "english": "They love to wind down with a sunset view.", "thai": "พวกเขาชอบผ่อนคลายด้วยการดูพระอาทิตย์ตก。"}
{"word": "wind down", "english": "Let’s wind down by playing some soft jazz.", "thai": "มาผ่อนคลายด้วยการเล่นดนตรีแจ๊สเบาๆ กันเถอะ。"}
{"word": "wind down", "english": "She’s going to wind down after her shift.", "thai": "เธอจะผ่อนคลายหลังจากกะทำงาน。"}
{"word": "wind down", "english": "He wants to wind down with his guitar.", "thai": "เขาอยากผ่อนคลายด้วยการเล่นกีตาร์。"}
{"word": "wind down", "english": "We can wind down with a light dinner.", "thai": "เราสามารถผ่อนคลายด้วยอาหารเย็นเบาๆ。"}
{"word": "wind down", "english": "I need to wind down after the busy week.", "thai": "ฉันต้องผ่อนคลายหลังจากสัปดาห์ที่วุ่นวาย。"}
{"word": "wind down", "english": "They’re going to wind down at the spa.", "thai": "พวกเขาจะผ่อนคลายที่สปา。"}
{"word": "wind down", "english": "Let’s wind down with a board game tonight.", "thai": "มาผ่อนคลายด้วยเกมกระดานคืนนี้กันเถอะ。"}
{"word": "wind down", "english": "She loves to wind down with her sketchbook.", "thai": "เธอชอบผ่อนคลายด้วยสมุดสเก็ตช์ของเธอ。"}
{"word": "wind down", "english": "He’s ready to wind down after his exam.", "thai": "เขาพร้อมจะผ่อนคลายหลังจากการสอบ。"}
{"word": "wind down", "english": "We should wind down by the campfire.", "thai": "เราควรผ่อนคลายข้างกองไฟ。"}
{"word": "wind down", "english": "I’ll wind down with some calming tea.", "thai": "ฉันจะผ่อนคลายด้วยชาที่ทำให้สงบ。"}
{"word": "wind down", "english": "They want to wind down at the beach house.", "thai": "พวกเขาอยากผ่อนคลายที่บ้านพักชายหาด。"}
{"word": "wind down", "english": "Let’s wind down with a quiet evening.", "thai": "มาผ่อนคลายด้วยค่ำคืนที่เงียบสงบกันเถอะ。"}
{"word": "wind down", "english": "She plans to wind down with her yoga mat.", "thai": "เธอวางแผนจะผ่อนคลายด้วยเสื่อโยคะของเธอ。"}
{"word": "wind down", "english": "He’s going to wind down with a book.", "thai": "เขาจะผ่อนคลายด้วยการอ่านหนังสือ。"}
{"word": "wind down", "english": "We can wind down by watching the stars.", "thai": "เราสามารถผ่อนคลายด้วยการดูดาว。"}
{"word": "wind down", "english": "I need to wind down after the long meeting.", "thai": "ฉันต้องผ่อนคลายหลังจากการประชุมที่ยาวนาน。"}
{"word": "wind down", "english": "They’re going to wind down with a picnic.", "thai": "พวกเขาจะผ่อนคลายด้วยการไปปิกนิก。"}
{"word": "wind down", "english": "Let’s wind down with some hot chocolate.", "thai": "มาผ่อนคลายด้วยช็อกโกแลตร้อนกันเถอะ。"}
{"word": "wind down", "english": "She loves to wind down with her painting.", "thaiDefinition": "เธอชอบผ่อนคลายด้วยการวาดภาพ。"}
{"word": "wind down", "english": "He’s ready to wind down after his project.", "thai": "เขาพร้อมจะผ่อนคลายหลังจากโปรเจกต์ของเขา。"}
{"word": "wind down", "english": "We should wind down at the lake house.", "thai": "เราควรผ่อนคลายที่บ้านพักริมทะเลสาบ。"}
{"word": "wind down", "english": "I’ll wind down with a warm blanket.", "thai": "ฉันจะผ่อนคลายด้วยผ้าห่มอุ่นๆ。"}
{"word": "wind down", "english": "They want to wind down with a movie night.", "thai": "พวกเขาอยากผ่อนคลายด้วยค่ำคืนดูหนัง。"}
{"word": "wind down", "english": "Let’s wind down by the pool tonight.", "thai": "มาผ่อนคลายข้างสระน้ำคืนนี้กันเถอะ。"}
{"word": "wind down", "english": "She’s going to wind down with her journal.", "thai": "เธอจะผ่อนคลายด้วยสมุดบันทึกของเธอ。"}
{"word": "wind down", "english": "He likes to wind down with his headphones.", "thai": "เขาชอบผ่อนคลายด้วยหูฟังของเขา。"}
{"word": "wind down", "english": "We can wind down with a light snack.", "thai": "เราสามารถผ่อนคลายด้วยของว่างเบาๆ。"}
{"word": "wind down", "english": "I need to wind down after the party.", "thai": "ฉันต้องผ่อนคลายหลังจากงานปาร์ตี้。"}
{"word": "wind down", "english": "They’re going to wind down at the resort.", "thai": "พวกเขาจะผ่อนคลายที่รีสอร์ต。"}
{"word": "wind down", "english": "Let’s wind down with some soft lighting.", "thai": "มาผ่อนคลายด้วยแสงไฟนุ่มๆ กันเถอะ。"}
{"word": "wind down", "english": "She plans to wind down with her meditation.", "thai": "เธอวางแผนจะผ่อนคลายด้วยการนั่งสมาธิ。"}
{"word": "wind down", "english": "He’s ready to wind down after his shift.", "thai": "เขาพร้อมจะผ่อนคลายหลังจากกะทำงาน。"}
{"word": "wind down", "english": "We should wind down with a nature walk.", "thai": "เราควรผ่อนคลายด้วยการเดินชมธรรมชาติ。"}
{"word": "wind down", "english": "I’ll wind down with a cozy movie.", "thai": "ฉันจะผ่อนคลายด้วยหนังที่อบอุ่น。"}
{"word": "wind down", "english": "They want to wind down by the ocean.", "thai": "พวกเขาอยากผ่อนคลายริมมหาสมุทร。"}
{"word": "wind down", "english": "Let’s wind down with a cup of coffee.", "thai": "มาผ่อนคลายด้วยกาแฟสักถ้วยกันเถอะ。"}
{"word": "wind down", "english": "She loves to wind down with her guitar.", "thai": "เธอชอบผ่อนคลายด้วยการเล่นกีตาร์。"}
{"word": "wind down", "english": "He’s going to wind down with a bath.", "thai": "เขาจะผ่อนคลายด้วยการอาบน้ำ。"}
{"word": "wind down", "english": "We can wind down with some board games.", "thai": "เราสามารถผ่อนคลายด้วยเกมกระดาน。"}
{"word": "wind down", "english": "I need to wind down after the long trip.", "thai": "ฉันต้องผ่อนคลายหลังจากการเดินทางไกล。"}
{"word": "wind down", "english": "They’re going to wind down at the cabin.", "thai": "พวกเขาจะผ่อนคลายที่กระท่อม。"}
{"word": "wind down", "english": "Let’s wind down with a quiet dinner.", "thai": "มาผ่อนคลายด้วยอาหารเย็นเงียบๆ กันเถอะ。"}
{"word": "wind down", "english": "She plans to wind down with her book club.", "thai": "เธอวางแผนจะผ่อนคลายกับชมรมหนังสือของเธอ。"}
{"word": "wind down", "english": "He’s ready to wind down after his class.", "thai": "เขาพร้อมจะผ่อนคลายหลังจากเรียนจบ。"}
{"word": "wind down", "english": "We should wind down with a sunset stroll.", "thai": "เราควรผ่อนคลายด้วยการเดินเล่นตอนพระอาทิตย์ตก。"}
{"word": "wind down", "english": "I’ll wind down with some aromatherapy.", "thai": "ฉันจะผ่อนคลายด้วยการบำบัดด้วยกลิ่นหอม。"}
{"word": "wind down", "english": "They want to wind down with a campfire.", "thai": "พวกเขาอยากผ่อนคลายด้วยกองไฟ。"}
{"word": "wind down", "english": "Let’s wind down with some relaxing music.", "thai": "มาผ่อนคลายด้วยเพลงที่ผ่อนคลายกันเถอะ。"}
{"word": "wind down", "english": "She loves to wind down with her embroidery.", "thai": "เธอชอบผ่อนคลายด้วยการปักผ้า。"}
{"word": "wind down", "english": "He’s going to wind down with a podcast.", "thai": "เขาจะผ่อนคลายด้วยการฟังพอดแคสต์。"}
{"word": "wind down", "english": "We can wind down by the river tonight.", "thai": "เราสามารถผ่อนคลายริมแม่น้ำคืนนี้ได้。"}
{"word": "wind down", "english": "I need to wind down after the deadline.", "thai": "ฉันต้องผ่อนคลายหลังจากกำหนดเวลา。"}
{"word": "wind down", "english": "They’re going to wind down with a game night.", "thai": "พวกเขาจะผ่อนคลายด้วยค่ำคืนเล่นเกม。"}
{"word": "wind down", "english": "Let’s wind down with some iced tea.", "thai": "มาผ่อนคลายด้วยชาเย็นกันเถอะ。"}
{"word": "wind down", "english": "She plans to wind down with her diary.", "thai": "เธอวางแผนจะผ่อนคลายด้วยการเขียนไดอารี่。"}
{"word": "wind down", "english": "He’s ready to wind down after his meeting.", "thai": "เขาพร้อมจะผ่อนคลายหลังจากการประชุม。"}
{"word": "wind down", "english": "We should wind down at the local café.", "thai": "เราควรผ่อนคลายที่ร้านกาแฟท้องถิ่น。"}
{"word": "wind down", "english": "I’ll wind down with a warm drink tonight.", "thai": "ฉันจะผ่อนคลายด้วยเครื่องดื่มอุ่นๆ คืนนี้。"}
{"word": "wind down", "english": "They want to wind down with a quiet night.", "thai": "พวกเขาอยากผ่อนคลายด้วยค่ำคืนที่เงียบสงบ。"}
{"word": "wind down", "english": "Let’s wind down with some gentle yoga.", "thai": "มาผ่อนคลายด้วยโยคะเบาๆ กันเถอะ。"}
{"word": "wind down", "english": "She loves to wind down with her coloring book.", "thai": "เธอชอบผ่อนคลายด้วยสมุดระบายสีของเธอ。"}
{"word": "wind down", "english": "He’s going to wind down with a light read.", "thai": "เขาจะผ่อนคลายด้วยการอ่านอะไรเบาๆ。"}
{"word": "wind down", "english": "We can wind down with a cozy movie night.", "thai": "เราสามารถผ่อนคลายด้วยค่ำคืนดูหนังที่อบอุ่น。"}
{"word": "wind down", "english": "I need to wind down after the long day.", "thai": "ฉันต้องผ่อนคลายหลังจากวันที่ยาวนาน。"}
{"word": "wind down", "english": "They’re going to wind down at the park.", "thai": "พวกเขาจะผ่อนคลายที่สวนสาธารณะ。"}
{"word": "wind down", "english": "Let’s wind down with a relaxing bath.", "thai": "มาผ่อนคลายด้วยการอาบน้ำที่ผ่อนคลายกันเถอะ。"}
{"word": "wind down", "english": "She plans to wind down with her meditation app.", "thai": "เธอวางแผนจะผ่อนคลายด้วยแอปนั่งสมาธิของเธอ。"}
{"word": "wind down", "english": "He’s ready to wind down with some tea.", "thai": "เขาพร้อมจะผ่อนคลายด้วยชาสักถ้วย。"}
{"word": "wind down", "english": "We should wind down with a quiet walk.", "thai": "เราควรผ่อนคลายด้วยการเดินเงียบๆ。"}
{"word": "wind down", "english": "I’ll wind down with a soothing playlist.", "thai": "ฉันจะผ่อนคลายด้วยเพลย์ลิสต์ที่ผ่อนคลาย。"}
{"word": "wipe down", "english": "I need to wipe down the kitchen counter before cooking.", "thai": "ฉันต้องเช็ดเคาน์เตอร์ครัวก่อนทำอาหาร"}
{"word": "wipe down", "english": "Can you wipe down the table after dinner?", "thai": "คุณช่วยเช็ดโต๊ะหลังอาหารเย็นได้ไหม?"}
{"word": "wipe down", "english": "She always forgets to wipe down the gym equipment.", "thai": "เธอมักจะลืมเช็ดอุปกรณ์ยิม"}
{"word": "wipe down", "english": "Let’s wipe down the car’s dashboard; it’s so dusty.", "thai": "มาเช็ดแผงหน้าปัดรถกันเถอะ มันฝุ่นเยอะมาก"}
{"word": "wipe down", "english": "He used a damp cloth to wipe down the shelves.", "thai": "เขาใช้ผ้าชุบน้ำเช็ดชั้นวาง"}
{"word": "wipe down", "english": "Please wipe down the whiteboard after class.", "thai": "กรุณาเช็ดกระดานไวต์บอร์ดหลังเลิกเรียน"}
{"word": "wipe down", "english": "I’ll wipe down the fridge door; it’s got fingerprints.", "thai": "ฉันจะเช็ดประตูตู้เย็น มันมีรอยนิ้วมือ"}
{"word": "wipe down", "english": "They need to wipe down the bar counter every night.", "thai": "พวกเขาต้องเช็ดเคาน์เตอร์บาร์ทุกคืน"}
{"word": "wipe down", "english": "Wipe down your phone screen; it’s all smudged.", "thai": "เช็ดหน้าจอโทรศัพท์ของคุณสิ มันเลอะไปหมด"}
{"word": "wipe down", "english": "The mechanic had to wipe down the engine parts.", "thai": "ช่างต้องเช็ดชิ้นส่วนเครื่องยนต์"}
{"word": "wipe down", "english": "She taught her kids to wipe down their toys.", "thai": "เธอสอนลูกๆ ให้เช็ดของเล่นของพวกเขา"}
{"word": "wipe down", "english": "We should wipe down the patio furniture before the party.", "thai": "เราควรเช็ดเฟอร์นิเจอร์นอกบ้านก่อนงานปาร์ตี้"}
{"word": "wipe down", "english": "He didn’t wipe down the cutting board after use.", "thai": "เขาไม่ได้เช็ดเขียงหลังใช้งาน"}
{"word": "wipe down", "english": "I always wipe down my yoga mat after practice.", "thai": "ฉันเช็ดเสื่อโยคะทุกครั้งหลังฝึก"}
{"word": "wipe down", "english": "Can someone wipe down the sink? It’s dirty.", "thai": "มีใครช่วยเช็ดอ่างล้างจานได้ไหม? มันสกปรก"}
{"word": "wipe down", "english": "The staff forgot to wipe down the display case.", "thai": "พนักงานลืมเช็ดตู้โชว์"}
{"word": "wipe down", "english": "Let’s wipe down the windows; they’re streaky.", "thai": "มาเช็ดหน้าต่างกันเถอะ มันเป็นรอย"}
{"word": "wipe down", "english": "She used a disinfectant to wipe down the doorknobs.", "thai": "เธอใช้ยาฆ่าเชื้อเช็ดลูกบิดประตู"}
{"word": "wipe down", "english": "I need to wipe down my laptop keyboard.", "thai": "ฉันต้องเช็ดคีย์บอร์ดแล็ปท็อป"}
{"word": "wipe down", "english": "He told the kids to wipe down their bikes.", "thai": "เขาบอกเด็กๆ ให้เช็ดจักรยานของพวกเขา"}
{"word": "wipe down", "english": "Wipe down the countertops with this spray.", "thai": "เช็ดเคาน์เตอร์ด้วยสเปรย์นี้"}
{"word": "wipe down", "english": "The cleaner will wipe down all surfaces tomorrow.", "thai": "พนักงานทำความสะอาดจะเช็ดทุกพื้นผิวพรุ่งนี้"}
{"word": "wipe down", "english": "I forgot to wipe down the stove after cooking.", "thai": "ฉันลืมเช็ดเตาหลังทำอาหาร"}
{"word": "wipe down", "english": "They need to wipe down the gym mats daily.", "thai": "พวกเขาต้องเช็ดเสื่อยิมทุกวัน"}
{"word": "wipe down", "english": "She’ll wipe down the mirrors before guests arrive.", "thai": "เธอจะเช็ดกระจกก่อนแขกมา"}
{"word": "wipe down", "english": "Can you wipe down the chair arms? They’re sticky.", "thai": "คุณช่วยเช็ดที่วางแขนเก้าอี้ได้ไหม? มันเหนียว"}
{"word": "wipe down", "english": "He used a rag to wipe down the toolbox.", "thai": "เขาใช้ผ้าเช็ดกล่องเครื่องมือ"}
{"word": "wipe down", "english": "Let’s wipe down the picnic table before eating.", "thai": "มาเช็ดโต๊ะปิกนิกก่อนกินข้าวกัน"}
{"word": "wipe down", "english": "The barista needs to wipe down the coffee machine.", "thai": "บาริสต้าต้องเช็ดเครื่องชงกาแฟ"}
{"word": "wipe down", "english": "I’ll wipe down the dining table after breakfast.", "thai": "ฉันจะเช็ดโต๊ะอาหารหลังอาหารเช้า"}
{"word": "wipe down", "english": "She forgot to wipe down the bathroom sink.", "thai": "เธอลืมเช็ดอ่างล้างหน้าห้องน้ำ"}
{"word": "wipe down", "english": "Wipe down the appliances to keep them shiny.", "thai": "เช็ดเครื่องใช้ไฟฟ้าให้มันเงา"}
{"word": "wipe down", "english": "He’ll wipe down the counter before closing the shop.", "thai": "เขาจะเช็ดเคาน์เตอร์ก่อนปิดร้าน"}
{"word": "wipe down", "english": "The kids were told to wipe down their desks.", "thai": "เด็กๆ ถูกบอกให้เช็ดโต๊ะเรียนของพวกเขา"}
{"word": "wipe down", "english": "I need to wipe down the TV screen; it’s smudged.", "thai": "ฉันต้องเช็ดหน้าจอทีวี มันเลอะ"}
{"word": "wipe down", "english": "They always wipe down the equipment after use.", "thai": "พวกเขาเช็ดอุปกรณ์ทุกครั้งหลังใช้"}
{"word": "wipe down", "english": "Can you wipe down the fridge shelves?", "thai": "คุณช่วยเช็ดชั้นในตู้เย็นได้ไหม?"}
{"word": "wipe down", "english": "She used vinegar to wipe down the counter.", "thai": "เธอใช้น้ำส้มสายชูเช็ดเคาน์เตอร์"}
{"word": "wipe down", "english": "Let’s wipe down the outdoor table before lunch.", "thai": "มาเช็ดโต๊ะนอกบ้านก่อนกินข้าวเที่ยง"}
{"word": "wipe down", "english": "He forgot to wipe down the workbench.", "thai": "เขาลืมเช็ดโต๊ะทำงาน"}
{"word": "wipe down", "english": "I’ll wipe down the car seats tomorrow.", "thai": "ฉันจะเช็ดเบาะรถยนต์พรุ่งนี้"}
{"word": "wipe down", "english": "The cleaner will wipe down the glass doors.", "thai": "พนักงานทำความสะอาดจะเช็ดประตูกระจก"}
{"word": "wipe down", "english": "Wipe down the keyboard before you start working.", "thai": "เช็ดคีย์บอร์ดก่อนเริ่มทำงาน"}
{"word": "wipe down", "english": "She needs to wipe down the cutting boards.", "thai": "เธอต้องเช็ดเขียง"}
{"word": "wipe down", "english": "They wipe down the tables after every shift.", "thai": "พวกเขาเช็ดโต๊ะหลังทุกกะ"}
{"word": "wipe down", "english": "I’ll wipe down the counters in the bathroom.", "thai": "ฉันจะเช็ดเคาน์เตอร์ในห้องน้ำ"}
{"word": "wipe down", "english": "Can you wipe down the handlebars on the bike?", "thai": "คุณช่วยเช็ดแฮนด์จักรยานได้ไหม?"}
{"word": "wipe down", "english": "He used a towel to wipe down the equipment.", "thai": "เขาใช้ผ้าขนหนูเช็ดอุปกรณ์"}
{"word": "wipe down", "english": "Let’s wipe down the grill before we start cooking.", "thai": "มาเช็ดเตาย่างก่อนเริ่มทำอาหาร"}
{"word": "wipe down", "english": "She’ll wipe down the cabinets this afternoon.", "thai": "เธอจะเช็ดตู้บ่ายนี้"}
{"word": "wipe down", "english": "Wipe down the door handles with disinfectant.", "thai": "เช็ดลูกบิดประตูด้วยยาฆ่าเชื้อ"}
{"word": "wipe down", "english": "I forgot to wipe down the microwave inside.", "thai": "ฉันลืมเช็ดด้านในไมโครเวฟ"}
{"word": "wipe down", "english": "The staff must wipe down the counters hourly.", "thai": "พนักงานต้องเช็ดเคาน์เตอร์ทุกชั่วโมง"}
{"word": "wipe down", "english": "He’ll wipe down the tools after the project.", "thai": "เขาจะเช็ดเครื่องมือหลังจบโปรเจกต์"}
{"word": "wipe down", "english": "Can you wipe down the bar stools?", "thai": "คุณช่วยเช็ดเก้าอี้บาร์ได้ไหม?"}
{"word": "wipe down", "english": "She used a cloth to wipe down the counter.", "thai": "เธอใช้ผ้าเช็ดเคาน์เตอร์"}
{"word": "wipe down", "english": "I need to wipe down the light switches.", "thai": "ฉันต้องเช็ดสวิตช์ไฟ"}
{"word": "wipe down", "english": "They forgot to wipe down the exercise bikes.", "thai": "พวกเขาลืมเช็ดจักรยานออกกำลังกาย"}
{"word": "wipe down", "english": "Let’s wipe down the patio chairs today.", "thai": "มาเช็ดเก้าอี้นอกบ้านวันนี้"}
{"word": "wipe down", "english": "He’ll wipe down the machine after each use.", "thai": "เขาจะเช็ดเครื่องหลังใช้ทุกครั้ง"}
{"word": "wipe down", "english": "Wipe down the shelves before restocking.", "thai": "เช็ดชั้นวางก่อนเติมของ"}
{"word": "wipe down", "english": "She needs to wipe down her art supplies.", "thai": "เธอต้องเช็ดอุปกรณ์ศิลปะของเธอ"}
{"word": "wipe down", "english": "I’ll wipe down the monitor screen later.", "thai": "ฉันจะเช็ดหน้าจอมอนิเตอร์ทีหลัง"}
{"word": "wipe down", "english": "Can you wipe down the refrigerator handle?", "thai": "คุณช่วยเช็ดมือจับตู้เย็นได้ไหม?"}
{"word": "wipe down", "english": "He forgot to wipe down the coffee table.", "thai": "เขาลืมเช็ดโต๊ะกาแฟ"}
{"word": "wipe down", "english": "They wipe down the counters before opening.", "thai": "พวกเขาเช็ดเคาน์เตอร์ก่อนเปิดร้าน"}
{"word": "wipe down", "english": "She’ll wipe down the sink after dishes.", "thai": "เธอจะเช็ดอ่างหลังล้างจาน"}
{"word": "wipe down", "english": "Wipe down the tablet screen; it’s dirty.", "thai": "เช็ดหน้าจอแท็บเล็ต มันสกปรก"}
{"word": "wipe down", "english": "I need to wipe down the window sills.", "thai": "ฉันต้องเช็ดขอบหน้าต่าง"}
{"word": "wipe down", "english": "The cleaner forgot to wipe down the railings.", "thai": "พนักงานทำความสะอาดลืมเช็ดราวบันได"}
{"word": "wipe down", "english": "Let’s wipe down the counter after baking.", "thai": "มาเช็ดเคาน์เตอร์หลังอบขนม"}
{"word": "wipe down", "english": "He used soap to wipe down the sink.", "thai": "เขาใช้สบู่เช็ดอ่างล้างจาน"}
{"word": "wipe down", "english": "She’ll wipe down the desks before class.", "thai": "เธอจะเช็ดโต๊ะก่อนเริ่มเรียน"}
{"word": "wipe down", "english": "Can you wipe down the car’s steering wheel?", "thai": "คุณช่วยเช็ดพวงมาลัยรถได้ไหม?"}
{"word": "wipe down", "english": "I forgot to wipe down the oven door.", "thai": "ฉันลืมเช็ดประตูเตาอบ"}
{"word": "wipe down", "english": "They need to wipe down the display shelves.", "thai": "พวกเขาต้องเช็ดชั้นวางสินค้า"}
{"word": "wipe down", "english": "Wipe down the counter with a clean cloth.", "thai": "เช็ดเคาน์เตอร์ด้วยผ้าสะอาด"}
{"word": "wipe down", "english": "She used alcohol to wipe down the remote.", "thai": "เธอใช้แอลกอฮอล์เช็ดรีโมท"}
{"word": "wipe down", "english": "Let’s wipe down the benches before sitting.", "thai": "มาเช็ดม้านั่งก่อนนั่ง"}
{"word": "wipe down", "english": "He’ll wipe down the treadmill after running.", "thai": "เขาจะเช็ดลู่วิ่งหลังวิ่ง"}
{"word": "wipe down", "english": "I need to wipe down the cabinet handles.", "thai": "ฉันต้องเช็ดมือจับตู้"}
{"word": "wipe down", "english": "Can you wipe down the dining chairs?", "thai": "คุณช่วยเช็ดเก้าอี้โต๊ะอาหารได้ไหม?"}
{"word": "wipe down", "english": "She forgot to wipe down the mirror.", "thai": "เธอลืมเช็ดกระจก"}
{"word": "wipe down", "english": "They wipe down the machines every evening.", "thai": "พวกเขาเช็ดเครื่องจักรทุกเย็น"}
{"word": "wipe down", "english": "I’ll wipe down the countertops tonight.", "thai": "ฉันจะเช็ดเคาน์เตอร์คืนนี้"}
{"word": "wipe down", "english": "Wipe down the glass table carefully.", "thai": "เช็ดโต๊ะกระจกอย่างระวัง"}
{"word": "wipe down", "english": "He needs to wipe down the work surfaces.", "thai": "เขาต้องเช็ดพื้นผิวงาน"}
{"word": "wipe down", "english": "Let’s wipe down the appliances before moving.", "thai": "มาเช็ดเครื่องใช้ไฟฟ้าก่อนย้าย"}
{"word": "wipe down", "english": "She’ll wipe down the counter after lunch.", "thai": "เธอจะเช็ดเคาน์เตอร์หลังกินข้าวเที่ยง"}
{"word": "wipe down", "english": "Can you wipe down the light fixtures?", "thai": "คุณช่วยเช็ดโคมไฟได้ไหม?"}
{"word": "wipe down", "english": "I forgot to wipe down the refrigerator door.", "thai": "ฉันลืมเช็ดประตูตู้เย็น"}
{"word": "wipe down", "english": "They need to wipe down the bar every hour.", "thai": "พวกเขาต้องเช็ดบาร์ทุกชั่วโมง"}
{"word": "wipe down", "english": "Wipe down the shelves with this cleaner.", "thai": "เช็ดชั้นวางด้วยน้ำยานี้"}
{"word": "wipe down", "english": "She used a sponge to wipe down the sink.", "thai": "เธอใช้ฟองน้ำเช็ดอ่างล้างจาน"}
{"word": "wipe down", "english": "Let’s wipe down the table before guests arrive.", "thai": "มาเช็ดโต๊ะก่อนแขกมา"}
{"word": "wipe down", "english": "He’ll wipe down the counter after cooking.", "thai": "เขาจะเช็ดเคาน์เตอร์หลังทำอาหาร"}
{"word": "wipe down", "english": "I need to wipe down the bathroom mirror.", "thai": "ฉันต้องเช็ดกระจกห้องน้ำ"}
{"word": "wipe down", "english": "Can you wipe down the kitchen appliances?", "thai": "คุณช่วยเช็ดเครื่องใช้ในครัวได้ไหม?"}
{"word": "wipe down", "english": "She forgot to wipe down the countertops.", "thai": "เธอลืมเช็ดเคาน์เตอร์"}
{"word": "wipe down", "english": "They wipe down the equipment before closing.", "thai": "พวกเขาเช็ดอุปกรณ์ก่อนปิด"}
{"word": "scroll through", "english": "I like to scroll through my phone before bed.", "thai": "ฉันชอบเลื่อนดูโทรศัพท์ก่อนนอน"}
{"word": "scroll through", "english": "Can you scroll through the menu to find dessert?", "thai": "คุณช่วยเลื่อนดูเมนูเพื่อหาของหวานได้ไหม?"}
{"word": "scroll through", "english": "She spent hours scrolling through social media.", "thai": "เธอใช้เวลาหลายชั่วโมงเลื่อนดูโซเชียลมีเดีย"}
{"word": "scroll through", "english": "He scrolled through the news app during breakfast.", "thai": "เขาเลื่อนดูแอปข่าวตอนกินข้าวเช้า"}
{"word": "scroll through", "english": "Let’s scroll through the photos from the trip.", "thai": "มาเลื่อนดูรูปจากทริปกันเถอะ"}
{"word": "scroll through", "english": "I was bored, so I scrolled through some videos.", "thai": "ฉันเบื่อเลยเลื่อนดูวิดีโอบ้าง"}
{"word": "scroll through", "english": "She scrolls through her emails every morning.", "thai": "เธอเลื่อนดูอีเมลทุกเช้า"}
{"word": "scroll through", "english": "Can you scroll through the playlist for a good song?", "thai": "คุณช่วยเลื่อนดูเพลย์ลิสต์หาเพลงดีๆ ได้ไหม?"}
{"word": "scroll through", "english": "He scrolled through the article but didn’t read it.", "thai": "เขาเลื่อนดูบทความแต่ไม่ได้อ่าน"}
{"word": "scroll through", "english": "I’ll scroll through the options before deciding.", "thai": "ฉันจะเลื่อนดูตัวเลือกก่อนตัดสินใจ"}
{"word": "scroll through", "english": "They love to scroll through memes online.", "thai": "พวกเขาชอบเลื่อนดูมีมออนไลน์"}
{"word": "scroll through", "english": "She was scrolling through her feed when I called.", "thai": "เธอกำลังเลื่อนดูฟีดตอนฉันโทรไป"}
{"word": "scroll through", "english": "I scrolled through the comments on the post.", "thai": "ฉันเลื่อนดูคอมเมนต์ในโพสต์"}
{"word": "scroll through", "english": "He scrolls through his contacts to find her number.", "thai": "เขาเลื่อนดูรายชื่อเพื่อหาเบอร์ของเธอ"}
{"word": "scroll through", "english": "Let’s scroll through the movie list tonight.", "thai": "มาเลื่อนดูรายชื่อหนังคืนนี้กัน"}
{"word": "scroll through", "english": "I caught her scrolling through my messages.", "thai": "ฉันจับได้ว่าเธอเลื่อนดูข้อความของฉัน"}
{"word": "scroll through", "english": "Can you scroll through the document for errors?", "thai": "คุณช่วยเลื่อนดูเอกสารหาข้อผิดพลาดได้ไหม?"}
{"word": "scroll through", "english": "She scrolls through job listings every day.", "thai": "เธอเลื่อนดูประกาศงานทุกวัน"}
{"word": "scroll through", "english": "He was scrolling through his gallery for old photos.", "thai": "เขาเลื่อนดูแกลเลอรี่เพื่อหารูปเก่าๆ"}
{"word": "scroll through", "english": "I’ll scroll through the reviews before buying.", "thai": "ฉันจะเลื่อนดูรีวิวก่อนซื้อ"}
{"word": "scroll through", "english": "They scrolled through the catalog to pick furniture.", "thai": "พวกเขาเลื่อนดูแคตตาล็อกเพื่อเลือกเฟอร์นิเจอร์"}
{"word": "scroll through", "english": "She scrolled through the app to find a recipe.", "thai": "เธอเลื่อนดูแอปเพื่อหาสูตรอาหาร"}
{"word": "scroll through", "english": "I was scrolling through X and saw a funny post.", "thai": "ฉันเลื่อนดู X แล้วเจอโพสต์ตลกๆ"}
{"word": "scroll through", "english": "He scrolls through his notes before the exam.", "thai": "เขาเลื่อนดูโน๊ตก่อนสอบ"}
{"word": "scroll through", "english": "Can you scroll through the slides for the presentation?", "thai": "คุณช่วยเลื่อนดูสไลด์สำหรับการนำเสนอได้ไหม?"}
{"word": "scroll through", "english": "She scrolled through the blog for inspiration.", "thai": "เธอเลื่อนดูบล็อกเพื่อหาแรงบันดาลใจ"}
{"word": "scroll through", "english": "I scrolled through the website but found nothing.", "thai": "ฉันเลื่อนดูเว็บไซต์แต่ไม่เจออะไร"}
{"word": "scroll through", "english": "He was scrolling through his playlist during the drive.", "thai": "เขาเลื่อนดูเพลย์ลิสต์ระหว่างขับรถ"}
{"word": "scroll through", "english": "Let’s scroll through the vacation photos together.", "thai": "มาเลื่อนดูรูปวันหยุดด้วยกันเถอะ"}
{"word": "scroll through", "english": "She scrolls through fashion blogs for ideas.", "thai": "เธอเลื่อนดูบล็อกแฟชั่นเพื่อหาไอเดีย"}
{"word": "scroll through", "english": "I’ll scroll through the terms before signing up.", "thai": "ฉันจะเลื่อนดูเงื่อนไขก่อนสมัคร"}
{"word": "scroll through", "english": "He scrolled through the chat to find the link.", "thai": "เขาเลื่อนดูแชทเพื่อหาลิงก์"}
{"word": "scroll through", "english": "Can you scroll through the app for deals?", "thai": "คุณช่วยเลื่อนดูแอปหาดีลได้ไหม?"}
{"word": "scroll through", "english": "She was scrolling through her old texts.", "thai": "เธอเลื่อนดูข้อความเก่าๆ"}
{"word": "scroll through", "english": "I scrolled through the forum for advice.", "thai": "ฉันเลื่อนดูฟอรัมเพื่อหาคำแนะนำ"}
{"word": "scroll through", "english": "He scrolls through his feed during lunch.", "thai": "เขาเลื่อนดูฟีดตอนกินข้าวเที่ยง"}
{"word": "scroll through", "english": "Let’s scroll through the online store tonight.", "thai": "มาเลื่อนดูร้านค้าออนไลน์คืนนี้กัน"}
{"word": "scroll through", "english": "She scrolled through the comments and laughed.", "thai": "เธอเลื่อนดูคอมเมนต์แล้วหัวเราะ"}
{"word": "scroll through", "english": "I was scrolling through some DIY tutorials.", "thai": "ฉันเลื่อนดูบทเรียน DIY บ้าง"}
{"word": "scroll through", "english": "He scrolled through the list to pick a restaurant.", "thai": "เขาเลื่อนดูรายชื่อเพื่อเลือกร้านอาหาร"}
{"word": "scroll through", "english": "Can you scroll through the settings for me?", "thai": "คุณช่วยเลื่อนดูการตั้งค่าให้ฉันได้ไหม?"}
{"word": "scroll through", "english": "She scrolls through her calendar every evening.", "thai": "เธอเลื่อนดูปฏิทินทุกเย็น"}
{"word": "scroll through", "english": "I’ll scroll through the news before bed.", "thai": "ฉันจะเลื่อนดูข่าวก่อนนอน"}
{"word": "scroll through", "english": "He was scrolling through his emails on the train.", "thai": "เขาเลื่อนดูอีเมลบนรถไฟ"}
{"word": "scroll through", "english": "Let’s scroll through the app to find a movie.", "thai": "มาเลื่อนดูแอปเพื่อหาหนังกัน"}
{"word": "scroll through", "english": "She scrolled through the gallery for inspiration.", "thai": "เธอเลื่อนดูแกลเลอรี่เพื่อหาแรงบันดาลใจ"}
{"word": "scroll through", "english": "I scrolled through the thread but got bored.", "thai": "ฉันเลื่อนดูกระทู้แต่รู้สึกเบื่อ"}
{"word": "scroll through", "english": "He scrolls through his photos to show friends.", "thai": "เขาเลื่อนดูรูปเพื่อโชว์เพื่อน"}
{"word": "scroll through", "english": "Can you scroll through the list for her name?", "thai": "คุณช่วยเลื่อนดูรายชื่อหาชื่อเธอได้ไหม?"}
{"word": "scroll through", "english": "She was scrolling through recipes online.", "thai": "เธอเลื่อนดูสูตรอาหารออนไลน์"}
{"word": "scroll through", "english": "I’ll scroll through the updates later.", "thai": "ฉันจะเลื่อนดูอัปเดตทีหลัง"}
{"word": "scroll through", "english": "He scrolled through the document on his tablet.", "thai": "เขาเลื่อนดูเอกสารบนแท็บเล็ต"}
{"word": "scroll through", "english": "Let’s scroll through the travel blog for ideas.", "thai": "มาเลื่อนดูบล็อกท่องเที่ยวเพื่อหาไอเดีย"}
{"word": "scroll through", "english": "She scrolls through her messages every morning.", "thai": "เธอเลื่อนดูข้อความทุกเช้า"}
{"word": "scroll through", "english": "I was scrolling through some old posts.", "thai": "ฉันเลื่อนดูโพสต์เก่าๆ"}
{"word": "scroll through", "english": "He scrolled through the app to check prices.", "thai": "เขาเลื่อนดูแอปเพื่อเช็คราคา"}
{"word": "scroll through", "english": "Can you scroll through the photos on my phone?", "thai": "คุณช่วยเลื่อนดูรูปในโทรศัพท์ฉันได้ไหม?"}
{"word": "scroll through", "english": "She scrolled through the catalog for dresses.", "thai": "เธอเลื่อนดูแคตตาล็อกเพื่อหาชุด"}
{"word": "scroll through", "english": "I’ll scroll through the comments later.", "thai": "ฉันจะเลื่อนดูคอมเมนต์ทีหลัง"}
{"word": "scroll through", "english": "He was scrolling through his feed during the break.", "thai": "เขาเลื่อนดูฟีดตอนพัก"}
{"word": "scroll through", "english": "Let’s scroll through the app for new games.", "thai": "มาเลื่อนดูแอปเพื่อหาเกมใหม่ๆ"}
{"word": "scroll through", "english": "She scrolled through the website for deals.", "thai": "เธอเลื่อนดูเว็บไซต์เพื่อหาดีล"}
{"word": "scroll through", "english": "I scrolled through the reviews before booking.", "thai": "ฉันเลื่อนดูรีวิวก่อนจอง"}
{"word": "scroll through", "english": "He scrolls through his notes during meetings.", "thai": "เขาเลื่อนดูโน๊ตระหว่างประชุม"}
{"word": "scroll through", "english": "Can you scroll through the menu for specials?", "thai": "คุณช่วยเลื่อนดูเมนูหาเมนูพิเศษได้ไหม?"}
{"word": "scroll through", "english": "She was scrolling through her playlist at the gym.", "thai": "เธอเลื่อนดูเพลย์ลิสต์ที่ยิม"}
{"word": "scroll through", "english": "I’ll scroll through the blog for tips.", "thai": "ฉันจะเลื่อนดูบล็อกเพื่อหาเคล็ดลับ"}
{"word": "scroll through", "english": "He scrolled through the app to find a ride.", "thai": "เขาเลื่อนดูแอปเพื่อหารถ"}
{"word": "scroll through", "english": "Let’s scroll through the pictures from last week.", "thai": "มาเลื่อนดูรูปจากสัปดาห์ที่แล้วกัน"}
{"word": "scroll through", "english": "She scrolls through her emails on the bus.", "thai": "เธอเลื่อนดูอีเมลบนรถบัส"}
{"word": "scroll through", "english": "I was scrolling through some travel sites.", "thai": "ฉันเลื่อนดูเว็บท่องเที่ยวบางเว็บ"}
{"word": "scroll through", "english": "He scrolled through the list to pick a gift.", "thai": "เขาเลื่อนดูรายชื่อเพื่อเลือกของขวัญ"}
{"word": "scroll through", "english": "Can you scroll through the app for updates?", "thai": "คุณช่วยเลื่อนดูแอปเพื่อหาอัปเดตได้ไหม?"}
{"word": "scroll through", "english": "She scrolled through her contacts for his number.", "thai": "เธอเลื่อนดูรายชื่อเพื่อหาเบอร์เขา"}
{"word": "scroll through", "english": "I’ll scroll through the newsfeed tonight.", "thai": "ฉันจะเลื่อนดูนิวส์ฟีดคืนนี้"}
{"word": "scroll through", "english": "He was scrolling through his messages at lunch.", "thai": "เขาเลื่อนดูข้อความตอนกินข้าวเที่ยง"}
{"word": "scroll through", "english": "Let’s scroll through the website for ideas.", "thai": "มาเลื่อนดูเว็บไซต์เพื่อหาไอเดีย"}
{"word": "scroll through", "english": "She scrolled through the app for new music.", "thai": "เธอเลื่อนดูแอปเพื่อหาเพลงใหม่"}
{"word": "scroll through", "english": "I scrolled through the comments on the video.", "thai": "ฉันเลื่อนดูคอมเมนต์ในวิดีโอ"}
{"word": "scroll through", "english": "He scrolls through his calendar before bed.", "thai": "เขาเลื่อนดูปฏิทินก่อนนอน"}
{"word": "scroll through", "english": "Can you scroll through the list for her email?", "thai": "คุณช่วยเลื่อนดูรายชื่อหาอีเมลของเธอได้ไหม?"}
{"word": "scroll through", "english": "She was scrolling through job postings online.", "thai": "เธอเลื่อนดูประกาศงานออนไลน์"}
{"word": "scroll through", "english": "I’ll scroll through the photos from the party.", "thai": "ฉันจะเลื่อนดูรูปจากงานปาร์ตี้"}
{"word": "scroll through", "english": "He scrolled through the app during the wait.", "thai": "เขาเลื่อนดูแอประหว่างรอ"}
{"word": "scroll through", "english": "Let’s scroll through the online catalog now.", "thai": "มาเลื่อนดูแคตตาล็อกออนไลน์ตอนนี้"}
{"word": "scroll through", "english": "She scrolls through her feed every evening.", "thai": "เธอเลื่อนดูฟีดทุกเย็น"}
{"word": "scroll through", "english": "I was scrolling through some blog posts.", "thai": "ฉันเลื่อนดูโพสต์บล็อกบางอัน"}
{"word": "scroll through", "english": "He scrolled through the menu on his phone.", "thai": "เขาเลื่อนดูเมนูบนโทรศัพท์"}
{"word": "scroll through", "english": "Can you scroll through the settings for Wi-Fi?", "thai": "คุณช่วยเลื่อนดูการตั้งค่าเพื่อหา Wi-Fi ได้ไหม?"}
{"word": "scroll through", "english": "She scrolled through the website for shoes.", "thai": "เธอเลื่อนดูเว็บไซต์เพื่อหาเสื้อผ้า"}
{"word": "scroll through", "english": "I’ll scroll through the news app later.", "thai": "ฉันจะเลื่อนดูแอปข่าวทีหลัง"}
{"word": "scroll through", "english": "He was scrolling through his emails at work.", "thai": "เขาเลื่อนดูอีเมลที่ทำงาน"}
{"word": "scroll through", "english": "Let’s scroll through the playlist for a vibe.", "thai": "มาเลื่อนดูเพลย์ลิสต์เพื่อหาอารมณ์"}
{"word": "scroll through", "english": "She scrolled through the reviews for the product.", "thai": "เธอเลื่อนดูรีวิวของสินค้า"}
{"word": "scroll through", "english": "I scrolled through the app to find a deal.", "thai": "ฉันเลื่อนดูแอปเพื่อหาดีล"}
{"word": "scroll through", "english": "He scrolls through his photos every weekend.", "thai": "เขาเลื่อนดูรูปทุกสุดสัปดาห์"}
{"word": "scroll through", "english": "Can you scroll through the document for me?", "thai": "คุณช่วยเลื่อนดูเอกสารให้ฉันได้ไหม?"}
{"word": "scroll through", "english": "She was scrolling through her social media.", "thai": "เธอเลื่อนดูโซเชียลมีเดียของเธอ"}
{"word": "scroll through", "english": "I’ll scroll through the blog tonight.", "thai": "ฉันจะเลื่อนดูบล็อกคืนนี้"}
{"word": "swipe up", "english": "Just swipe up to unlock your phone.", "thai": "แค่เลื่อนขึ้นเพื่อปลดล็อกโทรศัพท์"}
{"word": "swipe up", "english": "She told me to swipe up to see the story.", "thai": "เธอบอกให้ฉันเลื่อนขึ้นเพื่อดูสตอรี่"}
{"word": "swipe up", "english": "I forgot to swipe up to close the app.", "thai": "ฉันลืมเลื่อนขึ้นเพื่อปิดแอป"}
{"word": "swipe up", "english": "Can you swipe up to check the notifications?", "thai": "คุณช่วยเลื่อนขึ้นเพื่อเช็คการแจ้งเตือนได้ไหม?"}
{"word": "swipe up", "english": "He swipes up to skip the video ads.", "thai": "เขาเลื่อนขึ้นเพื่อข้ามโฆษณาวิดีโอ"}
{"word": "swipe up", "english": "Swipe up to see the full post on X.", "thai": "เลื่อนขึ้นเพื่อดูโพสต์เต็มบน X"}
{"word": "swipe up", "english": "I always swipe up to refresh my feed.", "thai": "ฉันเลื่อนขึ้นเพื่อรีเฟรชฟีดทุกครั้ง"}
{"word": "swipe up", "english": "She swiped up to view the next story.", "thai": "เธอเลื่อนขึ้นเพื่อดูสตอรี่ถัดไป"}
{"word": "swipe up", "english": "You need to swipe up to access the menu.", "thai": "คุณต้องเลื่อนขึ้นเพื่อเข้าถึงเมนู"}
{"word": "swipe up", "english": "He showed me how to swipe up for the settings.", "thai": "เขาแสดงให้ฉันดูวิธีเลื่อนขึ้นเพื่อไปที่การตั้งค่า"}
{"word": "swipe up", "english": "Swipe up to see the link in her bio.", "thai": "เลื่อนขึ้นเพื่อดูลิงก์ในไบโอของเธอ"}
{"word": "swipe up", "english": "I swiped up but the app didn’t respond.", "thai": "ฉันเลื่อนขึ้นแต่แอปไม่ตอบสนอง"}
{"word": "swipe up", "english": "Can you swipe up to open the camera?", "thai": "คุณช่วยเลื่อนขึ้นเพื่อเปิดกล้องได้ไหม?"}
{"word": "swipe up", "english": "She swipes up to check her messages.", "thai": "เธอเลื่อนขึ้นเพื่อเช็คข้อความ"}
{"word": "swipe up", "english": "Swipe up to view the full article.", "thai": "เลื่อนขึ้นเพื่อดูบทความเต็ม"}
{"word": "swipe up", "english": "He forgot to swipe up to answer the call.", "thai": "เขาลืมเลื่อนขึ้นเพื่อรับสาย"}
{"word": "swipe up", "english": "I’ll swipe up to see the new posts.", "thai": "ฉันจะเลื่อนขึ้นเพื่อดูโพสต์ใหม่"}
{"word": "swipe up", "english": "Swipe up to watch the next video.", "thai": "เลื่อนขึ้นเพื่อดูวิดีโอถัดไป"}
{"word": "swipe up", "english": "She swiped up to find the discount code.", "thai": "เธอเลื่อนขึ้นเพื่อหาโค้ดส่วนลด"}
{"word": "swipe up", "english": "You can swipe up to reply to her story.", "thai": "คุณเลื่อนขึ้นเพื่อตอบสตอรี่ของเธอได้"}
{"word": "swipe up", "english": "He swipes up to check his calendar.", "thai": "เขาเลื่อนขึ้นเพื่อเช็คปฏิทิน"}
{"word": "swipe up", "english": "Swipe up to see the event details.", "thai": "เลื่อนขึ้นเพื่อดูรายละเอียดงาน"}
{"word": "swipe up", "english": "I swiped up to open the control center.", "thai": "ฉันเลื่อนขึ้นเพื่อเปิดศูนย์ควบคุม"}
{"word": "swipe up", "english": "Can you swipe up to show me the photo?", "thai": "คุณช่วยเลื่อนขึ้นเพื่อโชว์รูปให้ฉันดูได้ไหม?"}
{"word": "swipe up", "english": "She swipes up to skip the intro.", "thai": "เธอเลื่อนขึ้นเพื่อข้ามส่วนแนะนำ"}
{"word": "swipe up", "english": "Swipe up to join the live stream.", "thai": "เลื่อนขึ้นเพื่อเข้าร่วมไลฟ์สตรีม"}
{"word": "swipe up", "english": "He swiped up to check the app updates.", "thai": "เขาเลื่อนขึ้นเพื่อเช็คอัปเดตแอป"}
{"word": "swipe up", "english": "I forgot to swipe up to save the story.", "thai": "ฉันลืมเลื่อนขึ้นเพื่อบันทึกสตอรี่"}
{"word": "swipe up", "english": "Swipe up to see the full recipe.", "thai": "เลื่อนขึ้นเพื่อดูสูตรอาหารเต็ม"}
{"word": "swipe up", "english": "She swiped up to view the comments.", "thai": "เธอเลื่อนขึ้นเพื่อดูคอมเมนต์"}
{"word": "swipe up", "english": "You need to swipe up to confirm the payment.", "thai": "คุณต้องเลื่อนขึ้นเพื่อยืนยันการชำระเงิน"}
{"word": "swipe up", "english": "He swipes up to switch apps quickly.", "thai": "เขาเลื่อนขึ้นเพื่อสลับแอปอย่างรวดเร็ว"}
{"word": "swipe up", "english": "Swipe up to check the weather update.", "thai": "เลื่อนขึ้นเพื่อเช็คอัปเดตสภาพอากาศ"}
{"word": "swipe up", "english": "I swiped up to see her latest post.", "thai": "ฉันเลื่อนขึ้นเพื่อดูโพสต์ล่าสุดของเธอ"}
{"word": "swipe up", "english": "Can you swipe up to find the link?", "thai": "คุณช่วยเลื่อนขึ้นเพื่อหาลิงก์ได้ไหม?"}
{"word": "swipe up", "english": "She swipes up to browse her stories.", "thai": "เธอเลื่อนขึ้นเพื่อดูสตอรี่ของเธอ"}
{"word": "swipe up", "english": "Swipe up to access the shortcuts.", "thai": "เลื่อนขึ้นเพื่อเข้าถึงทางลัด"}
{"word": "swipe up", "english": "He swiped up to open the news feed.", "thai": "เขาเลื่อนขึ้นเพื่อเปิดนิวส์ฟีด"}
{"word": "swipe up", "english": "I’ll swipe up to check the notifications later.", "thai": "ฉันจะเลื่อนขึ้นเพื่อเช็คการแจ้งเตือนทีหลัง"}
{"word": "swipe up", "english": "Swipe up to see the shopping deals.", "thai": "เลื่อนขึ้นเพื่อดูดีลช้อปปิ้ง"}
{"word": "swipe up", "english": "She swiped up to view the next image.", "thai": "เธอเลื่อนขึ้นเพื่อดูรูปถัดไป"}
{"word": "swipe up", "english": "You can swipe up to send a quick reply.", "thai": "คุณเลื่อนขึ้นเพื่อส่งข้อความตอบกลับเร็วได้"}
{"word": "swipe up", "english": "He swipes up to check his emails.", "thai": "เขาเลื่อนขึ้นเพื่อเช็คอีเมล"}
{"word": "swipe up", "english": "Swipe up to see the full video clip.", "thai": "เลื่อนขึ้นเพื่อดูคลิปวิดีโอเต็ม"}
{"word": "swipe up", "english": "I swiped up to open the app tray.", "thai": "ฉันเลื่อนขึ้นเพื่อเปิดถาดแอป"}
{"word": "swipe up", "english": "Can you swipe up to show the playlist?", "thai": "คุณช่วยเลื่อนขึ้นเพื่อโชว์เพลย์ลิสต์ได้ไหม?"}
{"word": "swipe up", "english": "She swipes up to skip the boring parts.", "thai": "เธอเลื่อนขึ้นเพื่อข้ามส่วนที่น่าเบื่อ"}
{"word": "swipe up", "english": "Swipe up to check the event RSVP.", "thai": "เลื่อนขึ้นเพื่อเช็คการตอบรับงาน"}
{"word": "swipe up", "english": "He swiped up to view the map directions.", "thai": "เขาเลื่อนขึ้นเพื่อดูเส้นทางบนแผนที่"}
{"word": "swipe up", "english": "I forgot to swipe up to save the post.", "thai": "ฉันลืมเลื่อนขึ้นเพื่อบันทึกโพสต์"}
{"word": "swipe up", "english": "Swipe up to see the product details.", "thai": "เลื่อนขึ้นเพื่อดูรายละเอียดสินค้า"}
{"word": "swipe up", "english": "She swiped up to check the group chat.", "thai": "เธอเลื่อนขึ้นเพื่อเช็คแชทกลุ่ม"}
{"word": "swipe up", "english": "You need to swipe up to start the game.", "thai": "คุณต้องเลื่อนขึ้นเพื่อเริ่มเกม"}
{"word": "swipe up", "english": "He swipes up to browse his photos.", "thai": "เขาเลื่อนขึ้นเพื่อดูรูปของเขา"}
{"word": "swipe up", "english": "Swipe up to open the music player.", "thai": "เลื่อนขึ้นเพื่อเปิดเครื่องเล่นเพลง"}
{"word": "swipe up", "english": "I swiped up to see the new messages.", "thai": "ฉันเลื่อนขึ้นเพื่อดูข้อความใหม่"}
{"word": "swipe up", "english": "Can you swipe up to find the contact?", "thai": "คุณช่วยเลื่อนขึ้นเพื่อหาคอนแทคได้ไหม?"}
{"word": "swipe up", "english": "She swipes up to check her calendar.", "thai": "เธอเลื่อนขึ้นเพื่อเช็คปฏิทิน"}
{"word": "swipe up", "english": "Swipe up to view the next page.", "thai": "เลื่อนขึ้นเพื่อดูหน้าถัดไป"}
{"word": "swipe up", "english": "He swiped up to refresh the app.", "thai": "เขาเลื่อนขึ้นเพื่อรีเฟรชแอป"}
{"word": "swipe up", "english": "I’ll swipe up to see the live updates.", "thai": "ฉันจะเลื่อนขึ้นเพื่อดูอัปเดตสด"}
{"word": "swipe up", "english": "Swipe up to access the quick settings.", "thai": "เลื่อนขึ้นเพื่อเข้าถึงการตั้งค่าด่วน"}
{"word": "swipe up", "english": "She swiped up to watch the next clip.", "thai": "เธอเลื่อนขึ้นเพื่อดูคลิปถัดไป"}
{"word": "swipe up", "english": "You can swipe up to share the post.", "thai": "คุณเลื่อนขึ้นเพื่อแชร์โพสต์ได้"}
{"word": "swipe up", "english": "He swipes up to check his reminders.", "thai": "เขาเลื่อนขึ้นเพื่อเช็คเตือนความจำ"}
{"word": "swipe up", "english": "Swipe up to see the sale items.", "thai": "เลื่อนขึ้นเพื่อดูสินค้าลดราคา"}
{"word": "swipe up", "english": "I swiped up to open the gallery.", "thai": "ฉันเลื่อนขึ้นเพื่อเปิดแกลเลอรี่"}
{"word": "swipe up", "english": "Can you swipe up to show the video?", "thai": "คุณช่วยเลื่อนขึ้นเพื่อโชว์วิดีโอได้ไหม?"}
{"word": "swipe up", "english": "She swipes up to skip the ads.", "thai": "เธอเลื่อนขึ้นเพื่อข้ามโฆษณา"}
{"word": "swipe up", "english": "Swipe up to check the new comments.", "thai": "เลื่อนขึ้นเพื่อเช็คคอมเมนต์ใหม่"}
{"word": "swipe up", "english": "He swiped up to view the settings menu.", "thai": "เขาเลื่อนขึ้นเพื่อดูเมนูการตั้งค่า"}
{"word": "swipe up", "english": "I forgot to swipe up to save the link.", "thai": "ฉันลืมเลื่อนขึ้นเพื่อบันทึกลิงก์"}
{"word": "swipe up", "english": "Swipe up to see the full description.", "thai": "เลื่อนขึ้นเพื่อดูคำอธิบายเต็ม"}
{"word": "swipe up", "english": "She swiped up to check her notifications.", "thai": "เธอเลื่อนขึ้นเพื่อเช็คการแจ้งเตือน"}
{"word": "swipe up", "english": "You need to swipe up to open the app.", "thai": "คุณต้องเลื่อนขึ้นเพื่อเปิดแอป"}
{"word": "swipe up", "english": "He swipes up to browse his stories.", "thai": "เขาเลื่อนขึ้นเพื่อดูสตอรี่ของเขา"}
{"word": "swipe up", "english": "Swipe up to view the next photo.", "thai": "เลื่อนขึ้นเพื่อดูรูปถัดไป"}
{"word": "swipe up", "english": "I swiped up to check the event page.", "thai": "ฉันเลื่อนขึ้นเพื่อเช็คหน้าอีเวนต์"}
{"word": "swipe up", "english": "Can you swipe up to find the message?", "thai": "คุณช่วยเลื่อนขึ้นเพื่อหาข้อความได้ไหม?"}
{"word": "swipe up", "english": "She swipes up to see the new posts.", "thai": "เธอเลื่อนขึ้นเพื่อดูโพสต์ใหม่"}
{"word": "swipe up", "english": "Swipe up to access the camera roll.", "thai": "เลื่อนขึ้นเพื่อเข้าถึงม้วนฟิล์มกล้อง"}
{"word": "swipe up", "english": "He swiped up to open the music app.", "thai": "เขาเลื่อนขึ้นเพื่อเปิดแอปเพลง"}
{"word": "swipe up", "english": "I’ll swipe up to see the latest deals.", "thai": "ฉันจะเลื่อนขึ้นเพื่อดูดีลล่าสุด"}
{"word": "swipe up", "english": "Swipe up to check the group updates.", "thai": "เลื่อนขึ้นเพื่อเช็คอัปเดตกลุ่ม"}
{"word": "swipe up", "english": "She swiped up to view the next story.", "thai": "เธอเลื่อนขึ้นเพื่อดูสตอรี่ถัดไป"}
{"word": "swipe up", "english": "You can swipe up to send feedback.", "thai": "คุณเลื่อนขึ้นเพื่อส่งฟีดแบ็กได้"}
{"word": "swipe up", "english": "He swipes up to check his social media.", "thai": "เขาเลื่อนขึ้นเพื่อเช็คโซเชียลมีเดีย"}
{"word": "swipe up", "english": "Swipe up to see the new arrivals.", "thai": "เลื่อนขึ้นเพื่อดูสินค้าใหม่"}
{"word": "swipe up", "english": "I swiped up to open the settings.", "thai": "ฉันเลื่อนขึ้นเพื่อเปิดการตั้งค่า"}
{"word": "swipe up", "english": "Can you swipe up to show the calendar?", "thai": "คุณช่วยเลื่อนขึ้นเพื่อโชว์ปฏิทินได้ไหม?"}
{"word": "swipe up", "english": "She swipes up to skip the video intro.", "thai": "เธอเลื่อนขึ้นเพื่อข้ามส่วนแนะนำวิดีโอ"}
{"word": "swipe up", "english": "Swipe up to check the latest news.", "thai": "เลื่อนขึ้นเพื่อเช็คข่าวล่าสุด"}
{"word": "swipe up", "english": "He swiped up to view his messages.", "thai": "เขาเลื่อนขึ้นเพื่อดูข้อความของเขา"}
{"word": "swipe up", "english": "I forgot to swipe up to save the video.", "thai": "ฉันลืมเลื่อนขึ้นเพื่อบันทึกวิดีโอ"}
{"word": "swipe up", "english": "Swipe up to see the full menu.", "thai": "เลื่อนขึ้นเพื่อดูเมนูเต็ม"}
{"word": "swipe up", "english": "She swiped up to check the app notifications.", "thai": "เธอเลื่อนขึ้นเพื่อเช็คการแจ้งเตือนแอป"}
{"word": "swipe up", "english": "You need to swipe up to unlock the screen.", "thai": "คุณต้องเลื่อนขึ้นเพื่อปลดล็อกหน้าจอ"}
{"word": "swipe up", "english": "He swipes up to browse his gallery.", "thai": "เขาเลื่อนขึ้นเพื่อดูแกลเลอรี่ของเขา"}
{"word": "tap out", "english": "He had to tap out in the first round of the match.", "thai": "เขาต้องยอมแพ้ในรอบแรกของการแข่งขัน"}
{"word": "tap out", "english": "I’m so tired, I’m ready to tap out for the day.", "thai": "ฉันเหนื่อยมาก พร้อมจะยอมแพ้สำหรับวันนี้แล้ว"}
{"word": "tap out", "english": "She tapped out after trying to solve the puzzle.", "thai": "เธอยอมแพ้หลังจากพยายามแก้ปริศนา"}
{"word": "tap out", "english": "Can you tap out if you can’t handle the sparring?", "thai": "คุณจะยอมแพ้ได้ไหมถ้าทนการซ้อมไม่ได้?"}
{"word": "tap out", "english": "He tapped out when the chokehold got too tight.", "thai": "เขายอมแพ้เมื่อถูกบีบคอแน่นเกินไป"}
{"word": "tap out", "english": "I’m about to tap out; this project is overwhelming.", "thai": "ฉันกำลังจะยอมแพ้ โปรเจกต์นี้น่าท่วมท้น"}
{"word": "tap out", "english": "She decided to tap out of the debate.", "thai": "เธอตัดสินใจยอมแพ้ในการโต้วาที"}
{"word": "tap out", "english": "He tapped out after running out of ideas.", "thai": "เขายอมแพ้หลังจากหมดไอเดีย"}
{"word": "tap out", "english": "You can tap out if the workout is too intense.", "thai": "คุณสามารถยอมแพ้ได้ถ้าการออกกำลังกายหนักเกินไป"}
{"word": "tap out", "english": "I had to tap out of the game; it was too hard.", "thai": "ฉันต้องยอมแพ้ในเกม มันยากเกินไป"}
{"word": "tap out", "english": "He tapped out during the arm-wrestling match.", "thai": "เขายอมแพ้ระหว่างการแข่งขันมวยปล้ำแขน"}
{"word": "tap out", "english": "She’s going to tap out if she keeps working late.", "thai": "เธอจะยอมแพ้ถ้ายังทำงานดึกต่อไป"}
{"word": "tap out", "english": "I tapped out after three rounds of negotiations.", "thai": "ฉันยอมแพ้หลังจากการเจรจาสามรอบ"}
{"word": "tap out", "english": "He’ll tap out if you keep asking tough questions.", "thai": "เขาจะยอมแพ้ถ้าคุณถามคำถามยากต่อไป"}
{"word": "tap out", "english": "She tapped out of the competition due to stress.", "thai": "เธอยอมแพ้ในการแข่งขันเพราะความเครียด"}
{"word": "tap out", "english": "I’m ready to tap out; this quiz is impossible.", "thai": "ฉันพร้อมยอมแพ้แล้ว แบบทดสอบนี้ยากเกินไป"}
{"word": "tap out", "english": "He tapped out when the fight got too intense.", "thai": "เขายอมแพ้เมื่อการต่อสู้ดุเดือดเกินไป"}
{"word": "tap out", "english": "Can you tap out if you’re out of energy?", "thai": "คุณจะยอมแพ้ได้ไหมถ้าหมดพลัง?"}
{"word": "tap out", "english": "She tapped out after failing the challenge.", "thai": "เธอยอมแพ้หลังจากล้มเหลวในความท้าทาย"}
{"word": "tap out", "english": "I had to tap out; my wallet’s empty.", "thai": "ฉันต้องยอมแพ้ กระเป๋าตังค์ฉันว่างเปล่า"}
{"word": "tap out", "english": "He tapped out of the card game after losing.", "thai": "เขายอมแพ้ในเกมไพ่หลังจากแพ้"}
{"word": "tap out", "english": "She’s going to tap out if she doesn’t rest.", "thai": "เธอจะยอมแพ้ถ้าไม่พักผ่อน"}
{"word": "tap out", "english": "I tapped out after trying to fix the code.", "thai": "ฉันยอมแพ้หลังจากพยายามแก้โค้ด"}
{"word": "tap out", "english": "He tapped out in the wrestling match quickly.", "thai": "เขายอมแพ้ในการแข่งมวยปล้ำอย่างรวดเร็ว"}
{"word": "tap out", "english": "You can tap out if the task feels too hard.", "thai": "คุณสามารถยอมแพ้ได้ถ้างานรู้สึกยากเกินไป"}
{"word": "tap out", "english": "She tapped out of the argument; it was pointless.", "thai": "เธอยอมแพ้ในการโต้แย้ง มันไร้ประโยชน์"}
{"word": "tap out", "english": "I’m about to tap out; this hike is exhausting.", "thai": "ฉันกำลังจะยอมแพ้ การเดินป่านี้เหนื่อยมาก"}
{"word": "tap out", "english": "He tapped out when his opponent got stronger.", "thai": "เขายอมแพ้เมื่อคู่ต่อสู้แข็งแกร่งขึ้น"}
{"word": "tap out", "english": "She tapped out after hours of studying.", "thai": "เธอยอมแพ้หลังจากเรียนมาหลายชั่วโมง"}
{"word": "tap out", "english": "I had to tap out; I ran out of patience.", "thai": "ฉันต้องยอมแพ้ ฉันหมดความอดทน"}
{"word": "tap out", "english": "He’ll tap out if the pressure keeps building.", "thai": "เขาจะยอมแพ้ถ้าความกดดันเพิ่มขึ้นเรื่อยๆ"}
{"word": "tap out", "english": "She tapped out of the meeting; it was too long.", "thai": "เธอยอมแพ้ในที่ประชุม มันยาวเกินไป"}
{"word": "tap out", "english": "I tapped out after losing three games in a row.", "thai": "ฉันยอมแพ้หลังจากแพ้สามเกมติด"}
{"word": "tap out", "english": "He tapped out during the intense training session.", "thai": "เขายอมแพ้ระหว่างการฝึกหนัก"}
{"word": "tap out", "english": "Can you tap out if you’re overwhelmed?", "thai": "คุณจะยอมแพ้ได้ไหมถ้ารู้สึกหนักเกินไป?"}
{"word": "tap out", "english": "She tapped out when the math got too hard.", "thai": "เธอยอมแพ้เมื่อคณิตศาสตร์ยากเกินไป"}
{"word": "tap out", "english": "I’m ready to tap out; this party’s too wild.", "thai": "ฉันพร้อมยอมแพ้ ปาร์ตี้นี้มันเกินไป"}
{"word": "tap out", "english": "He tapped out in the boxing ring last night.", "thai": "เขายอมแพ้ในสังเวียนมวยเมื่อคืน"}
{"word": "tap out", "english": "She tapped out of the group project.", "thai": "เธอยอมแพ้ในโปรเจกต์กลุ่ม"}
{"word": "tap out", "english": "I had to tap out; I’m out of ideas.", "thai": "ฉันต้องยอมแพ้ ฉันหมดไอเดีย"}
{"word": "tap out", "english": "He tapped out after the long debate.", "thai": "เขายอมแพ้หลังจากการโต้วาทีที่ยาวนาน"}
{"word": "tap out", "english": "You can tap out if you’re too tired to continue.", "thai": "คุณสามารถยอมแพ้ได้ถ้าเหนื่อยเกินไปที่จะทำต่อ"}
{"word": "tap out", "english": "She tapped out during the tough workout.", "thai": "เธอยอมแพ้ระหว่างการออกกำลังกายหนัก"}
{"word": "tap out", "english": "I’m about to tap out; this job is stressful.", "thai": "ฉันกำลังจะยอมแพ้ งานนี้เครียดมาก"}
{"word": "tap out", "english": "He tapped out when the game got too competitive.", "thai": "เขายอมแพ้เมื่อเกมเริ่มแข่งขันกันมาก"}
{"word": "tap out", "english": "She tapped out of the trivia contest.", "thai": "เธอยอมแพ้ในการแข่งขันทริเวีย"}
{"word": "tap out", "english": "I tapped out after struggling with the code.", "thai": "ฉันยอมแพ้หลังจากพยายามแก้โค้ด"}
{"word": "tap out", "english": "He tapped out in the martial arts spar.", "thai": "เขายอมแพ้ในการซ้อมศิลปะการต่อสู้"}
{"word": "tap out", "english": "Can you tap out if you’re out of moves?", "thai": "คุณจะยอมแพ้ได้ไหมถ้าคุณหมดวิธี?"}
{"word": "tap out", "english": "She tapped out after the long study session.", "thai": "เธอยอมแพ้หลังจากการเรียนนาน"}
{"word": "tap out", "english": "I’m ready to tap out; this is too much.", "thai": "ฉันพร้อมยอมแพ้แล้ว มันมากเกินไป"}
{"word": "tap out", "english": "He tapped out during the wrestling practice.", "thai": "เขายอมแพ้ระหว่างการฝึกมวยปล้ำ"}
{"word": "tap out", "english": "She tapped out of the cooking competition.", "thai": "เธอยอมแพ้ในการแข่งขันทำอาหาร"}
{"word": "tap out", "english": "I had to tap out; my brain’s fried.", "thai": "ฉันต้องยอมแพ้ สมองฉันล้าแล้ว"}
{"word": "tap out", "english": "He’ll tap out if the workout gets harder.", "thai": "เขาจะยอมแพ้ถ้าการออกกำลังกายหนักขึ้น"}
{"word": "tap out", "english": "She tapped out after the intense argument.", "thai": "เธอยอมแพ้หลังจากการโต้แย้งที่รุนแรง"}
{"word": "tap out", "english": "I tapped out when the quiz got too tricky.", "thai": "ฉันยอมแพ้เมื่อแบบทดสอบยากเกินไป"}
{"word": "tap out", "english": "He tapped out in the MMA fight last week.", "thai": "เขายอมแพ้ในการต่อสู้ MMA เมื่อสัปดาห์ที่แล้ว"}
{"word": "tap out", "english": "You can tap out if you’re out of stamina.", "thai": "คุณสามารถยอมแพ้ได้ถ้าหมดแรง"}
{"word": "tap out", "english": "She tapped out of the group discussion.", "thai": "เธอยอมแพ้ในการสนทนากลุ่ม"}
{"word": "tap out", "english": "I’m about to tap out; this is exhausting.", "thai": "ฉันกำลังจะยอมแพ้ มันเหนื่อยมาก"}
{"word": "tap out", "english": "He tapped out after losing the bet.", "thai": "เขายอมแพ้หลังจากแพ้เดิมพัน"}
{"word": "tap out", "english": "She tapped out when the task got too complex.", "thai": "เธอยอมแพ้เมื่องานซับซ้อนเกินไป"}
{"word": "tap out", "english": "I had to tap out; I’m out of money.", "thai": "ฉันต้องยอมแพ้ ฉันเงินหมด"}
{"word": "tap out", "english": "He tapped out during the chess match.", "thai": "เขายอมแพ้ระหว่างการแข่งหมากรุก"}
{"word": "tap out", "english": "Can you tap out if you’re too stressed?", "thai": "คุณจะยอมแพ้ได้ไหมถ้าเครียดเกินไป?"}
{"word": "tap out", "english": "She tapped out after the long rehearsal.", "thai": "เธอยอมแพ้หลังจากการซ้อมนาน"}
{"word": "tap out", "english": "I’m ready to tap out; this game’s too tough.", "thai": "ฉันพร้อมยอมแพ้แล้ว เกมนี้ยากเกิน"}
{"word": "tap out", "english": "He tapped out in the jiu-jitsu match.", "thai": "เขายอมแพ้ในการแข่งยิวยิตสู"}
{"word": "tap out", "english": "She tapped out of the team challenge.", "thai": "เธอยอมแพ้ในความท้าทายของทีม"}
{"word": "tap out", "english": "I tapped out after hours of debugging.", "thai": "ฉันยอมแพ้หลังจากดีบั๊กหลายชั่วโมง"}
{"word": "tap out", "english": "He tapped out when the opponent was too strong.", "thai": "เขายอมแพ้เมื่อคู่ต่อสู้แข็งแกร่งเกินไป"}
{"word": "tap out", "english": "You can tap out if you’re out of options.", "thai": "คุณสามารถยอมแพ้ได้ถ้าคุณหมดทางเลือก"}
{"word": "tap out", "english": "She tapped out during the intense cardio session.", "thai": "เธอยอมแพ้ระหว่างการออกกำลังกายคาร์ดิโอหนัก"}
{"word": "tap out", "english": "I’m about to tap out; this is overwhelming.", "thai": "ฉันกำลังจะยอมแพ้ มันหนักเกินไป"}
{"word": "tap out", "english": "He tapped out after the tough negotiation.", "thai": "เขายอมแพ้หลังจากการเจรจาที่ยากลำบาก"}
{"word": "tap out", "english": "She tapped out of the dance practice.", "thai": "เธอยอมแพ้ในการซ้อมเต้น"}
{"word": "tap out", "english": "I had to tap out; I’m too tired.", "thai": "ฉันต้องยอมแพ้ ฉันเหนื่อยเกินไป"}
{"word": "tap out", "english": "He’ll tap out if the match gets too rough.", "thai": "เขาจะยอมแพ้ถ้าการแข่งขันรุนแรงเกินไป"}
{"word": "tap out", "english": "She tapped out after the long exam.", "thai": "เธอยอมแพ้หลังจากการสอบที่ยาวนาน"}
{"word": "tap out", "english": "I tapped out when I ran out of time.", "thai": "ฉันยอมแพ้เมื่อหมดเวลา"}
{"word": "tap out", "english": "He tapped out in the grappling session.", "thai": "เขายอมแพ้ในเซสชั่นการต่อสู้"}
{"word": "tap out", "english": "You can tap out if you’re too frustrated.", "thai": "คุณสามารถยอมแพ้ได้ถ้าคุณหงุดหงิดเกินไป"}
{"word": "tap out", "english": "She tapped out of the coding challenge.", "thai": "เธอยอมแพ้ในความท้าทายด้านการเขียนโค้ด"}
{"word": "tap out", "english": "I’m ready to tap out; this is too intense.", "thai": "ฉันพร้อมยอมแพ้แล้ว มันเข้มข้นเกินไป"}
{"word": "tap out", "english": "He tapped out after the long workout.", "thai": "เขายอมแพ้หลังจากการออกกำลังกายนาน"}
{"word": "tap out", "english": "She tapped out when the puzzle was unsolvable.", "thai": "เธอยอมแพ้เมื่อปริศนาแก้ไม่ได้"}
{"word": "tap out", "english": "I had to tap out; I’m out of energy.", "thai": "ฉันต้องยอมแพ้ ฉันหมดพลัง"}
{"word": "tap out", "english": "He tapped out during the intense debate.", "thai": "เขายอมแพ้ระหว่างการโต้วาทีที่เข้มข้น"}
{"word": "tap out", "english": "Can you tap out if you’re too overwhelmed?", "thai": "คุณจะยอมแพ้ได้ไหมถ้าคุณหนักเกินไป?"}
{"word": "tap out", "english": "She tapped out after the tough yoga class.", "thai": "เธอยอมแพ้หลังจากคลาสโยคะหนัก"}
{"word": "tap out", "english": "I’m about to tap out; this task is brutal.", "thai": "ฉันกำลังจะยอมแพ้ งานนี้โหดมาก"}
{"word": "tap out", "english": "He tapped out in the kickboxing match.", "thai": "เขายอมแพ้ในการแข่งขันคิกบ็อกซิ่ง"}
{"word": "tap out", "english": "She tapped out of the group activity.", "thai": "เธอยอมแพ้ในกิจกรรมกลุ่ม"}
{"word": "tap out", "english": "I tapped out after trying to fix the bug.", "thai": "ฉันยอมแพ้หลังจากพยายามแก้บั๊ก"}
{"word": "tap out", "english": "He tapped out when the challenge got too hard.", "thai": "เขายอมแพ้เมื่อความท้าทายยากเกินไป"}
{"word": "tap out", "english": "You can tap out if you’re out of patience.", "thai": "คุณสามารถยอมแพ้ได้ถ้าคุณหมดความอดทน"}
{"word": "tap out", "english": "She tapped out during the long meeting.", "thai": "เธอยอมแพ้ระหว่างการประชุมยาว"}
{"word": "tap out", "english": "I’m ready to tap out; this is too much work.", "thai": "ฉันพร้อมยอมแพ้แล้ว งานนี้เยอะเกินไป"}
{"word": "zone in", "english": "I need to zone in on my homework tonight.", "thai": "ฉันต้องจดจ่อกับการบ้านคืนนี้"}
{"word": "zone in", "english": "She zoned in during the final exam.", "thai": "เธอจดจ่อระหว่างการสอบปลายภาค"}
{"word": "zone in", "english": "He always zones in when he’s coding.", "thai": "เขามักจะจดจ่อเมื่อเขียนโค้ด"}
{"word": "zone in", "english": "Can you zone in on the project details?", "thai": "คุณช่วยจดจ่อกับรายละเอียดโปรเจกต์ได้ไหม?"}
{"word": "zone in", "english": "I zoned in on the book and forgot the time.", "thai": "ฉันจดจ่อกับหนังสือจนลืมเวลา"}
{"word": "zone in", "english": "She zones in when she’s painting.", "thai": "เธอจดจ่อเมื่อวาดภาพ"}
{"word": "zone in", "english": "He needs to zone in during practice.", "thai": "เขาต้องจดจ่อระหว่างการซ้อม"}
{"word": "zone in", "english": "Let’s zone in on the main issue here.", "thai": "มาจดจ่อกับประเด็นหลักที่นี่กัน"}
{"word": "zone in", "english": "I’m trying to zone in on my presentation.", "thai": "ฉันกำลังพยายามจดจ่อกับงานนำเสนอ"}
{"word": "zone in", "english": "She zoned in on her workout routine.", "thai": "เธอจดจ่อกับตารางออกกำลังกาย"}
{"word": "zone in", "english": "He zoned in during the chess match.", "thai": "เขาจดจ่อระหว่างการแข่งหมากรุก"}
{"word": "zone in", "english": "I need to zone in to finish this essay.", "thai": "ฉันต้องจดจ่อเพื่อเขียนเรียงความนี้ให้เสร็จ"}
{"word": "zone in", "english": "She’s really good at zoning in on details.", "thai": "เธอเก่งมากในการจดจ่อกับรายละเอียด"}
{"word": "zone in", "english": "He zoned in on the lecture and took notes.", "thai": "เขาจดจ่อกับการบรรยายและจดโน้ต"}
{"word": "zone in", "english": "Can you zone in on the problem and fix it?", "thai": "คุณช่วยจดจ่อกับปัญหาและแก้ไขได้ไหม?"}
{"word": "zone in", "english": "I zoned in on the game and won.", "thai": "ฉันจดจ่อกับเกมและชนะ"}
{"word": "zone in", "english": "She zoned in during the meeting.", "thai": "เธอจดจ่อระหว่างการประชุม"}
{"word": "zone in", "english": "He needs to zone in to meet the deadline.", "thai": "เขาต้องจดจ่อเพื่อให้ทันกำหนดเวลา"}
{"word": "zone in", "english": "Let’s zone in on the key points of the plan.", "thai": "มาจดจ่อกับประเด็นสำคัญของแผนกัน"}
{"word": "zone in", "english": "I’m zoning in on my math homework now.", "thai": "ฉันกำลังจดจ่อกับการบ้านคณิตศาสตร์"}
{"word": "zone in", "english": "She zoned in on her yoga practice.", "thai": "เธอจดจ่อกับการฝึกโยคะ"}
{"word": "zone in", "english": "He zoned in during the debate prep.", "thai": "เขาจดจ่อระหว่างการเตรียมโต้วาที"}
{"word": "zone in", "english": "I need to zone in to study for the test.", "thai": "ฉันต้องจดจ่อเพื่ออ่านหนังสือสอบ"}
{"word": "zone in", "english": "She zoned in on the recipe instructions.", "thai": "เธอจดจ่อกับคำแนะนำสูตรอาหาร"}
{"word": "zone in", "english": "He’s zoning in on his guitar practice.", "thai": "เขากำลังจดจ่อกับการฝึกกีตาร์"}
{"word": "zone in", "english": "Can you zone in on the data analysis?", "thai": "คุณช่วยจดจ่อกับการวิเคราะห์ข้อมูลได้ไหม?"}
{"word": "zone in", "english": "I zoned in on the movie and missed the call.", "thai": "ฉันจดจ่อกับหนังจนพลาดสาย"}
{"word": "zone in", "english": "She zoned in during the art class.", "thai": "เธอจดจ่อระหว่างชั้นเรียนศิลปะ"}
{"word": "zone in", "english": "He needs to zone in on his lines for the play.", "thai": "เขาต้องจดจ่อกับบทละคร"}
{"word": "zone in", "english": "Let’s zone in on the budget details.", "thai": "มาจดจ่อกับรายละเอียดงบประมาณกัน"}
{"word": "zone in", "english": "I’m trying to zone in on my writing.", "thai": "ฉันกำลังพยายามจดจ่อกับการเขียน"}
{"word": "zone in", "english": "She zoned in on her knitting project.", "thai": "เธอจดจ่อกับโปรเจกต์ถักนิตติ้ง"}
{"word": "zone in", "english": "He zoned in during the coding session.", "thai": "เขาจดจ่อระหว่างเซสชันเขียนโค้ด"}
{"word": "zone in", "english": "I need to zone in to finish this report.", "thai": "ฉันต้องจดจ่อเพื่อเขียนรายงานนี้ให้เสร็จ"}
{"word": "zone in", "english": "She’s zoning in on her dance routine.", "thai": "เธอกำลังจดจ่อกับท่าเต้น"}
{"word": "zone in", "english": "He zoned in on the science experiment.", "thai": "เขาจดจ่อกับการทดลองวิทยาศาสตร์"}
{"word": "zone in", "english": "Can you zone in on the client’s needs?", "thai": "คุณช่วยจดจ่อกับความต้องการของลูกค้าได้ไหม?"}
{"word": "zone in", "english": "I zoned in on the book and finished it.", "thai": "ฉันจดจ่อกับหนังสือและอ่านจบ"}
{"word": "zone in", "english": "She zoned in during the piano lesson.", "thai": "เธอจดจ่อระหว่างบทเรียนเปียโน"}
{"word": "zone in", "english": "He needs to zone in on his presentation skills.", "thai": "เขาต้องจดจ่อกับทักษะการนำเสนอ"}
{"word": "zone in", "english": "Let’s zone in on the project timeline.", "thai": "มาจดจ่อกับไทม์ไลน์ของโปรเจกต์กัน"}
{"word": "zone in", "english": "I’m zoning in on my fitness goals.", "thai": "ฉันกำลังจดจ่อกับเป้าหมายฟิตเนส"}
{"word": "zone in", "english": "She zoned in on her language studies.", "thai": "เธอจดจ่อกับการเรียนภาษา"}
{"word": "zone in", "english": "He zoned in during the math class.", "thai": "เขาจดจ่อระหว่างชั้นเรียนคณิตศาสตร์"}
{"word": "zone in", "english": "I need to zone in to prepare for the interview.", "thai": "ฉันต้องจดจ่อเพื่อเตรียมตัวสัมภาษณ์"}
{"word": "zone in", "english": "She zoned in on her sewing project.", "thai": "เธอจดจ่อกับโปรเจกต์เย็บผ้า"}
{"word": "zone in", "english": "He’s zoning in on his workout plan.", "thai": "เขากำลังจดจ่อกับแผนออกกำลังกาย"}
{"word": "zone in", "english": "Can you zone in on the meeting agenda?", "thai": "คุณช่วยจดจ่อกับวาระการประชุมได้ไหม?"}
{"word": "zone in", "english": "I zoned in on the puzzle and solved it.", "thai": "ฉันจดจ่อกับปริศนาและแก้ได้"}
{"word": "zone in", "english": "She zoned in during the writing workshop.", "thai": "เธอจดจ่อระหว่างเวิร์กช็อปการเขียน"}
{"word": "zone in", "english": "He needs to zone in on his study schedule.", "thai": "เขาต้องจดจ่อกับตารางเรียน"}
{"word": "zone in", "english": "Let’s zone in on the marketing strategy.", "thai": "มาจดจ่อกับกลยุทธ์การตลาดกัน"}
{"word": "zone in", "english": "I’m trying to zone in on my reading.", "thai": "ฉันกำลังพยายามจดจ่อกับการอ่าน"}
{"word": "zone in", "english": "She zoned in on her baking recipe.", "thai": "เธอจดจ่อกับสูตรอบขนม"}
{"word": "zone in", "english": "He zoned in during the team practice.", "thai": "เขาจดจ่อระหว่างการซ้อมทีม"}
{"word": "zone in", "english": "I need to zone in to finish this design.", "thai": "ฉันต้องจดจ่อเพื่อออกแบบนี้ให้เสร็จ"}
{"word": "zone in", "english": "She’s zoning in on her photography project.", "thai": "เธอกำลังจดจ่อกับโปรเจกต์ถ่ายภาพ"}
{"word": "zone in", "english": "He zoned in on the history lecture.", "thai": "เขาจดจ่อกับการบรรยายประวัติศาสตร์"}
{"word": "zone in", "english": "Can you zone in on the technical details?", "thai": "คุณช่วยจดจ่อกับรายละเอียดทางเทคนิคได้ไหม?"}
{"word": "zone in", "english": "I zoned in on the game strategy.", "thai": "ฉันจดจ่อกับกลยุทธ์เกม"}
{"word": "zone in", "english": "She zoned in during the cooking class.", "thai": "เธอจดจ่อระหว่างชั้นเรียนทำอาหาร"}
{"word": "zone in", "english": "He needs to zone in on his essay draft.", "thai": "เขาต้องจดจ่อกับร่างเรียงความ"}
{"word": "zone in", "english": "Let’s zone in on the event planning.", "thai": "มาจดจ่อกับการวางแผนงานกัน"}
{"word": "zone in", "english": "I’m zoning in on my language practice.", "thai": "ฉันกำลังจดจ่อกับการฝึกภาษา"}
{"word": "zone in", "english": "She zoned in on her fitness routine.", "thai": "เธอจดจ่อกับตารางฟิตเนส"}
{"word": "zone in", "english": "He zoned in during the coding bootcamp.", "thai": "เขาจดจ่อระหว่างบูตแคมป์เขียนโค้ด"}
{"word": "zone in", "english": "I need to zone in to complete this task.", "thai": "ฉันต้องจดจ่อเพื่อทำงานนี้ให้เสร็จ"}
{"word": "zone in", "english": "She zoned in on her research paper.", "thai": "เธอจดจ่อกับเอกสารวิจัย"}
{"word": "zone in", "english": "He’s zoning in on his basketball drills.", "thai": "เขากำลังจดจ่อกับการฝึกบาสเกตบอล"}
{"word": "zone in", "english": "Can you zone in on the feedback notes?", "thai": "คุณช่วยจดจ่อกับบันทึกฟีดแบ็กได้ไหม?"}
{"word": "zone in", "english": "I zoned in on the novel and read all night.", "thai": "ฉันจดจ่อกับนิยายและอ่านทั้งคืน"}
{"word": "zone in", "english": "She zoned in during the design workshop.", "thai": "เธอจดจ่อระหว่างเวิร์กช็อปการออกแบบ"}
{"word": "zone in", "english": "He needs to zone in on his exam prep.", "thai": "เขาต้องจดจ่อกับการเตรียมสอบ"}
{"word": "zone in", "english": "Let’s zone in on the sales targets.", "thai": "มาจดจ่อกับเป้าหมายยอดขายกัน"}
{"word": "zone in", "english": "I’m trying to zone in on my meditation.", "thai": "ฉันกำลังพยายามจดจ่อกับการนั่งสมาธิ"}
{"word": "zone in", "english": "She zoned in on her drawing project.", "thai": "เธอจดจ่อกับโปรเจกต์วาดภาพ"}
{"word": "zone in", "english": "He zoned in during the physics class.", "thai": "เขาจดจ่อระหว่างชั้นเรียนฟิสิกส์"}
{"word": "zone in", "english": "I need to zone in to finish this code.", "thai": "ฉันต้องจดจ่อเพื่อเขียนโค้ดนี้ให้เสร็จ"}
{"word": "zone in", "english": "She’s zoning in on her music practice.", "thai": "เธอกำลังจดจ่อกับการฝึกดนตรี"}
{"word": "zone in", "english": "He zoned in on the project proposal.", "thai": "เขาจดจ่อกับข้อเสนอโปรเจกต์"}
{"word": "zone in", "english": "Can you zone in on the client feedback?", "thai": "คุณช่วยจดจ่อกับฟีดแบ็กของลูกค้าได้ไหม?"}
{"word": "zone in", "english": "I zoned in on the article and learned a lot.", "thai": "ฉันจดจ่อกับบทความและเรียนรู้เยอะมาก"}
{"word": "zone in", "english": "She zoned in during the coding challenge.", "thai": "เธอจดจ่อระหว่างความท้าทายการเขียนโค้ด"}
{"word": "zone in", "english": "He needs to zone in on his speech practice.", "thai": "เขาต้องจดจ่อกับการฝึกพูด"}
{"word": "zone in", "english": "Let’s zone in on the design mockups.", "thai": "มาจดจ่อกับแบบจำลองการออกแบบกัน"}
{"word": "zone in", "english": "I’m zoning in on my exam revision.", "thai": "ฉันกำลังจดจ่อกับการทบทวนสอบ"}
{"word": "zone in", "english": "She zoned in on her embroidery project.", "thai": "เธอจดจ่อกับโปรเจกต์ปักผ้า"}
{"word": "zone in", "english": "He zoned in during the soccer practice.", "thai": "เขาจดจ่อระหว่างการซ้อมฟุตบอล"}
{"word": "zone in", "english": "I need to zone in to finish this painting.", "thai": "ฉันต้องจดจ่อเพื่อวาดภาพนี้ให้เสร็จ"}
{"word": "zone in", "english": "She’s zoning in on her study notes.", "thai": "เธอกำลังจดจ่อกับบันทึกการเรียน"}
{"word": "zone in", "english": "He zoned in on the financial report.", "thai": "เขาจดจ่อกับรายงานการเงิน"}
{"word": "zone in", "english": "Can you zone in on the presentation slides?", "thai": "คุณช่วยจดจ่อกับสไลด์นำเสนอได้ไหม?"}
{"word": "zone in", "english": "I zoned in on the podcast and loved it.", "thai": "ฉันจดจ่อกับพอดแคสต์และชอบมาก"}
{"word": "zone in", "english": "She zoned in during the photography class.", "thai": "เธอจดจ่อระหว่างชั้นเรียนถ่ายภาพ"}
{"word": "zone in", "english": "He needs to zone in on his coding project.", "thai": "เขาต้องจดจ่อกับโปรเจกต์เขียนโค้ด"}
{"word": "zone in", "english": "Let’s zone in on the team strategy.", "thai": "มาจดจ่อกับกลยุทธ์ทีมกัน"}
{"word": "zone in", "english": "I’m trying to zone in on my essay outline.", "thai": "ฉันกำลังพยายามจดจ่อกับโครงร่างเรียงความ"}
{"word": "zone in", "english": "She zoned in on her cooking technique.", "thai": "เธอจดจ่อกับเทคนิคการทำอาหาร"}
{"word": "zone in", "english": "He zoned in during the art workshop.", "thai": "เขาจดจ่อระหว่างเวิร์กช็อปศิลปะ"}
{"word": "zone in", "english": "I need to zone in to complete this puzzle.", "thai": "ฉันต้องจดจ่อเพื่อทำปริศนานี้ให้เสร็จ"}
{"word": "zone in", "english": "She’s zoning in on her workout schedule.", "thai": "เธอกำลังจดจ่อกับตารางออกกำลังกาย"}
{"word": "zone in", "english": "He zoned in on the research data.", "thai": "เขาจดจ่อกับข้อมูลวิจัย"}
{"word": "wrap up", "english": "Let’s wrap up the meeting before lunch.", "thai": "มาสรุปการประชุมก่อนพักเที่ยงกัน"}
{"word": "wrap up", "english": "I need to wrap up this project by tonight.", "thai": "ฉันต้องจบโปรเจกต์นี้ภายในคืนนี้"}
{"word": "wrap up", "english": "She wrapped up her presentation in ten minutes.", "thai": "เธอสรุปการนำเสนอในสิบนาที"}
{"word": "wrap up", "english": "He’s trying to wrap up the report before the deadline.", "thai": "เขากำลังพยายามจบรายงานก่อนกำหนด"}
{"word": "wrap up", "english": "Can we wrap up this discussion quickly?", "thai": "เราสามารถสรุปการสนทนานี้ได้เร็วๆ ไหม?"}
{"word": "wrap up", "english": "I’ll wrap up the leftovers for tomorrow.", "thai": "ฉันจะห่ออาหารที่เหลือไว้สำหรับพรุ่งนี้"}
{"word": "wrap up", "english": "She wrapped up the event with a speech.", "thai": "เธอจบงานด้วยการกล่าวสุนทรพจน์"}
{"word": "wrap up", "english": "He needs to wrap up his homework before bed.", "thai": "เขาต้องจบการบ้านก่อนนอน"}
{"word": "wrap up", "english": "Let’s wrap up the game; it’s getting late.", "thai": "มาจบเกมกันเถอะ มันดึกแล้ว"}
{"word": "wrap up", "english": "I wrapped up the gift in shiny paper.", "thai": "ฉันห่อของขวัญด้วยกระดาษเงา"}
{"word": "wrap up", "english": "She’s wrapping up her shift at the store.", "thai": "เธอกำลังจบกะที่ร้าน"}
{"word": "wrap up", "english": "He wrapped up the deal with a handshake.", "thai": "เขาจบข้อตกลงด้วยการจับมือ"}
{"word": "wrap up", "english": "I need to wrap up this email before leaving.", "thai": "ฉันต้องจบอีเมลนี้ก่อนออก"}
{"word": "wrap up", "english": "Can you wrap up the sandwiches for the picnic?", "thai": "คุณช่วยห่อแซนด์วิชสำหรับปิกนิกได้ไหม?"}
{"word": "wrap up", "english": "She wrapped up the class with a quiz.", "thai": "เธอจบชั้นเรียนด้วยแบบทดสอบ"}
{"word": "wrap up", "english": "He’s wrapping up his speech right now.", "thai": "เขากำลังสรุปสุนทรพจน์ตอนนี้"}
{"word": "wrap up", "english": "Let’s wrap up the planning session soon.", "thai": "มาสรุปเซสชันการวางแผนเร็วๆ นี้กัน"}
{"word": "wrap up", "english": "I wrapped up the package with a bow.", "thai": "ฉันห่อกล่องด้วยโบว์"}
{"word": "wrap up", "english": "She needs to wrap up her essay tonight.", "thai": "เธอต้องจบเรียงความคืนนี้"}
{"word": "wrap up", "english": "He wrapped up the call in five minutes.", "thai": "เขาจบการโทรในห้านาที"}
{"word": "wrap up", "english": "Can we wrap up this chapter before dinner?", "thai": "เราสามารถจบบทนี้ก่อนอาหารเย็นได้ไหม?"}
{"word": "wrap up", "english": "I’ll wrap up the cookies for the party.", "thai": "ฉันจะห่อคุกกี้สำหรับงานปาร์ตี้"}
{"word": "wrap up", "english": "She wrapped up the project ahead of schedule.", "thai": "เธอจบโปรเจกต์ก่อนกำหนด"}
{"word": "wrap up", "english": "He’s wrapping up his workout routine.", "thai": "เขากำลังจบตารางออกกำลังกาย"}
{"word": "wrap up", "english": "Let’s wrap up the rehearsal by six.", "thai": "มาจบการซ้อมภายในหกโมงเย็น"}
{"word": "wrap up", "english": "I wrapped up the cables to keep them neat.", "thai": "ฉันห่อสายไฟเพื่อให้เรียบร้อย"}
{"word": "wrap up", "english": "She needs to wrap up her presentation slides.", "thai": "เธอต้องจบสไลด์นำเสนอ"}
{"word": "wrap up", "english": "He wrapped up the meeting with a summary.", "thai": "เขาสรุปการประชุมด้วยบทสรุป"}
{"word": "wrap up", "english": "Can you wrap up the food for the fridge?", "thai": "คุณช่วยห่ออาหารใส่ตู้เย็นได้ไหม?"}
{"word": "wrap up", "english": "I’ll wrap up my work before the weekend.", "thai": "ฉันจะจบงานก่อนสุดสัปดาห์"}
{"word": "wrap up", "english": "She wrapped up the lesson with a game.", "thai": "เธอจบบทเรียนด้วยเกม"}
{"word": "wrap up", "english": "He’s wrapping up his coding project.", "thai": "เขากำลังจบโปรเจกต์เขียนโค้ด"}
{"word": "wrap up", "english": "Let’s wrap up the event planning today.", "thai": "มาสรุปการวางแผนงานวันนี้กัน"}
{"word": "wrap up", "english": "I wrapped up the book in gift paper.", "thai": "ฉันห่อหนังสือด้วยกระดาษของขวัญ"}
{"word": "wrap up", "english": "She needs to wrap up her speech soon.", "thai": "เธอต้องจบสุนทรพจน์เร็วๆ นี้"}
{"word": "wrap up", "english": "He wrapped up the negotiation successfully.", "thai": "เขาจบการเจรจาอย่างสำเร็จ"}
{"word": "wrap up", "english": "Can we wrap up this task before noon?", "thai": "เราสามารถจบงานนี้ก่อนเที่ยงได้ไหม?"}
{"word": "wrap up", "english": "I’ll wrap up the leftovers in foil.", "thai": "ฉันจะห่ออาหารที่เหลือด้วยฟอยล์"}
{"word": "wrap up", "english": "She wrapped up the seminar with a Q&A.", "thai": "เธอจบสัมมนาด้วยการถามตอบ"}
{"word": "wrap up", "english": "He’s wrapping up his essay for class.", "thai": "เขากำลังจบเรียงความสำหรับชั้นเรียน"}
{"word": "wrap up", "english": "Let’s wrap up the budget discussion now.", "thai": "มาสรุปการสนทนาเรื่องงบประมาณตอนนี้"}
{"word": "wrap up", "english": "I wrapped up the present with a ribbon.", "thai": "ฉันห่อของขวัญด้วยริบบิ้น"}
{"word": "wrap up", "english": "She needs to wrap up her study session.", "thai": "เธอต้องจบเซสชันการเรียน"}
{"word": "wrap up", "english": "He wrapped up the deal in one meeting.", "thai": "เขาจบข้อตกลงในการประชุมครั้งเดียว"}
{"word": "wrap up", "english": "Can you wrap up the pizza for later?", "thai": "คุณช่วยห่อพิซซ่าไว้กินทีหลังได้ไหม?"}
{"word": "wrap up", "english": "I’ll wrap up my notes before the test.", "thai": "ฉันจะจบโน้ตก่อนสอบ"}
{"word": "wrap up", "english": "She wrapped up the class with a review.", "thai": "เธอจบชั้นเรียนด้วยการทบทวน"}
{"word": "wrap up", "english": "He’s wrapping up his shift at the café.", "thai": "เขากำลังจบกะที่ร้านกาแฟ"}
{"word": "wrap up", "english": "Let’s wrap up the group project today.", "thai": "มาจบโปรเจกต์กลุ่มวันนี้กัน"}
{"word": "wrap up", "english": "I wrapped up the toys in a blanket.", "thai": "ฉันห่อของเล่นด้วยผ้าห่ม"}
{"word": "wrap up", "english": "She needs to wrap up her research paper.", "thai": "เธอต้องจบเอกสารวิจัย"}
{"word": "wrap up", "english": "He wrapped up the call with a plan.", "thai": "เขาจบการโทรด้วยแผน"}
{"word": "wrap up", "english": "Can we wrap up this section before break?", "thai": "เราสามารถจบส่วนนี้ก่อนพักได้ไหม?"}
{"word": "wrap up", "english": "I’ll wrap up the cake for the party.", "thai": "ฉันจะห่อเค้กสำหรับงานปาร์ตี้"}
{"word": "wrap up", "english": "She wrapped up the workshop with feedback.", "thai": "เธอจบเวิร์กช็อปด้วยฟีดแบ็ก"}
{"word": "wrap up", "english": "He’s wrapping up his training session.", "thai": "เขากำลังจบเซสชันการฝึก"}
{"word": "wrap up", "english": "Let’s wrap up the brainstorming session.", "thai": "มาสรุปเซสชันระดมความคิดกัน"}
{"word": "wrap up", "english": "I wrapped up the box with tape.", "thai": "ฉันห่อกล่องด้วยเทป"}
{"word": "wrap up", "english": "She needs to wrap up her art project.", "thai": "เธอต้องจบโปรเจกต์ศิลปะ"}
{"word": "wrap up", "english": "He wrapped up the interview with a smile.", "thai": "เขาจบการสัมภาษณ์ด้วยรอยยิ้ม"}
{"word": "wrap up", "english": "Can you wrap up the bread for storage?", "thai": "คุณช่วยห่อขนมปังเพื่อเก็บได้ไหม?"}
{"word": "wrap up", "english": "I’ll wrap up my study notes tonight.", "thai": "ฉันจะจบโน้ตการเรียนคืนนี้"}
{"word": "wrap up", "english": "She wrapped up the lecture with examples.", "thai": "เธอจบการบรรยายด้วยตัวอย่าง"}
{"word": "wrap up", "english": "He’s wrapping up his coding task.", "thai": "เขากำลังจบงานเขียนโค้ด"}
{"word": "wrap up", "english": "Let’s wrap up the team meeting now.", "thai": "มาสรุปการประชุมทีมตอนนี้กัน"}
{"word": "wrap up", "english": "I wrapped up the gift in colorful paper.", "thai": "ฉันห่อของขวัญด้วยกระดาษสีสัน"}
{"word": "wrap up", "english": "She needs to wrap up her dance practice.", "thai": "เธอต้องจบการซ้อมเต้น"}
{"word": "wrap up", "english": "He wrapped up the contract negotiations.", "thai": "เขาจบการเจรจาสัญญา"}
{"word": "wrap up", "english": "Can we wrap up this chapter today?", "thai": "เราสามารถจบบทนี้วันนี้ได้ไหม?"}
{"word": "wrap up", "english": "I’ll wrap up the sandwiches in plastic.", "thai": "ฉันจะห่อแซนด์วิชด้วยพลาสติก"}
{"word": "wrap up", "english": "She wrapped up the session with a review.", "thai": "เธอจบเซสชันด้วยการทบทวน"}
{"word": "wrap up", "english": "He’s wrapping up his work for the day.", "thai": "เขากำลังจบงานสำหรับวันนี้"}
{"word": "wrap up", "english": "Let’s wrap up the event with a toast.", "thai": "มาจบงานด้วยการดื่มอวยพรกัน"}
{"word": "wrap up", "english": "I wrapped up the package tightly.", "thai": "ฉันห่อกล่องแน่นหนา"}
{"word": "wrap up", "english": "She needs to wrap up her exam prep.", "thai": "เธอต้องจบการเตรียมสอบ"}
{"word": "wrap up", "english": "He wrapped up the discussion with a plan.", "thai": "เขาจบการสนทนาด้วยแผน"}
{"word": "wrap up", "english": "Can you wrap up the cake for later?", "thai": "คุณช่วยห่อเค้กไว้กินทีหลังได้ไหม?"}
{"word": "wrap up", "english": "I’ll wrap up my presentation soon.", "thai": "ฉันจะจบการนำเสนอเร็วๆ นี้"}
{"word": "wrap up", "english": "She wrapped up the class with a story.", "thai": "เธอจบชั้นเรียนด้วยเรื่องเล่า"}
{"word": "wrap up", "english": "He’s wrapping up his research project.", "thai": "เขากำลังจบโปรเจกต์วิจัย"}
{"word": "wrap up", "english": "Let’s wrap up the planning meeting now.", "thai": "มาสรุปการประชุมวางแผนตอนนี้กัน"}
{"word": "wrap up", "english": "I wrapped up the books in a bag.", "thai": "ฉันห่อหนังสือใส่ถุง"}
{"word": "wrap up", "english": "She needs to wrap up her coding homework.", "thai": "เธอต้องจบการบ้านเขียนโค้ด"}
{"word": "wrap up", "english": "He wrapped up the call with action items.", "thai": "เขาจบการโทรด้วยรายการที่ต้องทำ"}
{"word": "wrap up", "english": "Can we wrap up this topic before moving on?", "thai": "เราสามารถจบหัวข้อนี้ก่อนไปต่อได้ไหม?"}
{"word": "wrap up", "english": "I’ll wrap up the food in containers.", "thai": "ฉันจะห่ออาหารใส่ภาชนะ"}
{"word": "wrap up", "english": "She wrapped up the training with tips.", "thai": "เธอจบการฝึกด้วยเคล็ดลับ"}
{"word": "wrap up", "english": "He’s wrapping up his essay draft.", "thai": "เขากำลังจบร่างเรียงความ"}
{"word": "wrap up", "english": "Let’s wrap up the rehearsal early.", "thai": "มาจบการซ้อมเร็วกว่านี้กัน"}
{"word": "wrap up", "english": "I wrapped up the toy in wrapping paper.", "thai": "ฉันห่อของเล่นด้วยกระดาษห่อ"}
{"word": "wrap up", "english": "She needs to wrap up her study group.", "thai": "เธอต้องจบกลุ่มการเรียน"}
{"word": "wrap up", "english": "He wrapped up the meeting with a vote.", "thai": "เขาจบการประชุมด้วยการลงคะแนน"}
{"word": "wrap up", "english": "Can you wrap up the leftovers for me?", "thai": "คุณช่วยห่ออาหารที่เหลือให้ฉันได้ไหม?"}
{"word": "wrap up", "english": "I’ll wrap up my tasks before the break.", "thai": "ฉันจะจบงานก่อนพัก"}
{"word": "wrap up", "english": "She wrapped up the seminar with a demo.", "thai": "เธอจบสัมมนาด้วยการสาธิต"}
{"word": "wrap up", "english": "He’s wrapping up his workout for the day.", "thai": "เขากำลังจบการออกกำลังกายสำหรับวันนี้"}
{"word": "wrap up", "english": "Let’s wrap up the discussion with a plan.", "thai": "มาสรุปการสนทนาด้วยแผนกัน"}
{"word": "wrap up", "english": "I wrapped up the present in a box.", "thai": "ฉันห่อของขวัญใส่กล่อง"}
{"word": "wrap up", "english": "She needs to wrap up her final draft.", "thai": "เธอต้องจบร่างสุดท้าย"}
{"word": "wrap up", "english": "He wrapped up the session with feedback.", "thai": "เขาจบเซสชันด้วยฟีดแบ็ก"}
{"word": "wrap up", "english": "Can we wrap up this meeting now?", "thai": "เราสามารถจบการประชุมนี้ตอนนี้ได้ไหม?"}
