{"word": "smartphone", "english": "I left my smartphone on the kitchen counter.", "thai": "ฉันวางสมาร์ทโฟนไว้บนเคาน์เตอร์ครัว"}
{"word": "smartphone", "english": "Can you check the weather on your smartphone?", "thai": "คุณช่วยเช็คสภาพอากาศบนสมาร์ทโฟนของคุณได้ไหม"}
{"word": "smartphone", "english": "My smartphone battery dies so quickly these days.", "thai": "แบตเตอรี่สมาร์ทโฟนของฉันหมดเร็วมากในช่วงนี้"}
{"word": "smartphone", "english": "She’s always texting on her smartphone.", "thai": "เธอส่งข้อความบนสมาร์ทโฟนตลอดเวลา"}
{"word": "smartphone", "english": "I dropped my smartphone and cracked the screen.", "thai": "ฉันทำสมาร์ทโฟนตกแล้วหน้าจอแตก"}
{"word": "smartphone", "english": "He’s addicted to playing games on his smartphone.", "thai": "เขาเสพติดการเล่นเกมบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "I need to update the apps on my smartphone.", "thai": "ฉันต้องอัปเดตแอปบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "Where’s the charger for my smartphone?", "thai": "ที่ชาร์จสมาร์ทโฟนของฉันอยู่ไหน"}
{"word": "smartphone", "english": "I took a great photo with my smartphone yesterday.", "thai": "ฉันถ่ายรูปสวยๆ ด้วยสมาร์ทโฟนเมื่อวาน"}
{"word": "smartphone", "english": "My smartphone keeps freezing when I open that app.", "thai": "สมาร์ทโฟนของฉันค้างเมื่อฉันเปิดแอปนั้น"}
{"word": "smartphone", "english": "Can I borrow your smartphone to make a call?", "thai": "ฉันยืมสมาร์ทโฟนของคุณโทรได้ไหม"}
{"word": "smartphone", "english": "I lost my smartphone at the mall last night.", "thai": "ฉันทำสมาร์ทโฟนหายที่ห้างเมื่อคืน"}
{"word": "smartphone", "english": "She’s watching videos on her smartphone.", "thai": "เธอกำลังดูวิดีโอบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "I forgot the password to unlock my smartphone.", "thai": "ฉันลืมรหัสผ่านเพื่อปลดล็อกสมาร์ทโฟน"}
{"word": "smartphone", "english": "This smartphone has an amazing camera.", "thai": "สมาร์ทโฟนนี้มีกล้องที่ยอดเยี่ยม"}
{"word": "smartphone", "english": "I’m shopping for a new smartphone online.", "thai": "ฉันกำลังซื้อสมาร์ทโฟนใหม่ทางออนไลน์"}
{"word": "smartphone", "english": "My smartphone is running out of storage space.", "thai": "สมาร์ทโฟนของฉันพื้นที่เก็บข้อมูลใกล้เต็ม"}
{"word": "smartphone", "english": "He’s scrolling through social media on his smartphone.", "thai": "เขากำลังเลื่อนดูโซเชียลมีเดียบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "I use my smartphone for work emails.", "thai": "ฉันใช้สมาร์ทโฟนสำหรับอีเมลงาน"}
{"word": "smartphone", "english": "The smartphone screen is too bright at night.", "thai": "หน้าจอสมาร์ทโฟนสว่างเกินไปตอนกลางคืน"}
{"word": "smartphone", "english": "I got a text message on my smartphone.", "thai": "ฉันได้รับข้อความบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "She’s listening to music on her smartphone.", "thai": "เธอกำลังฟังเพลงบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "My smartphone case is starting to wear out.", "thai": "เคสสมาร์ทโฟนของฉันเริ่มชำรุด"}
{"word": "smartphone", "english": "I need to back up my smartphone data.", "thai": "ฉันต้องสำรองข้อมูลสมาร์ทโฟน"}
{"word": "smartphone", "english": "He’s recording a video with his smartphone.", "thai": "เขากำลังบันทึกวิดีโอกับสมาร์ทโฟน"}
{"word": "smartphone", "english": "I dropped my smartphone in water yesterday.", "thai": "ฉันทำสมาร์ทโฟนตกน้ำเมื่อวาน"}
{"word": "smartphone", "english": "My smartphone is too old to run this app.", "thai": "สมาร์ทโฟนของฉันเก่าเกินไปที่จะรันแอปนี้"}
{"word": "smartphone", "english": "Can you call me on my smartphone later?", "thai": "คุณโทรหาฉันที่สมาร์ทโฟนทีหลังได้ไหม"}
{"word": "smartphone", "english": "I’m reading an e-book on my smartphone.", "thai": "ฉันกำลังอ่านอีบุ๊คบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "The smartphone’s GPS is really accurate.", "thai": "จีพีเอสของสมาร์ทโฟนแม่นยำมาก"}
{"word": "smartphone", "english": "I forgot to charge my smartphone last night.", "thai": "ฉันลืมชาร์จสมาร์ทโฟนเมื่อคืน"}
{"word": "smartphone", "english": "She’s taking a selfie with her smartphone.", "thai": "เธอกำลังถ่ายเซลฟี่ด้วยสมาร์ทโฟน"}
{"word": "smartphone", "english": "My smartphone keeps buzzing with notifications.", "thai": "สมาร์ทโฟนของฉันสั่นเพราะการแจ้งเตือน"}
{"word": "smartphone", "english": "I’m using my smartphone to navigate the city.", "thai": "ฉันใช้สมาร์ทโฟนเพื่อนำทางในเมือง"}
{"word": "smartphone", "english": "He’s streaming a movie on his smartphone.", "thai": "เขากำลังสตรีมหนังบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "I need a new case for my smartphone.", "thai": "ฉันต้องการเคสใหม่สำหรับสมาร์ทโฟน"}
{"word": "smartphone", "english": "My smartphone is locked with a fingerprint.", "thai": "สมาร์ทโฟนของฉันล็อกด้วยลายนิ้วมือ"}
{"word": "smartphone", "english": "I’m checking my calendar on my smartphone.", "thai": "ฉันกำลังเช็คปฏิทินบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "She’s ordering food through her smartphone.", "thai": "เธอกำลังสั่งอาหารผ่านสมาร์ทโฟน"}
{"word": "smartphone", "english": "My smartphone is slow after the update.", "thai": "สมาร์ทโฟนของฉันช้าลงหลังอัปเดต"}
{"word": "smartphone", "english": "I’m using my smartphone as a hotspot.", "thai": "ฉันใช้สมาร์ทโฟนเป็นฮอตสปอต"}
{"word": "smartphone", "english": "He left his smartphone in the car.", "thai": "เขาทิ้งสมาร์ทโฟนไว้ในรถ"}
{"word": "smartphone", "english": "I’m tracking my steps with my smartphone.", "thai": "ฉันกำลังติดตามจำนวนก้าวด้วยสมาร์ทโฟน"}
{"word": "smartphone", "english": "My smartphone’s camera doesn’t focus well.", "thai": "กล้องสมาร์ทโฟนของฉันโฟกัสไม่ดี"}
{"word": "smartphone", "english": "She’s chatting with friends on her smartphone.", "thai": "เธอกำลังแชทกับเพื่อนบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "I need to restart my smartphone.", "thai": "ฉันต้องรีสตาร์ทสมาร์ทโฟน"}
{"word": "smartphone", "english": "He’s paying with his smartphone at the store.", "thai": "เขากำลังจ่ายเงินด้วยสมาร์ทโฟนที่ร้าน"}
{"word": "smartphone", "english": "My smartphone screen is scratched.", "thai": "หน้าจอสมาร์ทโฟนของฉันเป็นรอย"}
{"word": "smartphone", "english": "I’m using my smartphone to control the TV.", "thai": "ฉันใช้สมาร์ทโฟนควบคุมทีวี"}
{"word": "smartphone", "english": "She’s browsing the internet on her smartphone.", "thai": "เธอกำลังท่องอินเทอร์เน็ตบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "I set an alarm on my smartphone for tomorrow.", "thai": "ฉันตั้งนาฬิกาปลุกบนสมาร์ทโฟนสำหรับพรุ่งนี้"}
{"word": "smartphone", "english": "My smartphone is connected to the Wi-Fi.", "thai": "สมาร์ทโฟนของฉันเชื่อมต่อกับไวไฟ"}
{"word": "smartphone", "english": "He’s downloading an app on his smartphone.", "thai": "เขากำลังดาวน์โหลดแอปบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "I’m using my smartphone to scan a QR code.", "thai": "ฉันใช้สมาร์ทโฟนสแกนคิวอาร์โค้ด"}
{"word": "smartphone", "english": "She forgot her smartphone at home today.", "thai": "เธอลืมสมาร์ทโฟนไว้ที่บ้านวันนี้"}
{"word": "smartphone", "english": "My smartphone is on silent mode.", "thai": "สมาร์ทโฟนของฉันอยู่ในโหมดเงียบ"}
{"word": "smartphone", "english": "I’m listening to a podcast on my smartphone.", "thai": "ฉันกำลังฟังพอดแคสต์บนสมาร์ทโฟน"}
{"word": "smartphone", "english": "He’s checking his bank account on his smartphone.", "thai": "เขากำลังเช็คบัญชีธนาคารบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "My smartphone is overheating again.", "thai": "สมาร์ทโฟนของฉันร้อนเกินไปอีกแล้ว"}
{"word": "smartphone", "english": "She’s using her smartphone to take notes.", "thai": "เธอกำลังใช้สมาร์ทโฟนจดบันทึก"}
{"word": "smartphone", "english": "I’m syncing my smartphone with my laptop.", "thai": "ฉันกำลังซิงค์สมาร์ทโฟนกับแล็ปท็อป"}
{"word": "smartphone", "english": "My smartphone’s speaker isn’t working.", "thai": "ลำโพงสมาร์ทโฟนของฉันไม่ทำงาน"}
{"word": "smartphone", "english": "He’s reading the news on his smartphone.", "thai": "เขากำลังอ่านข่าวบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "I’m using my smartphone to book a ride.", "thai": "ฉันใช้สมาร์ทโฟนจองรถ"}
{"word": "smartphone", "english": "She’s editing photos on her smartphone.", "thai": "เธอกำลังแก้ไขรูปภาพบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "My smartphone is almost out of battery.", "thai": "สมาร์ทโฟนของฉันแบตเตอรี่ใกล้หมด"}
{"word": "smartphone", "english": "I’m playing music through my smartphone.", "thai": "ฉันกำลังเล่นเพลงผ่านสมาร์ทโฟน"}
{"word": "smartphone", "english": "He’s using his smartphone as a flashlight.", "thai": "เขากำลังใช้สมาร์ทโฟนเป็นไฟฉาย"}
{"word": "smartphone", "english": "I’m checking directions on my smartphone.", "thai": "ฉันกำลังเช็คเส้นทางบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "She’s video calling her family on her smartphone.", "thai": "เธอกำลังวิดีโอคอลครอบครัวบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "My smartphone doesn’t connect to this Wi-Fi.", "thai": "สมาร์ทโฟนของฉันไม่เชื่อมต่อกับไวไฟนี้"}
{"word": "smartphone", "english": "I’m using my smartphone to track my workout.", "thai": "ฉันใช้สมาร์ทโฟนติดตามการออกกำลังกาย"}
{"word": "smartphone", "english": "He’s shopping online with his smartphone.", "thai": "เขากำลังช้อปปิ้งออนไลน์ด้วยสมาร์ทโฟน"}
{"word": "smartphone", "english": "My smartphone’s touchscreen is unresponsive.", "thai": "หน้าจอสัมผัสสมาร์ทโฟนของฉันไม่ตอบสนอง"}
{"word": "smartphone", "english": "She’s checking her email on her smartphone.", "thai": "เธอกำลังเช็คอีเมลบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "I’m using my smartphone to translate this text.", "thai": "ฉันใช้สมาร์ทโฟนแปลข้อความนี้"}
{"word": "smartphone", "english": "He’s playing a podcast on his smartphone.", "thai": "เขากำลังเล่นพอดแคสต์บนสมาร์ทโฟน"}
{"word": "smartphone", "english": "My smartphone fell under the couch.", "thai": "สมาร์ทโฟนของฉันตกลงไปใต้โซฟา"}
{"word": "smartphone", "english": "I’m using my smartphone to set a reminder.", "thai": "ฉันใช้สมาร์ทโฟนตั้งการเตือน"}
{"word": "smartphone", "english": "She’s sharing photos from her smartphone.", "thai": "เธอกำลังแชร์รูปภาพจากสมาร์ทโฟน"}
{"word": "smartphone", "english": "My smartphone needs a software update.", "thai": "สมาร์ทโฟนของฉันต้องอัปเดตซอฟต์แวร์"}
{"word": "smartphone", "english": "He’s using his smartphone to check the time.", "thai": "เขากำลังใช้สมาร์ทโฟนเช็คเวลา"}
{"word": "smartphone", "english": "I’m recording a voice memo on my smartphone.", "thai": "ฉันกำลังบันทึกเสียงบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "She’s using her smartphone to play a game.", "thai": "เธอกำลังใช้สมาร์ทโฟนเล่นเกม"}
{"word": "smartphone", "english": "My smartphone is in my backpack.", "thai": "สมาร์ทโฟนของฉันอยู่ในกระเป๋าเป้"}
{"word": "smartphone", "english": "I’m using my smartphone to check my schedule.", "thai": "ฉันใช้สมาร์ทโฟนเช็คตารางเวลา"}
{"word": "smartphone", "english": "He’s texting someone on his smartphone.", "thai": "เขากำลังส่งข้อความถึงใครบางคนบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "My smartphone’s battery lasts all day.", "thai": "แบตเตอรี่สมาร์ทโฟนของฉันอยู่ได้ทั้งวัน"}
{"word": "smartphone", "english": "She’s using her smartphone to track her sleep.", "thai": "เธอกำลังใช้สมาร์ทโฟนติดตามการนอน"}
{"word": "smartphone", "english": "I’m checking the news on my smartphone.", "thai": "ฉันกำลังเช็คข่าวบนสมาร์ทโฟน"}
{"word": "smartphone", "english": "He’s using his smartphone to take a photo.", "thai": "เขากำลังใช้สมาร์ทโฟนถ่ายรูป"}
{"word": "smartphone", "english": "My smartphone is vibrating in my pocket.", "thai": "สมาร์ทโฟนของฉันสั่นอยู่ในกระเป๋า"}
{"word": "smartphone", "english": "She’s using her smartphone to send an email.", "thai": "เธอกำลังใช้สมาร์ทโฟนส่งอีเมล"}
{"word": "smartphone", "english": "I’m using my smartphone to order groceries.", "thai": "ฉันใช้สมาร์ทโฟนสั่งของชำ"}
{"word": "smartphone", "english": "My smartphone is charging on the table.", "thai": "สมาร์ทโฟนของฉันกำลังชาร์จอยู่บนโต๊ะ"}
{"word": "smartphone", "english": "He’s using his smartphone to listen to music.", "thai": "เขากำลังใช้สมาร์ทโฟนฟังเพลง"}
{"word": "smartphone", "english": "I’m using my smartphone to check the weather.", "thai": "ฉันใช้สมาร์ทโฟนเช็คสภาพอากาศ"}
{"word": "smartphone", "english": "She’s using her smartphone to read a book.", "thai": "เธอกำลังใช้สมาร์ทโฟนอ่านหนังสือ"}
{"word": "keys", "english": "I left my keys on the table.", "thai": "ฉันวางกุญแจไว้บนโต๊ะ"}
{"word": "keys", "english": "Where did I put my car keys?", "thai": "ฉันวางกุญแจรถไว้ไหน"}
{"word": "keys", "english": "She’s jingling her keys in her pocket.", "thai": "เธอกำลังเขย่ากุญแจในกระเป๋า"}
{"word": "keys", "english": "I need to get a spare set of keys.", "thai": "ฉันต้องทำกุญแจสำรองชุดหนึ่ง"}
{"word": "keys", "english": "He dropped his keys in the parking lot.", "thai": "เขาทำกุญแจตกในลานจอดรถ"}
{"word": "keys", "english": "My keys are in my backpack.", "thai": "กุญแจของฉันอยู่ในกระเป๋าเป้"}
{"word": "keys", "english": "Can you grab my keys from the counter?", "thai": "คุณช่วยหยิบกุญแจจากเคาน์เตอร์ให้ฉันได้ไหม"}
{"word": "keys", "english": "I locked my keys inside the car.", "thai": "ฉันล็อกกุญแจไว้ในรถ"}
{"word": "keys", "english": "She’s holding the house keys in her hand.", "thai": "เธอกำลังถือกุญแจบ้านอยู่ในมือ"}
{"word": "keys", "english": "I can’t find my keys anywhere.", "thai": "ฉันหกุญแจไม่เจอเลย"}
{"word": "keys", "english": "He’s got two sets of keys in his bag.", "thai": "เขามีกุญแจสองชุดอยู่ในกระเป๋า"}
{"word": "keys", "english": "My keys fell under the couch.", "thai": "กุญแจของฉันตกลงไปใต้โซฟา"}
{"word": "keys", "english": "I gave my keys to the valet.", "thai": "ฉันให้กุญแจกับพนักงานรับรถ"}
{"word": "keys", "english": "She forgot her keys at the office.", "thai": "เธอลืมกุญแจไว้ที่ออฟฟิศ"}
{"word": "keys", "english": "The keys to the shed are missing.", "thai": "กุญแจโรงเก็บของหายไป"}
{"word": "keys", "english": "I’m putting my keys in the bowl.", "thai": "ฉันกำลังวางกุญแจในชาม"}
{"word": "keys", "english": "He’s looking for his apartment keys.", "thai": "เขากำลังมองหากุญแจอพาร์ตเมนต์"}
{"word": "keys", "english": "My keys are always in my jacket pocket.", "thai": "กุญแจของฉันอยู่ในกระเป๋าเสื้อแจ็คเก็ตเสมอ"}
{"word": "keys", "english": "She handed me the keys to her car.", "thai": "เธอยื่นกุญแจรถให้ฉัน"}
{"word": "keys", "english": "I need to return these keys to the landlord.", "thai": "ฉันต้องคืนกุญแจเหล่านี้ให้เจ้าของบ้าน"}
{"word": "keys", "english": "The keys are hanging on the hook.", "thai": "กุญแจแขวนอยู่ที่ตะขอ"}
{"word": "keys", "english": "He’s got the keys to the storage room.", "thai": "เขามีกุญแจห้องเก็บของ"}
{"word": "keys", "english": "I found my keys in the laundry basket.", "thai": "ฉันเจอกุญแจในตะกร้าซักผ้า"}
{"word": "keys", "english": "She’s got a bunch of keys on her keychain.", "thai": "เธอมีกุญแจหลายดอกบนพวงกุญแจ"}
{"word": "keys", "english": "My keys got stuck in the lock.", "thai": "กุญแจของฉันติดอยู่ในล็อก"}
{"word": "keys", "english": "I’m giving you the keys to my place.", "thai": "ฉันให้กุญแจบ้านฉันกับคุณ"}
{"word": "keys", "english": "He lost his keys while hiking.", "thai": "เขาทำกุญแจหายตอนเดินป่า"}
{"word": "keys", "english": "The keys to the safe are hidden.", "thai": "กุญแจตู้เซฟถูกซ่อนไว้"}
{"word": "keys", "english": "I left my keys at my friend’s house.", "thai": "ฉันทิ้งกุญแจไว้ที่บ้านเพื่อน"}
{"word": "keys", "english": "She’s searching her purse for her keys.", "thai": "เธอกำลังค้นหากุญแจในกระเป๋า"}
{"word": "keys", "english": "My keys are in the front door.", "thai": "กุญแจของฉันอยู่ในประตูหน้า"}
{"word": "keys", "english": "He’s got the keys to the company van.", "thai": "เขามีกุญแจรถตู้ของบริษัท"}
{"word": "keys", "english": "I need to copy my keys tomorrow.", "thai": "ฉันต้องทำสำเนากุญแจพรุ่งนี้"}
{"word": "keys", "english": "The keys are in my coat pocket.", "thai": "กุญแจอยู่ในกระเป๋าโค้ต"}
{"word": "keys", "english": "She’s got the keys to the garage.", "thai": "เธอมีกุญแจโรงรถ"}
{"word": "keys", "english": "I’m holding the keys for my neighbor.", "thai": "ฉันกำลังถือกุญแจให้เพื่อนบ้าน"}
{"word": "keys", "english": "He forgot his keys in the ignition.", "thai": "เขาลืมกุญแจไว้ในสวิตช์รถ"}
{"word": "keys", "english": "My keys are on the kitchen counter.", "thai": "กุญแจของฉันอยู่บนเคาน์เตอร์ครัว"}
{"word": "keys", "english": "She’s got extra keys in her drawer.", "thai": "เธอมีกุญแจสำรองในลิ้นชัก"}
{"word": "keys", "english": "I dropped my keys in the snow.", "thai": "ฉันทำกุญแจตกในหิมะ"}
{"word": "keys", "english": "The keys to the cabin are with my dad.", "thai": "กุญแจกระท่อมอยู่กับพ่อฉัน"}
{"word": "keys", "english": "He’s got the keys to the motorcycle.", "thai": "เขามีกุญแจมอเตอร์ไซค์"}
{"word": "keys", "english": "I’m picking up my keys from the shop.", "thai": "ฉันกำลังไปรับกุญแจจากร้าน"}
{"word": "keys", "english": "She left her keys in the gym locker.", "thai": "เธอทิ้งกุญแจไว้ในล็อกเกอร์ยิม"}
{"word": "keys", "english": "My keys are attached to my wallet.", "thai": "กุญแจของฉันติดกับกระเป๋าสตางค์"}
{"word": "keys", "english": "He’s got the keys to the meeting room.", "thai": "เขามีกุญแจห้องประชุม"}
{"word": "keys", "english": "I need to replace my lost keys.", "thai": "ฉันต้องเปลี่ยนกุญแจที่หายไป"}
{"word": "keys", "english": "The keys are in the glove compartment.", "thai": "กุญแจอยู่ในช่องเก็บของในรถ"}
{"word": "keys", "english": "She’s got the keys to her new apartment.", "thai": "เธอมีกุญแจอพาร์ตเมนต์ใหม่"}
{"word": "keys", "english": "I forgot my keys at the coffee shop.", "thai": "ฉันลืมกุญแจไว้ที่ร้านกาแฟ"}
{"word": "keys", "english": "He’s carrying his keys in his hand.", "thai": "เขากำลังถือกุญแจอยู่ในมือ"}
{"word": "keys", "english": "My keys are on a lanyard.", "thai": "กุญแจของฉันอยู่บนสายคล้อง"}
{"word": "keys", "english": "She’s got the keys to the mailbox.", "thai": "เธอมีกุญแจตู้จดหมาย"}
{"word": "keys", "english": "I left my keys in my other pants.", "thai": "ฉันทิ้งกุญแจไว้ในกางเกงตัวอื่น"}
{"word": "keys", "english": "He’s got the keys to the rental car.", "thai": "เขามีกุญแจรถเช่า"}
{"word": "keys", "english": "The keys to the gate are rusty.", "thai": "กุญแจประตูขึ้นสนิม"}
{"word": "keys", "english": "I’m putting my keys in my purse.", "thai": "ฉันกำลังใส่กุญแจในกระเป๋า"}
{"word": "keys", "english": "She’s got the keys to the basement.", "thai": "เธอมีกุญแจชั้นใต้ดิน"}
{"word": "keys", "english": "My keys are in the side pocket.", "thai": "กุญแจของฉันอยู่ในกระเป๋าด้านข้าง"}
{"word": "keys", "english": "He lost his keys at the beach.", "thai": "เขาทำกุญแจหายที่ชายหาด"}
{"word": "keys", "english": "I need to label my keys.", "thai": "ฉันต้องติดป้ายกุญแจ"}
{"word": "keys", "english": "The keys to the office are with security.", "thai": "กุญแจสำนักงานอยู่กับรปภ."}
{"word": "keys", "english": "She’s got the keys to her bike lock.", "thai": "เธอมีกุญแจล็อกจักรยาน"}
{"word": "keys", "english": "My keys are in the entryway.", "thai": "กุญแจของฉันอยู่ในทางเข้า"}
{"word": "keys", "english": "He’s got the keys to the tool shed.", "thai": "เขามีกุญแจโรงเก็บเครื่องมือ"}
{"word": "keys", "english": "I found my keys in the fridge.", "thai": "ฉันเจอกุญแจในตู้เย็น"}
{"word": "keys", "english": "She’s got the keys to her suitcase.", "thai": "เธอมีกุญแจกระเป๋าเดินทาง"}
{"word": "keys", "english": "My keys are on the nightstand.", "thai": "กุญแจของฉันอยู่บนโต๊ะข้างเตียง"}
{"word": "keys", "english": "He’s got the keys to the warehouse.", "thai": "เขามีกุญแจโกดัง"}
{"word": "keys", "english": "I left my keys in the hotel room.", "thai": "ฉันทิ้งกุญแจไว้ในห้องโรงแรม"}
{"word": "keys", "english": "She’s got the keys to the back door.", "thai": "เธอมีกุญแจประตูหลัง"}
{"word": "keys", "english": "My keys are in my gym bag.", "thai": "กุญแจของฉันอยู่ในกระเป๋ายิม"}
{"word": "keys", "english": "He’s got the keys to the boat.", "thai": "เขามีกุญแจเรือ"}
{"word": "keys", "english": "I need to give my keys to my roommate.", "thai": "ฉันต้องให้กุญแจกับรูมเมท"}
{"word": "keys", "english": "The keys to the attic are lost.", "thai": "กุญแจห้องใต้หลังคาหายไป"}
{"word": "keys", "english": "She’s got the keys to her diary.", "thai": "เธอมีกุญแจสมุดบันทึก"}
{"word": "keys", "english": "My keys are in the junk drawer.", "thai": "กุญแจของฉันอยู่ในลิ้นชักของกระจุกกระจิก"}
{"word": "keys", "english": "He’s got the keys to the golf cart.", "thai": "เขามีกุญแจรถกอล์ฟ"}
{"word": "keys", "english": "I left my keys at the bar.", "thai": "ฉันทิ้งกุญแจไว้ที่บาร์"}
{"word": "keys", "english": "She’s got the keys to her safe deposit box.", "thai": "เธอมีกุญแจตู้ฝากของ"}
{"word": "keys", "english": "My keys are in my work bag.", "thai": "กุญแจของฉันอยู่ในกระเป๋าทำงาน"}
{"word": "keys", "english": "He’s got the keys to the trailer.", "thai": "เขามีกุญแจรถพ่วง"}
{"word": "keys", "english": "I need to get my keys from the repair shop.", "thai": "ฉันต้องไปรับกุญแจจากร้านซ่อม"}
{"word": "keys", "english": "The keys to the barn are old.", "thai": "กุญแจโรงนาเก่ามาก"}
{"word": "keys", "english": "She’s got the keys to her storage unit.", "thai": "เธอมีกุญแจหน่วยเก็บของ"}
{"word": "keys", "english": "My keys are in my shoe.", "thai": "กุญแจของฉันอยู่ในรองเท้า"}
{"word": "keys", "english": "He’s got the keys to the vending machine.", "thai": "เขามีกุญแจตู้หยอดเหรียญ"}
{"word": "keys", "english": "I left my keys in my locker.", "thai": "ฉันทิ้งกุญแจไว้ในล็อกเกอร์"}
{"word": "keys", "english": "She’s got the keys to her jewelry box.", "thai": "เธอมีกุญแจกล่องเครื่องประดับ"}
{"word": "keys", "english": "My keys are on the dresser.", "thai": "กุญแจของฉันอยู่บนโต๊ะเครื่องแป้ง"}
{"word": "keys", "english": "He’s got the keys to the fire escape.", "thai": "เขามีกุญแจทางหนีไฟ"}
{"word": "keys", "english": "I need to find my keys before I leave.", "thai": "ฉันต้องหากุญแจก่อนออกไป"}
{"word": "keys", "english": "The keys to the shop are with the manager.", "thai": "กุญแจร้านอยู่กับผู้จัดการ"}
{"word": "keys", "english": "She’s got the keys to her scooter.", "thai": "เธอมีกุญแจสกู๊ตเตอร์"}
{"word": "keys", "english": "My keys are in the car seat.", "thai": "กุญแจของฉันอยู่ในเบาะรถ"}
{"word": "keys", "english": "He’s got the keys to the classroom.", "thai": "เขามีกุญแจห้องเรียน"}
{"word": "keys", "english": "I left my keys in my umbrella stand.", "thai": "ฉันทิ้งกุญแจไว้ในที่วางร่ม"}
{"word": "keys", "english": "She’s got the keys to her new house.", "thai": "เธอมีกุญแจบ้านใหม่"}
{"word": "wallet", "english": "I forgot my wallet at home today.", "thai": "ฉันลืมกระเป๋าสตางค์ไว้ที่บ้านวันนี้"}
{"word": "wallet", "english": "My wallet is in my back pocket.", "thai": "กระเป๋าสตางค์ของฉันอยู่ในกระเป๋าหลัง"}
{"word": "wallet", "english": "She found her wallet under the couch.", "thai": "เธอเจอกระเป๋าสตางค์ใต้โซฟา"}
{"word": "wallet", "english": "I need to buy a new wallet soon.", "thai": "ฉันต้องซื้อกระเป๋าสตางค์ใหม่เร็วๆ นี้"}
{"word": "wallet", "english": "He pulled out his wallet to pay.", "thai": "เขาดึงกระเป๋าสตางค์ออกมาจ่ายเงิน"}
{"word": "wallet", "english": "My wallet is stuffed with receipts.", "thai": "กระเป๋าสตางค์ของฉันเต็มไปด้วยใบเสร็จ"}
{"word": "wallet", "english": "I lost my wallet at the mall.", "thai": "ฉันทำกระเป๋าสตางค์หายที่ห้าง"}
{"word": "wallet", "english": "She’s got a fancy leather wallet.", "thai": "เธอมีกระเป๋าสตางค์หนังสุดหรู"}
{"word": "wallet", "english": "I left my wallet in the car.", "thai": "ฉันทิ้งกระเป๋าสตางค์ไว้ในรถ"}
{"word": "wallet", "english": "His wallet fell out of his pocket.", "thai": "กระเป๋าสตางค์ของเขาตกจากกระเป๋า"}
{"word": "wallet", "english": "I keep my ID in my wallet.", "thai": "ฉันเก็บบัตรประจำตัวในกระเป๋าสตางค์"}
{"word": "wallet", "english": "She’s looking for her wallet in her bag.", "thai": "เธอกำลังหากระเป๋าสตางค์ในกระเป๋า"}
{"word": "wallet", "english": "My wallet has a picture of my dog.", "thai": "กระเป๋าสตางค์ของฉันมีรูปหมา"}
{"word": "wallet", "english": "I found a wallet on the sidewalk.", "thai": "ฉันเจอกระเป๋าสตางค์บนทางเท้า"}
{"word": "wallet", "english": "He’s got too many cards in his wallet.", "thai": "เขามีบัตรเยอะเกินไปในกระเป๋าสตางค์"}
{"word": "wallet", "english": "I need to clean out my wallet.", "thai": "ฉันต้องจัดระเบียบกระเป๋าสตางค์"}
{"word": "wallet", "english": "She forgot her wallet at the restaurant.", "thai": "เธอลืมกระเป๋าสตางค์ไว้ที่ร้านอาหาร"}
{"word": "wallet", "english": "My wallet is falling apart.", "thai": "กระเป๋าสตางค์ของฉันเริ่มพัง"}
{"word": "wallet", "english": "I put some cash in my wallet.", "thai": "ฉันใส่เงินสดในกระเป๋าสตางค์"}
{"word": "wallet", "english": "He’s checking his wallet for change.", "thai": "เขากำลังเช็คเงินทอนในกระเป๋าสตางค์"}
{"word": "wallet", "english": "I left my wallet on the dresser.", "thai": "ฉันวางกระเป๋าสตางค์ไว้บนโต๊ะเครื่องแป้ง"}
{"word": "wallet", "english": "She’s got a wallet full of coupons.", "thai": "เธอมีกระเป๋าสตางค์ที่เต็มไปด้วยคูปอง"}
{"word": "wallet", "english": "My wallet was stolen last night.", "thai": "กระเป๋าสตางค์ของฉันถูกขโมยเมื่อคืน"}
{"word": "wallet", "english": "I need to grab my wallet before we go.", "thai": "ฉันต้องหยิบกระเป๋าสตางค์ก่อนออกไป"}
{"word": "wallet", "english": "He keeps his wallet in his jacket.", "thai": "เขาเก็บกระเป๋าสตางค์ในเสื้อแจ็คเก็ต"}
{"word": "wallet", "english": "I found my wallet in the laundry.", "thai": "ฉันเจอกระเป๋าสตางค์ในเครื่องซักผ้า"}
{"word": "wallet", "english": "She’s got a slim wallet for travel.", "thai": "เธอมีกระเป๋าสตางค์บางสำหรับเดินทาง"}
{"word": "wallet", "english": "My wallet is in my work bag.", "thai": "กระเป๋าสตางค์ของฉันอยู่ในกระเป๋าทำงาน"}
{"word": "wallet", "english": "I dropped my wallet in the store.", "thai": "ฉันทำกระเป๋าสตางค์ตกในร้าน"}
{"word": "wallet", "english": "He’s buying a wallet as a gift.", "thai": "เขากำลังซื้อกระเป๋าสตางค์เป็นของขวัญ"}
{"word": "wallet", "english": "I keep my keys with my wallet.", "thai": "ฉันเก็บกุญแจไว้กับกระเป๋าสตางค์"}
{"word": "wallet", "english": "She left her wallet at the gym.", "thai": "เธอทิ้งกระเป๋าสตางค์ไว้ที่ยิม"}
{"word": "wallet", "english": "My wallet is too bulky to carry.", "thai": "กระเป๋าสตางค์ของฉันใหญ่เกินกว่าจะพก"}
{"word": "wallet", "english": "I need to check my wallet for my card.", "thai": "ฉันต้องเช็คกระเป๋าสตางค์หาบัตร"}
{"word": "wallet", "english": "He’s got a wallet with his initials.", "thai": "เขามีกระเป๋าสตางค์ที่มีอักษรย่อของเขา"}
{"word": "wallet", "english": "I left my wallet in my other pants.", "thai": "ฉันทิ้งกระเป๋าสตางค์ไว้ในกางเกงตัวอื่น"}
{"word": "wallet", "english": "She’s got a wallet that matches her purse.", "thai": "เธอมีกระเป๋าสตางค์ที่เข้ากับกระเป๋าถือ"}
{"word": "wallet", "english": "My wallet is on the kitchen counter.", "thai": "กระเป๋าสตางค์ของฉันอยู่บนเคาน์เตอร์ครัว"}
{"word": "wallet", "english": "I need to replace my old wallet.", "thai": "ฉันต้องเปลี่ยนกระเป๋าสตางค์เก่า"}
{"word": "wallet", "english": "He forgot his wallet at the bar.", "thai": "เขาลืมกระเป๋าสตางค์ไว้ที่บาร์"}
{"word": "wallet", "english": "I keep a photo in my wallet.", "thai": "ฉันเก็บรูปถ่ายในกระเป๋าสตางค์"}
{"word": "wallet", "english": "She’s got a wallet with a zipper.", "thai": "เธอมีกระเป๋าสตางค์ที่มีซิป"}
{"word": "wallet", "english": "My wallet is in the glove compartment.", "thai": "กระเป๋าสตางค์ของฉันอยู่ในช่องเก็บของในรถ"}
{"word": "wallet", "english": "I found a wallet in the parking lot.", "thai": "ฉันเจอกระเป๋าสตางค์ในลานจอดรถ"}
{"word": "wallet", "english": "He’s got a wallet full of cash.", "thai": "เขามีกระเป๋าสตางค์ที่เต็มไปด้วยเงินสด"}
{"word": "wallet", "english": "I left my wallet at the hotel.", "thai": "ฉันทิ้งกระเป๋าสตางค์ไว้ที่โรงแรม"}
{"word": "wallet", "english": "She’s checking her wallet for her ID.", "thai": "เธอกำลังเช็คกระเป๋าสตางค์หาบัตรประจำตัว"}
{"word": "wallet", "english": "My wallet is in my backpack.", "thai": "กระเป๋าสตางค์ของฉันอยู่ในกระเป๋าเป้"}
{"word": "wallet", "english": "I need to organize my wallet.", "thai": "ฉันต้องจัดระเบียบกระเป๋าสตางค์"}
{"word": "wallet", "english": "He lost his wallet on the bus.", "thai": "เขาทำกระเป๋าสตางค์หายบนรถบัส"}
{"word": "wallet", "english": "I keep my wallet in my front pocket.", "thai": "ฉันเก็บกระเป๋าสตางค์ในกระเป๋าหน้า"}
{"word": "wallet", "english": "She’s got a wallet with a coin pouch.", "thai": "เธอมีกระเป๋าสตางค์ที่มีช่องใส่เหรียญ"}
{"word": "wallet", "english": "My wallet is on the nightstand.", "thai": "กระเป๋าสตางค์ของฉันอยู่บนโต๊ะข้างเตียง"}
{"word": "wallet", "english": "I left my wallet in my gym bag.", "thai": "ฉันทิ้งกระเป๋าสตางค์ไว้ในกระเป๋ายิม"}
{"word": "wallet", "english": "He’s got a wallet that’s really worn out.", "thai": "เขามีกระเป๋าสตางค์ที่เก่ามาก"}
{"word": "wallet", "english": "I need to put my wallet somewhere safe.", "thai": "ฉันต้องวางกระเป๋าสตางค์ไว้ในที่ปลอดภัย"}
{"word": "wallet", "english": "She found her wallet in her coat.", "thai": "เธอเจอกระเป๋าสตางค์ในโค้ต"}
{"word": "wallet", "english": "My wallet has my business cards.", "thai": "กระเป๋าสตางค์ของฉันมีนามบัตร"}
{"word": "wallet", "english": "I dropped my wallet in the taxi.", "thai": "ฉันทำกระเป๋าสตางค์ตกในแท็กซี่"}
{"word": "wallet", "english": "He’s got a wallet with a chain.", "thai": "เขามีกระเป๋าสตางค์ที่มีโซ่"}
{"word": "wallet", "english": "I left my wallet at the office.", "thai": "ฉันทิ้งกระเป๋าสตางค์ไว้ที่ออฟฟิศ"}
{"word": "wallet", "english": "She’s got a wallet in every purse.", "thai": "เธอมีกระเป๋าสตางค์ในทุกกระเป๋าถือ"}
{"word": "wallet", "english": "My wallet is in the side pocket.", "thai": "กระเป๋าสตางค์ของฉันอยู่ในกระเป๋าด้านข้าง"}
{"word": "wallet", "english": "I need to check my wallet for cash.", "thai": "ฉันต้องเช็คกระเป๋าสตางค์หาเงินสด"}
{"word": "wallet", "english": "He forgot his wallet at the store.", "thai": "เขาลืมกระเป๋าสตางค์ไว้ที่ร้าน"}
{"word": "wallet", "english": "I keep my wallet on the table.", "thai": "ฉันวางกระเป๋าสตางค์ไว้บนโต๊ะ"}
{"word": "wallet", "english": "She’s got a wallet that’s bright red.", "thai": "เธอมีกระเป๋าสตางค์สีแดงสด"}
{"word": "wallet", "english": "My wallet is in my briefcase.", "thai": "กระเป๋าสตางค์ของฉันอยู่ในกระเป๋าเอกสาร"}
{"word": "wallet", "english": "I left my wallet in the locker.", "thai": "ฉันทิ้งกระเป๋าสตางค์ไว้ในล็อกเกอร์"}
{"word": "wallet", "english": "He’s got a wallet with his photo ID.", "thai": "เขามีกระเป๋าสตางค์ที่มีบัตรประจำตัวพร้อมรูป"}
{"word": "wallet", "english": "I need to find my wallet before I leave.", "thai": "ฉันต้องหากระเป๋าสตางค์ก่อนออกไป"}
{"word": "wallet", "english": "She lost her wallet at the concert.", "thai": "เธอทำกระเป๋าสตางค์หายที่คอนเสิร์ต"}
{"word": "wallet", "english": "My wallet is in my tote bag.", "thai": "กระเป๋าสตางค์ของฉันอยู่ในกระเป๋าโท้ต"}
{"word": "wallet", "english": "I keep my wallet in my desk drawer.", "thai": "ฉันเก็บกระเป๋าสตางค์ในลิ้นชักโต๊ะ"}
{"word": "wallet", "english": "He’s got a wallet that’s super thin.", "thai": "เขามีกระเป๋าสตางค์ที่บางมาก"}
{"word": "wallet", "english": "I left my wallet at my friend’s house.", "thai": "ฉันทิ้งกระเป๋าสตางค์ไว้ที่บ้านเพื่อน"}
{"word": "wallet", "english": "She’s got a wallet with a floral design.", "thai": "เธอมีกระเป๋าสตางค์ที่มีลายดอกไม้"}
{"word": "wallet", "english": "My wallet is in the center console.", "thai": "กระเป๋าสตางค์ของฉันอยู่ในคอนโซลกลาง"}
{"word": "wallet", "english": "I need to get my wallet from upstairs.", "thai": "ฉันต้องไปหยิบกระเป๋าสตางค์จากชั้นบน"}
{"word": "wallet", "english": "He forgot his wallet in his gym locker.", "thai": "เขาลืมกระเป๋าสตางค์ไว้ในล็อกเกอร์ยิม"}
{"word": "wallet", "english": "I keep my wallet in my cargo pants.", "thai": "ฉันเก็บกระเป๋าสตางค์ในกางเกงคาร์โก"}
{"word": "wallet", "english": "She’s got a wallet with her monogram.", "thai": "เธอมีกระเป๋าสตางค์ที่มีลายนูนชื่อย่อ"}
{"word": "wallet", "english": "My wallet is in the entryway.", "thai": "กระเป๋าสตางค์ของฉันอยู่ในทางเข้า"}
{"word": "wallet", "english": "I left my wallet in my raincoat.", "thai": "ฉันทิ้งกระเป๋าสตางค์ไว้ในเสื้อกันฝน"}
{"word": "wallet", "english": "He’s got a wallet that’s waterproof.", "thai": "เขามีกระเป๋าสตางค์ที่กันน้ำ"}
{"word": "wallet", "english": "I need to check my wallet for my license.", "thai": "ฉันต้องเช็คกระเป๋าสตางค์หาใบขับขี่"}
{"word": "wallet", "english": "She lost her wallet at the beach.", "thai": "เธอทำกระเป๋าสตางค์หายที่ชายหาด"}
{"word": "wallet", "english": "My wallet is in my laptop bag.", "thai": "กระเป๋าสตางค์ของฉันอยู่ในกระเป๋าแล็ปท็อป"}
{"word": "wallet", "english": "I keep my wallet in my fanny pack.", "thai": "ฉันเก็บกระเป๋าสตางค์ในกระเป๋าคาดเอว"}
{"word": "wallet", "english": "He’s got a wallet with a cardholder.", "thai": "เขามีกระเป๋าสตางค์ที่มีช่องใส่บัตร"}
{"word": "wallet", "english": "I left my wallet at the coffee shop.", "thai": "ฉันทิ้งกระเป๋าสตางค์ไว้ที่ร้านกาแฟ"}
{"word": "wallet", "english": "She’s got a wallet that’s eco-friendly.", "thai": "เธอมีกระเป๋าสตางค์ที่เป็นมิตรต่อสิ่งแวดล้อม"}
{"word": "wallet", "english": "My wallet is in my jacket pocket.", "thai": "กระเป๋าสตางค์ของฉันอยู่ในกระเป๋าเสื้อแจ็คเก็ต"}
{"word": "wallet", "english": "I need to empty my wallet of old receipts.", "thai": "ฉันต้องเทใบเสร็จเก่าออกจากกระเป๋าสตางค์"}
{"word": "wallet", "english": "He forgot his wallet at the movie theater.", "thai": "เขาลืมกระเป๋าสตางค์ไว้ที่โรงหนัง"}
{"word": "wallet", "english": "I keep my wallet in my suitcase.", "thai": "ฉันเก็บกระเป๋าสตางค์ในกระเป๋าเดินทาง"}
{"word": "wallet", "english": "She’s got a wallet with a wrist strap.", "thai": "เธอมีกระเป๋าสตางค์ที่มีสายรัดข้อมือ"}
{"word": "wallet", "english": "My wallet is on the coffee table.", "thai": "กระเป๋าสตางค์ของฉันอยู่บนโต๊ะกาแฟ"}
{"word": "wallet", "english": "I left my wallet in my hoodie.", "thai": "ฉันทิ้งกระเป๋าสตางค์ไว้ในฮู้ดดี้"}
{"word": "wallet", "english": "He’s got a wallet that’s RFID-protected.", "thai": "เขามีกระเป๋าสตางค์ที่ป้องกัน RFID"}
