{"word": "fall", "english": "I saw him fall off the ladder yesterday.", "thai": "ฉันเห็นเขาตกลงจากบันไดเมื่อวานนี้"}
{"word": "fall", "english": "The leaves start to fall in October.", "thai": "ใบไม้เริ่มร่วงในเดือนตุลาคม"}
{"word": "fall", "english": "She’s afraid she might fall during the hike.", "thai": "เธอกลัวว่าเธออาจจะล้มระหว่างการเดินป่า"}
{"word": "fall", "english": "Prices tend to fall during the holiday season.", "thai": "ราคามักจะลดลงในช่วงเทศกาลวันหยุด"}
{"word": "fall", "english": "Don’t let the book fall off the table.", "thai": "อย่าปล่อยให้หนังสือตกลงจากโต๊ะ"}
{"word": "fall", "english": "He took a hard fall on the ice.", "thai": "เขาล้มแรงบนน้ำแข็ง"}
{"word": "fall", "english": "The team’s performance began to fall last season.", "thai": "ผลงานของทีมเริ่มตกต่ำในฤดูกาลที่แล้ว"}
{"word": "fall", "english": "I love the cool weather in the fall.", "thai": "ฉันชอบอากาศเย็นๆ ในฤดูใบไม้ร่วง"}
{"word": "fall", "english": "She watched the raindrops fall outside.", "thai": "เธอมองหยดฝนที่ตกลงมาข้างนอก"}
{"word": "fall", "english": "The stock market could fall tomorrow.", "thai": "ตลาดหุ้นอาจจะตกพรุ่งนี้"}
{"word": "fall", "english": "Kids often fall while learning to ride a bike.", "thai": "เด็กๆ มักจะล้มตอนหัดขี่จักรยาน"}
{"word": "fall", "english": "The city looks beautiful in the fall.", "thai": "เมืองนี้ดูสวยงามในฤดูใบไม้ร่วง"}
{"word": "fall", "english": "He didn’t mean to fall asleep in class.", "thai": "เขาไม่ได้ตั้งใจจะหลับในชั้นเรียน"}
{"word": "fall", "english": "The vase might fall if you bump the shelf.", "thai": "แจกันอาจจะตกถ้าคุณชนชั้นวาง"}
{"word": "fall", "english": "Her grades started to fall this semester.", "thai": "เกรดของเธอเริ่มตกในเทอมนี้"}
{"word": "fall", "english": "The old tree might fall in the storm.", "thai": "ต้นไม้เก่าอาจจะล้มในพายุ"}
{"word": "fall", "english": "I hope I don’t fall on the wet floor.", "thai": "ฉันหวังว่าฉันจะไม่ล้มบนพื้นเปียก"}
{"word": "fall", "english": "The temperature will fall tonight.", "thai": "อุณหภูมิจะลดลงคืนนี้"}
{"word": "fall", "english": "He watched the snow fall gently.", "thai": "เขาดูหิมะที่ตกลงมาเบาๆ"}
{"word": "fall", "english": "She let her hair fall over her shoulders.", "thai": "เธอปล่อยผมให้ตกลงมาที่ไหล่"}
{"word": "fall", "english": "The company’s profits began to fall.", "thai": "กำไรของบริษัทเริ่มลดลง"}
{"word": "fall", "english": "Be careful not to fall down the stairs.", "thai": "ระวังอย่าตกลงจากบันได"}
{"word": "fall", "english": "The leaves turn red before they fall.", "thai": "ใบไม้เปลี่ยนเป็นสีแดงก่อนที่จะร่วง"}
{"word": "fall", "english": "He tends to fall behind in group projects.", "thai": "เขามักจะตามหลังในโปรเจกต์กลุ่ม"}
{"word": "fall", "english": "The apple didn’t fall far from the tree.", "thai": "แอปเปิ้ลไม่ตกไกลจากต้น"}
{"word": "fall", "english": "I saw a star fall in the night sky.", "thai": "ฉันเห็นดาวตกในท้องฟ้ายามค่ำคืน"}
{"word": "fall", "english": "Her voice seemed to fall as she spoke.", "thai": "น้ำเสียงของเธอเหมือนจะลดลงขณะที่เธอพูด"}
{"word": "fall", "english": "The building could fall if not repaired.", "thai": "อาคารอาจจะพังถ้าไม่ได้รับการซ่อมแซม"}
{"word": "fall", "english": "Don’t let the baby fall off the bed.", "thai": "อย่าปล่อยให้เด็กทารกตกลงจากเตียง"}
{"word": "fall", "english": "Sales always fall after the holidays.", "thai": "ยอดขายมักจะลดลงหลังวันหยุด"}
{"word": "fall", "english": "She felt her heart fall when he left.", "thai": "เธอรู้สึกหัวใจสลายเมื่อเขาจากไป"}
{"word": "fall", "english": "The climbers were trained to avoid a fall.", "thai": "นักปีนเขาถูกฝึกให้หลีกเลี่ยงการตก"}
{"word": "fall", "english": "The curtain will fall at the end of the play.", "thai": "ม่านจะลงเมื่อการแสดงจบ"}
{"word": "fall", "english": "He didn’t expect to fall in love so fast.", "thai": "เขาไม่คาดว่าจะตกหลุมรักเร็วขนาดนี้"}
{"word": "fall", "english": "The tower began to fall during the quake.", "thai": "หอคอยเริ่มล้มระหว่างแผ่นดินไหว"}
{"word": "fall", "english": "Her confidence started to fall after the mistake.", "thai": "ความมั่นใจของเธอเริ่มลดลงหลังจากความผิดพลาด"}
{"word": "fall", "english": "The ball might fall into the water.", "thai": "ลูกบอลอาจจะตกลงไปในน้ำ"}
{"word": "fall", "english": "I saw the kite fall from the sky.", "thai": "ฉันเห็นว่าวตกลงมาจากท้องฟ้า"}
{"word": "fall", "english": "The plan could fall apart without support.", "thai": "แผนอาจจะล้มเหลวถ้าไม่มีการสนับสนุน"}
{"word": "fall", "english": "He let the pen fall from his hand.", "thai": "เขาปล่อยให้ปากกาตกลงจากมือ"}
{"word": "fall", "english": "The city’s defenses began to fall.", "thai": "การป้องกันของเมืองเริ่มพังทลาย"}
{"word": "fall", "english": "She tripped but didn’t fall.", "thai": "เธอสะดุดแต่ไม่ได้ล้ม"}
{"word": "fall", "english": "The rain began to fall heavily.", "thai": "ฝนเริ่มตกลงมาอย่างหนัก"}
{"word": "fall", "english": "His voice would fall when he was nervous.", "thai": "น้ำเสียงของเขาจะลดลงเมื่อเขาตื่นเต้น"}
{"word": "fall", "english": "The bridge might fall under too much weight.", "thai": "สะพานอาจจะพังถ้ามีน้ำหนักมากเกินไป"}
{"word": "fall", "english": "I don’t want to fall behind in my work.", "thai": "ฉันไม่อยากตามหลังในงานของฉัน"}
{"word": "fall", "english": "The painting could fall off the wall.", "thai": "ภาพวาดอาจจะตกลงจากผนัง"}
{"word": "fall", "english": "She loves to watch the leaves fall.", "thai": "เธอชอบดูใบไม้ร่วง"}
{"word": "fall", "english": "The economy might fall into recession.", "thai": "เศรษฐกิจอาจจะตกสู่ภาวะถดถอย"}
{"word": "fall", "english": "He saw the rock fall down the hill.", "thai": "เขาเห็นหินกลิ้งตกลงจากเนินเขา"}
{"word": "fall", "english": "The deal could fall through at any moment.", "thai": "ข้อตกลงอาจจะล้มเหลวได้ทุกเมื่อ"}
{"word": "fall", "english": "Her hair would fall into her eyes.", "thai": "ผมของเธอจะตกลงมาปิดตา"}
{"word": "fall", "english": "The soldier saw his friend fall in battle.", "thai": "ทหารเห็นเพื่อนของเขาล้มในสนามรบ"}
{"word": "fall", "english": "The temperature tends to fall in the evening.", "thai": "อุณหภูมิมีแนวโน้มลดลงในตอนเย็น"}
{"word": "fall", "english": "Don’t let the glass fall and break.", "thai": "อย่าปล่อยให้แก้วตกลงมาแตก"}
{"word": "fall", "english": "She didn’t want to fall for his lies.", "thai": "เธอไม่อยากหลงเชื่อคำโกหกของเขา"}
{"word": "fall", "english": "The old house might fall apart soon.", "thai": "บ้านเก่าอาจจะพังลงในไม่ช้า"}
{"word": "fall", "english": "He felt his spirits fall after the news.", "thai": "เขารู้สึกท้อแท้หลังจากได้ยินข่าว"}
{"word": "fall", "english": "The kids love to jump in fall leaves.", "thai": "เด็กๆ ชอบกระโดดลงไปในกองใบไม้ร่วง"}
{"word": "fall", "english": "The rope could cause you to fall.", "thai": "เชือกอาจทำให้คุณล้ม"}
{"word": "fall", "english": "Her eyes would fall on the old photo.", "thai": "สายตาของเธอจะตกไปที่ภาพถ่ายเก่า"}
{"word": "fall", "english": "The team didn’t want to fall short.", "thai": "ทีมไม่อยากทำได้ไม่ถึงเป้า"}
{"word": "fall", "english": "The snow will fall all night long.", "thai": "หิมะจะตกลงมาตลอดทั้งคืน"}
{"word": "fall", "english": "He didn’t expect the plan to fall apart.", "thai": "เขาไม่คาดว่าแผนจะล้มเหลว"}
{"word": "fall", "english": "She saw the prices fall at the store.", "thai": "เธอเห็นราคาลดลงที่ร้านค้า"}
{"word": "fall", "english": "The branch might fall on the car.", "thai": "กิ่งไม้อาจจะตกลงบนรถ"}
{"word": "fall", "english": "He let his guard fall during the match.", "thai": "เขาปล่อยการ์ดตกระหว่างการแข่งขัน"}
{"word": "fall", "english": "The festival happens every fall.", "thai": "เทศกาลนี้จัดขึ้นทุกฤดูใบไม้ร่วง"}
{"word": "fall", "english": "The cup could fall off the counter.", "thai": "ถ้วยอาจจะตกลงจากเคาน์เตอร์"}
{"word": "fall", "english": "She didn’t want to fall into debt.", "thai": "เธอไม่อยากตกเป็นหนี้"}
{"word": "fall", "english": "The kids saw the balloon fall slowly.", "thai": "เด็กๆ เห็นบอลลูนตกลงมาช้าๆ"}
{"word": "fall", "english": "His grades didn’t fall despite the challenge.", "thai": "เกรดของเขาไม่ตกแม้จะเจอความท้าทาย"}
{"word": "fall", "english": "The rain will fall all afternoon.", "thai": "ฝนจะตกลงมาตลอดบ่าย"}
{"word": "fall", "english": "She felt her hopes fall after the call.", "thai": "เธอรู้สึกความหวังลดลงหลังจากการโทร"}
{"word": "fall", "english": "The ladder could make you fall.", "thai": "บันไดอาจทำให้คุณล้ม"}
{"word": "fall", "english": "He saw the prices fall online.", "thai": "เขาเห็นราคาลดลงทางออนไลน์"}
{"word": "fall", "english": "The team’s morale began to fall.", "thai": "ขวัญกำลังใจของทีมเริ่มลดลง"}
{"word": "fall", "english": "She loves the fall colors in the park.", "thai": "เธอชอบสีสันของฤดูใบไม้ร่วงในสวนสาธารณะ"}
{"word": "fall", "english": "The box might fall off the truck.", "thai": "กล่องอาจจะตกลงจากรถบรรทุก"}
{"word": "fall", "english": "He didn’t want to fall for the trick.", "thai": "เขาไม่อยากหลงกล"}
{"word": "fall", "english": "The building’s roof could fall in.", "thai": "หลังคาของอาคารอาจจะพังลงมา"}
{"word": "fall", "english": "Her voice would fall when she was sad.", "thai": "น้ำเสียงของเธอจะลดลงเมื่อเธอเศร้า"}
{"word": "fall", "english": "The leaves fall faster in strong winds.", "thai": "ใบไม้ร่วงเร็วกว่าในลมแรง"}
{"word": "fall", "english": "He saw the team fall behind early.", "thai": "เขาเห็นทีมตามหลังตั้งแต่ต้น"}
{"word": "fall", "english": "The painting might fall without a strong hook.", "thai": "ภาพวาดอาจจะตกถ้าไม่มีตะขอที่แข็งแรง"}
{"word": "fall", "english": "She didn’t expect to fall so hard.", "thai": "เธอไม่คาดว่าจะล้มแรงขนาดนี้"}
{"word": "fall", "english": "The market tends to fall in September.", "thai": "ตลาดมีแนวโน้มตกในเดือนกันยายน"}
{"word": "fall", "english": "He let the ball fall through his hands.", "thai": "เขาปล่อยให้ลูกบอลหลุดจากมือ"}
{"word": "fall", "english": "The city prepares for fall every year.", "thai": "เมืองเตรียมพร้อมสำหรับฤดูใบไม้ร่วงทุกปี"}
{"word": "fall", "english": "The shelf could fall under the weight.", "thai": "ชั้นวางอาจจะพังลงมาด้วยน้ำหนัก"}
{"word": "fall", "english": "She saw the stars fall during the meteor shower.", "thai": "เธอเห็นดาวตกในช่วงฝนดาวตก"}
{"word": "fall", "english": "The project might fall behind schedule.", "thai": "โปรเจกต์อาจจะล่าช้ากว่ากำหนด"}
{"word": "fall", "english": "He didn’t want to fall out with his friend.", "thai": "เขาไม่อยากทะเลาะกับเพื่อน"}
{"word": "fall", "english": "The raindrops fall softly on the roof.", "thai": "หยดฝนตกลงมาบนหลังคาเบาๆ"}
{"word": "fall", "english": "The team could fall in the rankings.", "thai": "ทีมอาจจะตกในอันดับ"}
{"word": "fall", "english": "She watched the petals fall from the flower.", "thai": "เธอดูกลีบดอกไม้ร่วงจากดอก"}
{"word": "fall", "english": "The old wall might fall soon.", "thai": "กำแพงเก่าอาจจะพังลงในไม่ช้า"}
{"word": "fall", "english": "He felt his energy fall after the race.", "thai": "เขารู้สึกพลังงานลดลงหลังจากการแข่งขัน"}
{"word": "fall", "english": "The leaves fall in piles on the ground.", "thai": "ใบไม้ร่วงเป็นกองบนพื้น"}
{"word": "fall", "english": "She didn’t want to fall into a trap.", "thai": "เธอไม่อยากตกลงไปในกับดัก"}
{"word": "fall", "english": "I love watching the leaves fall in autumn.", "thai": "ฉันชอบดูใบไม้ร่วงในฤดูใบไม้ร่วง"}
{"word": "fall", "english": "Be careful not to fall on the icy sidewalk.", "thai": "ระวังอย่าล้มบนทางเท้าที่เป็นน้ำแข็ง"}
{"word": "fall", "english": "The prices of gas always seem to fall in winter.", "thai": "ราคาน้ำมันมักจะลดลงในช่วงฤดูหนาว"}
{"word": "fall", "english": "She tripped and started to fall down the stairs.", "thai": "เธอสะดุดและเริ่มล้มลงบันได"}
{"word": "fall", "english": "The stock market took a big fall last week.", "thai": "ตลาดหุ้นตกลงอย่างมากเมื่อสัปดาห์ที่แล้ว"}
{"word": "fall", "english": "Kids love to jump and fall into piles of leaves.", "thai": "เด็กๆ ชอบกระโดดและตกลงไปในกองใบไม้"}
{"word": "fall", "english": "I hope I don’t fall off my bike again.", "thai": "ฉันหวังว่าฉันจะไม่ตกจากจักรยานอีก"}
{"word": "fall", "english": "The temperature will fall below freezing tonight.", "thai": "อุณหภูมิจะลดลงต่ำกว่าจุดเยือกแข็งคืนนี้"}
{"word": "fall", "english": "He let the book fall from his hands.", "thai": "เขาปล่อยให้หนังสือหล่นจากมือ"}
{"word": "fall", "english": "The old tree might fall in the storm.", "thai": "ต้นไม้เก่าอาจล้มในพายุ"}
{"word": "fall", "english": "Her grades started to fall this semester.", "thai": "เกรดของเธอเริ่มตกลงในเทอมนี้"}
{"word": "fall", "english": "I saw a star fall across the night sky.", "thai": "ฉันเห็นดาวตกพาดผ่านท้องฟ้ายามค่ำ"}
{"word": "fall", "english": "Don’t let the baby fall off the couch.", "thai": "อย่าปล่อยให้เด็กทารกลงจากโซฟา"}
{"word": "fall", "english": "The team’s morale began to fall after the loss.", "thai": "ขวัญกำลังใจของทีมเริ่มลดลงหลังจากแพ้"}
{"word": "fall", "english": "The rain will fall heavily this afternoon.", "thai": "ฝนจะตกหนักในช่วงบ่ายนี้"}
{"word": "fall", "english": "He’s afraid he’ll fall behind in class.", "thai": "เขากลัวว่าจะตามไม่ทันในชั้นเรียน"}
{"word": "fall", "english": "The apple didn’t fall far from the tree.", "thai": "แอปเปิ้ลไม่ตกไกลจากต้น"}
{"word": "fall", "english": "I can’t wait for fall; it’s my favorite season.", "thai": "ฉันรอฤดูใบไม้ร่วงไม่ไหวแล้ว มันเป็นฤดูที่ฉันชอบที่สุด"}
{"word": "fall", "english": "The vase could fall if you bump the table.", "thai": "แจกันอาจหล่นถ้าคุณชนโต๊ะ"}
{"word": "fall", "english": "Sales tend to fall during the holidays.", "thai": "ยอดขายมักจะลดลงในช่วงวันหยุด"}
{"word": "fall", "english": "She watched the snow fall gently outside.", "thai": "เธอดูหิมะตกลงมาเบาๆ ข้างนอก"}
{"word": "fall", "english": "He took a bad fall while skiing.", "thai": "เขาได้รับบาดเจ็บจากการล้มขณะเล่นสกี"}
{"word": "fall", "english": "The city will fall silent during the ceremony.", "thai": "เมืองจะเงียบสงบในระหว่างพิธี"}
{"word": "fall", "english": "I might fall asleep during the movie.", "thai": "ฉันอาจหลับไปในระหว่างดูหนัง"}
{"word": "fall", "english": "The bridge could fall under too much weight.", "thai": "สะพานอาจพังลงถ้ามีน้ำหนักมากเกินไป"}
{"word": "fall", "english": "Her hair would fall over her eyes when she laughed.", "thai": "ผมของเธอจะตกลงมาปิดตาเมื่อเธอหัวเราะ"}
{"word": "fall", "english": "The economy is expected to fall next quarter.", "thai": "เศรษฐกิจคาดว่าจะตกในไตรมาสหน้า"}
{"word": "fall", "english": "Don’t fall for that scam; it’s too good to be true.", "thai": "อย่าหลงกลการหลอกลวงนั้น มันดีเกินจริง"}
{"word": "fall", "english": "The kids saw the leaves fall and ran to play.", "thai": "เด็กๆ เห็นใบไม้ร่วงและวิ่งไปเล่น"}
{"word": "fall", "english": "The curtain will fall at the end of the play.", "thai": "ม่านจะปิดลงเมื่อการแสดงจบ"}
{"word": "fall", "english": "He didn’t want to fall out with his best friend.", "thai": "เขาไม่อยากทะเลาะกับเพื่อนสนิท"}
{"word": "fall", "english": "The tower began to fall during the earthquake.", "thai": "หอคอยเริ่มล้มในระหว่างแผ่นดินไหว"}
{"word": "fall", "english": "I always fall in love with the wrong people.", "thai": "ฉันมักจะตกหลุมรักคนที่ไม่เหมาะสม"}
{"word": "fall", "english": "The soldiers were ordered not to fall back.", "thai": "ทหารได้รับคำสั่งไม่ให้ถอยกลับ"}
{"word": "fall", "english": "Her voice would fall when she was nervous.", "thai": "น้ำเสียงของเธอจะต่ำลงเมื่อเธอประหม่า"}
{"word": "fall", "english": "The plan might fall apart if we don’t act fast.", "thai": "แผนอาจล้มเหลวถ้าเราไม่ดำเนินการเร็ว"}
{"word": "fall", "english": "The rain began to fall just as we left.", "thai": "ฝนเริ่มตกเมื่อเราออกไป"}
{"word": "fall", "english": "He felt his confidence fall after the mistake.", "thai": "เขารู้สึกว่าความมั่นใจลดลงหลังจากทำผิด"}
{"word": "fall", "english": "The leaves fall faster when it’s windy.", "thai": "ใบไม้ร่วงเร็วขึ้นเมื่อมีลมแรง"}
{"word": "fall", "english": "She didn’t want to fall behind her classmates.", "thai": "เธอไม่อยากตามหลังเพื่อนร่วมชั้น"}
{"word": "fall", "english": "The building could fall if it’s not repaired.", "thai": "อาคารอาจพังถ้าไม่ได้รับการซ่อมแซม"}
{"word": "fall", "english": "I saw him fall while running in the park.", "thai": "ฉันเห็นเขาล้มขณะวิ่งในสวน"}
{"word": "fall", "english": "The team might fall short of their goal.", "thai": "ทีมอาจไม่ถึงเป้าหมาย"}
{"word": "fall", "english": "The shadows fall longer in the evening.", "thai": "เงาจะยาวขึ้นในช่วงเย็น"}
{"word": "fall", "english": "He was afraid to fall off the ladder.", "thai": "เขากลัวว่าจะตกจากบันได"}
{"word": "fall", "english": "The company’s profits began to fall sharply.", "thai": "กำไรของบริษัทเริ่มลดลงอย่างรวดเร็ว"}
{"word": "fall", "english": "She let her guard fall during the conversation.", "thai": "เธอปล่อยให้การป้องกันตัวลดลงระหว่างการสนทนา"}
{"word": "fall", "english": "The snow will fall all night long.", "thai": "หิมะจะตกลงมาทั้งคืน"}
{"word": "fall", "english": "I don’t want to fall into bad habits.", "thai": "ฉันไม่อยากตกอยู่ในนิสัยที่ไม่ดี"}
{"word": "fall", "english": "The old house might fall apart soon.", "thai": "บ้านเก่าอาจพังลงในไม่ช้า"}
{"word": "fall", "english": "He watched the dominos fall one by one.", "thai": "เขาดูโดมิโนล้มลงทีละตัว"}
{"word": "fall", "english": "Her mood seemed to fall after the news.", "thai": "อารมณ์ของเธอดูจะแย่ลงหลังจากได้ยินข่าว"}
{"word": "fall", "english": "The kite will fall if the wind stops.", "thai": "ว่าวจะตกลงถ้าลมหยุด"}
{"word": "fall", "english": "I didn’t expect to fall for him so fast.", "thai": "ฉันไม่คาดคิดว่าจะตกหลุมรักเขาเร็วขนาดนี้"}
{"word": "fall", "english": "The city’s defenses began to fall.", "thai": "การป้องกันของเมืองเริ่มพังทลาย"}
{"word": "fall", "english": "The ball will fall if you don’t catch it.", "thai": "ลูกบอลจะตกลงถ้าคุณไม่รับมัน"}
{"word": "fall", "english": "She felt her energy fall after the long day.", "thai": "เธอรู้สึกพลังงานลดลงหลังจากวันที่ยาวนาน"}
{"word": "fall", "english": "The project might fall through without funding.", "thai": "โครงการอาจล้มเหลวถ้าไม่มีเงินทุน"}
{"word": "fall", "english": "The stars seem to fall closer at night.", "thai": "ดวงดาวดูเหมือนจะตกลงมาใกล้ในตอนกลางคืน"}
{"word": "fall", "english": "He didn’t want to fall under pressure.", "thai": "เขาไม่อยากยอมจำนนต่อความกดดัน"}
{"word": "fall", "english": "The leaves fall in beautiful patterns.", "thai": "ใบไม้ร่วงเป็นลวดลายที่สวยงาม"}
{"word": "fall", "english": "The team’s ranking began to fall.", "thai": "อันดับของทีมเริ่มตกลง"}
{"word": "fall", "english": "She saw the petals fall from the flower.", "thai": "เธอเห็นกลีบดอกไม้ร่วงจากดอก"}
{"word": "fall", "english": "The plan could fall apart without support.", "thai": "แผนอาจล้มเหลวถ้าไม่มีการสนับสนุน"}
{"word": "fall", "english": "I don’t want to fall asleep at work.", "thai": "ฉันไม่อยากหลับในที่ทำงาน"}
{"word": "fall", "english": "The rain will fall softly tonight.", "thai": "ฝนจะตกเบาๆ คืนนี้"}
{"word": "fall", "english": "He felt his spirits fall after the argument.", "thai": "เขารู้สึกจิตใจหดหู่หลังจากการโต้เถียง"}
{"word": "fall", "english": "The old fence might fall in the wind.", "thai": "รั้วเก่าอาจล้มในลมแรง"}
{"word": "fall", "english": "She didn’t want to fall for his charm.", "thai": "เธอไม่อยากหลงเสน่ห์ของเขา"}
{"word": "fall", "english": "The temperature tends to fall at night.", "thai": "อุณหภูมิมีแนวโน้มลดลงในตอนกลางคืน"}
{"word": "fall", "english": "The book fell open to my favorite page.", "thai": "หนังสือเปิดออกที่หน้าที่ฉันชอบ"}
{"word": "fall", "english": "The team didn’t want to fall behind.", "thai": "ทีมไม่อยากตามหลัง"}
{"word": "fall", "english": "The leaves fall slowly in calm weather.", "thai": "ใบไม้ร่วงช้าๆ ในสภาพอากาศสงบ"}
{"word": "fall", "english": "He was scared he’d fall off the cliff.", "thai": "เขากลัวว่าจะตกจากหน้าผา"}
{"word": "fall", "english": "The company’s stock began to fall.", "thai": "หุ้นของบริษัทเริ่มตกลง"}
{"word": "fall", "english": "The raindrops fall gently on the roof.", "thai": "หยดฝนตกลงเบาๆ บนหลังคา"}
{"word": "fall", "english": "I don’t want to fall into debt.", "thai": "ฉันไม่อยากตกอยู่ในหนี้"}
{"word": "fall", "english": "The old barn might fall any day now.", "thai": "โรงนาเก่าอาจพังลงวันใดวันหนึ่ง"}
{"word": "fall", "english": "Her smile made my heart fall for her.", "thai": "รอยยิ้มของเธอทำให้ใจฉันตกหลุมรัก"}
{"word": "fall", "english": "The snow will fall heavily tomorrow.", "thai": "หิมะจะตกหนักในวันพรุ่งนี้"}
{"word": "fall", "english": "He didn’t want to fall out of favor.", "thai": "เขาไม่อยากเสียความนิยม"}
{"word": "fall", "english": "The leaves fall in a colorful shower.", "thai": "ใบไม้ร่วงลงมาเหมือนฝนสีสัน"}
{"word": "fall", "english": "The plan might fall short of expectations.", "thai": "แผนอาจไม่ถึงความคาดหวัง"}
{"word": "fall", "english": "She watched the rain fall on the window.", "thai": "เธอดูฝนตกลงบนหน้าต่าง"}
{"word": "fall", "english": "The tower could fall if not maintained.", "thai": "หอคอยอาจล้มถ้าไม่ได้รับการบำรุง"}
{"word": "fall", "english": "I saw him fall during the race.", "thai": "ฉันเห็นเขาล้มระหว่างการแข่ง"}
{"word": "fall", "english": "The market might fall again soon.", "thai": "ตลาดอาจตกลงอีกในไม่ช้า"}
{"word": "fall", "english": "Her hair would fall in soft waves.", "thai": "ผมของเธอจะตกลงมาเป็นคลื่นนุ่ม"}
{"word": "fall", "english": "The team didn’t want to fall apart.", "thai": "ทีมไม่อยากแตกสลาย"}
{"word": "fall", "english": "The leaves fall every year in October.", "thai": "ใบไม้ร่วงทุกปีในเดือนตุลาคม"}
{"word": "fall", "english": "He was afraid to fall from the roof.", "thai": "เขากลัวว่าจะตกจากหลังคา"}
{"word": "fall", "english": "The prices will fall after the sale.", "thai": "ราคาจะลดลงหลังการลดราคา"}
{"word": "fall", "english": "She didn’t expect to fall so hard.", "thai": "เธอไม่คาดคิดว่าจะตกหลุมรักหนักขนาดนี้"}
{"word": "fall", "english": "The snow began to fall at dusk.", "thai": "หิมะเริ่มตกในตอนพลบค่ำ"}
{"word": "fall", "english": "The deal might fall through at the last minute.", "thai": "ข้อตกลงอาจล้มเหลวในนาทีสุดท้าย"}
{"word": "fall", "english": "I love how the leaves fall in fall.", "thai": "ฉันชอบวิธีที่ใบไม้ร่วงในฤดูใบไม้ร่วง"}
{"word": "fall", "english": "He felt his hopes fall after the rejection.", "thai": "เขารู้สึกความหวังลดลงหลังถูกปฏิเสธ"}
{"word": "fall", "english": "The rain will fall all day tomorrow.", "thai": "ฝนจะตกทั้งวันในวันพรุ่งนี้"}
{"word": "fall", "english": "She didn’t want to fall for his tricks.", "thai": "เธอไม่อยากหลงกลเล่ห์ของเขา"}
{"word": "feel", "english": "I feel so happy when I’m with you.", "thai": "ฉันรู้สึกมีความสุขมากเมื่ออยู่กับคุณ"}
{"word": "feel", "english": "Do you feel the cold wind outside?", "thai": "คุณรู้สึกถึงลมหนาวข้างนอกไหม"}
{"word": "feel", "english": "She didn’t feel like going to the party.", "thai": "เธอไม่อยากไปงานปาร์ตี้"}
{"word": "feel", "english": "I feel tired after a long day.", "thai": "ฉันรู้สึกเหนื่อยหลังจากวันที่ยาวนาน"}
{"word": "feel", "english": "He feels confident about the exam.", "thai": "เขารู้สึกมั่นใจในข้อสอบ"}
{"word": "feel", "english": "Can you feel the beat of the music?", "thai": "คุณรู้สึกถึงจังหวะของดนตรีได้ไหม"}
{"word": "feel", "english": "I feel bad for forgetting her birthday.", "thai": "ฉันรู้สึกแย่ที่ลืมวันเกิดของเธอ"}
{"word": "feel", "english": "She feels nervous before speaking in public.", "thai": "เธอรู้สึกประหม่าเมื่อต้องพูดในที่สาธารณะ"}
{"word": "feel", "english": "I feel like eating pizza tonight.", "thai": "ฉันอยากกินพิซซ่าคืนนี้"}
{"word": "feel", "english": "He doesn’t feel well; he might be sick.", "thai": "เขาไม่สบาย อาจจะป่วย"}
{"word": "feel", "english": "I feel the sun warming my skin.", "thai": "ฉันรู้สึกถึงแสงแดดที่ทำให้ผิวอุ่น"}
{"word": "feel", "english": "She feels excited about the new job.", "thai": "เธอรู้สึกตื่นเต้นกับงานใหม่"}
{"word": "feel", "english": "I feel sorry for what happened to him.", "thai": "ฉันรู้สึกเสียใจกับสิ่งที่เกิดขึ้นกับเขา"}
{"word": "feel", "english": "Do you feel the ground shaking?", "thai": "คุณรู้สึกถึงพื้นสั่นไหม"}
{"word": "feel", "english": "I feel like I’m forgetting something.", "thai": "ฉันรู้สึกเหมือนลืมอะไรบางอย่าง"}
{"word": "feel", "english": "He feels proud of his team’s success.", "thai": "เขารู้สึกภูมิใจในความสำเร็จของทีม"}
{"word": "feel", "english": "I don’t feel comfortable in this room.", "thai": "ฉันรู้สึกไม่สบายใจในห้องนี้"}
{"word": "feel", "english": "She feels overwhelmed by all the work.", "thai": "เธอรู้สึกหนักใจกับงานทั้งหมด"}
{"word": "feel", "english": "Can you feel the texture of this fabric?", "thai": "คุณสัมผัสถึงพื้นผิวของผ้านี้ได้ไหม"}
{"word": "feel", "english": "I feel like we’ve met before.", "thai": "ฉันรู้สึกเหมือนเราเคยเจอกันมาก่อน"}
{"word": "feel", "english": "He feels anxious about the future.", "thai": "เขารู้สึกกังวลเกี่ยวกับอนาคต"}
{"word": "feel", "english": "I feel the raindrops on my face.", "thai": "ฉันรู้สึกถึงหยดฝนบนใบหน้า"}
{"word": "feel", "english": "She feels ready for the challenge.", "thai": "เธอรู้สึกพร้อมสำหรับความท้าทาย"}
{"word": "feel", "english": "I feel a bit dizzy after spinning around.", "thai": "ฉันรู้สึกเวียนหัวเล็กน้อยหลังจากหมุนตัว"}
{"word": "feel", "english": "He feels like he’s not good enough.", "thai": "เขารู้สึกเหมือนเขาไม่ดีพอ"}
{"word": "feel", "english": "I feel the warmth of the fire.", "thai": "ฉันรู้สึกถึงความอบอุ่นของไฟ"}
{"word": "feel", "english": "She doesn’t feel safe walking alone at night.", "thai": "เธอรู้สึกไม่ปลอดภัยเมื่อเดินคนเดียวตอนกลางคืน"}
{"word": "feel", "english": "I feel like going for a walk.", "thai": "ฉันอยากไปเดินเล่น"}
{"word": "feel", "english": "He feels frustrated with his slow progress.", "thai": "เขารู้สึกหงุดหงิดกับความก้าวหน้าที่ช้า"}
{"word": "feel", "english": "I can feel the sand between my toes.", "thai": "ฉันรู้สึกถึงทรายระหว่างนิ้วเท้า"}
{"word": "feel", "english": "She feels inspired by the book she read.", "thai": "เธอรู้สึกได้รับแรงบันดาลใจจากหนังสือที่อ่าน"}
{"word": "feel", "english": "I feel a headache coming on.", "thai": "ฉันรู้สึกว่าปวดหัวกำลังจะมา"}
{"word": "feel", "english": "He feels hopeful about the new year.", "thai": "เขารู้สึกมีความหวังในปีใหม่"}
{"word": "feel", "english": "I don’t feel like talking right now.", "thai": "ฉันไม่อยากคุยตอนนี้"}
{"word": "feel", "english": "She feels the pressure of the deadline.", "thai": "เธอรู้สึกถึงแรงกดดันจากกำหนดเวลา"}
{"word": "feel", "english": "I feel the breeze coming through the window.", "thai": "ฉันรู้สึกถึงสายลมที่พัดผ่านหน้าต่าง"}
{"word": "feel", "english": "He feels guilty for lying to his friend.", "thai": "เขารู้สึกผิดที่โกหกเพื่อน"}
{"word": "feel", "english": "I feel like I need a break.", "thai": "ฉันรู้สึกเหมือนต้องการพัก"}
{"word": "feel", "english": "She feels calm when she’s by the ocean.", "thai": "เธอรู้สึกสงบเมื่ออยู่ใกล้ทะเล"}
{"word": "feel", "english": "I can feel my heart racing.", "thai": "ฉันรู้สึกถึงหัวใจที่เต้นเร็ว"}
{"word": "feel", "english": "He feels excited about the trip tomorrow.", "thai": "เขารู้สึกตื่นเต้นกับการเดินทางพรุ่งนี้"}
{"word": "feel", "english": "I feel the weight of the bag on my shoulder.", "thai": "ฉันรู้สึกถึงน้ำหนักของกระเป๋าที่ไหล่"}
{"word": "feel", "english": "She feels disappointed with the results.", "thai": "เธอรู้สึกผิดหวังกับผลลัพธ์"}
{"word": "feel", "english": "I feel like I’m catching a cold.", "thai": "ฉันรู้สึกเหมือนกำลังจะเป็นหวัด"}
{"word": "feel", "english": "He feels relieved after finishing the project.", "thai": "เขารู้สึกโล่งใจหลังจากจบโปรเจกต์"}
{"word": "feel", "english": "I feel the vibration of my phone.", "thai": "ฉันรู้สึกถึงการสั่นของโทรศัพท์"}
{"word": "feel", "english": "She feels lonely without her friends.", "thai": "เธอรู้สึกเหงาเมื่อไม่มีเพื่อน"}
{"word": "feel", "english": "I feel like we should try something new.", "thai": "ฉันรู้สึกว่าเราควรลองอะไรใหม่ๆ"}
{"word": "feel", "english": "He feels stressed about the meeting.", "thai": "เขารู้สึกเครียดเกี่ยวกับการประชุม"}
{"word": "feel", "english": "I feel the grass under my feet.", "thai": "ฉันรู้สึกถึงหญ้าใต้ฝ่าเท้า"}
{"word": "feel", "english": "She feels motivated to start exercising.", "thai": "เธอรู้สึกมีแรงจูงใจที่จะเริ่มออกกำลังกาย"}
{"word": "feel", "english": "I feel a sharp pain in my knee.", "thai": "ฉันรู้สึกเจ็บแปลบที่หัวเข่า"}
{"word": "feel", "english": "He feels optimistic about his new plan.", "thai": "เขารู้สึกมองโลกในแง่ดีเกี่ยวกับแผนใหม่"}
{"word": "feel", "english": "I don’t feel ready for the test.", "thai": "ฉันรู้สึกไม่พร้อมสำหรับการสอบ"}
{"word": "feel", "english": "She feels the warmth of the coffee cup.", "thai": "เธอรู้สึกถึงความอุ่นของถ้วยกาแฟ"}
{"word": "feel", "english": "I feel like dancing tonight.", "thai": "ฉันอยากเต้นคืนนี้"}
{"word": "feel", "english": "He feels embarrassed about his mistake.", "thai": "เขารู้สึกอายกับความผิดพลาดของเขา"}
{"word": "feel", "english": "I feel the tension in the room.", "thai": "ฉันรู้สึกถึงความตึงเครียดในห้อง"}
{"word": "feel", "english": "She feels grateful for all the help.", "thai": "เธอรู้สึกขอบคุณสำหรับความช่วยเหลือทั้งหมด"}
{"word": "feel", "english": "I feel a chill running down my spine.", "thai": "ฉันรู้สึกหนาวสั่นลงกระดูกสันหลัง"}
{"word": "feel", "english": "He feels unsure about his decision.", "thai": "เขารู้สึกไม่แน่ใจเกี่ยวกับการตัดสินใจ"}
{"word": "feel", "english": "I feel like I’m on top of the world.", "thai": "ฉันรู้สึกเหมือนอยู่บนจุดสูงสุดของโลก"}
{"word": "feel", "english": "She feels exhausted after the long hike.", "thai": "เธอรู้สึกเหนื่อยล้าหลังจากการเดินป่าที่ยาวนาน"}
{"word": "feel", "english": "I feel the softness of the blanket.", "thai": "ฉันรู้สึกถึงความนุ่มของผ้าห่ม"}
{"word": "feel", "english": "He feels annoyed by the loud noise.", "thai": "เขารู้สึกหงุดหงิดกับเสียงดัง"}
{"word": "feel", "english": "I don’t feel like cooking tonight.", "thai": "ฉันไม่อยากทำอาหารคืนนี้"}
{"word": "feel", "english": "She feels inspired by his speech.", "thai": "เธอรู้สึกได้รับแรงบันดาลใจจากคำพูดของเขา"}
{"word": "feel", "english": "I feel the heat from the oven.", "thai": "ฉันรู้สึกถึงความร้อนจากเตาอบ"}
{"word": "feel", "english": "He feels confident in his new suit.", "thai": "เขารู้สึกมั่นใจในชุดสูทใหม่"}
{"word": "feel", "english": "I feel a bit lost without my phone.", "thai": "ฉันรู้สึกหลงทางนิดหน่อยเมื่อไม่มีโทรศัพท์"}
{"word": "feel", "english": "She feels thrilled about the promotion.", "thai": "เธอรู้สึกตื่นเต้นกับการเลื่อนตำแหน่ง"}
{"word": "feel", "english": "I feel the sand sticking to my skin.", "thai": "ฉันรู้สึกถึงทรายที่ติดผิว"}
{"word": "feel", "english": "He feels betrayed by his friend.", "thai": "เขารู้สึกถูกหักหลังโดยเพื่อน"}
{"word": "feel", "english": "I feel like watching a movie tonight.", "thai": "ฉันอยากดูหนังคืนนี้"}
{"word": "feel", "english": "She feels scared in the dark.", "thai": "เธอรู้สึกกลัวในความมืด"}
{"word": "feel", "english": "I feel the rhythm of the song.", "thai": "ฉันรู้สึกถึงจังหวะของเพลง"}
{"word": "feel", "english": "He feels curious about the new neighbor.", "thai": "เขารู้สึกอยากรู้เกี่ยวกับเพื่อนบ้านใหม่"}
{"word": "feel", "english": "I feel a lump in my throat.", "thai": "ฉันรู้สึกเหมือนมีก้อนในลำคอ"}
{"word": "feel", "english": "She feels happy with her new home.", "thai": "เธอรู้สึกมีความสุขกับบ้านใหม่"}
{"word": "feel", "english": "I don’t feel up to going out tonight.", "thai": "ฉันไม่รู้สึกอยากออกไปข้างนอกคืนนี้"}
{"word": "feel", "english": "He feels the pain in his back.", "thai": "เขารู้สึกเจ็บที่หลัง"}
{"word": "feel", "english": "I feel like I’m getting stronger.", "thai": "ฉันรู้สึกเหมือนกำลังแข็งแกร่งขึ้น"}
{"word": "feel", "english": "She feels relaxed after yoga.", "thai": "เธอรู้สึกผ่อนคลายหลังโยคะ"}
{"word": "feel", "english": "I feel the breeze on my face.", "thai": "ฉันรู้สึกถึงสายลมที่พัดหน้า"}
{"word": "feel", "english": "He feels embarrassed about tripping.", "thai": "เขารู้สึกอายที่สะดุด"}
{"word": "feel", "english": "I feel like we’re being watched.", "thai": "ฉันรู้สึกเหมือนเรากำลังถูกจับตามอง"}
{"word": "feel", "english": "She feels proud of her daughter.", "thai": "เธอรู้สึกภูมิใจในลูกสาว"}
{"word": "feel", "english": "I feel the cold metal in my hand.", "thai": "ฉันรู้สึกถึงโลหะเย็นในมือ"}
{"word": "feel", "english": "He feels nervous about the interview.", "thai": "เขารู้สึกประหม่าเกี่ยวกับการสัมภาษณ์"}
{"word": "feel", "english": "I feel like I need more sleep.", "thai": "ฉันรู้สึกเหมือนต้องการนอนมากกว่านี้"}
{"word": "feel", "english": "She feels content with her life.", "thai": "เธอรู้สึกพอใจกับชีวิต"}
{"word": "feel", "english": "I feel the excitement in the air.", "thai": "ฉันรู้สึกถึงความตื่นเต้นในบรรยากาศ"}
{"word": "feel", "english": "He feels sad about leaving home.", "thai": "เขารู้สึกเศร้าเกี่ยวกับการจากบ้าน"}
{"word": "feel", "english": "I feel the softness of the pillow.", "thai": "ฉันรู้สึกถึงความนุ่มของหมอน"}
{"word": "feel", "english": "She feels hopeful about tomorrow.", "thai": "เธอรู้สึกมีความหวังเกี่ยวกับวันพรุ่งนี้"}
{"word": "feel", "english": "I don’t feel like arguing today.", "thai": "ฉันไม่อยากเถียงวันนี้"}
{"word": "feel", "english": "He feels the sting of the cold water.", "thai": "เขารู้สึกถึงความเย็นจัดของน้ำ"}
{"word": "feel", "english": "I feel like this is the right choice.", "thai": "ฉันรู้สึกว่านี่คือการเลือกที่ถูกต้อง"}
{"word": "feel", "english": "She feels amazed by the sunset.", "thai": "เธอรู้สึกทึ่งกับพระอาทิตย์ตก"}
{"word": "find", "english": "I can’t find my keys anywhere.", "thai": "ฉันหา钥匙ของฉันไม่เจอเลย"}
{"word": "find", "english": "Did you find the book you were looking for?", "thai": "คุณเจอหนังสือที่ตามหาอยู่ไหม"}
{"word": "find", "english": "She hopes to find a new job soon.", "thai": "เธอหวังว่าจะได้งานใหม่เร็วๆ นี้"}
{"word": "find", "english": "I find this movie really boring.", "thai": "ฉันรู้สึกว่าหนังเรื่องนี้น่าเบื่อมาก"}
{"word": "find", "english": "He tried to find his phone in the dark.", "thai": "เขาพยายามหาโทรศัพท์ในความมืด"}
{"word": "find", "english": "We need to find a solution to this problem.", "thai": "เราต้องหาทางแก้ปัญหานี้"}
{"word": "find", "english": "I find it hard to believe you.", "thai": "ฉันรู้สึกว่าเชื่อคุณได้ยาก"}
{"word": "find", "english": "She wants to find her lost dog.", "thai": "เธออยากหาสุนัขที่หายไป"}
{"word": "find", "english": "Can you find the restaurant on the map?", "thai": "คุณหาห้องอาหารบนแผนที่เจอไหม"}
{"word": "find", "english": "I find cooking to be very relaxing.", "thai": "ฉันรู้สึกว่าการทำอาหารผ่อนคลายมาก"}
{"word": "find", "english": "He couldn’t find his glasses this morning.", "thai": "เขาไม่เจอแว่นตาเช้านี้"}
{"word": "find", "english": "I hope we find a parking spot soon.", "thai": "ฉันหวังว่าเราจะเจอที่จอดรถเร็วๆ นี้"}
{"word": "find", "english": "She finds math to be really challenging.", "thai": "เธอรู้สึกว่าคณิตศาสตร์ท้าทายมาก"}
{"word": "find", "english": "I need to find my wallet before we leave.", "thai": "ฉันต้องหากระเป๋าสตางค์ก่อนที่เราจะไป"}
{"word": "find", "english": "He finds it easy to talk to strangers.", "thai": "เขารู้สึกว่าคุยกับคนแปลกหน้าง่าย"}
{"word": "find", "english": "Did you find any good deals at the store?", "thai": "คุณเจอของลดราคาดีๆ ที่ร้านไหม"}
{"word": "find", "english": "I find her new song really catchy.", "thai": "ฉันรู้สึกว่าเพลงใหม่ของเธอติดหูมาก"}
{"word": "find", "english": "We should find a better way to do this.", "thai": "เราควรหาวิธีที่ดีกว่านี้"}
{"word": "find", "english": "She couldn’t find her favorite sweater.", "thai": "เธอหาเสื้อสเวตเตอร์ตัวโปรดไม่เจอ"}
{"word": "find", "english": "I find mornings to be the best time to work.", "thai": "ฉันรู้สึกว่าเช้าเป็นเวลาที่ดีที่สุดในการทำงาน"}
{"word": "find", "english": "He needs to find his passport before the trip.", "thai": "เขาต้องหาหนังสือเดินทางก่อนเดินทาง"}
{"word": "find", "english": "I find this book incredibly inspiring.", "thai": "ฉันรู้สึกว่าหนังสือเล่มนี้ให้แรงบันดาลใจมาก"}
{"word": "find", "english": "Can you find the remote for the TV?", "thai": "คุณห่ารีโมททีวีเจอไหม"}
{"word": "find", "english": "She finds it difficult to focus in class.", "thai": "เธอรู้สึกว่ามีสมาธิในชั้นเรียนยาก"}
{"word": "find", "english": "I hope I find my sunglasses before the beach.", "thai": "ฉันหวังว่าจะเจอแว่นกันแดดก่อนไปชายหาด"}
{"word": "find", "english": "He finds running to be great exercise.", "thai": "เขารู้สึกว่าการวิ่งเป็นการออกกำลังกายที่ดี"}
{"word": "find", "english": "We need to find the source of the leak.", "thai": "เราต้องหาต้นตอของการรั่ว"}
{"word": "find", "english": "I find her jokes really funny.", "thai": "ฉันรู้สึกว่าเรื่องตลกของเธอขำมาก"}
{"word": "find", "english": "She couldn’t find her shoes in the closet.", "thai": "เธอห่ารองเท้าในตู้เสื้อผ้าไม่เจอ"}
{"word": "find", "english": "I find it hard to stay awake during meetings.", "thai": "ฉันรู้สึกว่าตื่นตัวในที่ประชุมยาก"}
{"word": "find", "english": "He wants to find a new hobby this year.", "thai": "เขาอยากหางานอดิเรกใหม่ในปีนี้"}
{"word": "find", "english": "Can you find the address for the party?", "thai": "คุณหาที่อยู่สำหรับงานปาร์ตี้เจอไหม"}
{"word": "find", "english": "I find this puzzle really confusing.", "thai": "ฉันรู้สึกว่าปริศนานี้สับสนมาก"}
{"word": "find", "english": "She needs to find her car keys now.", "thai": "เธอต้องหากุญแจรถเดี๋ยวนี้"}
{"word": "find", "english": "I find yoga to be very calming.", "thai": "ฉันรู้สึกว่าโยคะสงบมาก"}
{"word": "find", "english": "He couldn’t find the right words to say.", "thai": "เขาไม่เจอคำที่เหมาะสมจะพูด"}
{"word": "find", "english": "I hope we find a good restaurant tonight.", "thai": "ฉันหวังว่าเราจะเจอร้านอาหารดีๆ คืนนี้"}
{"word": "findទ", "english": "She finds it hard to make new friends.", "thai": "เธอรู้สึกว่าหาเพื่อนใหม่ยาก"}
{"word": "find", "english": "I find his accent quite charming.", "thai": "ฉันรู้สึกว่าสำเนียงของเขาน่ารักมาก"}
{"word": "find", "english": "We need to find a cheaper apartment.", "thai": "เราต้องหาอพาร์ตเมนต์ที่ถูกกว่า"}
{"word": "find", "english": "I can’t find my favorite pen.", "thai": "ฉันหาปากกาตัวโปรดไม่เจอ"}
{"word": "find", "english": "He finds history fascinating.", "thai": "เขารู้สึกว่าประวัติศาสตร์น่าทึ่ง"}
{"word": "find", "english": "Did you find your missing sock?", "thai": "คุณเจอถุงเท้าที่หายไปไหม"}
{"word": "find", "english": "I find this app really useful.", "thai": "ฉันรู้สึกว่าแอปนี้มีประโยชน์มาก"}
{"word": "find", "english": "She wants to find a new coffee shop.", "thai": "เธออยากหาร้านกาแฟใหม่"}
{"word": "find", "english": "I can’t find the charger for my phone.", "thai": "ฉันหาที่ชาร์จโทรศัพท์ไม่เจอ"}
{"word": "find", "english": "He finds public speaking terrifying.", "thai": "เขารู้สึกว่าการพูดในที่สาธารณะน่ากลัว"}
{"word": "find", "english": "We need to find a babysitter for tonight.", "thai": "เราต้องหาพี่เลี้ยงเด็กสำหรับคืนนี้"}
{"word": "find", "english": "I find this game really addictive.", "thai": "ฉันรู้สึกว่าเกมนี้ติดหนึบมาก"}
{"word": "find", "english": "She couldn’t find her earrings anywhere.", "thai": "เธอหาต่างหูไม่เจอเลย"}
{"word": "find", "english": "I find hiking to be great fun.", "thai": "ฉันรู้สึกว่าการเดินป่าสนุกมาก"}
{"word": "find", "english": "He needs to find his old notebook.", "thai": "เขาต้องหาสมุดบันทึกเก่า"}
{"word": "find", "english": "I find her smile very contagious.", "thai": "ฉันรู้สึกว่ารอยยิ้มของเธอติดต่อมาก"}
{"word": "find", "english": "Can you find the recipe for this dish?", "thai": "คุณหาสูตรอาหารนี้เจอไหม"}
{"word": "find", "english": "She finds it hard to wake up early.", "thai": "เธอรู้สึกว่าตื่นเช้ายาก"}
{"word": "find", "english": "I hope I find my scarf before winter.", "thai": "ฉันหวังว่าจะเจอผ้าพันคอก่อนหน้าหนาว"}
{"word": "find", "english": "He finds science fiction exciting.", "thai": "เขารู้สึกว่านิยายวิทยาศาสตร์น่าตื่นเต้น"}
{"word": "find", "english": "I can’t find my headphones anywhere.", "thai": "ฉันหาหูฟังไม่เจอเลย"}
{"word": "find", "english": "She finds painting very therapeutic.", "thai": "เธอรู้สึกว่าการวาดภาพบำบัดได้ดี"}
{"word": "find", "english": "We need to find a new gym to join.", "thai": "เราต้องหายิมใหม่เพื่อสมัคร"}
{"word": "find", "english": "I find this chair really comfortable.", "thai": "ฉันรู้สึกว่าเก้าอี้ตัวนี้สบายมาก"}
{"word": "find", "english": "He couldn’t find his tie for the event.", "thai": "เขาไม่เจอเนคไทสำหรับงานนี้"}
{"word": "find", "english": "I find her voice very soothing.", "thai": "ฉันรู้สึกว่าเสียงของเธอผ่อนคลายมาก"}
{"word": "find", "english": "She wants to find a good lawyer.", "thai": "เธออยากหาทนายที่ดี"}
{"word": "find", "english": "I can’t find the tickets for the concert.", "thai": "ฉันหาตั๋วคอนเสิร์ตไม่เจอ"}
{"word": "find", "english": "He finds chess to be very strategic.", "thai": "เขารู้สึกว่าหมากรุกมีกลยุทธ์มาก"}
{"word": "find", "english": "We need to find a gift for her birthday.", "thai": "เราต้องหาของขวัญวันเกิดให้เธอ"}
{"word": "find", "english": "I find this weather perfect for a walk.", "thai": "ฉันรู้สึกว่าอากาศนี้เหมาะสำหรับการเดินเล่น"}
{"word": "find", "english": "She couldn’t find her umbrella today.", "thai": "เธอห่าร่มไม่เจอวันนี้"}
{"word": "find", "english": "I find learning languages fascinating.", "thai": "ฉันรู้สึกว่าการเรียนภาษาน่าทึ่ง"}
{"word": "find", "english": "He needs to find a new pair of shoes.", "thai": "เขาต้องหารองเท้าคู่ใหม่"}
{"word": "find", "english": "I find this restaurant’s food amazing.", "thai": "ฉันรู้สึกว่าอาหารของร้านนี้น่าทึ่ง"}
{"word": "find", "english": "Can you find the instructions for this game?", "thai": "คุณหาคำแนะนำสำหรับเกมนี้เจอไหม"}
{"word": "find", "english": "She finds it hard to say no.", "thai": "เธอรู้สึกว่าปฏิเสธยาก"}
{"word": "find", "english": "I hope I find my jacket before it gets cold.", "thai": "ฉันหวังว่าจะเจอแจ็คเก็ตก่อนอากาศหนาว"}
{"word": "find", "english": "He finds gardening very relaxing.", "thai": "เขารู้สึกว่าการทำสวนผ่อนคลายมาก"}
{"word": "find", "english": "I can’t find my favorite hat.", "thai": "ฉันหาหมวกตัวโปรดไม่เจอ"}
{"word": "find", "english": "She finds horror movies too scary.", "thai": "เธอรู้สึกว่าหนังสยองขวัญน่ากลัวเกินไป"}
{"word": "find", "english": "We need to find a new place to live.", "thai": "เราต้องหาที่อยู่อาศัยใหม่"}
{"word": "find", "english": "I find this song really uplifting.", "thai": "ฉันรู้สึกว่าเพลงนี้ทำให้รู้สึกดี"}
{"word": "find", "english": "He couldn’t find his watch this morning.", "thai": "เขาไม่เจอนาฬิกาเช้านี้"}
{"word": "find", "english": "I find her stories very entertaining.", "thai": "ฉันรู้สึกว่านิทานของเธอสนุกมาก"}
{"word": "find", "english": "She wants to find a better school.", "thai": "เธออยากหาโรงเรียนที่ดีกว่า"}
{"word": "find", "english": "I can’t find my charger anywhere.", "thai": "ฉันหาที่ชาร์จไม่เจอเลย"}
{"word": "find", "english": "He finds old movies very nostalgic.", "thai": "เขารู้สึกว่าหนังเก่าทำให้คิดถึงอดีตมาก"}
{"word": "find", "english": "We need to find a good doctor.", "thai": "เราต้องหาหมอที่ดี"}
{"word": "find", "english": "I find this coffee too bitter.", "thai": "ฉันรู้สึกว่ากาแฟนี้ขมเกินไป"}
{"word": "find", "english": "She couldn’t find her notebook in her bag.", "thai": "เธอหาสมุดบันทึกในกระเป๋าไม่เจอ"}
{"word": "find", "english": "I find traveling to be very exciting.", "thai": "ฉันรู้สึกว่าการเดินทางน่าตื่นเต้นมาก"}
{"word": "find", "english": "He needs to find his missing glove.", "thai": "เขาต้องหาถุงมือที่หายไป"}
{"word": "find", "english": "I find this view absolutely stunning.", "thai": "ฉันรู้สึกว่าวิวนี้สวยงามมาก"}
{"word": "find", "english": "Can you find the menu for this restaurant?", "thai": "คุณหาเมนูของร้านนี้เจอไหม"}
{"word": "find", "english": "She finds it hard to keep secrets.", "thai": "เธอรู้สึกว่าการเก็บความลับยาก"}
{"word": "find", "english": "I hope I find my ring before the party.", "thai": "ฉันหวังว่าจะเจอแหวนก่อนงานปาร์ตี้"}
{"word": "find", "english": "He finds puzzles very engaging.", "thai": "เขารู้สึกว่าปริศนาน่าดึงดูดมาก"}
{"word": "find", "english": "I can’t find my umbrella anywhere.", "thai": "ฉันห่าร่มไม่เจอเลย"}
{"word": "find", "english": "She finds classical music very soothing.", "thai": "เธอรู้สึกว่าดนตรีคลาสสิกผ่อนคลายมาก"}
{"word": "find", "english": "We need to find a new hiking trail.", "thai": "เราต้องหาเส้นทางเดินป่าใหม่"}
{"word": "find", "english": "I find this book very thought-provoking.", "thai": "ฉันรู้สึกว่าหนังสือเล่มนี้ชวนให้คิด"}
{"word": "finish", "english": "I need to finish my homework tonight.", "thai": "ฉันต้องทำการบ้านให้เสร็จคืนนี้"}
{"word": "finish", "english": "Did you finish writing the report?", "thai": "คุณเขียนรายงานเสร็จหรือยัง"}
{"word": "finish", "english": "She wants to finish the race strong.", "thai": "เธออยากจบการแข่งขันอย่างแข็งแกร่ง"}
{"word": "finish", "english": "I’ll finish this book by tomorrow.", "thai": "ฉันจะอ่านหนังสือเล่มนี้ให้จบภายในพรุ่งนี้"}
{"word": "finish", "english": "He didn’t finish his dinner.", "thai": "เขาไม่กินอาหารเย็นจนหมด"}
{"word": "finish", "english": "We need to finish painting the room.", "thai": "เราต้องทาสีห้องให้เสร็จ"}
{"word": "finish", "english": "Can you finish this puzzle with me?", "thai": "คุณช่วยต่อปริศนานี้ให้เสร็จกับฉันได้ไหม"}
{"word": "finish", "english": "She’s trying to finish her project on time.", "thai": "เธอกำลังพยายามทำโปรเจกต์ให้เสร็จทันเวลา"}
{"word": "finish", "english": "I forgot to finish my chores yesterday.", "thai": "เมื่อวานฉันลืมทำธุระให้เสร็จ"}
{"word": "finish", "english": "He’ll finish his workout in an hour.", "thai": "เขาจะออกกำลังกายเสร็จในหนึ่งชั่วโมง"}
{"word": "finish", "english": "Let’s finish this game before dinner.", "thai": "มาจบเกมนี้ก่อนอาหารเย็นกันเถอะ"}
{"word": "finish", "english": "I can’t wait to finish this movie.", "thai": "ฉันรอไม่ไหวที่จะดูหนังเรื่องนี้ให้จบ"}
{"word": "finish", "english": "She didn’t finish her coffee.", "thai": "เธอดื่มกาแฟไม่หมด"}
{"word": "finish", "english": "We need to finish cleaning the house.", "thai": "เราต้องทำความสะอาดบ้านให้เสร็จ"}
{"word": "finish", "english": "He wants to finish the book tonight.", "thai": "เขาอยากอ่านหนังสือให้จบคืนนี้"}
{"word": "finish", "english": "I’ll finish writing the email soon.", "thai": "ฉันจะเขียนอีเมลให้เสร็จเร็วๆ นี้"}
{"word": "finish", "english": "Did they finish building the bridge?", "thai": "พวกเขาสร้างสะพานเสร็จหรือยัง"}
{"word": "finish", "english": "She needs to finish her presentation.", "thai": "เธอต้องทำพรีเซนเทชันให้เสร็จ"}
{"word": "finish", "english": "I forgot to finish my essay.", "thai": "ฉันลืมเขียนเรียงความให้จบ"}
{"word": "finish", "english": "He’ll finish his shift at six.", "thai": "เขาจะทำงานกะของเขาเสร็จตอนหกโมง"}
{"word": "finish", "english": "Let’s finish this puzzle tonight.", "thai": "มาจบปริศนานี้คืนนี้กันเถอะ"}
{"word": "finish", "english": "I didn’t finish my lunch today.", "thai": "วันนี้ฉันกินข้าวเที่ยงไม่หมด"}
{"word": "finish", "english": "She wants to finish her knitting project.", "thai": "เธออยากถักนิตติ้งให้เสร็จ"}
{"word": "finish", "english": "We should finish the repairs by Friday.", "thai": "เราควรซ่อมให้เสร็จภายในวันศุกร์"}
{"word": "finish", "english": "He’s trying to finish his math homework.", "thai": "เขากำลังพยายามทำการบ้านคณิตศาสตร์ให้เสร็จ"}
{"word": "finish", "english": "I’ll finish this call in a minute.", "thai": "ฉันจะคุยโทรศัพท์ให้จบในอีกนาที"}
{"word": "finish", "english": "Did you finish reading the article?", "thai": "คุณอ่านบทความนั้นจบหรือยัง"}
{"word": "finish", "english": "She didn’t finish her workout today.", "thai": "วันนี้เธอออกกำลังกายไม่จบ"}
{"word": "finish", "english": "We need to finish the cake before the party.", "thai": "เราต้องทำเค้กให้เสร็จก่อนงานปาร์ตี้"}
{"word": "finish", "english": "I want to finish this level of the game.", "thai": "ฉันอยากเล่นเกมเลเวลนี้ให้จบ"}
{"word": "finish", "english": "He forgot to finish his application.", "thai": "เขาลืมกรอกใบสมัครให้เสร็จ"}
{"word": "finish", "english": "Let’s finish organizing the files today.", "thai": "มาจัดแฟ้มให้เสร็จวันนี้กันเถอะ"}
{"word": "finish", "english": "She’ll finish her painting this weekend.", "thai": "เธอจะวาดภาพให้เสร็จสุดสัปดาห์นี้"}
{"word": "finish", "english": "I didn’t finish my tea this morning.", "thai": "เช้านี้ฉันดื่มชาไม่หมด"}
{"word": "finish", "english": "He needs to finish his speech for tomorrow.", "thai": "เขาต้องเขียนคำปราศรัยให้เสร็จสำหรับพรุ่งนี้"}
{"word": "finish", "english": "We should finish the project by next week.", "thai": "เราควรทำโปรเจกต์ให้เสร็จภายในสัปดาห์หน้า"}
{"word": "finish", "english": "I’ll finish my chores before lunch.", "thai": "ฉันจะทำธุระให้เสร็จก่อนอาหารเที่ยง"}
{"word": "finish", "english": "Did she finish her homework yet?", "thai": "เธอทำการบ้านเสร็จหรือยัง"}
{"word": "finish", "english": "He wants to finish the marathon this year.", "thai": "เขาอยากวิ่งมาราธอนให้จบในปีนี้"}
{"word": "finish", "english": "I can’t finish this sandwich; I’m full.", "thai": "ฉันกินแซนด์วิชนี้ไม่หมด ฉันอิ่มแล้ว"}
{"word": "finish", "english": "She’s trying to finish her novel.", "thai": "เธอกำลังพยายามเขียนนิยายให้จบ"}
{"word": "finish", "english": "We need to finish packing for the trip.", "thai": "เราต้องเก็บกระเป๋าให้เสร็จสำหรับการเดินทาง"}
{"word": "finish", "english": "I forgot to finish my laundry yesterday.", "thai": "เมื่อวานฉันลืมซักผ้าให้เสร็จ"}
{"word": "finish", "english": "He’ll finish his exam in an hour.", "thai": "เขาจะสอบเสร็จในหนึ่งชั่วโมง"}
{"word": "finish", "english": "Let’s finish decorating the room today.", "thai": "มาตกแต่งห้องให้เสร็จวันนี้กันเถอะ"}
{"word": "finish", "english": "I didn’t finish my book yet.", "thai": "ฉันยังอ่านหนังสือไม่จบ"}
{"word": "finish", "english": "She wants to finish her yoga session.", "thai": "เธออยากฝึกโยคะให้จบ"}
{"word": "finish", "english": "We should finish the dishes before bed.", "thai": "เราควรล้างจานให้เสร็จก่อนเข้านอน"}
{"word": "finish", "english": "He’s trying to finish his drawing.", "thai": "เขากำลังพยายามวาดภาพให้เสร็จ"}
{"word": "finish", "english": "I’ll finish this letter by tonight.", "thai": "ฉันจะเขียนจดหมายนี้ให้เสร็จคืนนี้"}
{"word": "finish", "english": "Did you finish your workout routine?", "thai": "คุณออกกำลังกายตามโปรแกรมเสร็จหรือยัง"}
{"word": "finish", "english": "She didn’t finish her soup.", "thai": "เธอกินซุปไม่หมด"}
{"word": "finish", "english": "We need to finish the budget plan.", "thai": "เราต้องทำแผนงบประมาณให้เสร็จ"}
{"word": "finish", "english": "I want to finish this chapter today.", "thai": "ฉันอยากอ่านบทนี้ให้จบวันนี้"}
{"word": "finish", "english": "He forgot to finish his paperwork.", "thai": "เขาลืมทำเอกสารให้เสร็จ"}
{"word": "finish", "english": "Let’s finish the yard work this afternoon.", "thai": "มาทำงานในสวนให้เสร็จบ่ายนี้กันเถอะ"}
{"word": "finish", "english": "She’ll finish her sewing project soon.", "thai": "เธอจะเย็บผ้าให้เสร็จเร็วๆ นี้"}
{"word": "finish", "english": "I didn’t finish my juice today.", "thai": "วันนี้ฉันดื่มน้ำผลไม้ไม่หมด"}
{"word": "finish", "english": "He needs to finish his essay tonight.", "thai": "เขาต้องเขียนเรียงความให้เสร็จคืนนี้"}
{"word": "finish", "english": "We should finish the repairs by tomorrow.", "thai": "เราควรซ่อมให้เสร็จภายในพรุ่งนี้"}
{"word": "finish", "english": "I’ll finish my coffee in a minute.", "thai": "ฉันจะดื่มกาแฟให้หมดในอีกนาที"}
{"word": "finish", "english": "Did they finish the construction yet?", "thai": "พวกเขาสร้างเสร็จหรือยัง"}
{"word": "finish", "english": "She wants to finish her puzzle tonight.", "thai": "เธออยากต่อปริศนาให้เสร็จคืนนี้"}
{"word": "finish", "english": "I can’t finish this cake; it’s too big.", "thai": "ฉันกินเค้กนี้ไม่หมด มันใหญ่เกินไป"}
{"word": "finish", "english": "He’s trying to finish his coding project.", "thai": "เขากำลังพยายามทำโปรเจกต์เขียนโค้ดให้เสร็จ"}
{"word": "finish", "english": "We need to finish organizing the event.", "thai": "เราต้องจัดงานให้เสร็จ"}
{"word": "finish", "english": "I forgot to finish my journal entry.", "thai": "ฉันลืมเขียนบันทึกประจำวันให้จบ"}
{"word": "finish", "english": "He’ll finish his presentation soon.", "thai": "เขาจะทำพรีเซนเทชันให้เสร็จเร็วๆ นี้"}
{"word": "finish", "english": "Let’s finish cleaning the garage today.", "thai": "มาทำความสะอาดโรงรถให้เสร็จวันนี้กันเถอะ"}
{"word": "finish", "english": "I didn’t finish my homework last night.", "thai": "เมื่อคืนฉันทำการบ้านไม่จบ"}
{"word": "finish", "english": "She wants to finish her workout routine.", "thai": "เธออยากออกกำลังกายตามโปรแกรมให้จบ"}
{"word": "finish", "english": "We should finish the report by Monday.", "thai": "เราควรทำรายงานให้เสร็จภายในวันจันทร์"}
{"word": "finish", "english": "I’ll finish this song in a moment.", "thai": "ฉันจะร้องเพลงนี้ให้จบในอีกครู่"}
{"word": "finish", "english": "Did you finish your painting yet?", "thai": "คุณวาดภาพเสร็จหรือยัง"}
{"word": "finish", "english": "He didn’t finish his breakfast.", "thai": "เขาไม่กินอาหารเช้าจนหมด"}
{"word": "finish", "english": "We need to finish planning the trip.", "thai": "เราต้องวางแผนการเดินทางให้เสร็จ"}
{"word": "finish", "english": "I want to finish this game level tonight.", "thai": "ฉันอยากเล่นเกมเลเวลนี้ให้จบคืนนี้"}
{"word": "finish", "english": "She forgot to finish her application form.", "thai": "เธอลืมกรอกใบสมัครให้เสร็จ"}
{"word": "finish", "english": "Let’s finish the meeting early today.", "thai": "มาจบการประชุมเร็วๆ วันนี้กันเถอะ"}
{"word": "finish", "english": "He’ll finish his book by next month.", "thai": "เขาจะอ่านหนังสือให้จบภายในเดือนหน้า"}
{"word": "finish", "english": "I didn’t finish my salad at lunch.", "thai": "ตอนเที่ยงฉันกินสลัดไม่หมด"}
{"word": "finish", "english": "She needs to finish her speech for the event.", "thai": "เธอต้องเขียนคำปราศรัยสำหรับงานให้เสร็จ"}
{"word": "finish", "english": "We should finish the decorations tonight.", "thai": "เราควรตกแต่งให้เสร็จคืนนี้"}
{"word": "finish", "english": "I’ll finish my email before the meeting.", "thai": "ฉันจะเขียนอีเมลให้เสร็จก่อนการประชุม"}
{"word": "finish", "english": "Did she finish her knitting yet?", "thai": "เธอถักนิตติ้งเสร็จหรือยัง"}
{"word": "finish", "english": "He wants to finish his run before dark.", "thai": "เขาอยากวิ่งให้จบก่อนมืด"}
{"word": "finish", "english": "I can’t finish this drink; it’s too sweet.", "thai": "ฉันดื่มเครื่องดื่มนี้ไม่หมด มันหวานเกินไป"}
{"word": "finish", "english": "She’s trying to finish her homework early.", "thai": "เธอกำลังพยายามทำการบ้านให้เสร็จเร็ว"}
{"word": "finish", "english": "We need to finish the budget today.", "thai": "เราต้องทำงบประมาณให้เสร็จวันนี้"}
{"word": "finish", "english": "I forgot to finish my drawing yesterday.", "thai": "เมื่อวานฉันลืมวาดภาพให้เสร็จ"}
{"word": "finish", "english": "He’ll finish his shift in an hour.", "thai": "เขาจะทำงานกะของเขาเสร็จในหนึ่งชั่วโมง"}
{"word": "finish", "english": "Let’s finish the book club discussion.", "thai": "มาจบการสนทนาชมรมหนังสือกันเถอะ"}
{"word": "finish", "english": "I didn’t finish my workout yesterday.", "thai": "เมื่อวานฉันออกกำลังกายไม่จบ"}
{"word": "finish", "english": "She wants to finish her journal tonight.", "thai": "เธออยากเขียนบันทึกประจำวันให้จบคืนนี้"}
{"word": "finish", "english": "We should finish the game before dinner.", "thai": "เราควรเล่นเกมให้จบก่อนอาหารเย็น"}
{"word": "finish", "english": "I’ll finish this task by noon.", "thai": "ฉันจะทำงานนี้ให้เสร็จภายในเที่ยง"}
{"word": "finish", "english": "Did you finish your letter yet?", "thai": "คุณเขียนจดหมายเสร็จหรือยัง"}
{"word": "finish", "english": "He didn’t finish his project on time.", "thai": "เขาไม่ทำโปรเจกต์ให้เสร็จทันเวลา"}
{"word": "fly", "english": "I want to fly to Paris next summer.", "thai": "ฉันอยากบินไปปารีสซัมเมอร์หน้า"}
{"word": "fly", "english": "Did you see that bird fly over the house?", "thai": "คุณเห็นนกตัวนั้นบินผ่านบ้านไหม"}
{"word": "fly", "english": "She’s afraid to fly in small planes.", "thai": "เธอกลัวการบินด้วยเครื่องบินเล็ก"}
{"word": "fly", "english": "The fly landed on my food.", "thai": "แมลงวันเกาะบนอาหารของฉัน"}
{"word": "fly", "english": "He let his kite fly high in the sky.", "thai": "เขาปล่อยให้ว่าวของเขาบินสูงในท้องฟ้า"}
{"word": "fly", "english": "We need to fly out early tomorrow.", "thai": "เราต้องบินออกแต่เช้าพรุ่งนี้"}
{"word": "fly", "english": "I saw a butterfly fly near the flowers.", "thai": "ฉันเห็นผีเสื้อบินใกล้ดอกไม้"}
{"word": "fly", "english": "She wants to fly first class this time.", "thai": "เธออยากบินชั้นหนึ่งครั้งนี้"}
{"word": "fly", "english": "The plane will fly over the ocean.", "thai": "เครื่องบินจะบินข้ามมหาสมุทร"}
{"word": "fly", "english": "A fly keeps buzzing around the room.", "thai": "แมลงวันบินวนอยู่ในห้อง"}
{"word": "fly", "english": "I’d love to fly a helicopter one day.", "thai": "ฉันอยากขับเฮลิคอปเตอร์สักวันหนึ่ง"}
{"word": "fly", "english": "He saw the flag fly in the wind.", "thai": "เขาเห็นธงโบกสะบัดในสายลม"}
{"word": "fly", "english": "We can’t fly in this stormy weather.", "thai": "เราไม่สามารถบินในสภาพอากาศพายุแบบนี้ได้"}
{"word": "fly", "english": "The fly got caught in the spiderweb.", "thai": "แมลงวันติดอยู่ในใยแมงมุม"}
{"word": "fly", "english": "She’s learning to fly a drone.", "thai": "เธอกำลังเรียนขับโดรน"}
{"word": "fly", "english": "I watched the birds fly south for winter.", "thai": "ฉันดูนกบินไปทางใต้ในฤดูหนาว"}
{"word": "fly", "english": "He wants to fly to Japan for vacation.", "thai": "เขาอยากบินไปญี่ปุ่นเพื่อพักผ่อน"}
{"word": "fly", "english": "A fly is stuck on the sticky trap.", "thai": "แมลงวันติดอยู่ในกับดักเหนียว"}
{"word": "fly", "english": "The pilot will fly the plane tonight.", "thai": "นักบินจะขับเครื่องบินคืนนี้"}
{"word": "fly", "english": "I saw a hawk fly above the trees.", "thai": "ฉันเห็นเหยี่ยวบินเหนือต้นไม้"}
{"word": "fly", "english": "She doesn’t like to fly long distances.", "thai": "เธอไม่ชอบบินระยะไกล"}
{"word": "fly", "english": "The fly was buzzing near my ear.", "thai": "แมลงวันบินหึ่งใกล้หูของฉัน"}
{"word": "fly", "english": "I want to fly a kite this weekend.", "thai": "ฉันอยากปล่อยว่าวสุดสัปดาห์นี้"}
{"word": "fly", "english": "The plane will fly at low altitude.", "thai": "เครื่องบินจะบินในระดับความสูงต่ำ"}
{"word": "fly", "english": "He saw a dragonfly fly over the pond.", "thai": "เขาเห็นแมลงปอบินเหนือสระน้ำ"}
{"word": "fly", "english": "We need to fly back home tomorrow.", "thai": "เราต้องบินกลับบ้านพรุ่งนี้"}
{"word": "fly", "english": "The fly landed on the window.", "thai": "แมลงวันเกาะที่หน้าต่าง"}
{"word": "fly", "english": "She’s excited to fly to New York.", "thai": "เธอตื่นเต้นที่จะบินไปนิวยอร์ก"}
{"word": "fly", "english": "I watched the balloons fly high above.", "thai": "ฉันดูบอลลูนบินสูงขึ้นไป"}
{"word": "fly", "english": "He wants to fly a private jet someday.", "thai": "เขาอยากขับเครื่องบินส่วนตัวสักวันหนึ่ง"}
{"word": "fly", "english": "A fly keeps circling the kitchen.", "thai": "แมลงวันบินวนอยู่ในครัว"}
{"word": "fly", "english": "The birds fly in formation every morning.", "thai": "นกบินเป็นแถวทุกเช้า"}
{"word": "fly", "english": "I’d love to fly to Hawaii for a break.", "thai": "ฉันอยากบินไปฮาวายเพื่อพักผ่อน"}
{"word": "fly", "english": "The fly got away before I could swat it.", "thai": "แมลงวันหนีไปก่อนที่ฉันจะตีมัน"}
{"word": "fly", "english": "She’ll fly across the country next week.", "thai": "เธอจะบินข้ามประเทศสัปดาห์หน้า"}
{"word": "fly", "english": "I saw a bat fly out of the cave.", "thai": "ฉันเห็นค้างคาวบินออกจากถ้ำ"}
{"word": "fly", "english": "He wants to fly a glider next summer.", "thai": "เขาอยากขับเครื่องร่อนซัมเมอร์หน้า"}
{"word": "fly", "english": "The fly was annoying me all day.", "thai": "แมลงวันรบกวนฉันทั้งวัน"}
{"word": "fly", "english": "We can fly direct to Chicago.", "thai": "เราสามารถบินตรงไปชิคาโกได้"}
{"word": "fly", "english": "I watched a bee fly from flower to flower.", "thai": "ฉันดูผึ้งบินจากดอกไม้หนึ่งไปอีกดอก"}
{"word": "fly", "english": "She’s nervous to fly during turbulence.", "thai": "เธอกังวลที่จะบินในช่วงที่มีการสั่นสะเทือน"}
{"word": "fly", "english": "The fly got stuck in the syrup.", "thai": "แมลงวันติดอยู่ในน้ำเชื่อม"}
{"word": "fly", "english": "He wants to fly to Europe next year caravan.", "thai": "เขาอยากบินไปยุโรปปีหน้า"}
{"word": "fly", "english": "I saw an eagle fly over the mountain.", "thai": "ฉันเห็นนกอินทรีบินเหนือภูเขา"}
{"word": "fly", "english": "We need to fly out before the storm hits.", "thai": "เราต้องบินออกก่อนพายุมา"}
{"word": "fly", "english": "The fly kept landing on my arm.", "thai": "แมลงวันเกาะที่แขนฉันตลอด"}
{"word": "fly", "english": "She’ll fly to Florida for the holidays.", "thai": "เธอจะบินไปฟลอริดาสำหรับวันหยุด"}
{"word": "fly", "english": "I watched the leaves fly in the wind.", "thai": "ฉันดูใบไม้ปลิวไปในสายลม"}
{"word": "fly", "english": "He wants to learn to fly a plane.", "thai": "เขาอยากเรียนขับเครื่องบิน"}
{"word": "fly", "english": "A fly is buzzing near the lamp.", "thai": "แมลงวันบินหึ่งใกล้โคมไฟ"}
{"word": "fly", "english": "The plane will fly at night.", "thai": "เครื่องบินจะบินตอนกลางคืน"}
{"word": "fly", "english": "I saw a hummingbird fly by the feeder.", "thai": "ฉันเห็นนกฮัมมิงเบิร์ดบินผ่านที่ให้อาหาร"}
{"word": "fly", "english": "She doesn’t want to fly during the storm.", "thai": "เธอไม่อยากบินในช่วงพายุ"}
{"word": "fly", "english": "The fly landed on my sandwich.", "thai": "แมลงวันเกาะบนแซนด์วิชของฉัน"}
{"word": "fly", "english": "I’d love to fly to Australia someday.", "thai": "ฉันอยากบินไปออสเตรเลียสักวัน"}
{"word": "fly", "english": "He saw a flock of birds fly overhead.", "thai": "เขาเห็นฝูงนกบินเหนือศีรษะ"}
{"word": "fly", "english": "We can’t fly until the fog clears.", "thai": "เราไม่สามารถบินได้จนกว่าหมอกจะจาง"}
{"word": "fly", "english": "The fly was caught in the jar.", "thai": "แมลงวันถูกจับในโหล"}
{"word": "fly", "english": "She’s excited to fly to London.", "thai": "เธอตื่นเต้นที่จะบินไปลอนดอน"}
{"word": "fly", "english": "I watched a plane fly low over the city.", "thai": "ฉันดูเครื่องบินบินต่ำเหนือเมือง"}
{"word": "fly", "english": "He wants to fly a hot air balloon.", "thai": "เขาอยากขับบอลลูนลมร้อน"}
{"word": "fly", "english": "The fly keeps landing on the table.", "thai": "แมลงวันเกาะที่โต๊ะตลอด"}
{"word": "fly", "english": "We’ll fly to California next month.", "thai": "เราจะบินไปแคลิฟอร์เนียเดือนหน้า"}
{"word": "fly", "english": "I saw a wasp fly into the room.", "thai": "ฉันเห็นตัวต่อบินเข้ามาในห้อง"}
{"word": "fly", "english": "She’s scared to fly over the ocean.", "thai": "เธอกลัวการบินข้ามมหาสมุทร"}
{"word": "fly", "english": "The fly was annoying everyone at the picnic.", "thai": "แมลงวันรบกวนทุกคนในงานปิกนิก"}
{"word": "fly", "english": "I want to fly to Thailand for vacation.", "thai": "ฉันอยากบินไปประเทศไทยเพื่อพักผ่อน"}
{"word": "fly", "english": "He saw a seagull fly near the beach.", "thai": "เขาเห็นนกนางนวลบินใกล้ชายหาด"}
{"word": "fly", "english": "We need to fly early to avoid delays.", "thai": "เราต้องบินแต่เช้าเพื่อหลีกเลี่ยงความล่าช้า"}
{"word": "fly", "english": "The fly got stuck on the tape.", "thai": "แมลงวันติดอยู่บนเทปกาว"}
{"word": "fly", "english": "She’ll fly to Miami for the weekend.", "thai": "เธอจะบินไปไมอามีสำหรับสุดสัปดาห์"}
{"word": "fly", "english": "I watched the sparks fly from the fire.", "thai": "ฉันดูประกายไฟปลิวจากกองไฟ"}
{"word": "fly", "english": "He wants to fly a model airplane.", "thai": "เขาอยากขับเครื่องบินจำลอง"}
{"word": "fly", "english": "The fly was buzzing around the trash.", "thai": "แมลงวันบินหึ่งรอบถังขยะ"}
{"word": "fly", "english": "We can fly nonstop to Boston.", "thai": "เราสามารถบินตรงไปบอสตันได้"}
{"word": "fly", "english": "I saw a moth fly near the light.", "thai": "ฉันเห็นมอดบินใกล้แสงไฟ"}
{"word": "fly", "english": "She doesn’t like to fly at night.", "thai": "เธอไม่ชอบบินตอนกลางคืน"}
{"word": "fly", "english": "The fly landed on the fruit bowl.", "thai": "แมลงวันเกาะบนชามผลไม้"}
{"word": "fly", "english": "I’d love to fly to Iceland one day.", "thai": "ฉันอยากบินไปไอซ์แลนด์สักวัน"}
{"word": "fly", "english": "He saw a crow fly into the tree.", "thai": "เขาเห็นอีกาบินเข้าไปในต้นไม้"}
{"word": "fly", "english": "We can’t fly until the runway is clear.", "thai": "เราไม่สามารถบินได้จนกว่าทางวิ่งจะว่าง"}
{"word": "fly", "english": "The fly was caught in the net.", "thai": "แมลงวันถูกจับในตาข่าย"}
{"word": "fly", "english": "She’ll fly to Paris for work.", "thai": "เธอจะบินไปปารีสเพื่อทำงาน"}
{"word": "fly", "english": "I watched the helicopter fly overhead.", "thai": "ฉันดูเฮลิคอปเตอร์บินเหนือศีรษะ"}
{"word": "fly", "english": "He wants to fly a paraglider someday.", "thai": "เขาอยากขับร่มร่อนสักวันหนึ่ง"}
{"word": "fly", "english": "The fly kept buzzing near my face.", "thai": "แมลงวันบินหึ่งใกล้หน้าฉัน"}
{"word": "fly", "english": "We’ll fly to Texas next week.", "thai": "เราจะบินไปเท็กซัสสัปดาห์หน้า"}
{"word": "fly", "english": "I saw a ladybug fly away.", "thai": "ฉันเห็นเต่าทองบินหนีไป"}
{"word": "fly", "english": "She’s nervous to fly in bad weather.", "thai": "เธอกังวลที่จะบินในสภาพอากาศแย่"}
{"word": "fly", "english": "The fly got trapped in the bottle.", "thai": "แมลงวันติดอยู่ในขวด"}
{"word": "fly", "english": "I want to fly to Brazil for Carnival.", "thai": "ฉันอยากบินไปบราซิลเพื่องานคาร์นิวัล"}
{"word": "fly", "english": "He saw a pigeon fly onto the roof.", "thai": "เขาเห็นนกพิราบบินขึ้นไปบนหลังคา"}
{"word": "fly", "english": "We need to fly before the airport closes.", "thai": "เราต้องบินก่อนที่สนามบินจะปิด"}
{"word": "fly", "english": "The fly was buzzing around the food.", "thai": "แมลงวันบินหึ่งรอบอาหาร"}
{"word": "fly", "english": "She’ll fly to Seattle for the conference.", "thai": "เธอจะบินไปซีแอตเทิลเพื่อประชุม"}
{"word": "fly", "english": "I watched the drone fly over the park.", "thai": "ฉันดูโดรนบินเหนือสวนสาธารณะ"}
{"word": "fly", "english": "He wants to fly a stunt plane.", "thai": "เขาอยากขับเครื่องบินผาดโผน"}
{"word": "fly", "english": "The fly landed on my book.", "thai": "แมลงวันเกาะบนหนังสือของฉัน"}
{"word": "fly", "english": "We’ll fly to Hawaii for our honeymoon.", "thai": "เราจะบินไปฮาวายสำหรับฮันนีมูน"}
{"word": "fly", "english": "I saw a flock of geese fly in a V shape.", "thai": "ฉันเห็นฝูงห่านบินเป็นรูปตัววี"}
{"word": "fly", "english": "She doesn’t want to fly during the holidays.", "thai": "เธอไม่อยากบินในช่วงวันหยุด"}
{"word": "fly", "english": "The fly was caught in the curtain.", "thai": "แมลงวันติดอยู่ในม่าน"}
{"word": "follow", "english": "I’ll follow you to the store.", "thai": "ฉันจะตามคุณไปที่ร้าน"}
{"word": "follow", "english": "Did you follow the recipe exactly?", "thai": "คุณทำตามสูตรเป๊ะๆ หรือเปล่า"}
{"word": "follow", "english": "She wants to follow her dreams.", "thai": "เธออยากตามความฝันของตัวเอง"}
{"word": "follow", "english": "He decided to follow the path to the lake.", "thai": "เขาตัดสินใจตามเส้นทางไปที่ทะเลสาบ"}
{"word": "follow", "english": "Can you follow the instructions on the box?", "thai": "คุณทำตามคำแนะนำบนกล่องได้ไหม"}
{"word": "follow", "english": "I follow her on social media.", "thai": "ฉันติดตามเธอบนโซเชียลมีเดีย"}
{"word": "follow", "english": "The dog will follow you anywhere.", "thai": "สุนัขจะตามคุณไปทุกที่"}
{"word": "follow", "english": "We need to follow the rules of the game.", "thai": "เราต้องทำตามกฎของเกม"}
{"word": "follow", "english": "She didn’t follow the teacher’s advice.", "thai": "เธอไม่ได้ทำตามคำแนะนำของครู"}
{"word": "follow", "english": "I can’t follow what you’re saying.", "thai": "ฉันตามไม่ทันที่คุณพูด"}
{"word": "follow", "english": "He wants to follow in his father’s footsteps.", "thai": "เขาอยากตามรอยพ่อของเขา"}
{"word": "follow", "english": "Follow me to the meeting room.", "thai": "ตามฉันไปที่ห้องประชุม"}
{"word": "follow", "english": "Did they follow the map correctly?", "thai": "พวกเขาทำตามแผนที่ถูกต้องหรือเปล่า"}
{"word": "follow", "english": "I follow the news every morning.", "thai": "ฉันติดตามข่าวทุกเช้า"}
{"word": "follow", "english": "She’ll follow the diet plan this month.", "thai": "เธอจะทำตามแผนไดเอ็ตเดือนนี้"}
{"word": "follow", "english": "The kids follow their teacher everywhere.", "thai": "เด็กๆ ตามครูไปทุกที่"}
{"word": "follow", "english": "I didn’t follow the movie’s plot.", "thai": "ฉันตามเนื้อเรื่องของหนังไม่ทัน"}
{"word": "follow", "english": "He should follow the doctor’s orders.", "thai": "เขาควรทำตามคำสั่งของหมอ"}
{"word": "follow", "english": "Can you follow the trail to the camp?", "thai": "คุณตามเส้นทางไปที่แคมป์ได้ไหม"}
{"word": "follow", "english": "I follow a few blogs about cooking.", "thai": "ฉันติดตามบล็อกเกี่ยวกับการทำอาหารสองสามอัน"}
{"word": "follow", "english": "She wants to follow the fashion trends.", "thai": "เธออยากตามเทรนด์แฟชั่น"}
{"word": "follow", "english": "He didn’t follow through with his promise.", "thai": "เขาไม่ทำตามสัญญา"}
{"word": "follow", "english": "Follow the signs to the parking lot.", "thai": "ตามป้ายไปที่ลานจอดรถ"}
{"word": "follow", "english": "I can follow the conversation now.", "thai": "ตอนนี้ฉันตามบทสนทนาได้แล้ว"}
{"word": "follow", "english": "She follows a strict workout routine.", "thai": "เธอทำตามตารางออกกำลังกายที่เข้มงวด"}
{"word": "follow", "english": "The cat will follow you for food.", "thai": "แมวจะตามคุณเพื่อหาอาหาร"}
{"word": "follow", "english": "Did you follow the game last night?", "thai": "คุณติดตามเกมเมื่อคืนนี้หรือเปล่า"}
{"word": "follow", "english": "I’ll follow your advice this time.", "thai": "ครั้งนี้ฉันจะทำตามคำแนะนำของคุณ"}
{"word": "follow", "english": "He wants to follow the hiking trail.", "thai": "เขาอยากตามเส้นทางเดินป่า"}
{"word": "follow", "english": "She didn’t follow the schedule today.", "thai": "วันนี้เธอไม่ได้ทำตามตาราง"}
{"word": "follow", "english": "I follow her posts on Instagram.", "thai": "ฉันติดตามโพสต์ของเธอบนอินสตาแกรม"}
{"word": "follow", "english": "Can you follow the directions to the park?", "thai": "คุณทำตามคำแนะนำไปที่สวนสาธารณะได้ไหม"}
{"word": "follow", "english": "He should follow his heart.", "thai": "เขาควรทำตามหัวใจตัวเอง"}
{"word": "follow", "english": "I couldn’t follow the lecture today.", "thai": "วันนี้ฉันตามการบรรยายไม่ทัน"}
{"word": "follow", "english": "Follow me to the new coffee shop.", "thai": "ตามฉันไปที่ร้านกาแฟใหม่"}
{"word": "follow", "english": "She follows a vegan diet.", "thai": "เธอทำตามอาหารมังสวิรัติ"}
{"word": "follow", "english": "The puppy will follow you home.", "thai": "ลูกสุนัขจะตามคุณกลับบ้าน"}
{"word": "follow", "english": "Did you follow the score of the match?", "thai": "คุณติดตามคะแนนของการแข่งขันหรือเปล่า"}
{"word": "follow", "english": "I’ll follow the guidelines for the project.", "thai": "ฉันจะทำตามแนวทางของโปรเจกต์"}
{"word": "follow", "english": "He wants to follow the river to its source.", "thai": "เขาอยากตามแม่น้ำไปถึงต้นน้ำ"}
{"word": "follow", "english": "She didn’t follow the safety instructions.", "thai": "เธอไม่ได้ทำตามคำแนะนำด้านความปลอดภัย"}
{"word": "follow", "english": "I follow a few sports teams online.", "thai": "ฉันติดตามทีมกีฬาสองสามทีมทางออนไลน์"}
{"word": "follow", "english": "Can you follow the steps in the manual?", "thai": "คุณทำตามขั้นตอนในคู่มือได้ไหม"}
{"word": "follow", "english": "He follows the stock market daily.", "thai": "เขาติดตามตลาดหุ้นทุกวัน"}
{"word": "follow", "english": "Follow the road until you see the sign.", "thai": "ตามถนนไปจนกว่าคุณจะเห็นป้าย"}
{"word": "follow", "english": "I can’t follow this complicated recipe.", "thai": "ฉันตามสูตรที่ซับซ้อนนี้ไม่ทัน"}
{"word": "follow", "english": "She wants to follow her passion for art.", "thai": "เธออยากตามความหลงใหลในศิลปะ"}
{"word": "follow", "english": "The kids follow their coach’s instructions.", "thai": "เด็กๆ ทำตามคำแนะนำของโค้ช"}
{"word": "follow", "english": "Did you follow the debate last night?", "thai": "คุณติดตามการโต้วาทีเมื่อคืนนี้หรือเปล่า"}
{"word": "follow", "english": "I’ll follow your lead on this project.", "thai": "ฉันจะตามการนำของคุณในโปรเจกต์นี้"}
{"word": "follow", "english": "He didn’t follow the traffic rules.", "thai": "เขาไม่ได้ทำตามกฎจราจร"}
{"word": "follow", "english": "She follows a meditation routine.", "thai": "เธอทำตามตารางการนั่งสมาธิ"}
{"word": "follow", "english": "Follow me to the back of the building.", "thai": "ตามฉันไปที่ด้านหลังของอาคาร"}
{"word": "follow", "english": "I couldn’t follow the plot of the book.", "thai": "ฉันตามเนื้อเรื่องของหนังสือไม่ทัน"}
{"word": "follow", "english": "He wants to follow the latest tech trends.", "thai": "เขาอยากติดตามเทรนด์เทคโนโลยีล่าสุด"}
{"word": "follow", "english": "She didn’t follow the workout plan.", "thai": "เธอไม่ได้ทำตามแผนออกกำลังกาย"}
{"word": "follow", "english": "I follow a few YouTubers online.", "thai": "ฉันติดตามยูทูบเบอร์สองสามคนทางออนไลน์"}
{"word": "follow", "english": "Can you follow the melody of this song?", "thai": "คุณตามทำนองเพลงนี้ได้ไหม"}
{"word": "follow", "english": "He’ll follow the guide to the museum.", "thai": "เขาจะตามไกด์ไปที่พิพิธภัณฑ์"}
{"word": "follow", "english": "I didn’t follow the game’s rules.", "thai": "ฉันไม่ได้ทำตามกฎของเกม"}
{"word": "follow", "english": "She follows a strict study schedule.", "thai": "เธอทำตามตารางเรียนที่เข้มงวด"}
{"word": "follow", "english": "Follow the trail to the waterfall.", "thai": "ตามเส้นทางไปที่น้ำตก"}
{"word": "follow", "english": "I can’t follow his fast talking.", "thai": "ฉันตามการพูดเร็วๆ ของเขาไม่ทัน"}
{"word": "follow", "english": "He wants to follow his favorite band’s tour.", "thai": "เขาอยากตามทัวร์ของวงดนตรีที่ชอบ"}
{"word": "follow", "english": "She didn’t follow the cooking instructions.", "thai": "เธอไม่ได้ทำตามคำแนะนำการทำอาหาร"}
{"word": "follow", "english": "I follow the weather updates daily.", "thai": "ฉันติดตามการพยากรณ์อากาศทุกวัน"}
{"word": "follow", "english": "Can you follow the dance moves?", "thai": "คุณตามท่าเต้นได้ไหม"}
{"word": "follow", "english": "He’ll follow the crowd to the event.", "thai": "เขาจะตามฝูงชนไปที่งาน"}
{"word": "follow", "english": "I didn’t follow the lecture’s main points.", "thai": "ฉันตามประเด็นหลักของการบรรยายไม่ทัน"}
{"word": "follow", "english": "She follows a healthy eating plan.", "thai": "เธอทำตามแผนการกินเพื่อสุขภาพ"}
{"word": "follow", "english": "Follow me to the rooftop garden.", "thai": "ตามฉันไปที่สวนบนดาดฟ้า"}
{"word": "follow", "english": "I can’t follow this TV show’s storyline.", "thai": "ฉันตามเนื้อเรื่องของรายการทีวีนี้ไม่ทัน"}
{"word": "follow", "english": "He wants to follow his mentor’s advice.", "thai": "เขาอยากทำตามคำแนะนำของที่ปรึกษา"}
{"word": "follow", "english": "She didn’t follow the company policy.", "thai": "เธอไม่ได้ทำตามนโยบายของบริษัท"}
{"word": "follow", "english": "I follow a few artists on Twitter.", "thai": "ฉันติดตามศิลปินสองสามคนบนทวิตเตอร์"}
{"word": "follow", "english": "Can you follow the pattern in this puzzle?", "thai": "คุณตามรูปแบบในปริศนานี้ได้ไหม"}
{"word": "follow", "english": "He’ll follow the road to the beach.", "thai": "เขาจะตามถนนไปที่ชายหาด"}
{"word": "follow", "english": "I didn’t follow the book’s ending.", "thai": "ฉันตามตอนจบของหนังสือไม่ทัน"}
{"word": "follow", "english": "She follows a daily yoga routine.", "thai": "เธอทำตามตารางโยคะประจำวัน"}
{"word": "follow", "english": "Follow the steps to set up the device.", "thai": "ทำตามขั้นตอนเพื่อตั้งค่าอุปกรณ์"}
{"word": "follow", "english": "I can’t follow his sense of humor.", "thai": "ฉันตามอารมณ์ขันของเขาไม่ทัน"}
{"word": "follow", "english": "He wants to follow the election news.", "thai": "เขาอยากติดตามข่าวการเลือกตั้ง"}
{"word": "follow", "english": "She didn’t follow the travel itinerary.", "thai": "เธอไม่ได้ทำตามกำหนดการเดินทาง"}
{"word": "follow", "english": "I follow a few podcasts about science.", "thai": "ฉันติดตามพอดแคสต์เกี่ยวกับวิทยาศาสตร์สองสามอัน"}
{"word": "follow", "english": "Can you follow the leader in this game?", "thai": "คุณตามผู้นำในเกมนี้ได้ไหม"}
{"word": "follow", "english": "He’ll follow the coach’s strategy.", "thai": "เขาจะทำตามกลยุทธ์ของโค้ช"}
{"word": "follow", "english": "I didn’t follow the speech’s main idea.", "thai": "ฉันตามประเด็นหลักของคำปราศรัยไม่ทัน"}
{"word": "follow", "english": "She follows a minimalist lifestyle.", "thai": "เธอใช้ชีวิตตามแบบมินิมัลลิสต์"}
{"word": "follow", "english": "Follow the arrows to the exit.", "thai": "ตามลูกศรไปที่ทางออก"}
{"word": "follow", "english": "I can’t follow her quick explanation.", "thai": "ฉันตามคำอธิบายเร็วๆ ของเธอไม่ทัน"}
{"word": "follow", "english": "He wants to follow the latest fashion.", "thai": "เขาอยากตามแฟชั่นล่าสุด"}
{"word": "follow", "english": "She didn’t follow the homework guidelines.", "thai": "เธอไม่ได้ทำตามแนวทางการบ้าน"}
{"word": "follow", "english": "I follow a few chefs on YouTube.", "thai": "ฉันติดตามเชฟสองสามคนบนยูทูบ"}
{"word": "follow", "english": "Can you follow the rhythm of this song?", "thai": "คุณตามจังหวะของเพลงนี้ได้ไหม"}
{"word": "follow", "english": "He’ll follow the guidebook for the trip.", "thai": "เขาจะทำตามคู่มือการเดินทาง"}
{"word": "follow", "english": "I didn’t follow the news this week.", "thai": "สัปดาห์นี้ฉันไม่ได้ติดตามข่าว"}
{"word": "follow", "english": "She follows a weekly meal plan.", "thai": "เธอทำตามแผนมื้ออาหารรายสัปดาห์"}
{"word": "follow", "english": "Follow the path to the river.", "thai": "ตามเส้นทางไปที่แม่น้ำ"}
{"word": "follow", "english": "I can’t follow his complicated argument.", "thai": "ฉันตามการโต้แย้งที่ซับซ้อนของเขาไม่ทัน"}
{"word": "follow", "english": "He wants to follow his favorite author’s work.", "thai": "เขาอยากติดตามผลงานของนักเขียนที่ชอบ"}
{"word": "follow", "english": "She didn’t follow the boss’s instructions.", "thai": "เธอไม่ได้ทำตามคำสั่งของเจ้านาย"}
{"word": "follow", "english": "I follow a few influencers online.", "thai": "ฉันติดตามอินฟลูเอนเซอร์สองสามคนทางออนไลน์"}
{"word": "forget", "english": "Don’t forget to lock the door.", "thai": "อย่าลืมล็อกประตู"}
{"word": "forget", "english": "I forgot my keys at home.", "thai": "ฉันลืมกุญแจไว้ที่บ้าน"}
{"word": "forget", "english": "She forgot to call her mom yesterday.", "thai": "เมื่อวานเธอลืมโทรหาแม่"}
{"word": "forget", "english": "I’ll never forget that amazing concert.", "thai": "ฉันจะไม่มีวันลืมคอนเสิร์ตที่น่าทึ่งนั้น"}
{"word": "forget", "english": "He forgot his lines during the play.", "thai": "เขาลืมบทพูดระหว่างการแสดง"}
{"word": "forget", "english": "Did you forget to buy milk?", "thai": "คุณลืมซื้อนมหรือเปล่า"}
{"word": "forget", "english": "I forgot where I parked my car.", "thai": "ฉันลืมว่าจอดรถไว้ที่ไหน"}
{"word": "forget", "english": "She forgot her friend’s birthday.", "thai": "เธอลืมวันเกิดของเพื่อน"}
{"word": "forget", "english": "Don’t forget to turn off the lights.", "thai": "อย่าลืมปิดไฟ"}
{"word": "forget", "english": "I forgot to do my homework last night.", "thai": "เมื่อคืนฉันลืมทำการบ้าน"}
{"word": "forget", "english": "He forgot the meeting was today.", "thai": "เขาลืมว่าการประชุมคือวันนี้"}
{"word": "forget", "english": "I can’t forget how kind she was.", "thai": "ฉันลืมไม่ได้ว่าเธอใจดีแค่ไหน"}
{"word": "forget", "english": "She forgot her wallet at the store.", "thai": "เธอลืมกระเป๋าสตางค์ไว้ที่ร้าน"}
{"word": "forget", "english": "Don’t forget to feed the cat.", "thai": "อย่าลืมให้อาหารแมว"}
{"word": "forget", "english": "I forgot what time the movie starts.", "thai": "ฉันลืมว่าหนังเริ่มตอนกี่โมง"}
{"word": "forget", "english": "He forgot to bring his jacket.", "thai": "เขาลืมเอาเสื้อแจ็คเก็ตมา"}
{"word": "forget", "english": "I’ll never forget my first day at school.", "thai": "ฉันจะไม่มีวันลืมวันแรกที่โรงเรียน"}
{"word": "forget", "english": "She forgot to RSVP for the party.", "thai": "เธอลืมตอบรับคำเชิญไปงานปาร์ตี้"}
{"word": "forget", "english": "Did you forget your password again?", "thai": "คุณลืมรหัสผ่านอีกแล้วหรือ"}
{"word": "forget", "english": "I forgot to water the plants.", "thai": "ฉันลืมรดน้ำต้นไม้"}
{"word": "forget", "english": "He forgot the name of the restaurant.", "thai": "เขาลืมชื่อร้านอาหาร"}
{"word": "forget", "english": "Don’t forget to check your email.", "thai": "อย่าลืมเช็คอีเมล"}
{"word": "forget", "english": "I forgot to pack my toothbrush.", "thai": "ฉันลืมเก็บแปรงสีฟัน"}
{"word": "forget", "english": "She forgot where she parked her bike.", "thai": "เธอลืมว่าจอดจักรยานไว้ที่ไหน"}
{"word": "forget", "english": "I can’t forget that embarrassing moment.", "thai": "ฉันลืมช่วงเวลาน่าอายนั้นไม่ได้"}
{"word": "forget", "english": "He forgot to turn in his assignment.", "thai": "เขาลืมส่งการบ้าน"}
{"word": "forget", "english": "Don’t forget to call me later.", "thai": "อย่าลืมโทรหาฉันทีหลัง"}
{"word": "forget", "english": "I forgot my lines in the speech.", "thai": "ฉันลืมบทพูดในคำปราศรัย"}
{"word": "forget", "english": "She forgot to set her alarm.", "thai": "เธอลืมตั้งนาฬิกาปลุก"}
{"word": "forget", "english": "Did you forget the meeting time?", "thai": "คุณลืมเวลาการประชุมหรือเปล่า"}
{"word": "forget", "english": "I forgot to buy bread at the store.", "thai": "ฉันลืมซื้อขนมปังที่ร้าน"}
{"word": "forget", "english": "He forgot his friend’s phone number.", "thai": "เขาลืมเบอร์โทรของเพื่อน"}
{"word": "forget", "english": "I’ll never forget that beautiful sunset.", "thai": "ฉันจะไม่มีวันลืมพระอาทิตย์ตกที่สวยงามนั้น"}
{"word": "forget", "english": "She forgot to take her medicine.", "thai": "เธอลืมกินยา"}
{"word": "forget", "english": "Don’t forget to sign the form.", "thai": "อย่าลืมเซ็นต์แบบฟอร์ม"}
{"word": "forget", "english": "I forgot where I put my glasses.", "thai": "ฉันลืมว่าวางแว่นไว้ที่ไหน"}
{"word": "forget", "english": "He forgot to book the hotel.", "thai": "เขาลืมจองโรงแรม"}
{"word": "forget", "english": "I can’t forget how fun that trip was.", "thai": "ฉันลืมไม่ได้ว่าทริปนั้นสนุกแค่ไหน"}
{"word": "forget", "english": "She forgot to charge her phone.", "thai": "เธอลืมชาร์จโทรศัพท์"}
{"word": "forget", "english": "Did you forget to do the laundry?", "thai": "คุณลืมซักผ้าหรือเปล่า"}
{"word": "forget", "english": "I forgot the lyrics to that song.", "thai": "ฉันลืมเนื้อเพลงนั้น"}
{"word": "forget", "english": "He forgot to shut the window.", "thai": "เขาลืมปิดหน้าต่าง"}
{"word": "forget", "english": "Don’t forget to bring your ticket.", "thai": "อย่าลืมนำตั๋วมา"}
{"word": "forget", "english": "I forgot to reply to her message.", "thai": "ฉันลืมตอบข้อความของเธอ"}
{"word": "forget", "english": "She forgot the date of the exam.", "thai": "เธอลืมวันที่สอบ"}
{"word": "forget", "english": "I’ll never forget my childhood home.", "thai": "ฉันจะไม่มีวันลืมบ้านในวัยเด็ก"}
{"word": "forget", "english": "He forgot to pay the bill.", "thai": "เขาลืมจ่ายบิล"}
{"word": "forget", "english": "Don’t forget to wear your jacket.", "thai": "อย่าลืมสวมเสื้อแจ็คเก็ต"}
{"word": "forget", "english": "I forgot what I was going to say.", "thai": "ฉันลืมว่ากำลังจะพูดอะไร"}
{"word": "forget", "english": "She forgot to water the flowers.", "thai": "เธอลืมรดน้ำดอกไม้"}
{"word": "forget", "english": "Did you forget your lines again?", "thai": "คุณลืมบทพูดอีกแล้วหรือ"}
{"word": "forget", "english": "I forgot to lock my car.", "thai": "ฉันลืมล็อครถ"}
{"word": "forget", "english": "He forgot the time of his appointment.", "thai": "เขาลืมเวลานัด"}
{"word": "forget", "english": "I can’t forget that terrible movie.", "thai": "ฉันลืมหนังแย่ๆ นั้นไม่ได้"}
{"word": "forget", "english": "She forgot to pack her lunch.", "thai": "เธอลืมเก็บอาหารกลางวัน"}
{"word": "forget", "english": "Don’t forget to call your dad.", "thai": "อย่าลืมโทรหาพ่อ"}
{"word": "forget", "english": "I forgot where I left my phone.", "thai": "ฉันลืมว่าทิ้งโทรศัพท์ไว้ที่ไหน"}
{"word": "forget", "english": "He forgot to turn off the stove.", "thai": "เขาลืมปิดเตา"}
{"word": "forget", "english": "I’ll never forget our first date.", "thai": "ฉันจะไม่มีวันลืมเดตแรกของเรา"}
{"word": "forget", "english": "She forgot to renew her subscription.", "thai": "เธอลืมต่ออายุการสมัคร"}
{"word": "forget", "english": "Did you forget to feed the dog?", "thai": "คุณลืมให้อาหารสุนัขหรือเปล่า"}
{"word": "forget", "english": "I forgot the name of that actor.", "thai": "ฉันลืมชื่อนักแสดงคนนั้น"}
{"word": "forget", "english": "He forgot to bring his homework.", "thai": "เขาลืมเอาการบ้านมา"}
{"word": "forget", "english": "Don’t forget to check the weather.", "thai": "อย่าลืมเช็คสภาพอากาศ"}
{"word": "forget", "english": "I forgot to buy eggs at the store.", "thai": "ฉันลืมซื้อไข่ที่ร้าน"}
{"word": "forget", "english": "She forgot her lines in the audition.", "thai": "เธอลืมบทพูดในการคัดเลือก"}
{"word": "forget", "english": "I can’t forget that scary moment.", "thai": "ฉันลืมช่วงเวลาน่ากลัวนั้นไม่ได้"}
{"word": "forget", "english": "He forgot to close the garage door.", "thai": "เขาลืมปิดประตูโรงรถ"}
{"word": "forget", "english": "Don’t forget to sign up for the class.", "thai": "อย่าลืมลงทะเบียนเรียน"}
{"word": "forget", "english": "I forgot the title of that book.", "thai": "ฉันลืมชื่อหนังสือเล่มนั้น"}
{"word": "forget", "english": "She forgot to charge her laptop.", "thai": "เธอลืมชาร์จแล็ปท็อป"}
{"word": "forget", "english": "Did you forget to lock the gate?", "thai": "คุณลืมล็อกประตูรั้วหรือเปล่า"}
{"word": "forget", "english": "I forgot to take out the trash.", "thai": "ฉันลืมทิ้งขยะ"}
{"word": "forget", "english": "He forgot the address of the party.", "thai": "เขาลืมที่อยู่ของงานปาร์ตี้"}
{"word": "forget", "english": "I’ll never forget that kind gesture.", "thai": "ฉันจะไม่มีวันลืมการกระทำที่ใจดีนั้น"}
{"word": "forget", "english": "She forgot to turn off her phone.", "thai": "เธอลืมปิดโทรศัพท์"}
{"word": "forget", "english": "Don’t forget to bring your umbrella.", "thai": "อย่าลืมพกร่ม"}
{"word": "forget", "english": "I forgot what day the meeting is.", "thai": "ฉันลืมว่าการประชุมคือวันไหน"}
{"word": "forget", "english": "He forgot to mail the letter.", "thai": "เขาลืมส่งจดหมาย"}
{"word": "forget", "english": "I can’t forget how cold it was.", "thai": "ฉันลืมไม่ได้ว่ามันหนาวแค่ไหน"}
{"word": "forget", "english": "She forgot to buy a gift.", "thai": "เธอลืมซื้อของขวัญ"}
{"word": "forget", "english": "Did you forget to do your chores?", "thai": "คุณลืมทำธุระหรือเปล่า"}
{"word": "forget", "english": "I forgot the password to my account.", "thai": "ฉันลืมรหัสผ่านของบัญชี"}
{"word": "forget", "english": "He forgot to feed the fish.", "thai": "เขาลืมให้อาหารปลา"}
{"word": "forget", "english": "Don’t forget to text me later.", "thai": "อย่าลืมส่งข้อความหาฉันทีหลัง"}
{"word": "forget", "english": "I forgot where I parked my bike.", "thai": "ฉันลืมว่าจอดจักรยานไว้ที่ไหน"}
{"word": "forget", "english": "She forgot to sign the card.", "thai": "เธอลืมเซ็นต์การ์ด"}
{"word": "forget", "english": "I’ll never forget that funny joke.", "thai": "ฉันจะไม่มีวันลืมมุกตลกนั้น"}
{"word": "forget", "english": "He forgot to check his schedule.", "thai": "เขาลืมเช็คตารางของเขา"}
{"word": "forget", "english": "Don’t forget to wear sunscreen.", "thai": "อย่าลืมทาครีมกันแดด"}
{"word": "forget", "english": "I forgot to pack my charger.", "thai": "ฉันลืมเก็บที่ชาร์จ"}
{"word": "forget", "english": "She forgot the name of the song.", "thai": "เธอลืมชื่อเพลง"}
{"word": "forget", "english": "Did you forget to turn off the TV?", "thai": "คุณลืมปิดทีวีหรือเปล่า"}
{"word": "forget", "english": "I forgot to call my friend back.", "thai": "ฉันลืมโทรกลับเพื่อน"}
{"word": "forget", "english": "He forgot where he left his keys.", "thai": "เขาลืมว่าทิ้งกุญแจไว้ที่ไหน"}
{"word": "forget", "english": "I can’t forget that amazing view.", "thai": "ฉันลืมวิวที่น่าทึ่งนั้นไม่ได้"}
{"word": "forget", "english": "She forgot to lock her bike.", "thai": "เธอลืมล็อกจักรยาน"}
{"word": "forget", "english": "Don’t forget to RSVP for the event.", "thai": "อย่าลืมตอบรับคำเชิญสำหรับงาน"}
{"word": "forget", "english": "I forgot to take my vitamins.", "thai": "ฉันลืมกินวิตามิน"}
{"word": "forget", "english": "He forgot the date of his exam.", "thai": "เขาลืมวันที่สอบ"}
{"word": "forget", "english": "I’ll never forget that special moment.", "thai": "ฉันจะไม่มีวันลืมช่วงเวลาพิเศษนั้น"}
