{"word": "count", "english": "Can you count to ten for me?", "thai": "คุณนับถึงสิบให้ฉันได้ไหม?"}
{"word": "count", "english": "I lost count of how many cookies I ate.", "thai": "ฉันลืมนับไปแล้วว่ากินคุกกี้ไปกี่ชิ้น"}
{"word": "count", "english": "Make sure to count all the votes carefully.", "thai": "อย่าลืมนับคะแนนทั้งหมดอย่างระมัดระวัง"}
{"word": "count", "english": "Does this purchase count toward my rewards points?", "thai": "การซื้อครั้งนี้นับรวมในคะแนนสะสมของฉันไหม?"}
{"word": "count", "english": "You can count on me to be there on time.", "thai": "คุณวางใจได้ว่าฉันจะไปถึงตรงเวลา"}
{"word": "count", "english": "Let’s count the number of people in the room.", "thai": "มานับจำนวนคนในห้องกันเถอะ"}
{"word": "count", "english": "Every vote will count in this election.", "thai": "ทุกคะแนนจะมีความสำคัญในการเลือกตั้งครั้งนี้"}
{"word": "count", "english": "I can’t count how many times I’ve told you this.", "thai": "ฉันนับไม่ถ้วนแล้วว่าบอกคุณเรื่องนี้กี่ครั้ง"}
{"word": "count", "english": "Don’t count your chickens before they hatch.", "thai": "อย่านับลูกไก่ก่อนที่มันจะฟัก"}
{"word": "count", "english": "We need to count the inventory before closing.", "thai": "เราต้องนับสต็อกก่อนปิดร้าน"}
{"word": "count", "english": "Her opinion doesn’t count in this matter.", "thai": "ความเห็นของเธอไม่มีความสำคัญในเรื่องนี้"}
{"word": "count", "english": "Count me in for the party this weekend!", "thai": "นับฉันด้วยสำหรับงานปาร์ตี้สุดสัปดาห์นี้!"}
{"word": "count", "english": "I’m trying to count calories to stay healthy.", "thai": "ฉันพยายามนับแคลอรี่เพื่อสุขภาพ"}
{"word": "count", "english": "Can you count the money in the cash register?", "thai": "คุณนับเงินในเครื่องบันทึกเงินสดได้ไหม?"}
{"word": "count", "english": "That goal doesn’t count; it was offside!", "thai": "ประตูนั้นไม่นับ เพราะมันล้ำหน้า!"}
{"word": "count", "english": "I’ll count to three, then you start running.", "thai": "ฉันจะนับถึงสาม แล้วคุณเริ่มวิ่ง"}
{"word": "count", "english": "His promises don’t count for much anymore.", "thai": "คำสัญญาของเขาไม่มีน้ำหนักอีกต่อไป"}
{"word": "count", "english": "Let’s count how many chairs we need for the event.", "thai": "มานับเก้าอี้ที่เราต้องการสำหรับงานนี้กัน"}
{"word": "count", "english": "You can always count on Sarah for good advice.", "thai": "คุณวางใจซาร่าห์ได้เสมอสำหรับคำแนะนำดีๆ"}
{"word": "count", "english": "I forgot to count the last lap in the race.", "thai": "ฉันลืมนับรอบสุดท้ายในการแข่งขัน"}
{"word": "count", "english": "Every second will count in this challenge.", "thai": "ทุกวินาทีจะมีความสำคัญในความท้าทายนี้"}
{"word": "count", "english": "Count the stars in the sky tonight.", "thai": "นับดวงดาวบนท้องฟ้าคืนนี้สิ"}
{"word": "count", "english": "I don’t think that mistake should count against you.", "thai": "ฉันคิดว่าความผิดพลาดนั้นไม่ควรนับเป็นคะแนนลบสำหรับคุณ"}
{"word": "count", "english": "We need to count the supplies before ordering more.", "thai": "เราต้องนับของใช้ก่อนสั่งเพิ่ม"}
{"word": "count", "english": "Don’t count me out; I’m still in the game!", "thai": "อย่าตัดฉันออก ฉันยังอยู่ในเกม!"}
{"word": "count", "english": "Can you count backward from one hundred?", "thai": "คุณนับถอยหลังจากหนึ่งร้อยได้ไหม?"}
{"word": "count", "english": "Her vote will count double in the final round.", "thai": "คะแนนของเธอจะนับเป็นสองเท่าในรอบสุดท้าย"}
{"word": "count", "english": "I’m too tired to count all these coins right now.", "thai": "ฉันเหนื่อยเกินกว่าจะนับเหรียญพวกนี้ตอนนี้"}
{"word": "count", "english": "Your effort will count toward the final grade.", "thai": "ความพยายามของคุณจะนับรวมในคะแนนสุดท้าย"}
{"word": "count", "english": "Let’s count the days until the vacation starts.", "thai": "มานับวันจนกว่าวันหยุดจะเริ่มกัน"}
{"word": "count", "english": "You can’t count on the weather being nice tomorrow.", "thai": "คุณเชื่อใจไม่ได้ว่าพรุ่งนี้อากาศจะดี"}
{"word": "count", "english": "I’ll count the kids to make sure no one’s missing.", "thai": "ฉันจะนับเด็กๆ เพื่อให้แน่ใจว่าไม่มีใครหายไป"}
{"word": "count", "english": "That point doesn’t count because of the foul.", "thai": "คะแนนนั้นไม่นับเพราะมีการฟาวล์"}
{"word": "count", "english": "Count how many steps it takes to cross the room.", "thai": "นับก้าวที่ต้องใช้เพื่อข้ามห้อง"}
{"word": "count", "english": "I can count on one hand the times I’ve been late.", "thai": "ฉันนับครั้งที่ฉันมาสายได้ด้วยมือเดียว"}
{"word": "count", "english": "Let’s count the cars passing by in ten minutes.", "thai": "มานับรถที่ผ่านไปในสิบนาทีกัน"}
{"word": "count", "english": "His words don’t count if he doesn’t follow through.", "thai": "คำพูดของเขาไม่มีความหมายถ้าเขาไม่ทำตาม"}
{"word": "count", "english": "Count me as one of the volunteers for the project.", "thai": "นับฉันเป็นหนึ่งในอาสาสมัครสำหรับโครงการนี้"}
{"word": "count", "english": "I need to count my blessings every day.", "thai": "ฉันต้องนับพรของฉันทุกวัน"}
{"word": "count", "english": "Can you count the number of books on the shelf?", "thai": "คุณนับจำนวนหนังสือบนชั้นได้ไหม?"}
{"word": "count", "english": "That doesn’t count as a real apology.", "thai": "นั่นไม่นับว่าเป็นคำขอโทษจริงๆ"}
{"word": "count", "english": "Let’s count to twenty before we start the game.", "thai": "มานับถึงยี่สิบก่อนเริ่มเกมกัน"}
{"word": "count", "english": "You can count on my support for your idea.", "thai": "คุณวางใจได้ว่าฉันจะสนับสนุนไอเดียของคุณ"}
{"word": "count", "english": "I lost count of how many emails I sent today.", "thai": "ฉันลืมนับไปแล้วว่าส่งอีเมลไปกี่ฉบับวันนี้"}
{"word": "count", "english": "Every step you take will count toward your goal.", "thai": "ทุกก้าวที่คุณเดินจะนับรวมในเป้าหมายของคุณ"}
{"word": "count", "english": "Count the number of birds in that tree.", "thai": "นับจำนวนนกบนต้นไม้นั้น"}
{"word": "count", "english": "I don’t count that as a real victory.", "thai": "ฉันไม่นับว่านั่นเป็นชัยชนะที่แท้จริง"}
{"word": "count", "english": "Can you count how many people showed up?", "thai": "คุณนับได้ไหมว่ามีคนมากี่คน?"}
{"word": "count", "english": "Your opinion will always count with me.", "thai": "ความเห็นของคุณจะมีความสำคัญสำหรับฉันเสมอ"}
{"word": "count", "english": "I’ll count the seconds until the timer goes off.", "thai": "ฉันจะนับวินาทีจนกว่าตัวจับเวลาจะดัง"}
{"word": "count", "english": "That penalty doesn’t count in the final score.", "thai": "การลงโทษนั้นไม่นับในคะแนนสุดท้าย"}
{"word": "count", "english": "Let’s count the money we raised for charity.", "thai": "มานับเงินที่เราระดมทุนเพื่อการกุศลกัน"}
{"word": "count", "english": "You can count on me to keep it a secret.", "thai": "คุณวางใจได้ว่าฉันจะเก็บเป็นความลับ"}
{"word": "count", "english": "I can’t count how many stars are in the sky.", "thai": "ฉันนับไม่ถ้วนว่ามีดวงดาวกี่ดวงบนท้องฟ้า"}
{"word": "count", "english": "Count the candles on the birthday cake.", "thai": "นับเทียนบนเค้กวันเกิด"}
{"word": "count", "english": "His actions count more than his words.", "thai": "การกระทำของเขามีความสำคัญมากกว่าคำพูด"}
{"word": "count", "english": "Let’s count the points to see who won.", "thai": "มานับคะแนนเพื่อดูว่าใครชนะ"}
{"word": "count", "english": "I’ll count you in for the team activity.", "thai": "ฉันจะนับคุณเข้าร่วมในกิจกรรมทีม"}
{"word": "count", "english": "Don’t count on him showing up early.", "thai": "อย่าคาดหวังว่าเขาจะมาถึงเร็ว"}
{"word": "count", "english": "Count how many apples are left in the basket.", "thai": "นับว่าเหลือแอปเปิ้ลกี่ลูกในตะกร้า"}
{"word": "count", "english": "Your vote will count in the final decision.", "thai": "คะแนนของคุณจะมีความสำคัญในการตัดสินใจขั้นสุดท้าย"}
{"word": "count", "english": "I can’t count the times I’ve been to that place.", "thai": "ฉันนับไม่ถ้วนว่าฉันไปที่นั้นกี่ครั้ง"}
{"word": "count", "english": "Let’s count the hours until the event starts.", "thai": "มานับชั่วโมงจนกว่ากิจกรรมจะเริ่ม"}
{"word": "count", "english": "That doesn’t count as a proper answer.", "thai": "นั่นไม่นับว่าเป็นคำตอบที่เหมาะสม"}
{"word": "count", "english": "You can count on my vote for the proposal.", "thai": "คุณวางใจได้ว่าฉันจะโหวตให้ข้อเสนอนั้น"}
{"word": "count", "english": "Count the number of pages in this book.", "thai": "นับจำนวนหน้าสำนักในหนังสือเล่มนี้"}
{"word": "count", "english": "I don’t count that as a fair competition.", "thai": "ฉันไม่นับว่านั่นเป็นการแข่งขันที่ยุติธรรม"}
{"word": "count", "english": "Let’s count the votes one more time.", "thai": "มานับคะแนนอีกครั้ง"}
{"word": "count", "english": "You can count on her to finish the job.", "thai": "คุณวางใจได้ว่าเธอจะทำงานให้เสร็จ"}
{"word": "count", "english": "I lost count of how many laps I ran.", "thai": "ฉันลืมนับไปแล้วว่าวิ่งไปกี่รอบ"}
{"word": "count", "english": "Every effort will count toward our success.", "thai": "ทุกความพยายามจะนับรวมในความสำเร็จของเรา"}
{"word": "count", "english": "Count the number of guests arriving tonight.", "thai": "นับจำนวนแขกที่มาถึงคืนนี้"}
{"word": "count", "english": "That doesn’t count if you cheated!", "thai": "นั่นไม่นับถ้าคุณโกง!"}
{"word": "count", "english": "Can you count the coins in this jar?", "thai": "คุณนับเหรียญในโหลนี้ได้ไหม?"}
{"word": "count", "english": "Your help will count a lot in this project.", "thai": "ความช่วยเหลือของคุณจะมีความสำคัญมากในโครงการนี้"}
{"word": "count", "english": "I’ll count to five, then you hide.", "thai": "ฉันจะนับถึงห้า แล้วคุณซ่อน"}
{"word": "count", "english": "Don’t count on getting a refund for that.", "thai": "อย่าคาดหวังว่าจะได้เงินคืนสำหรับอันนั้น"}
{"word": "count", "english": "Let’s count the ingredients before we start cooking.", "thai": "มานับส่วนผสมก่อนที่เราจะเริ่มทำอาหาร"}
{"word": "count", "english": "You can count me out for the late-night shift.", "thai": "อย่านับฉันสำหรับกะดึก"}
{"word": "count", "english": "Count how many balloons we need for the party.", "thai": "นับว่าต้องการลูกโป่งกี่ลูกสำหรับงานปาร์ตี้"}
{"word": "count", "english": "Her vote might count more than you think.", "thai": "คะแนนของเธออาจมีความสำคัญมากกว่าที่คุณคิด"}
{"word": "count", "english": "I can’t count how many times I’ve lost my keys.", "thai": "ฉันนับไม่ถ้วนว่าทำกุญแจหายกี่ครั้ง"}
{"word": "count", "english": "Let’s count the score at the end of the game.", "thai": "มานับคะแนนเมื่อจบเกม"}
{"word": "count", "english": "You can count on my help anytime.", "thai": "คุณวางใจได้ว่าฉันจะช่วยได้ทุกเมื่อ"}
{"word": "count", "english": "Count the number of windows in the house.", "thai": "นับจำนวนหน้าต่างในบ้าน"}
{"word": "count", "english": "That doesn’t count as a valid excuse.", "thai": "นั่นไม่นับว่าเป็นข้อแก้ตัวที่สมเหตุสมผล"}
{"word": "count", "english": "Let’s count how many tickets we sold.", "thai": "มานับว่าขายตั๋วไปกี่ใบ"}
{"word": "count", "english": "You can count on me to bring the snacks.", "thai": "คุณวางใจได้ว่าฉันจะนำของว่างมา"}
{"word": "count", "english": "I lost count of how many episodes I watched.", "thai": "ฉันลืมนับไปแล้วว่าดูไปกี่ตอน"}
{"word": "count", "english": "Every moment we spend together will count.", "thai": "ทุกช่วงเวลาที่เราใช้ด้วยกันจะมีความสำคัญ"}
{"word": "count", "english": "Count the number of flowers in the garden.", "thai": "นับจำนวนดอกไม้ในสวน"}
{"word": "count", "english": "That doesn’t count as a real effort.", "thai": "นั่นไม่นับว่าเป็นความพยายามที่แท้จริง"}
{"word": "count", "english": "Can you count the cars in the parking lot?", "thai": "คุณนับรถในลานจอดได้ไหม?"}
{"word": "count", "english": "Your support will count for a lot.", "thai": "การสนับสนุนของคุณจะมีความหมายมาก"}
{"word": "count", "english": "I’ll count to ten, then open my eyes.", "thai": "ฉันจะนับถึงสิบ แล้วลืมตา"}
{"word": "count", "english": "Don’t count on the plan going perfectly.", "thai": "อย่าคาดหวังว่าแผนจะสมบูรณ์แบบ"}
{"word": "count", "english": "Let’s count the votes before announcing the winner.", "thai": "มานับคะแนนก่อนประกาศผู้ชนะ"}
{"word": "count", "english": "You can count on me to finish the task.", "thai": "คุณวางใจได้ว่าฉันจะทำงานให้เสร็จ"}
{"word": "count", "english": "I can’t count how many times I’ve said sorry.", "thai": "ฉันนับไม่ถ้วนว่าพูดคำว่าขอโทษไปกี่ครั้ง"}
{"word": "cry", "english": "I always cry during sad movies.", "thai": "ฉันมักจะร้องไห้ตอนดูหนังเศร้า"}
{"word": "cry", "english": "Don’t cry, everything will be okay.", "thai": "อย่าร้องไห้ ทุกอย่างจะดีเอง"}
{"word": "cry", "english": "She started to cry when she heard the news.", "thai": "เธอเริ่มร้องไห้เมื่อได้ยินข่าว"}
{"word": "cry", "english": "It’s okay to cry if you’re feeling hurt.", "thai": "ร้องไห้ได้ถ้าคุณรู้สึกเจ็บปวด"}
{"word": "cry", "english": "The baby won’t stop crying tonight.", "thai": "เด็กทารกไม่หยุดร้องไห้คืนนี้"}
{"word": "cry", "english": "I heard a cry for help from the distance.", "thai": "ฉันได้ยินเสียงร้องขอความช่วยเหลือจากระยะไกล"}
{"word": "cry", "english": "He let out a loud cry when he fell.", "thai": "เขาร้องเสียงดังเมื่อล้มลง"}
{"word": "cry", "english": "Why do onions always make me cry?", "thai": "ทำไมหัวหอมถึงทำให้ฉันร้องไห้ทุกครั้ง?"}
{"word": "cry", "english": "She tried not to cry at the funeral.", "thai": "เธอพยายามไม่ร้องไห้ในงานศพ"}
{"word": "cry", "english": "His speech was so moving, it made me cry.", "thai": "คำพูดของเขาซึ้งมากจนทำให้ฉันร้องไห้"}
{"word": "cry", "english": "The kids cry when they don’t get their way.", "thai": "เด็กๆ ร้องไห้เมื่อไม่ได้ดั่งใจ"}
{"word": "cry", "english": "I could hear her cry through the wall.", "thai": "ฉันได้ยินเธอร้องไห้ผ่านกำแพง"}
{"word": "cry", "english": "Don’t cry over spilled milk, just clean it up.", "thai": "อย่าร้องไห้เพราะน้ำนมหก แค่เช็ดมัน"}
{"word": "cry", "english": "The movie’s ending always makes her cry.", "thai": "ตอนจบของหนังทำให้เธอร้องไห้ทุกครั้ง"}
{"word": "cry", "english": "He didn’t cry, even when he was in pain.", "thai": "เขาไม่ร้องไห้ แม้ว่าจะเจ็บปวด"}
{"word": "cry", "english": "The puppy’s sad eyes made me want to cry.", "thai": "ดวงตาเศร้าของลูกสุนัขทำให้ฉันอยากร้องไห้"}
{"word": "cry", "english": "She let out a cry of joy when she won.", "thai": "เธอร้องออกมาด้วยความดีใจเมื่อชนะ"}
{"word": "cry", "english": "I can’t help but cry when I’m stressed.", "thai": "ฉันอดไม่ได้ที่จะร้องไห้เมื่อเครียด"}
{"word": "cry", "english": "The crowd let out a cry of excitement.", "thai": "ฝูงชนร้องออกมาด้วยความตื่นเต้น"}
{"word": "cry", "english": "He told her not to cry, but she couldn’t stop.", "thai": "เขาบอกเธออย่าร้องไห้ แต่เธอหยุดไม่ได้"}
{"word": "cry", "english": "I heard a strange cry in the middle of the night.", "thai": "ฉันได้ยินเสียงร้องแปลกๆ กลางดึก"}
{"word": "cry", "english": "She started to cry after the argument.", "thai": "เธอเริ่มร้องไห้หลังจากการโต้เถียง"}
{"word": "cry", "english": "The child’s cry woke everyone up.", "thai": "เสียงร้องของเด็กปลุกทุกคนให้ตื่น"}
{"word": "cry", "english": "I don’t usually cry, but this was too much.", "thai": "ฉันไม่ค่อยร้องไห้ แต่นี่มันมากเกินไป"}
{"word": "cry", "english": "Her performance was so beautiful, it made me cry.", "thai": "การแสดงของเธอสวยงามมากจนทำให้ฉันร้องไห้"}
{"word": "cry", "english": "He gave a cry of surprise when he saw thegift.", "thai": "เขาร้องออกมาด้วยความประหลาดใจเมื่อเห็นของขวัญ"}
{"word": "cry", "english": "The story was so sad, it made everyone cry.", "thai": "เรื่องราวนั้นเศร้ามากจนทำให้ทุกคนร้องไห้"}
{"word": "cry", "english": "Don’t cry, we’ll find your lost toy.", "thai": "อย่าร้องไห้ เราจะหาของเล่นที่หายไปให้เจอ"}
{"word": "cry", "english": "I saw her cry for the first time yesterday.", "thai": "ฉันเห็นเธอร้องไห้เป็นครั้งแรกเมื่อวานนี้"}
{"word": "cry", "english": "The pain was so intense, he couldn’t help but cry.", "thai": "ความเจ็บปวดรุนแรงมาก เขาอดร้องไห้ไม่ได้"}
{"word": "cry", "english": "She let out a cry when she stubbed her toe.", "thai": "เธอร้องออกมาเมื่อนิ้วเท้าชน"}
{"word": "cry", "english": "I hate to see my friends cry.", "thai": "ฉันเกลียดที่เห็นเพื่อนร้องไห้"}
{"word": "cry", "english": "The baby’s cry was so loud last night.", "thai": "เสียงร้องของทารกดังมากเมื่อคืน"}
{"word": "cry", "english": "He tried to cry quietly so no one would hear.", "thai": "เขาพยายามร้องไห้เงียบๆ เพื่อไม่ให้ใครได้ยิน"}
{"word": "cry", "english": "The song’s lyrics always make me cry.", "thai": "เนื้อเพลงนี้ทำให้ฉันร้องไห้ทุกครั้ง"}
{"word": "cry", "english": "She didn’t cry, even during the sad scene.", "thai": "เธอไม่ร้องไห้ แม้ในฉากเศร้า"}
{"word": "cry", "english": "His cry of anger scared everyone around.", "thai": "เสียงร้องด้วยความโกรธของเขาทำให้ทุกคนกลัว"}
{"word": "cry", "english": "I heard a faint cry coming from the forest.", "thai": "ฉันได้ยินเสียงร้องเบาๆ จากในป่า"}
{"word": "cry", "english": "She’ll cry if she doesn’t get her favorite toy.", "thai": "เธอจะร้องไห้ถ้าไม่ได้ของเล่นที่ชอบ"}
{"word": "cry", "english": "The movie was so touching, I couldn’t help but cry.", "thai": "หนังนั้นซึ้งมาก ฉันอดร้องไห้ไม่ได้"}
{"word": "cry", "english": "He let out a cry when he saw the spider.", "thai": "เขาร้องออกมาเมื่อเห็นแมงมุม"}
{"word": "cry", "english": "Don’t cry, we can fix this mistake.", "thai": "อย่าร้องไห้ เราสามารถแก้ไขความผิดพลาดนี้ได้"}
{"word": "cry", "english": "Her cry of joy filled the room.", "thai": "เสียงร้องด้วยความดีใจของเธอเต็มห้อง"}
{"word": "cry", "english": "I didn’t expect to cry at the wedding.", "thai": "ฉันไม่คาดว่าจะร้องไห้ในงานแต่ง"}
{"word": "cry", "english": "The child’s cry echoed through the house.", "thai": "เสียงร้องของเด็กดังก้องไปทั่วบ้าน"}
{"word": "cry", "english": "She tried to hide her cry during the speech.", "thai": "เธอพยายามซ่อนการร้องไห้ระหว่างสุนทรพจน์"}
{"word": "cry", "english": "I always cry when I hear that song.", "thai": "ฉันร้องไห้ทุกครั้งที่ได้ยินเพลงนั้น"}
{"word": "cry", "english": "His cry for attention went unnoticed.", "thai": "การร้องเรียกความสนใจของเขาไม่มีใครสังเกต"}
{"word": "cry", "english": "The puppy’s cry broke my heart.", "thai": "เสียงร้องของลูกสุนัขทำให้ฉันใจสลาย"}
{"word": "cry", "english": "She let out a cry when she saw the surprise.", "thai": "เธอร้องออกมาเมื่อเห็นเซอร์ไพรส์"}
{"word": "cry", "english": "I don’t want to cry in front of everyone.", "thai": "ฉันไม่อยากร้องไห้ต่อหน้าทุกคน"}
{"word": "cry", "english": "The sad news made the whole family cry.", "thai": "ข่าวเศร้าทำให้ทั้งครอบครัวร้องไห้"}
{"word": "cry", "english": "He didn’t cry when he lost the game.", "thai": "เขาไม่ร้องไห้เมื่อแพ้เกม"}
{"word": "cry", "english": "Her cry of pain was hard to hear.", "thai": "เสียงร้องด้วยความเจ็บปวดของเธอฟังแล้วลำบากใจ"}
{"word": "cry", "english": "I heard a cry from the other room.", "thai": "ฉันได้ยินเสียงร้องจากห้องอื่น"}
{"word": "cry", "english": "The movie’s plot twist made me cry.", "thai": "จุดหักเหของหนังทำให้ฉันร้องไห้"}
{"word": "cry", "english": "Don’t cry, we’ll get through this together.", "thai": "อย่าร้องไห้ เราจะผ่านมันไปด้วยกัน"}
{"word": "cry", "english": "She let out a cry of frustration.", "thai": "เธอร้องออกมาด้วยความหงุดหงิด"}
{"word": "cry", "english": "The baby’s cry kept us up all night.", "thai": "เสียงร้องของทารกทำให้เรานอนไม่ได้ทั้งคืน"}
{"word": "cry", "english": "I didn’t cry, but I was really sad.", "thai": "ฉันไม่ร้องไห้ แต่ฉันเศร้ามาก"}
{"word": "cry", "english": "His cry of victory echoed across the field.", "thai": "เสียงร้องแห่งชัยชนะของเขาดังก้องไปทั่วสนาม"}
{"word": "cry", "english": "She’ll cry if she misses the concert.", "thai": "เธอจะร้องไห้ถ้าพลาดคอนเสิร์ต"}
{"word": "cry", "english": "The story was so emotional, it made me cry.", "thai": "เรื่องราวนั้นซึ้งมากจนทำให้ฉันร้องไห้"}
{"word": "cry", "english": "He let out a cry when he burned his hand.", "thai": "เขาร้องออกมาเมื่อมือไหม้"}
{"word": "cry", "english": "Don’t cry, we can try again tomorrow.", "thai": "อย่าร้องไห้ เราลองใหม่ได้พรุ่งนี้"}
{"word": "cry", "english": "Her cry of excitement was contagious.", "thai": "เสียงร้องด้วยความตื่นเต้นของเธอติดต่อกันได้"}
{"word": "cry", "english": "I couldn’t help but cry at the farewell.", "thai": "ฉันอดร้องไห้ไม่ได้ตอนอำลา"}
{"word": "cry", "english": "The child’s cry startled everyone.", "thai": "เสียงร้องของเด็กทำให้ทุกคนตกใจ"}
{"word": "cry", "english": "She tried not to cry during the interview.", "thai": "เธอพยายามไม่ร้องไห้ระหว่างการสัมภาษณ์"}
{"word": "cry", "english": "I always cry when I say goodbye.", "thai": "ฉันร้องไห้ทุกครั้งที่บอกลา"}
{"word": "cry", "english": "His cry for help was answered quickly.", "thai": "การร้องขอความช่วยเหลือของเขาได้รับการตอบสนองอย่างรวดเร็ว"}
{"word": "cry", "english": "The puppy’s cry made me rush to help.", "thai": "เสียงร้องของลูกสุนัขทำให้ฉันรีบไปช่วย"}
{"word": "cry", "english": "She let out a cry when she saw the mess.", "thai": "เธอร้องออกมาเมื่อเห็นความเลอะเทอะ"}
{"word": "cry", "english": "I don’t like to cry in public.", "thai": "ฉันไม่ชอบร้องไห้ในที่สาธารณะ"}
{"word": "cry", "english": "The sad scene made the audience cry.", "thai": "ฉากเศร้าทำให้ผู้ชมร้องไห้"}
{"word": "cry", "english": "He didn’t cry, even after the bad news.", "thai": "เขาไม่ร้องไห้ แม้หลังจากได้ยินข่าวร้าย"}
{"word": "cry", "english": "Her cry of relief was so loud.", "thai": "เสียงร้องด้วยความโล่งอกของเธอดังมาก"}
{"word": "cry", "english": "I heard a cry coming from the attic.", "thai": "ฉันได้ยินเสียงร้องจากห้องใต้หลังคา"}
{"word": "cry", "english": "The movie’s ending will make you cry.", "thai": "ตอนจบของหนังจะทำให้คุณร้องไห้"}
{"word": "cry", "english": "Don’t cry, we’ll find a solution.", "thai": "อย่าร้องไห้ เราจะหาทางแก้ไข"}
{"word": "cry", "english": "She let out a cry when she won the prize.", "thai": "เธอร้องออกมาเมื่อได้รางวัล"}
{"word": "cry", "english": "I didn’t expect to cry during the speech.", "thai": "ฉันไม่คาดว่าจะร้องไห้ระหว่างสุนทรพจน์"}
{"word": "cry", "english": "The baby’s cry was softer this time.", "thai": "เสียงร้องของทารกเบาลงครั้งนี้"}
{"word": "cry", "english": "She tried to cry silently in the corner.", "thai": "เธอพยายามร้องไห้เงียบๆ ที่มุม"}
{"word": "cry", "english": "I always cry at happy endings.", "thai": "ฉันร้องไห้ทุกครั้งที่มีตอนจบแบบแฮปปี้"}
{"word": "cry", "english": "His cry of despair was heartbreaking.", "thai": "เสียงร้องด้วยความสิ้นหวังของเขาทำให้ใจสลาย"}
{"word": "cry", "english": "The puppy’s cry got everyone’s attention.", "thai": "เสียงร้องของลูกสุนัขดึงดูดความสนใจทุกคน"}
{"word": "cry", "english": "She let out a cry when she lost her phone.", "thai": "เธอร้องออกมาเมื่อทำโทรศัพท์หาย"}
{"word": "cry", "english": "I don’t want to cry, but it’s hard.", "thai": "ฉันไม่อยากร้องไห้ แต่มันยาก"}
{"word": "cry", "english": "The sad song made her cry again.", "thai": "เพลงเศร้าทำให้เธอร้องไห้อีกครั้ง"}
{"word": "cry", "english": "He didn’t cry, even when he was hurt.", "thai": "เขาไม่ร้องไห้ แม้ว่าจะเจ็บ"}
{"word": "cry", "english": "Her cry of joy was so unexpected.", "thai": "เสียงร้องด้วยความดีใจของเธอไม่คาดคิด"}
{"word": "cry", "english": "I heard a cry from the playground.", "thai": "ฉันได้ยินเสียงร้องจากสนามเด็กเล่น"}
{"word": "cry", "english": "The movie’s sad moment made me cry.", "thai": "ช่วงเวลาน่าเศร้าของหนังทำให้ฉันร้องไห้"}
{"word": "cry", "english": "Don’t cry, we can start over.", "thai": "อย่าร้องไห้ เราเริ่มใหม่ได้"}
{"word": "cry", "english": "She let out a cry when she saw the cake.", "thai": "เธอร้องออกมาเมื่อเห็นเค้ก"}
{"word": "cry", "english": "I couldn’t help but cry at the reunion.", "thai": "ฉันอดร้องไห้ไม่ได้ตอนรวมตัวกัน"}
{"word": "cry", "english": "The child’s cry was loud and clear.", "thai": "เสียงร้องของเด็กดังและชัดเจน"}
{"word": "cry", "english": "She tried not to cry during the ceremony.", "thai": "เธอพยายามไม่ร้องไห้ระหว่างพิธี"}
{"word": "cry", "english": "I always cry when I watch that movie.", "thai": "ฉันร้องไห้ทุกครั้งที่ดูหนังเรื่องนั้น"}
{"word": "cut", "english": "Can you cut the bread for me?", "thai": "คุณช่วยหั่นขนมปังให้ฉันได้ไหม?"}
{"word": "cut", "english": "I accidentally cut my finger while cooking.", "thai": "ฉันเผลอทำนิ้วบาดตอนทำอาหาร"}
{"word": "cut", "english": "We need to cut costs to save money.", "thai": "เราต้องลดค่าใช้จ่ายเพื่อประหยัดเงิน"}
{"word": "cut", "english": "She cut her hair short for the summer.", "thai": "เธอตัดผมสั้นเพื่อหน้าร้อน"}
{"word": "cut", "english": "The director decided to cut that scene from the movie.", "thai": "ผู้กำกับตัดสินใจตัดฉากนั้นออกจากหนัง"}
{"word": "cut", "english": "Don’t cut in line, wait your turn!", "thai": "อย่าแซงคิว รอคิวของตัวเอง!"}
{"word": "cut", "english": "He cut the rope with a sharp knife.", "thai": "เขาตัดเชือกด้วยมีดคม"}
{"word": "cut", "english": "They cut the power during the storm.", "thai": "พวกเขาตัดไฟระหว่างพายุ"}
{"word": "cut", "english": "I need to cut back on sweets this month.", "thai": "ฉันต้องลดการกินของหวานเดือนนี้"}
{"word": "cut", "english": "The teacher asked us to cut the paper into shapes.", "thai": "ครูขอให้เราตัดกระดาษเป็นรูปทรง"}
{"word": "cut", "english": "That remark really cut me deep.", "thai": "คำพูดนั้นทำร้ายฉันลึกมาก"}
{"word": "cut", "english": "Can you cut me a piece of cake?", "thai": "คุณช่วยตัดเค้กให้ฉันหน่อยได้ไหม?"}
{"word": "cut", "english": "The company had to cut jobs to stay afloat.", "thai": "บริษัทต้องลดพนักงานเพื่อให้อยู่รอด"}
{"word": "cut", "english": "She cut the conversation short to leave early.", "thai": "เธอตัดบทสนทนาให้สั้นเพื่อออกไปก่อน"}
{"word": "cut", "english": "I cut my hand on a piece of glass.", "thai": "ฉันบาดมือกับเศษแก้ว"}
{"word": "cut", "english": "Let’s cut the cake for the party!", "thai": "มาตัดเค้กสำหรับงานปาร์ตี้กัน!"}
{"word": "cut", "english": "He cut through the forest to save time.", "thai": "เขาลัดผ่านป่าเพื่อประหยัดเวลา"}
{"word": "cut", "english": "The editor will cut the article to fit the page.", "thai": "บรรณาธิการจะตัดบทความให้พอดีกับหน้า"}
{"word": "cut", "english": "I’m trying to cut down on coffee.", "thai": "ฉันพยายามลดการดื่มกาแฟ"}
{"word": "cut", "english": "The barber gave him a clean cut.", "thai": "ช่างตัดผมตัดให้เขาเนี๊ยบมาก"}
{"word": "cut", "english": "Don’t cut corners on this project.", "thai": "อย่าลัดขั้นตอนในโครงการนี้"}
{"word": "cut", "english": "She cut the fabric for the dress carefully.", "thai": "เธอตัดผ้าสำหรับชุดอย่างระมัดระวัง"}
{"word": "cut", "english": "The movie was cut to remove violent scenes.", "thai": "หนังถูกตัดเพื่อลบฉากรุนแรง"}
{"word": "cut", "english": "He cut his finger while chopping vegetables.", "thai": "เขาบาดนิ้วตอนสับผัก"}
{"word": "cut", "english": "We need to cut the budget for next year.", "thai": "เราต้องลดงบประมาณสำหรับปีหน้า"}
{"word": "cut", "english": "She cut ties with her old friends.", "thai": "เธอตัดความสัมพันธ์กับเพื่อนเก่า"}
{"word": "cut", "english": "Can you cut the pizza into eight slices?", "thai": "คุณช่วยตัดพิซซ่าเป็นแปดชิ้นได้ไหม?"}
{"word": "cut", "english": "The storm cut off our internet connection.", "thai": "พายุตัดการเชื่อมต่ออินเทอร์เน็ตของเรา"}
{"word": "cut", "english": "I cut my workout short because I was tired.", "thai": "ฉันตัดการออกกำลังกายให้สั้นเพราะเหนื่อย"}
{"word": "cut", "english": "He cut the wood into small pieces.", "thai": "เขาตัดไม้เป็นชิ้นเล็กๆ"}
{"word": "cut", "english": "The boss wants to cut meeting times in half.", "thai": "เจ้านายต้องการลดเวลาการประชุมลงครึ่งหนึ่ง"}
{"word": "cut", "english": "She cut out sugar from her diet.", "thai": "เธอตัดน้ำตาลออกจากอาหาร"}
{"word": "cut", "english": "The knife is too dull to cut the meat.", "thai": "มีดทื่อเกินกว่าจะตัดเนื้อ"}
{"word": "cut", "english": "They cut the ribbon to open the store.", "thai": "พวกเขาตัดริบบิ้นเพื่อเปิดร้าน"}
{"word": "cut", "english": "I need to cut my nails, they’re too long.", "thai": "ฉันต้องตัดเล็บ มันยาวเกินไป"}
{"word": "cut", "english": "He cut in front of me in traffic.", "thai": "เขาขับตัดหน้าฉันในจราจร"}
{"word": "cut", "english": "The chef will cut the fish for sushi.", "thai": "พ่อครัวจะตัดปลาสำหรับซูชิ"}
{"word": "cut", "english": "We had to cut our trip short due to rain.", "thai": "เราต้องตัดทริปให้สั้นเพราะฝนตก"}
{"word": "cut", "english": "She cut a deal with the supplier.", "thai": "เธอตกลงทำข้อตกลงกับซัพพลายเออร์"}
{"word": "cut", "english": "I cut my leg while hiking yesterday.", "thai": "ฉันบาดขาตอนเดินป่าเมื่อวาน"}
{"word": "cut", "english": "Let’s cut the apples for the pie.", "thai": "มาตัดแอปเปิ้ลสำหรับพายกัน"}
{"word": "cut", "english": "The company cut prices to attract customers.", "thai": "บริษัทลดราคาเพื่อดึงดูดลูกค้า"}
{"word": "cut", "english": "He cut the call short to catch his flight.", "thai": "เขาตัดสายสั้นเพื่อไปขึ้นเครื่องบิน"}
{"word": "cut", "english": "I need to cut out some bad habits.", "thai": "ฉันต้องตัดนิสัยแย่ๆ ออกไป"}
{"word": "cut", "english": "She cut the cardboard into a heart shape.", "thai": "เธอตัดกระดาษแข็งเป็นรูปหัวใจ"}
{"word": "cut", "english": "The power cut left us in the dark.", "thai": "ไฟดับทำให้เราอยู่ในความมืด"}
{"word": "cut", "english": "Can you cut me some slack this time?", "thai": "คุณช่วยผ่อนปรนให้ฉันหน่อยครั้งนี้ได้ไหม?"}
{"word": "cut", "english": "He cut his own firewood for the winter.", "thai": "เขาตัดฟืนเองสำหรับหน้าหนาว"}
{"word": "cut", "english": "They cut funding for the arts program.", "thai": "พวกเขาลดงบประมาณสำหรับโครงการศิลปะ"}
{"word": "cut", "english": "She cut the string to open the package.", "thai": "เธอตัดเชือกเพื่อเปิดห่อ"}
{"word": "cut", "english": "I cut my finger on the sharp edge.", "thai": "ฉันบาดนิ้วที่ขอบคม"}
{"word": "cut", "english": "Let’s cut the watermelon for the picnic.", "thai": "มาตัดแตงโมสำหรับปิกนิกกัน"}
{"word": "cut", "english": "The movie was cut to fit the time slot.", "thai": "หนังถูกตัดให้เข้ากับช่วงเวลา"}
{"word": "cut", "english": "He cut through the crowd to reach the stage.", "thai": "เขาลัดผ่านฝูงชนเพื่อไปถึงเวที"}
{"word": "cut", "english": "I’m trying to cut back on screen time.", "thai": "ฉันพยายามลดเวลาการใช้หน้าจอ"}
{"word": "cut", "english": "She cut her jeans to make shorts.", "thai": "เธอตัดกางเกงยีนส์ทำเป็นกางเกงขาสั้น"}
{"word": "cut", "english": "The injury left a deep cut on his arm.", "thai": "บาดแผลทำให้เกิดรอยบาดลึกที่แขนเขา"}
{"word": "cut", "english": "We need to cut the grass this weekend.", "thai": "เราต้องตัดหญ้าสุดสัปดาห์นี้"}
{"word": "cut", "english": "He cut the meeting short to take a call.", "thai": "เขาตัดการประชุมให้สั้นเพื่อรับโทรศัพท์"}
{"word": "cut", "english": "I cut out dairy to feel better.", "thai": "ฉันตัดนมออกเพื่อให้รู้สึกดีขึ้น"}
{"word": "cut", "english": "She cut the vegetables for the stew.", "thai": "เธอตัดผักสำหรับสตูว์"}
{"word": "cut", "english": "The store cut prices for the holiday sale.", "thai": "ร้านค้าลดราคาสำหรับเทศกาลลดราคา"}
{"word": "cut", "english": "He cut his speech short due to time.", "thai": "เขาตัดสุนทรพจน์ให้สั้นเพราะเวลา"}
{"word": "cut", "english": "I cut my hand while opening a can.", "thai": "ฉันบาดมือตอนเปิดกระป๋อง"}
{"word": "cut", "english": "Let’s cut the ribbon for the grand opening.", "thai": "มาตัดริบบิ้นสำหรับพิธีเปิดตัว"}
{"word": "cut", "english": "She cut contact with her toxic friend.", "thai": "เธอตัดการติดต่อกับเพื่อนที่เป็นพิษ"}
{"word": "cut", "english": "Can you cut the cheese into cubes?", "thai": "คุณช่วยตัดชีสเป็นลูกเต๋าได้ไหม?"}
{"word": "cut", "english": "The accident cut off traffic for hours.", "thai": "อุบัติเหตุทำให้การจราจรติดขัดเป็นชั่วโมง"}
{"word": "cut", "english": "I cut my workout because I felt sick.", "thai": "ฉันตัดการออกกำลังกายเพราะรู้สึกไม่สบาย"}
{"word": "cut", "english": "He cut the wire to fix the circuit.", "thai": "เขาตัดสายไฟเพื่อซ่อมวงจร"}
{"word": "cut", "english": "They cut the show’s budget this season.", "thai": "พวกเขาลดงบประมาณของรายการในฤดูกาลนี้"}
{"word": "cut", "english": "She cut a piece of tape to fix the tear.", "thai": "เธอตัดเทปเพื่อซ่อมรอยฉีก"}
{"word": "cut", "english": "I cut my foot on a sharp rock.", "thai": "ฉันบาดเท้าที่หินคม"}
{"word": "cut", "english": "Let’s cut the dough into small pieces.", "thai": "มาตัดแป้งเป็นชิ้นเล็กๆ กัน"}
{"word": "cut", "english": "The company cut staff to reduce expenses.", "thai": "บริษัทลดพนักงานเพื่อลดค่าใช้จ่าย"}
{"word": "cut", "english": "He cut in while I was talking.", "thai": "เขาขัดจังหวะตอนฉันพูด"}
{"word": "cut", "english": "I’m trying to cut down on fast food.", "thai": "ฉันพยายามลดการกินอาหารจานด่วน"}
{"word": "cut", "english": "She cut the pattern for the costume.", "thai": "เธอตัดแพทเทิร์นสำหรับชุด"}
{"word": "cut", "english": "The power cut ruined our movie night.", "thai": "ไฟดับทำลายค่ำคืนดูหนังของเรา"}
{"word": "cut", "english": "Can you cut me a break this time?", "thai": "คุณช่วยให้ฉันพักบ้างครั้งนี้ได้ไหม?"}
{"word": "cut", "english": "He cut the branches to clear the path.", "thai": "เขาตัดกิ่งไม้เพื่อเคลียร์ทาง"}
{"word": "cut", "english": "They cut funding for the school program.", "thai": "พวกเขาลดงบประมาณสำหรับโครงการโรงเรียน"}
{"word": "cut", "english": "She cut the string to free the kite.", "thai": "เธอตัดเชือกเพื่อปล่อยว่าว"}
{"word": "cut", "english": "I cut my knee when I fell off my bike.", "thai": "ฉันบาดเข่าตอนตกจากจักรยาน"}
{"word": "cut", "english": "Let’s cut the fruit for the salad.", "thai": "มาตัดผลไม้สำหรับสลัดกัน"}
{"word": "cut", "english": "The editor cut the book by 50 pages.", "thai": "บรรณาธิการตัดหนังสือออก 50 หน้า"}
{"word": "cut", "english": "He cut through the park to get home faster.", "thai": "เขาลัดผ่านสวนเพื่อกลับบ้านเร็วขึ้น"}
{"word": "cut", "english": "I’m trying to cut back on soda.", "thai": "ฉันพยายามลดการดื่มโซดา"}
{"word": "cut", "english": "She cut her old clothes to make rags.", "thai": "เธอตัดเสื้อผ้าเก่าเพื่อทำผ้าขี้ริ้ว"}
{"word": "cut", "english": "The injury caused a small cut on her leg.", "thai": "บาดแผลทำให้เกิดรอยบาดเล็กๆ ที่ขาของเธอ"}
{"word": "cut", "english": "We need to cut the bushes in the yard.", "thai": "เราต้องตัดพุ่มไม้ในสวน"}
{"word": "cut", "english": "He cut the presentation short due to time.", "thai": "เขาตัดการนำเสนอให้สั้นเพราะเวลา"}
{"word": "cut", "english": "I cut out alcohol to improve my health.", "thai": "ฉันตัดแอลกอฮอล์เพื่อสุขภาพที่ดีขึ้น"}
{"word": "cut", "english": "She cut the carrots for the soup.", "thai": "เธอตัดแครอทสำหรับซุป"}
{"word": "cut", "english": "The store cut prices for the clearance sale.", "thai": "ร้านค้าลดราคาสำหรับการขายเคลียร์สต็อก"}
{"word": "cut", "english": "He cut his speech to fit the schedule.", "thai": "เขาตัดสุนทรพจน์ให้เข้ากับตาราง"}
{"word": "cut", "english": "I cut my arm while gardening.", "thai": "ฉันบาดแขนตอนทำสวน"}
{"word": "cut", "english": "Let’s cut the ribbon to start the event.", "thai": "มาตัดริบบิ้นเพื่อเริ่มงาน"}
{"word": "cut", "english": "She cut ties with her old job.", "thai": "เธอตัดความสัมพันธ์กับงานเก่า"}
{"word": "cut", "english": "Can you cut the bread into thin slices?", "thai": "คุณช่วยตัดขนมปังเป็นชิ้นบางๆ ได้ไหม?"}
{"word": "dance", "english": "Do you want to dance with me tonight?", "thai": "คุณอยากเต้นรำกับฉันคืนนี้ไหม?"}
{"word": "dance", "english": "She loves to dance to pop music.", "thai": "เธอชอบเต้นตามเพลงป๊อป"}
{"word": "dance", "english": "The couple’s dance at the wedding was beautiful.", "thai": "การเต้นรำของคู่รักในงานแต่งงานสวยงามมาก"}
{"word": "dance", "english": "I’m taking a dance class this weekend.", "thai": "ฉันจะไปเรียนเต้นรำสุดสัปดาห์นี้"}
{"word": "dance", "english": "He did a funny dance to make us laugh.", "thai": "เขาทำท่าเต้นตลกเพื่อให้เราหัวเราะ"}
{"word": "dance", "english": "Let’s dance like nobody’s watching!", "thai": "มาเต้นเหมือนไม่มีใครดูกันเถอะ!"}
{"word": "dance", "english": "The kids love to dance in the living room.", "thai": "เด็กๆ ชอบเต้นในห้องนั่งเล่น"}
{"word": "dance", "english": "Her dance performance was absolutely stunning.", "thai": "การแสดงเต้นรำของเธอสวยงามมาก"}
{"word": "dance", "english": "Can you teach me how to dance salsa?", "thai": "คุณสอนฉันเต้นซัลซ่าได้ไหม?"}
{"word": "dance", "english": "They dance together every Friday night.", "thai": "พวกเขาเต้นรำด้วยกันทุกคืนวันศุกร์"}
{"word": "dance", "english": "I saw her dance at the talent show.", "thai": "ฉันเห็นเธอเต้นในงานแสดงความสามารถ"}
{"word": "dance", "english": "He’s too shy to dance in public.", "thai": "เขาเขินเกินกว่าจะเต้นในที่สาธารณะ"}
{"word": "dance", "english": "The song makes me want to dance!", "thai": "เพลงนี้ทำให้ฉันอยากเต้น!"}
{"word": "dance", "english": "She practiced her dance routine for hours.", "thai": "เธอฝึกท่าเต้นของเธอเป็นชั่วโมง"}
{"word": "dance", "english": "Let’s go to the dance party tonight.", "thai": "ไปงานปาร์ตี้เต้นรำคืนนี้กันเถอะ"}
{"word": "dance", "english": "He learned to dance from watching videos.", "thai": "เขาเรียนเต้นจากวิดีโอ"}
{"word": "dance", "english": "The dance floor was packed with people.", "thai": "ฟลอร์เต้นรำเต็มไปด้วยผู้คน"}
{"word": "dance", "english": "I can’t dance, but I’ll give it a try.", "thai": "ฉันเต้นไม่เป็น แต่จะลองดู"}
{"word": "dance", "english": "Her ballet dance brought tears to my eyes.", "thai": "การเต้นบัลเลต์ของเธอทำให้น้ำตาคลอ"}
{"word": "dance", "english": "They dance so well together as a team.", "thai": "พวกเขาเต้นด้วยกันได้ดีมากเป็นทีม"}
{"word": "dance", "english": "I love to dance to hip-hop music.", "thai": "ฉันชอบเต้นตามเพลงฮิปฮอป"}
{"word": "dance", "english": "The festival included a traditional dance show.", "thai": "งานเทศกาลมีการแสดงเต้นรำแบบดั้งเดิม"}
{"word": "dance", "english": "She taught the kids a new dance move.", "thai": "เธอสอนเด็กๆ ท่าเต้นใหม่"}
{"word": "dance", "english": "He tripped during the dance but kept going.", "thai": "เขาสะดุดระหว่างเต้นแต่ยังเต้นต่อ"}
{"word": "dance", "english": "Let’s dance to this old classic song.", "thai": "มาเต้นกับเพลงคลาสสิกเก่านี้กัน"}
{"word": "dance", "english": "The dance competition was so exciting!", "thai": "การแข่งขันเต้นรำน่าตื่นเต้นมาก!"}
{"word": "dance", "english": "I’m too tired to dance tonight.", "thai": "ฉันเหนื่อยเกินกว่าจะเต้นคืนนี้"}
{"word": "dance", "english": "She choreographed a dance for the play.", "thai": "เธอออกแบบท่าเต้นสำหรับละคร"}
{"word": "dance", "english": "Can we dance one more time before leaving?", "thai": "เราเต้นอีกครั้งก่อนไปได้ไหม?"}
{"word": "dance", "english": "He’s practicing his dance for the recital.", "thai": "เขากำลังฝึกเต้นสำหรับการแสดง"}
{"word": "dance", "english": "The crowd cheered during her dance routine.", "thai": "ฝูงชนส่งเสียงเชียร์ระหว่างท่าเต้นของเธอ"}
{"word": "dance", "english": "I learned a new dance at the workshop.", "thai": "ฉันเรียนท่าเต้นใหม่ในเวิร์กช็อป"}
{"word": "dance", "english": "They dance like they’ve known each other forever.", "thai": "พวกเขาเต้นเหมือนรู้จักกันมานาน"}
{"word": "dance", "english": "The music was perfect for a slow dance.", "thai": "เพลงนี้เหมาะสำหรับการเต้นรำช้าๆ"}
{"word": "dance", "english": "She wants to dance professionally one day.", "thai": "เธออยากเป็นนักเต้นมืออาชีพสักวัน"}
{"word": "dance", "english": "Let’s dance to celebrate the good news!", "thai": "มาเต้นฉลองข่าวดีกัน!"}
{"word": "dance", "english": "He’s not great at dance, but he tries.", "thai": "เขาเต้นไม่เก่ง แต่ก็พยายาม"}
{"word": "dance", "english": "The dance class was so much fun!", "thai": "ชั้นเรียนเต้นรำสนุกมาก!"}
{"word": "dance", "english": "I saw them dance at the school event.", "thai": "ฉันเห็นพวกเขาเต้นในงานโรงเรียน"}
{"word": "dance", "english": "She did a dance to cheer everyone up.", "thai": "เธอเต้นเพื่อให้ทุกคนร่าเริง"}
{"word": "dance", "english": "Can you dance to this fast beat?", "thai": "คุณเต้นตามจังหวะเร็วนี้ได้ไหม?"}
{"word": "dance", "english": "The dance team won first place!", "thai": "ทีมเต้นรำได้ที่หนึ่ง!"}
{"word": "dance", "english": "I love watching people dance on TV.", "thai": "ฉันชอบดูคนเต้นในทีวี"}
{"word": "dance", "english": "He asked her to dance at the prom.", "thai": "เขาชวนเธอเต้นในงานพรอม"}
{"word": "dance", "english": "The kids did a cute dance for the show.", "thai": "เด็กๆ เต้นน่ารักในงานแสดง"}
{"word": "dance", "english": "I’m learning a traditional dance for the festival.", "thai": "ฉันกำลังเรียนเต้นรำแบบดั้งเดิมสำหรับเทศกาล"}
{"word": "dance", "english": "She tripped but kept the dance going.", "thai": "เธอสะดุดแต่ยังเต้นต่อ"}
{"word": "dance", "english": "Let’s dance until the music stops!", "thai": "มาเต้นจนกว่าเพลงจะหยุด!"}
{"word": "dance", "english": "His dance moves were so impressive.", "thai": "ท่าเต้นของเขาน่าประทับใจมาก"}
{"word": "dance", "english": "I can’t dance well, but I enjoy it.", "thai": "ฉันเต้นไม่เก่ง แต่ฉันสนุกกับมัน"}
{"word": "dance", "english": "The dance performance was sold out.", "thai": "การแสดงเต้นรำขายบัตรหมด"}
{"word": "dance", "english": "She loves to dance in her room alone.", "thai": "เธอชอบเต้นคนเดียวในห้อง"}
{"word": "dance", "english": "He taught me a cool dance move.", "thai": "เขาสอนฉันท่าเต้นเจ๋งๆ"}
{"word": "dance", "english": "The dance floor was lit up with lights.", "thai": "ฟลอร์เต้นรำสว่างไสวด้วยแสงไฟ"}
{"word": "dance", "english": "I want to dance at the club tonight.", "thai": "ฉันอยากไปเต้นที่คลับคืนนี้"}
{"word": "dance", "english": "Her dance brought the audience to their feet.", "thai": "การเต้นของเธอทำให้ผู้ชมลุกขึ้นยืน"}
{"word": "dance", "english": "Can we practice the dance one more time?", "thai": "เราฝึกเต้นอีกครั้งได้ไหม?"}
{"word": "dance", "english": "They dance so gracefully together.", "thai": "พวกเขาเต้นด้วยกันอย่างสง่างาม"}
{"word": "dance", "english": "I’m too nervous to dance in front of people.", "thai": "ฉันตื่นเต้นเกินกว่าจะเต้นต่อหน้าคน"}
{"word": "dance", "english": "The song has a great dance rhythm.", "thai": "เพลงนี้มีจังหวะเต้นที่ยอดเยี่ยม"}
{"word": "dance", "english": "She joined a dance group at school.", "thai": "เธอเข้าร่วมกลุ่มเต้นที่โรงเรียน"}
{"word": "dance", "english": "Let’s dance to this new hit song!", "thai": "มาเต้นกับเพลงฮิตใหม่นี้กัน!"}
{"word": "dance", "english": "His dance video went viral online.", "thai": "วิดีโอเต้นของเขาโด่งดังในโลกออนไลน์"}
{"word": "dance", "english": "I took a dance lesson last week.", "thai": "ฉันเรียนเต้นเมื่อสัปดาห์ที่แล้ว"}
{"word": "dance", "english": "The dance troupe performed at the festival.", "thai": "คณะเต้นรำแสดงในงานเทศกาล"}
{"word": "dance", "english": "She wants to dance in a music video.", "thai": "เธออยากเต้นในมิวสิกวิดีโอ"}
{"word": "dance", "english": "He did a silly dance to entertain the kids.", "thai": "เขาทำท่าเต้นตลกเพื่อสร้างความบันเทิงให้เด็กๆ"}
{"word": "dance", "english": "The dance class is every Tuesday evening.", "thai": "ชั้นเรียนเต้นรำจัดทุกคืนวันอังคาร"}
{"word": "dance", "english": "I can’t stop watching her dance routine.", "thai": "ฉันหยุดดูท่าเต้นของเธอไม่ได้"}
{"word": "dance", "english": "They dance to jazz music every weekend.", "thai": "พวกเขาเต้นตามเพลงแจ๊สทุกสุดสัปดาห์"}
{"word": "dance", "english": "I’m learning a dance for the wedding.", "thai": "ฉันกำลังเรียนเต้นสำหรับงานแต่งงาน"}
{"word": "dance", "english": "Her dance moves are so creative!", "thai": "ท่าเต้นของเธอสร้างสรรค์มาก!"}
{"word": "dance", "english": "Can you dance to this slow song?", "thai": "คุณเต้นตามเพลงช้านี้ได้ไหม?"}
{"word": "dance", "english": "The dance show was a huge success.", "thai": "การแสดงเต้นรำประสบความสำเร็จอย่างมาก"}
{"word": "dance", "english": "I love to dance when I’m happy.", "thai": "ฉันชอบเต้นเมื่อรู้สึกมีความสุข"}
{"word": "dance", "english": "He’s practicing a dance for the audition.", "thai": "เขากำลังฝึกเต้นสำหรับการออดิชัน"}
{"word": "dance", "english": "The dance party lasted until midnight.", "thai": "งานปาร์ตี้เต้นรำยาวถึงเที่ยงคืน"}
{"word": "dance", "english": "She learned to dance from her mom.", "thai": "เธอเรียนเต้นจากแม่ของเธอ"}
{"word": "dance", "english": "Let’s dance to this upbeat track!", "thai": "มาเต้นกับเพลงจังหวะสนุกนี้กัน!"}
{"word": "dance", "english": "His dance skills impressed everyone.", "thai": "ทักษะการเต้นของเขาทำให้ทุกคนประทับใจ"}
{"word": "dance", "english": "I’m not good at dance, but I try.", "thai": "ฉันเต้นไม่เก่ง แต่ฉันพยายาม"}
{"word": "dance", "english": "The dance recital was so emotional.", "thai": "การแสดงเต้นรำนั้นเต็มไปด้วยอารมณ์"}
{"word": "dance", "english": "She loves to dance in the rain.", "thai": "เธอชอบเต้นท่ามกลางสายฝน"}
{"word": "dance", "english": "He taught the group a new dance.", "thai": "เขาสอนกลุ่มท่าเต้นใหม่"}
{"word": "dance", "english": "The dance floor was crowded all night.", "thai": "ฟลอร์เต้นรำแน่นทั้งคืน"}
{"word": "dance", "english": "I want to dance at the festival.", "thai": "ฉันอยากเต้นในงานเทศกาล"}
{"word": "dance", "english": "Her dance performance was breathtaking.", "thai": "การแสดงเต้นรำของเธอน่าทึ่ง"}
{"word": "dance", "english": "Can we practice our dance routine again?", "thai": "เราฝึกท่าเต้นของเราอีกครั้งได้ไหม?"}
{"word": "dance", "english": "They dance like they’re in love.", "thai": "พวกเขาเต้นเหมือนกำลังตกหลุมรัก"}
{"word": "dance", "english": "I’m too shy to dance at parties.", "thai": "ฉันเขินเกินกว่าจะเต้นในงานปาร์ตี้"}
{"word": "dance", "english": "The song’s beat is perfect for dance.", "thai": "จังหวะของเพลงนี้เหมาะสำหรับการเต้น"}
{"word": "dance", "english": "She joined a dance club at college.", "thai": "เธอเข้าร่วมชมรมเต้นรำที่มหาวิทยาลัย"}
{"word": "dance", "english": "Let’s dance to this classic tune!", "thai": "มาเต้นกับเพลงคลาสสิกนี้กัน!"}
{"word": "dance", "english": "His dance video got thousands of likes.", "thai": "วิดีโอเต้นของเขาได้ไลค์เป็นพัน"}
{"word": "dance", "english": "I signed up for a dance workshop.", "thai": "ฉันสมัครเข้าร่วมเวิร์กช็อปเต้นรำ"}
{"word": "dance", "english": "The dance group practiced all week.", "thai": "กลุ่มเต้นรำฝึกซ้อมทั้งสัปดาห์"}
{"word": "dance", "english": "She wants to dance on a big stage.", "thai": "เธออยากเต้นบนเวทีใหญ่"}
{"word": "dance", "english": "He did a dance to make everyone smile.", "thai": "เขาทำท่าเต้นเพื่อให้ทุกคนยิ้ม"}
{"word": "dance", "english": "The dance class is open to everyone.", "thai": "ชั้นเรียนเต้นรำเปิดให้ทุกคน"}
{"word": "dance", "english": "I can’t stop watching their dance performance.", "thai": "ฉันหยุดดูการแสดงเต้นรำของพวกเขาไม่ได้"}
{"word": "do", "english": "What do you want to do today?", "thai": "วันนี้คุณอยากทำอะไร?"}
{"word": "do", "english": "I need to do my homework before dinner.", "thai": "ฉันต้องทำการบ้านก่อนอาหารเย็น"}
{"word": "do", "english": "Can you do me a favor and grab my phone?", "thai": "คุณช่วยหยิบโทรศัพท์ให้ฉันหน่อยได้ไหม?"}
{"word": "do", "english": "Let’s do something fun this weekend!", "thai": "สุดสัปดาห์นี้มาทำอะไรสนุกๆ กัน!"}
{"word": "do", "english": "She did a great job on the project.", "thai": "เธอทำงานได้ยอดเยี่ยมในโครงการนี้"}
{"word": "do", "english": "I don’t know what to do about this mess.", "thai": "ฉันไม่รู้จะทำยังไงกับความวุ่นวายนี้"}
{"word": "do", "english": "Do you want to do the dishes tonight?", "thai": "คืนนี้คุณอยากล้างจานไหม?"}
{"word": "do", "english": "He’s doing his best to stay calm.", "thai": "เขากำลังพยายามอย่างเต็มที่เพื่อสงบสติอารมณ์"}
{"word": "do", "english": "We should do lunch together soon.", "thai": "เราควรไปกินข้าวเที่ยงด้วยกันเร็วๆ นี้"}
{"word": "do", "english": "I did my laundry yesterday.", "thai": "ฉันซักผ้าไปเมื่อวานนี้"}
{"word": "do", "english": "What does she do for a living?", "thai": "เธอทำอะไรหาเลี้ยงชีพ?"}
{"word": "do", "english": "Can you do this puzzle with me?", "thai": "คุณช่วยเล่นปริศนานี้กับฉันได้ไหม?"}
{"word": "do", "english": "I’m doing yoga to relax.", "thai": "ฉันกำลังเล่นโยคะเพื่อผ่อนคลาย"}
{"word": "do", "english": "They did a fantastic performance last night.", "thai": "เมื่อคืนพวกเขาแสดงได้ยอดเยี่ยมมาก"}
{"word": "do", "english": "Do your chores before you go out.", "thai": "ทำหน้าที่บ้านให้เสร็จก่อนออกไป"}
{"word": "do", "english": "I don’t want to do this anymore.", "thai": "ฉันไม่อยากทำสิ่งนี้อีกแล้ว"}
{"word": "do", "english": "She’s doing her hair for the party.", "thai": "เธอกำลังทำผมสำหรับงานปาร์ตี้"}
{"word": "do", "english": "Let’s do a movie night this Friday.", "thai": "จัดค่ำคืนดูหนังวันศุกร์นี้กันเถอะ"}
{"word": "do", "english": "He did the repairs on the car himself.", "thai": "เขาซ่อมรถด้วยตัวเอง"}
{"word": "do", "english": "What can we do to help you?", "thai": "เราจะช่วยอะไรคุณได้บ้าง?"}
{"word": "do", "english": "I’m doing my taxes this weekend.", "thai": "ฉันจะทำภาษีสุดสัปดาห์นี้"}
{"word": "do", "english": "Do you know how to do this math problem?", "thai": "คุณรู้วิธีแก้โจทย์คณิตนี้ไหม?"}
{"word": "do", "english": "She did a double take when she saw him.", "thai": "เธอมองซ้ำเมื่อเห็นเขา"}
{"word": "do", "english": "I need to do some shopping later.", "thai": "ฉันต้องไปช็อปปิ้งบ้างตอนหลัง"}
{"word": "do", "english": "They’re doing a sale at the store.", "thai": "ร้านค้ากำลังจัดลดราคา"}
{"word": "do", "english": "Can you do a quick check of my work?", "thai": "คุณช่วยตรวจงานของฉันเร็วๆ ได้ไหม?"}
{"word": "do", "english": "I did my best, but it wasn’t enough.", "thai": "ฉันพยายามเต็มที่แล้ว แต่มันไม่พอ"}
{"word": "do", "english": "Let’s do a hike in the mountains.", "thai": "ไปเดินป่าบนเขากันเถอะ"}
{"word": "do", "english": "He’s doing well in his new job.", "thai": "เขาทำได้ดีในงานใหม่"}
{"word": "do", "english": "Do you want to do karaoke tonight?", "thai": "คืนนี้อยากไปร้องคาราโอเกะไหม?"}
{"word": "do", "english": "I did a workout this morning.", "thai": "ฉันออกกำลังกายเมื่อเช้า"}
{"word": "do", "english": "She’s doing research for her book.", "thai": "เธอกำลังทำวิจัยสำหรับหนังสือของเธอ"}
{"word": "do", "english": "What did you do last weekend?", "thai": "สุดสัปดาห์ที่แล้วคุณทำอะไร?"}
{"word": "do", "english": "I can’t do this without your help.", "thai": "ฉันทำสิ่งนี้ไม่ได้ถ้าไม่มีคุณช่วย"}
{"word": "do", "english": "They did a great job decorating the room.", "thai": "พวกเขาตกแต่งห้องได้ยอดเยี่ยม"}
{"word": "do", "english": "Do your best and don’t give up.", "thai": "พยายามให้เต็มที่และอย่ายอมแพ้"}
{"word": "do", "english": "I’m doing some gardening this afternoon.", "thai": "บ่ายนี้ฉันจะทำสวน"}
{"word": "do", "english": "Can you do the presentation for the team?", "thai": "คุณนำเสนอให้ทีมได้ไหม?"}
{"word": "do", "english": "She did her nails for the event.", "thai": "เธอทำเล็บสำหรับงานนี้"}
{"word": "do", "english": "Let’s do a picnic by the lake.", "thai": "ไปปิกนิกที่ริมทะเลสาบกันเถอะ"}
{"word": "do", "english": "He did a favor for his neighbor.", "thai": "เขาช่วยเหลือเพื่อนบ้าน"}
{"word": "do", "english": "What do you do when you’re stressed?", "thai": "คุณทำอะไรเมื่อรู้สึกเครียด?"}
{"word": "do", "english": "I did the cleaning this morning.", "thai": "ฉันทำความสะอาดเมื่อเช้า"}
{"word": "do", "english": "Do you know how to do a backflip?", "thai": "คุณรู้วิธีตีลังกาหลังไหม?"}
{"word": "do", "english": "She’s doing a marathon next month.", "thai": "เธอจะวิ่งมาราธอนเดือนหน้า"}
{"word": "do", "english": "I did a sketch of the landscape.", "thai": "ฉันวาดภาพร่างของทิวทัศน์"}
{"word": "do", "english": "Let’s do something special for her birthday.", "thai": "มาทำอะไรพิเศษสำหรับวันเกิดเธอกัน"}
{"word": "do", "english": "He’s doing a project for school.", "thai": "เขากำลังทำโปรเจกต์สำหรับโรงเรียน"}
{"word": "do", "english": "Do you want to do a game night?", "thai": "อยากจัดค่ำคืนเล่นเกมไหม?"}
{"word": "do", "english": "I did my part, now it’s your turn.", "thai": "ฉันทำส่วนของฉันแล้ว ตาคุณแล้ว"}
{"word": "do", "english": "She’s doing her makeup for the party.", "thai": "เธอกำลังแต่งหน้าสำหรับงานปาร์ตี้"}
{"word": "do", "english": "Can you do this task by tomorrow?", "thai": "คุณทำภารกิจนี้ให้เสร็จภายในพรุ่งนี้ได้ไหม?"}
{"word": "do", "english": "I’m doing a puzzle to relax.", "thai": "ฉันกำลังเล่นปริศนาเพื่อผ่อนคลาย"}
{"word": "do", "english": "They did a survey to gather opinions.", "thai": "พวกเขาทำแบบสำรวจเพื่อเก็บความคิดเห็น"}
{"word": "do", "english": "What do you do for fun?", "thai": "คุณทำอะไรเพื่อความสนุก?"}
{"word": "do", "english": "I did the grocery shopping yesterday.", "thai": "ฉันไปซื้อของชำเมื่อวาน"}
{"word": "do", "english": "Do you know how to do coding?", "thai": "คุณรู้วิธีเขียนโค้ดไหม?"}
{"word": "do", "english": "She did a great job leading the team.", "thai": "เธอนำทีมได้ยอดเยี่ยมมาก"}
{"word": "do", "english": "Let’s do a road trip this summer.", "thai": "ไปเที่ยวแบบขับรถกันหน้าร้อนนี้เถอะ"}
{"word": "do", "english": "He’s doing his homework in the library.", "thai": "เขากำลังทำการบ้านในห้องสมุด"}
{"word": "do", "english": "Do you want to do some baking today?", "thai": "วันนี้อยากอบขนมไหม?"}
{"word": "do", "english": "I did a painting for the art show.", "thai": "ฉันวาดภาพสำหรับงานแสดงศิลปะ"}
{"word": "do", "english": "She’s doing a course on photography.", "thai": "เธอกำลังเรียนคอร์สการถ่ายภาพ"}
{"word": "do", "english": "What did you do for your birthday?", "thai": "วันเกิดคุณทำอะไร?"}
{"word": "do", "english": "I can’t do this without more information.", "thai": "ฉันทำสิ่งนี้ไม่ได้ถ้าไม่มีข้อมูลเพิ่ม"}
{"word": "do", "english": "They did a charity event last week.", "thai": "พวกเขาจัดงานการกุศลเมื่อสัปดาห์ที่แล้ว"}
{"word": "do", "english": "Do your best to stay focused.", "thai": "พยายามให้เต็มที่เพื่อมีสมาธิ"}
{"word": "do", "english": "I’m doing some writing for my blog.", "thai": "ฉันกำลังเขียนบล็อก"}
{"word": "do", "english": "Can you do the report by Friday?", "thai": "คุณทำรายงานให้เสร็จภายในวันศุกร์ได้ไหม?"}
{"word": "do", "english": "She did her stretches before running.", "thai": "เธอยืดกล้ามเนื้อก่อนวิ่ง"}
{"word": "do", "english": "Let’s do a barbecue this weekend.", "thai": "จัดบาร์บีคิวสุดสัปดาห์นี้กันเถอะ"}
{"word": "do", "english": "He did a favor for his friend.", "thai": "เขาช่วยเพื่อน"}
{"word": "do", "english": "What do you do when you’re bored?", "thai": "คุณทำอะไรเมื่อรู้สึกเบื่อ?"}
{"word": "do", "english": "I did the dishes after dinner.", "thai": "ฉันล้างจานหลังอาหารเย็น"}
{"word": "do", "english": "Do you know how to do a cartwheel?", "thai": "คุณรู้วิธีตีลังกาด้านข้างไหม?"}
{"word": "do", "english": "She’s doing a presentation for work.", "thai": "เธอกำลังเตรียมนำเสนอสำหรับงาน"}
{"word": "do", "english": "I did a drawing of my dog.", "thai": "ฉันวาดภาพสุนัขของฉัน"}
{"word": "do", "english": "Let’s do something nice for Mom.", "thai": "มาทำอะไรดีๆ ให้แม่กัน"}
{"word": "do", "english": "He’s doing a science experiment at school.", "thai": "เขากำลังทำการทดลองวิทยาศาสตร์ที่โรงเรียน"}
{"word": "do", "english": "Do you want to do a puzzle together?", "thai": "อยากเล่นปริศนาด้วยกันไหม?"}
{"word": "do", "english": "I did my workout early today.", "thai": "ฉันออกกำลังกายแต่เช้าตรู่"}
{"word": "do", "english": "She’s doing her best to stay positive.", "thai": "เธอกำลังพยายามให้ตัวเองคิดบวก"}
{"word": "do", "english": "Can you do a quick edit of this document?", "thai": "คุณช่วยแก้ไขเอกสารนี้เร็วๆ ได้ไหม?"}
{"word": "do", "english": "I’m doing some cooking for the party.", "thai": "ฉันกำลังทำอาหารสำหรับงานปาร์ตี้"}
{"word": "do", "english": "They did a renovation on their house.", "thai": "พวกเขาปรับปรุงบ้าน"}
{"word": "do", "english": "What do you do to stay healthy?", "thai": "คุณทำอะไรเพื่อสุขภาพดี?"}
{"word": "do", "english": "I did the laundry this afternoon.", "thai": "ฉันซักผ้าตอนบ่าย"}
{"word": "do", "english": "Do you know how to do a magic trick?", "thai": "คุณรู้วิธีเล่นกลไหม?"}
{"word": "do", "english": "She did a great job organizing the event.", "thai": "เธอจัดงานได้ยอดเยี่ยม"}
{"word": "do", "english": "Let’s do a game of cards tonight.", "thai": "คืนนี้มาเล่นไพ่กัน"}
{"word": "do", "english": "He’s doing his taxes with an accountant.", "thai": "เขากำลังทำภาษีกับนักบัญชี"}
{"word": "do", "english": "Do you want to do some volunteering?", "thai": "อยากไปเป็นอาสาสมัครไหม?"}
{"word": "do", "english": "I did a sketch for the art class.", "thai": "ฉันวาดภาพร่างสำหรับชั้นเรียนศิลปะ"}
{"word": "do", "english": "She’s doing a study abroad program.", "thai": "เธอกำลังเรียนในโครงการแลกเปลี่ยนต่างประเทศ"}
{"word": "do", "english": "What did you do after the meeting?", "thai": "หลังประชุมคุณทำอะไร?"}
{"word": "do", "english": "I can’t do this task alone.", "thai": "ฉันทำภารกิจนี้คนเดียวไม่ได้"}
{"word": "do", "english": "They did a cleanup at the park.", "thai": "พวกเขาทำความสะอาดที่สวนสาธารณะ"}
{"word": "do", "english": "Do your best to finish on time.", "thai": "พยายามให้เต็มที่เพื่อให้เสร็จทันเวลา"}
{"word": "do", "english": "I’m doing some reading tonight.", "thai": "คืนนี้ฉันจะอ่านหนังสือ"}
{"word": "draw", "english": "Can you draw a picture of a dog for me?", "thai": "คุณวาดรูปสุนัขให้ฉันได้ไหม?"}
{"word": "draw", "english": "I love to draw in my sketchbook.", "thai": "ฉันชอบวาดรูปในสมุดสเก็ตช์"}
{"word": "draw", "english": "She drew a heart on the paper.", "thai": "เธอวาดรูปหัวใจบนกระดาษ"}
{"word": "draw", "english": "The game ended in a draw.", "thai": "เกมจบลงด้วยผลเสมอ"}
{"word": "draw", "english": "He drew a card from the deck.", "thai": "เขาจั่วไพ่จากสำรับ"}
{"word": "draw", "english": "The artist drew a portrait of her.", "thai": "ศิลปินวาดภาพเหมือนของเธอ"}
{"word": "draw", "english": "Let’s draw names for the gift exchange.", "thai": "มาจับฉลากชื่อสำหรับการแลกของขวัญกัน"}
{"word": "draw", "english": "I’m trying to draw a map of the park.", "thai": "ฉันกำลังพยายามวาดแผนที่ของสวนสาธารณะ"}
{"word": "draw", "english": "The story drew me in completely.", "thai": "เรื่องราวนี้ดึงดูดฉันอย่างเต็มที่"}
{"word": "draw", "english": "She drew a circle around the answer.", "thai": "เธอวาดวงกลมรอบคำตอบ"}
{"word": "draw", "english": "He drew his sword in the play.", "thai": "เขา拔ดาบในละคร"}
{"word": "draw", "english": "The kids love to draw with crayons.", "thai": "เด็กๆ ชอบวาดรูปด้วยดินสอสี"}
{"word": "draw", "english": "Can you draw a tree for the poster?", "thai": "คุณวาดรูปต้นไม้สำหรับโปสเตอร์ได้ไหม?"}
{"word": "draw", "english": "The movie drew a huge crowd.", "thai": "หนังเรื่องนี้ดึงดูดผู้คนจำนวนมาก"}
{"word": "draw", "english": "I drew a blank when asked the question.", "thai": "ฉันนึกอะไรไม่ออกเมื่อถูกถาม"}
{"word": "draw", "english": "She’s learning to draw in art class.", "thai": "เธอกำลังเรียนวาดรูปในชั้นเรียนศิลปะ"}
{"word": "draw", "english": "He drew a line in the sand.", "thai": "เขาขีดเส้นบนทราย"}
{"word": "draw", "english": "Let’s draw a picture together!", "thai": "มาวาดรูปด้วยกันเถอะ!"}
{"word": "draw", "english": "The book drew inspiration from history.", "thai": "หนังสือเล่มนี้ได้รับแรงบันดาลใจจากประวัติศาสตร์"}
{"word": "draw", "english": "I drew a star on my notebook.", "thai": "ฉันวาดดาวบนสมุดโน้ต"}
{"word": "draw", "english": "The match was a draw, so we replayed.", "thai": "การแข่งขันเสมอกัน เลยต้องแข่งใหม่"}
{"word": "draw", "english": "He drew water from the well.", "thai": "เขาตักน้ำจากบ่อ"}
{"word": "draw", "english": "She drew a crowd with her speech.", "thai": "เธอดึงดูดผู้คนด้วยสุนทรพจน์ของเธอ"}
{"word": "draw", "english": "Can you draw me a quick sketch?", "thai": "คุณวาดสเก็ตช์เร็วๆ ให้ฉันได้ไหม?"}
{"word": "draw", "english": "I’m not good at drawing faces.", "thai": "ฉันวาดหน้าไม่เก่ง"}
{"word": "draw", "english": "The teacher asked us to draw a house.", "thai": "ครูขอให้เราวาดรูปบ้าน"}
{"word": "draw", "english": "The deal drew criticism from the public.", "thai": "ข้อตกลงนี้ได้รับการวิจารณ์จากสาธารณชน"}
{"word": "draw", "english": "He drew a deep breath before speaking.", "thai": "เขาสูดหายใจลึกก่อนพูด"}
{"word": "draw", "english": "Let’s draw straws to decide who goes first.", "thai": "มาจับฉลากเพื่อตัดสินว่าใครไปก่อน"}
{"word": "draw", "english": "She drew a flower on the whiteboard.", "thai": "เธอวาดดอกไม้บนกระดานไวท์บอร์ด"}
{"word": "draw", "english": "The festival drew thousands of visitors.", "thai": "เทศกาลนี้ดึงดูดนักท่องเที่ยวนับพัน"}
{"word": "draw", "english": "I drew a map to the treasure.", "thai": "ฉันวาดแผนที่ไปยังสมบัติ"}
{"word": "draw", "english": "The teams drew in the final game.", "thai": "ทั้งสองทีมเสมอกันในเกมสุดท้าย"}
{"word": "draw", "english": "He drew his gun in the movie scene.", "thai": "เขา拔ปืนในฉากหนัง"}
{"word": "draw", "english": "The kids drew pictures for their parents.", "thai": "เด็กๆ วาดรูปให้พ่อแม่"}
{"word": "draw", "english": "Can you draw a cartoon character?", "thai": "คุณวาดตัวการ์ตูนได้ไหม?"}
{"word": "draw", "english": "Her performance drew loud applause.", "thai": "การแสดงของเธอได้รับเสียงปรบมือดัง"}
{"word": "draw", "english": "I drew a blank on that quiz question.", "thai": "ฉันนึกคำตอบข้อสอบนั้นไม่ออก"}
{"word": "draw", "english": "She’s teaching me how to draw landscapes.", "thai": "เธอกำลังสอนฉันวาดทิวทัศน์"}
{"word": "draw", "english": "He drew a diagram to explain the idea.", "thai": "เขาวาดแผนภาพเพื่ออธิบายแนวคิด"}
{"word": "draw", "english": "Let’s draw a design for the poster.", "thai": "มาวาดแบบสำหรับโปสเตอร์กัน"}
{"word": "draw", "english": "The campaign drew support from many.", "thai": "แคมเปญนี้ได้รับการสนับสนุนจากหลายคน"}
{"word": "draw", "english": "I drew a smiley face on the note.", "thai": "ฉันวาดหน้ายิ้มบนโน้ต"}
{"word": "draw", "english": "The game was called a draw after overtime.", "thai": "เกมถูกเรียกว่าเสมอหลังต่อเวลา"}
{"word": "draw", "english": "He drew water from the stream.", "thai": "เขาตักน้ำจากลำธาร"}
{"word": "draw", "english": "Her speech drew tears from the audience.", "thai": "สุนทรพจน์ของเธอทำให้น้ำตาคลอในผู้ชม"}
{"word": "draw", "english": "Can you draw a cat for the kids?", "thai": "คุณวาดรูปแมวให้เด็กๆ ได้ไหม?"}
{"word": "draw", "english": "I’m trying to draw a realistic portrait.", "thai": "ฉันกำลังพยายามวาดภาพเหมือนที่สมจริง"}
{"word": "draw", "english": "The show drew rave reviews online.", "thai": "การแสดงนี้ได้รับคำวิจารณ์ชื่นชมในออนไลน์"}
{"word": "draw", "english": "She drew a line through the wrong answer.", "thai": "เธอขีดเส้นทับคำตอบที่ผิด"}
{"word": "draw", "english": "He drew a quick sketch of the building.", "thai": "เขาวาดสเก็ตช์เร็วๆ ของตึก"}
{"word": "draw", "english": "Let’s draw lots to pick the winner.", "thai": "มาจับฉลากเพื่อเลือกผู้ชนะ"}
{"word": "draw", "english": "The kids drew stars on the wall.", "thai": "เด็กๆ วาดดาวบนกำแพง"}
{"word": "draw", "english": "The event drew a diverse crowd.", "thai": "งานนี้ดึงดูดผู้คนหลากหลาย"}
{"word": "draw", "english": "I drew a picture of my family.", "thai": "ฉันวาดรูปครอบครัวของฉัน"}
{"word": "draw", "english": "The match ended in a draw again.", "thai": "การแข่งขันจบลงด้วยผลเสมออีกครั้ง"}
{"word": "draw", "english": "He drew his knife to cut the rope.", "thai": "เขา拔มีดเพื่อตัดเชือก"}
{"word": "draw", "english": "She drew a flower in her notebook.", "thai": "เธอวาดดอกไม้ในสมุดโน้ต"}
{"word": "draw", "english": "The play drew a standing ovation.", "thai": "ละครนี้ได้รับการยืนปรบมือ"}
{"word": "draw", "english": "I drew a blank during the test.", "thai": "ฉันนึกอะไรไม่ออกระหว่างสอบ"}
{"word": "draw", "english": "Can you draw a map to your house?", "thai": "คุณวาดแผนที่ไปบ้านคุณได้ไหม?"}
{"word": "draw", "english": "She’s learning to draw in charcoal.", "thai": "เธอกำลังเรียนวาดด้วยถ่าน"}
{"word": "draw", "english": "He drew a chart for the presentation.", "thai": "เขาวาดแผนภูมิสำหรับการนำเสนอ"}
{"word": "draw", "english": "Let’s draw a mural on the wall.", "thai": "มาวาดภาพจิตรกรรมฝาผนังกัน"}
{"word": "draw", "english": "The ad drew attention to the cause.", "thai": "โฆษณานี้ดึงความสนใจไปที่ประเด็น"}
{"word": "draw", "english": "I drew a sun on the card.", "thai": "ฉันวาดดวงอาทิตย์บนการ์ด"}
{"word": "draw", "english": "The teams drew after a tough match.", "thai": "ทั้งสองทีมเสมอกันหลังการแข่งขันที่ดุเดือด"}
{"word": "draw", "english": "He drew water from the bucket.", "thai": "เขาตักน้ำจากถัง"}
{"word": "draw", "english": "Her art drew praise from the teacher.", "thai": "งานศิลปะของเธอได้รับคำชมจากครู"}
{"word": "draw", "english": "Can you draw a dinosaur for me?", "thai": "คุณวาดไดโนเสาร์ให้ฉันได้ไหม?"}
{"word": "draw", "english": "I’m trying to draw a city skyline.", "thai": "ฉันกำลังพยายามวาดเส้นขอบฟ้าของเมือง"}
{"word": "draw", "english": "The sale drew a lot of shoppers.", "thai": "การลดราคาดึงดูดนักช็อปจำนวนมาก"}
{"word": "draw", "english": "She drew a line under the title.", "thai": "เธอขีดเส้นใต้หัวข้อ"}
{"word": "draw", "english": "He drew a rough sketch of the plan.", "thai": "เขาวาดสเก็ตช์คร่าวๆ ของแผน"}
{"word": "draw", "english": "Let’s draw names for the game.", "thai": "มาจับฉลากชื่อสำหรับเกม"}
{"word": "draw", "english": "The kids drew animals on the board.", "thai": "เด็กๆ วาดสัตว์บนกระดาน"}
{"word": "draw", "english": "The concert drew fans from everywhere.", "thai": "คอนเสิร์ตนี้ดึงดูดแฟนๆ จากทุกที่"}
{"word": "draw", "english": "I drew a picture of my house.", "thai": "ฉันวาดรูปบ้านของฉัน"}
{"word": "draw", "english": "The game was a draw after extra time.", "thai": "เกมเสมอกันหลังต่อเวลาพิเศษ"}
{"word": "draw", "english": "He drew his bow in the archery contest.", "thai": "เขาโก่งคันธนูในการแข่งขันยิงธนู"}
{"word": "draw", "english": "She drew a rainbow on the canvas.", "thai": "เธอวาดรุ้งบนผ้าใบ"}
{"word": "draw", "english": "The speech drew cheers from the crowd.", "thai": "สุนทรพจน์นี้ได้รับเสียงเชียร์จากฝูงชน"}
{"word": "draw", "english": "I drew a blank on that trivia question.", "thai": "ฉันนึกคำตอบคำถามเกร็ดความรู้ไม่ออก"}
{"word": "draw", "english": "Can you draw a boat for the project?", "thai": "คุณวาดเรือสำหรับโปรเจกต์ได้ไหม?"}
{"word": "draw", "english": "She’s learning to draw with pastels.", "thai": "เธอกำลังเรียนวาดด้วยสีพาสเทล"}
{"word": "draw", "english": "He drew a graph to show the data.", "thai": "เขาวาดกราฟเพื่อแสดงข้อมูล"}
{"word": "draw", "english": "Let’s draw a picture for the card.", "thai": "มาวาดรูปสำหรับการ์ดกัน"}
{"word": "draw", "english": "The event drew media attention.", "thai": "งานนี้ดึงดูดความสนใจจากสื่อ"}
{"word": "draw", "english": "I drew a smile on the paper.", "thai": "ฉันวาดรอยยิ้มบนกระดาษ"}
{"word": "draw", "english": "The teams drew in the championship.", "thai": "ทั้งสองทีมเสมอกันในรอบชิงชนะเลิศ"}
{"word": "draw", "english": "He drew water from the fountain.", "thai": "เขาตักน้ำจากน้ำพุ"}
{"word": "draw", "english": "Her drawing drew gasps from the class.", "thai": "ภาพวาดของเธอทำให้ทั้งชั้นตกตะลึง"}
{"word": "draw", "english": "Can you draw a bird for the poster?", "thai": "คุณวาดนกสำหรับโปสเตอร์ได้ไหม?"}
{"word": "draw", "english": "I’m trying to draw a realistic face.", "thai": "ฉันกำลังพยายามวาดใบหน้าที่สมจริง"}
{"word": "draw", "english": "The offer drew interest from buyers.", "thai": "ข้อเสนอนี้ดึงดูดความสนใจจากผู้ซื้อ"}
{"word": "draw", "english": "She drew a line across the page.", "thai": "เธอขีดเส้นข้ามหน้า"}
{"word": "draw", "english": "He drew a sketch of the bridge.", "thai": "เขาวาดสเก็ตช์ของสะพาน"}
{"word": "draw", "english": "Let’s draw lots to choose the leader.", "thai": "มาจับฉลากเพื่อเลือกผู้นำ"}
{"word": "draw", "english": "The kids drew flowers on the sidewalk.", "thai": "เด็กๆ วาดดอกไม้บนทางเท้า"}
{"word": "draw", "english": "The exhibit drew art lovers from afar.", "thai": "นิทรรศการนี้ดึงดูดคนรักศิลปะจากที่ไกล"}
{"word": "drink", "english": "Can you get me a drink from the fridge?", "thai": "คุณช่วยหยิบเครื่องดื่มจากตู้เย็นให้ฉันได้ไหม?"}
{"word": "drink", "english": "I need a cold drink after that workout.", "thai": "ฉันต้องการเครื่องดื่มเย็นๆ หลังออกกำลังกาย"}
{"word": "drink", "english": "Let’s grab a drink after work.", "thai": "ไปดื่มอะไรกันหลังเลิกงานเถอะ"}
{"word": "drink", "english": "She drank her coffee too quickly.", "thai": "เธอดื่มกาแฟเร็วเกินไป"}
{"word": "drink", "english": "Do you want to drink some water?", "thai": "คุณอยากดื่มน้ำไหม?"}
{"word": "drink", "english": "He offered me a drink at the party.", "thai": "เขาเสนอเครื่องดื่มให้ฉันในงานปาร์ตี้"}
{"word": "drink", "english": "I forgot to drink my tea this morning.", "thai": "ฉันลืมดื่มชาเมื่อเช้า"}
{"word": "drink", "english": "The kids love to drink juice with lunch.", "thai": "เด็กๆ ชอบดื่มน้ำผลไม้กับมื้อเที่ยง"}
{"word": "drink", "english": "Let’s have a drink to celebrate!", "thai": "มาดื่มฉลองกัน!"}
{"word": "drink", "english": "She doesn’t drink alcohol at all.", "thai": "เธอไม่ดื่มแอลกอฮอล์เลย"}
{"word": "drink", "english": "I’m so thirsty, I need a drink.", "thai": "ฉันกระหายมาก ต้องการเครื่องดื่ม"}
{"word": "drink", "english": "He drank a whole bottle of soda.", "thai": "เขาดื่มโซดาทั้งขวด"}
{"word": "drink", "english": "Do you drink coffee or tea in the morning?", "thai": "คุณดื่มกาแฟหรือชาในตอนเช้า?"}
{"word": "drink", "english": "I’ll buy you a drink if you come.", "thai": "ฉันจะเลี้ยงเครื่องดื่มถ้าคุณมา"}
{"word": "drink", "english": "She drank her smoothie in one gulp.", "thai": "เธอดื่มสมูทตี้หมดในคำเดียว"}
{"word": "drink", "english": "We should drink more water every day.", "thai": "เราควรดื่มน้ำมากขึ้นทุกวัน"}
{"word": "drink", "english": "He’s drinking a beer with his friends.", "thai": "เขากำลังดื่มเบียร์กับเพื่อนๆ"}
{"word": "drink", "english": "I don’t drink soda because of the sugar.", "thai": "ฉันไม่ดื่มโซดาเพราะน้ำตาล"}
{"word": "drink", "english": "Can you make me a hot drink?", "thai": "คุณทำเครื่องดื่มร้อนให้ฉันได้ไหม?"}
{"word": "drink", "english": "They drank to the couple’s happiness.", "thai": "พวกเขาดื่มเพื่อความสุขของคู่รัก"}
{"word": "drink", "english": "I drank too much coffee today.", "thai": "ฉันดื่มกาแฟมากเกินไปวันนี้"}
{"word": "drink", "english": "Let’s go out for a quick drink.", "thai": "ไปดื่มอะไรเร็วๆ กัน"}
{"word": "drink", "english": "She drank water after the long run.", "thai": "เธอดื่มน้ำหลังวิ่งไกล"}
{"word": "drink", "english": "He doesn’t drink tea, only coffee.", "thai": "เขาไม่ดื่มชา ดื่มแต่กาแฟ"}
{"word": "drink", "english": "I need a drink to cool off.", "thai": "ฉันต้องการเครื่องดื่มเพื่อคลายร้อน"}
{"word": "drink", "english": "The kids drank milk with their cookies.", "thai": "เด็กๆ ดื่มนมกับคุกกี้"}
{"word": "drink", "english": "Do you want a drink with your meal?", "thai": "คุณอยากได้เครื่องดื่มกับอาหารไหม?"}
{"word": "drink", "english": "I drank a glass of juice this morning.", "thai": "ฉันดื่มน้ำผลไม้หนึ่งแก้วเมื่อเช้า"}
{"word": "drink", "english": "Let’s drink to a successful project!", "thai": "มาดื่มให้กับโปรเจกต์ที่สำเร็จ!"}
{"word": "drink", "english": "She drank her tea while reading.", "thai": "เธอดื่มชาขณะอ่านหนังสือ"}
{"word": "drink", "english": "He drank too much at the party.", "thai": "เขาดื่มมากเกินไปในงานปาร์ตี้"}
{"word": "drink", "english": "I don’t usually drink energy drinks.", "thai": "ฉันมักไม่ดื่มเครื่องดื่มชูกำลัง"}
{"word": "drink", "english": "Can you pour me a drink, please?", "thai": "คุณช่วยรินเครื่องดื่มให้ฉันหน่อยได้ไหม?"}
{"word": "drink", "english": "They drank wine during dinner.", "thai": "พวกเขาดื่มไวน์ระหว่างมื้อเย็น"}
{"word": "drink", "english": "I’m trying to drink less soda.", "thai": "ฉันพยายามดื่มโซดาน้อยลง"}
{"word": "drink", "english": "He drank a cup of hot chocolate.", "thai": "เขาดื่มช็อกโกแลตร้อนหนึ่งถ้วย"}
{"word": "drink", "english": "Do you want to drink something cold?", "thai": "คุณอยากดื่มอะไรเย็นๆ ไหม?"}
{"word": "drink", "english": "I drank some lemonade at the picnic.", "thai": "ฉันดื่มน้ำมะนาวในงานปิกนิก"}
{"word": "drink", "english": "Let’s have a drink at the bar tonight.", "thai": "ไปดื่มที่บาร์คืนนี้กัน"}
{"word": "drink", "english": "She doesn’t drink coffee after noon.", "thai": "เธอไม่ดื่มกาแฟหลังเที่ยง"}
{"word": "drink", "english": "I need a drink after that long day.", "thai": "ฉันต้องการเครื่องดื่มหลังจากวันยาวนาน"}
{"word": "drink", "english": "He drank a bottle of water in seconds.", "thai": "เขาดื่มน้ำหนึ่งขวดในไม่กี่วินาที"}
{"word": "drink", "english": "Can you make a drink for the guest?", "thai": "คุณทำเครื่องดื่มให้แขกได้ไหม?"}
{"word": "drink", "english": "They drank to their new adventure.", "thai": "พวกเขาดื่มเพื่อการผจญภัยใหม่"}
{"word": "drink", "english": "I drank too much tea this afternoon.", "thai": "ฉันดื่มชามากเกินไปตอนบ่าย Phil"}
{"word": "drink", "english": "Do you drink milk or almond milk?", "thai": "คุณดื่มนมวัวหรือนมอัลมอนด์?"}
{"word": "drink", "english": "She drank a sip of the iced coffee.", "thai": "เธอดื่มกาแฟเย็นจิบหนึ่ง"}
{"word": "drink", "english": "He’s drinking juice to stay hydrated.", "thai": "เขาดื่มน้ำผลไม้เพื่อรักษาความชุ่มชื้น"}
{"word": "drink", "english": "I drank a smoothie after my workout.", "thai": "ฉันดื่มสมูทตี้หลังออกกำลังกาย"}
{"word": "drink", "english": "Let’s drink something warm by the fire.", "thai": "มาดื่มอะไรอุ่นๆ ข้างกองไฟกัน"}
{"word": "drink", "english": "She doesn’t drink sugary drinks anymore.", "thai": "เธอไม่ดื่มเครื่องดื่มที่มีน้ำตาลอีกต่อไป"}
{"word": "drink", "english": "I need a drink to relax tonight.", "thai": "ฉันต้องการเครื่องดื่มเพื่อผ่อนคลายคืนนี้"}
{"word": "drink", "english": "He drank his coffee black today.", "thai": "เขาดื่มกาแฟดำวันนี้"}
{"word": "drink", "english": "Do you want a drink before the movie?", "thai": "คุณอยากดื่มอะไรก่อนดูหนังไหม?"}
{"word": "drink", "english": "I drank some herbal tea for my cold.", "thai": "ฉันดื่มชาสมุนไพรเพราะเป็นหวัด"}
{"word": "drink", "english": "Let’s go for a drink after the game.", "thai": "ไปดื่มอะไรกันหลังเกม"}
{"word": "drink", "english": "She drank a glass of orange juice.", "thai": "เธอดื่มน้ำส้มหนึ่งแก้ว"}
{"word": "drink", "english": "He doesn’t drink alcohol on weekdays.", "thai": "เขาไม่ดื่มแอลกอฮอล์ในวันทำงาน"}
{"word": "drink", "english": "I need a cold drink in this heat.", "thai": "ฉันต้องการเครื่องดื่มเย็นในอากาศร้อนนี้"}
{"word": "drink", "english": "The kids drank milkshakes at the diner.", "thai": "เด็กๆ ดื่มมิลค์เชคที่ร้านอาหาร"}
{"word": "drink", "english": "Can you get a drink for the table?", "thai": "คุณช่วยหยิบเครื่องดื่มมาให้โต๊ะหน่อยได้ไหม?"}
{"word": "drink", "english": "They drank champagne to celebrate.", "thai": "พวกเขาดื่มแชมเปญเพื่อฉลอง"}
{"word": "drink", "english": "I drank too much soda at lunch.", "thai": "ฉันดื่มโซดามากเกินไปตอนเที่ยง"}
{"word": "drink", "english": "Let’s have a drink at the new cafe.", "thai": "ไปดื่มอะไรที่คาเฟ่ใหม่กัน"}
{"word": "drink", "english": "She drank her latte while studying.", "thai": "เธอดื่มลาเต้ขณะอ่านหนังสือ"}
{"word": "drink", "english": "He drank a protein shake after the gym.", "thai": "เขาดื่มโปรตีนเชคหลังออกกำลังกาย"}
{"word": "drink", "english": "I don’t drink coffee late at night.", "thai": "ฉันไม่ดื่มกาแฟตอนดึก"}
{"word": "drink", "english": "Can you make me a fruity drink?", "thai": "คุณทำเครื่องดื่มรสผลไม้ให้ฉันได้ไหม?"}
{"word": "drink", "english": "They drank to their team’s victory.", "thai": "พวกเขาดื่มเพื่อชัยชนะของทีม"}
{"word": "drink", "english": "I drank some iced tea this afternoon.", "thai": "ฉันดื่มชาเย็นตอนบ่าย"}
{"word": "drink", "english": "Do you drink decaf or regular coffee?", "thai": "คุณดื่มกาแฟแบบไม่มีคาเฟอีนหรือแบบปกติ?"}
{"word": "drink", "english": "I’ll get you a drink if you’re thirsty.", "thai": "ฉันจะหยิบเครื่องดื่มให้ถ้าคุณกระหาย"}
{"word": "drink", "english": "She drank her juice through a straw.", "thai": "เธอดื่มน้ำผลไม้ผ่านหลอด"}
{"word": "drink", "english": "He drank too much at the bar.", "thai": "เขาดื่มมากเกินไปที่บาร์"}
{"word": "drink", "english": "I don’t drink milk, only plant-based.", "thai": "ฉันไม่ดื่มนมวัว ดื่มแต่นมจากพืช"}
{"word": "drink", "english": "Can you pour a drink for everyone?", "thai": "คุณรินเครื่องดื่มให้ทุกคนได้ไหม?"}
{"word": "drink", "english": "They drank lemonade at the picnic.", "thai": "พวกเขาดื่มน้ำมะนาวในงานปิกนิก"}
{"word": "drink", "english": "I drank coffee to stay awake.", "thai": "ฉันดื่มกาแฟเพื่อให้ตื่นตัว"}
{"word": "drink", "english": "Let’s drink something fancy tonight.", "thai": "คืนนี้มาดื่มอะไรหรูๆ กัน"}
{"word": "drink", "english": "She doesn’t drink tea with sugar.", "thai": "เธอไม่ดื่มชากับน้ำตาล"}
{"word": "drink", "english": "I need a drink after that hike.", "thai": "ฉันต้องการเครื่องดื่มหลังเดินป่า"}
{"word": "drink", "english": "He drank a soda with his burger.", "thai": "เขาดื่มโซดากับเบอร์เกอร์"}
{"word": "drink", "english": "Do you want a drink before dinner?", "thai": "คุณอยากดื่มอะไรก่อนอาหารเย็นไหม?"}
{"word": "drink", "english": "I drank some water after the run.", "thai": "ฉันดื่มน้ำหลังวิ่ง"}
{"word": "drink", "english": "Let’s drink to the new year!", "thai": "มาดื่มเพื่อปีใหม่!"}
{"word": "drink", "english": "She drank her coffee with cream.", "thai": "เธอดื่มกาแฟกับครีม"}
{"word": "drink", "english": "He drank a beer after work.", "thai": "เขาดื่มเบียร์หลังเลิกงาน"}
{"word": "drink", "english": "I don’t drink energy drinks often.", "thai": "ฉันไม่ค่อยดื่มเครื่องดื่มชูกำลัง"}
{"word": "drink", "english": "Can you make a drink for the kids?", "thai": "คุณทำเครื่องดื่มให้เด็กๆ ได้ไหม?"}
{"word": "drink", "english": "They drank wine at the dinner party.", "thai": "พวกเขาดื่มไวน์ในงานเลี้ยงอาหารค่ำ"}
{"word": "drink", "english": "I drank too much juice today.", "thai": "ฉันดื่มน้ำผลไม้มากเกินไปวันนี้"}
{"word": "drink", "english": "Let’s have a drink at the beach.", "thai": "ไปดื่มอะไรที่ชายหาดกัน"}
{"word": "drink", "english": "She drank her tea slowly.", "thai": "เธอดื่มช้าอย่างช้าๆ"}
{"word": "drink", "english": "He drank a milkshake after school.", "thai": "เขาดื่มมิลค์เชคหลังเลิกเรียน"}
{"word": "drink", "english": "I don’t drink coffee in the evening.", "thai": "ฉันไม่ดื่มกาแฟตอนเย็น"}
{"word": "drink", "english": "Can you get a drink for the road?", "thai": "คุณหยิบเครื่องดื่มสำหรับเดินทางได้ไหม?"}
{"word": "drink", "english": "They drank to their friend’s success.", "thai": "พวกเขาดื่มเพื่อความสำเร็จของเพื่อน"}
{"word": "drink", "english": "I drank some iced coffee this morning.", "thai": "ฉันดื่มกาแฟเย็นเมื่อเช้า"}
{"word": "drive", "english": "Can you drive me to the airport tomorrow?", "thai": "คุณขับรถไปส่งฉันที่สนามบินพรุ่งนี้ได้ไหม?"}
{"word": "drive", "english": "I love to drive with the windows down.", "thai": "ฉันชอบขับรถโดยเปิดหน้าต่าง"}
{"word": "drive", "english": "She drove all night to get here.", "thai": "เธอขับรถทั้งคืนเพื่อมาถึงที่นี่"}
{"word": "drive", "english": "His passion drives him to work harder.", "thai": "ความหลงใหลของเขาผลักดันให้เขาทำงานหนักขึ้น"}
{"word": "drive", "english": "Let’s go for a drive in the countryside.", "thai": "ไปขับรถเล่นที่ชนบทกันเถอะ"}
{"word": "drive", "english": "He drives a truck for a living.", "thai": "เขาขับรถบรรทุกหาเลี้ยงชีพ"}
{"word": "drive", "english": "I’m too tired to drive home tonight.", "thai": "ฉันเหนื่อยเกินกว่าจะขับรถกลับบ้านคืนนี้"}
{"word": "drive", "english": "The rain drove us inside the house.", "thai": "ฝนทำให้เราต้องเข้าไปในบ้าน"}
{"word": "drive", "english": "She’s learning to drive a manual car.", "thai": "เธอกำลังหัดขับรถเกียร์ธรรมดา"}
{"word": "drive", "english": "Do you want to drive my new car?", "thai": "คุณอยากลองขับรถใหม่ของฉันไหม?"}
{"word": "drive", "english": "His ambition drives his success.", "thai": "ความทะเยอทะยานของเขาผลักดันความสำเร็จ"}
{"word": "drive", "english": "I drove through the city this morning.", "thai": "ฉันขับรถผ่านเมืองเช้านี้"}
{"word": "drive", "english": "The noise is driving me crazy!", "thai": "เสียงดังทำให้ฉันแทบคลั่ง!"}
{"word": "drive", "english": "He drove the kids to school today.", "thai": "เขาขับรถไปส่งเด็กๆ ที่โรงเรียนวันนี้"}
{"word": "drive", "english": "Let’s drive to the beach this weekend.", "thai": "ไปขับรถไปชายหาดสุดสัปดาห์นี้กัน"}
{"word": "drive", "english": "She drives too fast on the highway.", "thai": "เธอขับรถเร็วเกินไปบนทางหลวง"}
{"word": "drive", "english": "His determination drives the team forward.", "thai": "ความมุ่งมั่นของเขาผลักดันทีมไปข้างหน้า"}
{"word": "drive", "english": "I need to drive to the store for milk.", "thai": "ฉันต้องขับรถไปร้านซื้อนม"}
{"word": "drive", "english": "The storm drove the ship off course.", "thai": "พายุทำให้เรือออกนอกเส้นทาง"}
{"word": "drive", "english": "Can you drive a stick shift?", "thai": "คุณขับรถเกียร์ธรรมดาได้ไหม?"}
{"word": "drive", "english": "I drove past your house yesterday.", "thai": "ฉันขับรถผ่านบ้านคุณเมื่อวาน"}
{"word": "drive", "english": "Her energy drives everyone to do better.", "thai": "พลังของเธอผลักดันให้ทุกคนทำได้ดีขึ้น"}
{"word": "drive", "english": "He’s driving to the mountains for a hike.", "thai": "เขากำลังขับรถไปที่ภูเขาเพื่อเดินป่า"}
{"word": "drive", "english": "The deadline is driving me to work late.", "thai": "กำหนดเวลาทำให้ฉันต้องทำงานดึก"}
{"word": "drive", "english": "She drove carefully in the snow.", "thai": "เธอขับรถอย่างระมัดระวังในหิมะ"}
{"word": "drive", "english": "Let’s take a drive to clear our minds.", "thai": "ไปขับรถเล่นเพื่อผ่อนคลายกัน"}
{"word": "drive", "english": "He drives a taxi in the city.", "thai": "เขาขับแท็กซี่ในเมือง"}
{"word": "drive", "english": "The music drove the crowd wild.", "thai": "ดนตรีทำให้ฝูงชนคลั่งไคล้"}
{"word": "drive", "english": "I’m learning to drive a motorcycle.", "thai": "ฉันกำลังหัดขับมอเตอร์ไซค์"}
{"word": "drive", "english": "Do you want to drive to the park?", "thai": "คุณอยากขับรถไปสวนสาธารณะไหม?"}
{"word": "drive", "english": "His speech drove the point home.", "thai": "คำพูดของเขาทำให้ประเด็นชัดเจน"}
{"word": "drive", "english": "I drove across town to meet her.", "thai": "ฉันขับรถข้ามเมืองเพื่อพบเธอ"}
{"word": "drive", "english": "The pressure is driving him to stress.", "thai": "ความกดดันทำให้เขาเครียด"}
{"word": "drive", "english": "She drove the kids to soccer practice.", "thai": "เธอขับรถไปส่งเด็กๆ ที่ซ้อมฟุตบอล"}
{"word": "drive", "english": "Let’s drive up the coast for the day.", "thai": "ไปขับรถเลียบชายฝั่งทั้งวันกัน"}
{"word": "drive", "english": "He drives a sports car on weekends.", "thai": "เขาขับรถสปอร์ตในวันหยุดสุดสัปดาห์"}
{"word": "drive", "english": "The hunger drove her to eat quickly.", "thai": "ความหิวทำให้เธอกินเร็ว"}
{"word": "drive", "english": "Can you drive me to the train station?", "thai": "คุณขับรถไปส่งฉันที่สถานีรถไฟได้ไหม?"}
{"word": "drive", "english": "I drove through a storm last night.", "thai": "ฉันขับรถฝ่าพายุเมื่อคืน"}
{"word": "drive", "english": "Her passion drives her to create art.", "thai": "ความหลงใหลของเธอผลักดันให้เธอสร้างงานศิลปะ"}
{"word": "drive", "english": "He’s driving to the city for a meeting.", "thai": "เขากำลังขับรถไปเมืองเพื่อประชุม"}
{"word": "drive", "english": "The noise drove the dog under the bed.", "thai": "เสียงดังทำให้สุนัขซ่อนใต้เตียง"}
{"word": "drive", "english": "She drives a hybrid to save gas.", "thai": "เธอขับรถไฮบริดเพื่อประหยัดน้ำมัน"}
{"word": "drive", "english": "Let’s drive to the lake this afternoon.", "thai": "ไปขับรถไปที่ทะเลสาบบ่ายนี้กัน"}
{"word": "drive", "english": "His anger drove him to shout.", "thai": "ความโกรธทำให้เขาตะโกน"}
{"word": "drive", "english": "I’m too nervous to drive in traffic.", "thai": "ฉันตื่นเต้นเกินกว่าจะขับรถในจราจร"}
{"word": "drive", "english": "The campaign drove donations to the charity.", "thai": "แคมเปญนี้ผลักดันให้มีการบริจาคเพื่อการกุศล"}
{"word": "drive", "english": "He drove slowly to avoid the potholes.", "thai": "เขาขับรถช้าๆ เพื่อหลบหลุม"}
{"word": "drive", "english": "Do you know how to drive a van?", "thai": "คุณขับรถตู้เป็นไหม?"}
{"word": "drive", "english": "I drove to the mall this morning.", "thai": "ฉันขับรถไปห้างเมื่อเช้า"}
{"word": "drive", "english": "Her energy drives the team’s spirit.", "thai": "พลังของเธอผลักดันจิตวิญญาณของทีม"}
{"word": "drive", "english": "She’s driving to visit her parents.", "thai": "เธอกำลังขับรถไปเยี่ยมพ่อแม่"}
{"word": "drive", "english": "The cold drove us to stay indoors.", "thai": "ความหนาวทำให้เราต้องอยู่แต่ในบ้าน"}
{"word": "drive", "english": "Can you drive a little faster, please?", "thai": "คุณขับรถเร็วขึ้นหน่อยได้ไหม?"}
{"word": "drive", "english": "I drove through the mountains last week.", "thai": "ฉันขับรถผ่านภูเขาเมื่อสัปดาห์ที่แล้ว"}
{"word": "drive", "english": "His goals drive him to keep learning.", "thai": "เป้าหมายของเขาผลักดันให้เขาเรียนรู้ต่อไป"}
{"word": "drive", "english": "He’s driving to the game tonight.", "thai": "เขากำลังขับรถไปดูเกมคืนนี้"}
{"word": "drive", "english": "The fear drove her to run faster.", "thai": "ความกลัวทำให้เธอวิ่งเร็วขึ้น"}
{"word": "drive", "english": "She drove the car to the repair shop.", "thai": "เธอขับรถไปร้านซ่อม"}
{"word": "drive", "english": "Let’s drive to the new restaurant.", "thai": "ไปขับรถไปร้านอาหารใหม่กัน"}
{"word": "drive", "english": "He drives a bus for the school.", "thai": "เขาขับรถบัสให้โรงเรียน"}
{"word": "drive", "english": "The music drove everyone to dance.", "thai": "ดนตรีผลักดันให้ทุกคนเต้น"}
{"word": "drive", "english": "I’m learning to drive an electric car.", "thai": "ฉันกำลังหัดขับรถไฟฟ้า"}
{"word": "drive", "english": "Do you want to drive to the concert?", "thai": "คุณอยากขับรถไปคอนเสิร์ตไหม?"}
{"word": "drive", "english": "His speech drove the message home.", "thai": "คำพูดของเขาทำให้สารชัดเจน"}
{"word": "drive", "english": "I drove around looking for parking.", "thai": "ฉันขับรถวนหาที่จอด"}
{"word": "drive", "english": "The stress is driving me up the wall.", "thai": "ความเครียดทำให้ฉันแทบคลั่ง"}
{"word": "drive", "english": "She drove the kids to the park.", "thai": "เธอขับรถไปส่งเด็กๆ ที่สวนสาธารณะ"}
{"word": "drive", "english": "Let’s drive to the city for dinner.", "thai": "ไปขับรถไปเมืองเพื่อกินข้าวเย็นกัน"}
{"word": "drive", "english": "He drives a delivery van for work.", "thai": "เขาขับรถตู้ส่งของสำหรับงาน"}
{"word": "drive", "english": "The wind drove the leaves across the yard.", "thai": "ลมพัดใบไม้ไปทั่วสนาม"}
{"word": "drive", "english": "Can you drive me to the doctor?", "thai": "คุณขับรถไปส่งฉันที่หมอได้ไหม?"}
{"word": "drive", "english": "I drove to the beach yesterday.", "thai": "ฉันขับรถไปชายหาดเมื่อวาน"}
{"word": "drive", "english": "Her courage drives her to take risks.", "thai": "ความกล้าของเธอผลักดันให้เธอเสี่ยง"}
{"word": "drive", "english": "He’s driving to the store for groceries.", "thai": "เขากำลังขับรถไปร้านซื้อของชำ"}
{"word": "drive", "english": "The argument drove them apart.", "thai": "การโต้เถียงทำให้พวกเขาแยกจากกัน"}
{"word": "drive", "english": "She drives carefully in the rain.", "thai": "เธอขับรถอย่างระมัดระวังในฝน"}
{"word": "drive", "english": "Let’s drive out to see the sunset.", "thai": "ไปขับรถออกไปดูพระอาทิตย์ตกกัน"}
{"word": "drive", "english": "He drives a convertible for fun.", "thai": "เขาขับรถเปิดประทุนเพื่อความสนุก"}
{"word": "drive", "english": "The pain drove him to see a doctor.", "thai": "ความเจ็บปวดทำให้เขาไปพบหมอ"}
{"word": "drive", "english": "I’m too scared to drive on icy roads.", "thai": "ฉันกลัวเกินกว่าจะขับรถบนถนนน้ำแข็ง"}
{"word": "drive", "english": "The fundraiser drove a lot of donations.", "thai": "การระดมทุนผลักดันให้มีการบริจาคมาก"}
{"word": "drive", "english": "She drove slowly through the fog.", "thai": "เธอขับรถช้าๆ ผ่านหมอก"}
{"word": "drive", "english": "Do you know how to drive a tractor?", "thai": "คุณขับรถแทรกเตอร์เป็นไหม?"}
{"word": "drive", "english": "I drove to the gym this morning.", "thai": "ฉันขับรถไปยิมเมื่อเช้า"}
{"word": "drive", "english": "His vision drives the company’s growth.", "thai": "วิสัยทัศน์ของเขาผลักดันการเติบโตของบริษัท"}
{"word": "drive", "english": "She’s driving to the mall for shopping.", "thai": "เธอกำลังขับรถไปห้างเพื่อช็อปปิ้ง"}
{"word": "drive", "english": "The heat drove us to the pool.", "thai": "ความร้อนทำให้เราไปที่สระว่ายน้ำ"}
{"word": "drive", "english": "Can you drive a little slower, please?", "thai": "คุณขับรถช้าลงหน่อยได้ไหม?"}
{"word": "drive", "english": "I drove through the tunnel last night.", "thai": "ฉันขับรถผ่านอุโมงค์เมื่อคืน"}
{"word": "drive", "english": "Her dreams drive her to keep trying.", "thai": "ความฝันของเธอผลักดันให้เธอพยายามต่อ"}
{"word": "drive", "english": "He’s driving to the airport now.", "thai": "เขากำลังขับรถไปสนามบิน"}
{"word": "drive", "english": "The boredom drove me to read a book.", "thai": "ความเบื่อทำให้ฉันอ่านหนังสือ"}
{"word": "drive", "english": "She drove the car to the gas station.", "thai": "เธอขับรถไปที่ปั๊มน้ำมัน"}
{"word": "drive", "english": "Let’s drive to the forest for a picnic.", "thai": "ไปขับรถไปป่าเพื่อปิกนิกกัน"}
{"word": "drive", "english": "He drives a motorcycle to work.", "thai": "เขาขับมอเตอร์ไซค์ไปทำงาน"}
{"word": "drive", "english": "The excitement drove them to cheer loudly.", "thai": "ความตื่นเต้นทำให้พวกเขาเชียร์ดัง"}
{"word": "drive", "english": "I’m learning to drive a big truck.", "thai": "ฉันกำลังหัดขับรถบรรทุกใหญ่"}
{"word": "drive", "english": "Do you want to drive to the movies?", "thai": "คุณอยากขับรถไปดูหนังไหม?"}
