{"word": "light bulb", "english": "I need to replace the light bulb in the kitchen.", "thai": "ฉันต้องเปลี่ยนหลอดไฟในครัว"}
{"word": "light bulb", "english": "The light bulb in my lamp just burned out.", "thai": "หลอดไฟในโคมไฟของฉันเพิ่งขาด"}
{"word": "light bulb", "english": "Can you grab a light bulb from the store?", "thai": "ช่วยซื้อหลอดไฟจากร้านมาให้หน่อยได้ไหม"}
{"word": "light bulb", "english": "This light bulb is too dim for reading.", "thai": "หลอดไฟนี้มืดเกินไปสำหรับอ่านหนังสือ"}
{"word": "light bulb", "english": "I bought an LED light bulb to save energy.", "thai": "ฉันซื้อหลอดไฟ LED เพื่อประหยัดพลังงาน"}
{"word": "light bulb", "english": "The light bulb flickered before it died.", "thai": "หลอดไฟกะพริบก่อนที่มันจะดับ"}
{"word": "light bulb", "english": "Do we have any spare light bulbs at home?", "thai": "เรามีหลอดไฟสำรองที่บ้านไหม"}
{"word": "light bulb", "english": "I dropped the light bulb, and it shattered.", "thai": "ฉันทำหลอดไฟตก และมันแตก"}
{"word": "light bulb", "english": "This light bulb gives off a warm glow.", "thai": "หลอดไฟนี้ให้แสงที่นุ่มนวล"}
{"word": "light bulb", "english": "We need a brighter light bulb for the garage.", "thai": "เราต้องการหลอดไฟที่สว่างกว่านี้สำหรับโรงรถ"}
{"word": "light bulb", "english": "The light bulb in the hallway is flickering.", "thai": "หลอดไฟในโถงทางเดินกำลังกะพริบ"}
{"word": "light bulb", "english": "I can’t find the right light bulb for this fixture.", "thai": "ฉันหาหลอดไฟที่เหมาะกับโคมนี้ไม่เจอ"}
{"word": "light bulb", "english": "A light bulb went out in the bathroom.", "thai": "หลอดไฟในห้องน้ำดับ"}
{"word": "light bulb", "english": "This light bulb is supposed to last for years.", "thai": "หลอดไฟนี้ควรจะใช้งานได้นานหลายปี"}
{"word": "light bulb", "english": "I’m switching to smart light bulbs this month.", "thai": "เดือนนี้ฉันจะเปลี่ยนไปใช้หลอดไฟอัจฉริยะ"}
{"word": "light bulb", "english": "The light bulb in the closet is too weak.", "thai": "หลอดไฟในตู้เสื้อผ้าสว่างไม่พอ"}
{"word": "light bulb", "english": "I forgot to buy a light bulb for the porch.", "thai": "ฉันลืมซื้อหลอดไฟสำหรับระเบียง"}
{"word": "light bulb", "english": "Can you screw in this light bulb for me?", "thai": "ช่วยขันหลอดไฟนี้ให้ฉันหน่อยได้ไหม"}
{"word": "light bulb", "english": "The light bulb exploded when I turned it on!", "thai": "หลอดไฟระเบิดเมื่อฉันเปิดมัน!"}
{"word": "light bulb", "english": "I prefer a soft white light bulb for my bedroom.", "thai": "ฉันชอบหลอดไฟแสงนวลสำหรับห้องนอน"}
{"word": "light bulb", "english": "We ran out of light bulbs in the storage room.", "thai": "เราไม่มีหลอดไฟเหลือในห้องเก็บของแล้ว"}
{"word": "light bulb", "english": "The light bulb in the fridge needs replacing.", "thai": "หลอดไฟในตู้เย็นต้องเปลี่ยน"}
{"word": "light bulb", "english": "This light bulb is way too bright for me.", "thai": "หลอดไฟนี้สว่างเกินไปสำหรับฉัน"}
{"word": "light bulb", "english": "I’m looking for a vintage-style light bulb.", "thai": "ฉันกำลังมองหาหลอดไฟสไตล์วินเทจ"}
{"word": "light bulb", "english": "The light bulb in the chandelier burned out.", "thai": "หลอดไฟในโคมระย้าขาด"}
{"word": "light bulb", "english": "I got a new light bulb for the reading nook.", "thai": "ฉันได้หลอดไฟใหม่สำหรับมุมอ่านหนังสือ"}
{"word": "light bulb", "english": "Do you know where the light bulb is kept?", "thai": "คุณรู้ไหมว่าหลอดไฟเก็บไว้ที่ไหน"}
{"word": "light bulb", "english": "This light bulb is energy-efficient, right?", "thai": "หลอดไฟนี้ประหยัดพลังงานใช่ไหม"}
{"word": "light bulb", "english": "The light bulb in my office is too harsh.", "thai": "หลอดไฟในออฟฟิศของฉันสว่างจ้าเกินไป"}
{"word": "light bulb", "english": "I need a light bulb with a higher wattage.", "thai": "ฉันต้องการหลอดไฟที่มีวัตต์สูงกว่านี้"}
{"word": "light bulb", "english": "The light bulb just popped and scared me!", "thai": "หลอดไฟเพิ่งแตกและทำให้ฉันตกใจ!"}
{"word": "light bulb", "english": "I’m installing a dimmable light bulb tonight.", "thai": "คืนนี้ฉันจะติดตั้งหลอดไฟที่ปรับความสว่างได้"}
{"word": "light bulb", "english": "This light bulb has a weird humming noise.", "thai": "หลอดไฟนี้มีเสียงหึ่งแปลกๆ"}
{"word": "light bulb", "english": "I broke the light bulb while changing it.", "thai": "ฉันทำหลอดไฟแตกตอนเปลี่ยน"}
{"word": "light bulb", "english": "The light bulb in the attic is ancient.", "thai": "หลอดไฟในห้องใต้หลังคาเก่ามาก"}
{"word": "light bulb", "english": "Can you check if this light bulb works?", "thai": "ช่วยตรวจสอบว่าหลอดไฟนี้ใช้งานได้ไหม"}
{"word": "light bulb", "english": "I ordered a smart light bulb online.", "thai": "ฉันสั่งหลอดไฟอัจฉริยะทางออนไลน์"}
{"word": "light bulb", "english": "The light bulb in the basement is out again.", "thai": "หลอดไฟในชั้นใต้ดินดับอีกแล้ว"}
{"word": "light bulb", "english": "I need a light bulb for my desk lamp.", "thai": "ฉันต้องการหลอดไฟสำหรับโคมไฟตั้งโต๊ะ"}
{"word": "light bulb", "english": "This light bulb is flickering like crazy!", "thai": "หลอดไฟนี้กะพริบรัวมาก!"}
{"word": "light bulb", "english": "I’m tired of changing this light bulb every month.", "thai": "ฉันเบื่อที่ต้องเปลี่ยนหลอดไฟนี้ทุกเดือน"}
{"word": "light bulb", "english": "The light bulb in the living room is perfect.", "thai": "หลอดไฟในห้องนั่งเล่นสมบูรณ์แบบ"}
{"word": "light bulb", "english": "I got a colored light bulb for the party.", "thai": "ฉันได้หลอดไฟสีสำหรับงานปาร์ตี้"}
{"word": "light bulb", "english": "This light bulb doesn’t fit the socket.", "thai": "หลอดไฟนี้ไม่พอดีกับขั้ว"}
{"word": "light bulb", "english": "The light bulb in the porch is waterproof.", "thai": "หลอดไฟที่ระเบียงกันน้ำได้"}
{"word": "light bulb", "english": "I need a light bulb for outdoor use.", "thai": "ฉันต้องการหลอดไฟสำหรับใช้กลางแจ้ง"}
{"word": "light bulb", "english": "The light bulb in my car burned out.", "thai": "หลอดไฟในรถของฉันขาด"}
{"word": "light bulb", "english": "I’m switching all our light bulbs to LED.", "thai": "ฉันจะเปลี่ยนหลอดไฟทั้งหมดเป็น LED"}
{"word": "light bulb", "english": "This light bulb is too expensive!", "thai": "หลอดไฟนี้แพงเกินไป!"}
{"word": "light bulb", "english": "The light bulb in the projector needs replacing.", "thai": "หลอดไฟในโปรเจคเตอร์ต้องเปลี่ยน"}
{"word": "light bulb", "english": "I can’t reach the light bulb in the ceiling.", "thai": "ฉันเอื้อมไม่ถึงหลอดไฟที่เพดาน"}
{"word": "light bulb", "english": "This light bulb has a strange blue tint.", "thai": "หลอดไฟนี้มีสีฟ้าแปลกๆ"}
{"word": "light bulb", "english": "The light bulb in the oven is broken.", "thai": "หลอดไฟในเตาอบเสีย"}
{"word": "light bulb", "english": "I need a light bulb for my flashlight.", "thai": "ฉันต้องการหลอดไฟสำหรับไฟฉาย"}
{"word": "light bulb", "english": "This light bulb is surprisingly heavy.", "thai": "หลอดไฟนี้หนักอย่างน่าประหลาด"}
{"word": "light bulb", "english": "The light bulb in the fan stopped working.", "thai": "หลอดไฟในพัดลมไม่ทำงานแล้ว"}
{"word": "light bulb", "english": "I found an old light bulb in the drawer.", "thai": "ฉันเจอหลอดไฟเก่าในลิ้นชัก"}
{"word": "light bulb", "english": "This light bulb is rated for outdoor use.", "thai": "หลอดไฟนี้เหมาะสำหรับใช้กลางแจ้ง"}
{"word": "light bulb", "english": "The light bulb in the shed is flickering.", "thai": "หลอดไฟในโรงเก็บของกำลังกะพริบ"}
{"word": "light bulb", "english": "I need a light bulb with a long lifespan.", "thai": "ฉันต้องการหลอดไฟที่มีอายุการใช้งานยาวนาน"}
{"word": "light bulb", "english": "The light bulb in my studio is perfect.", "thai": "หลอดไฟในสตูดิโอของฉันสมบูรณ์แบบ"}
{"word": "light bulb", "english": "I’m buying a light bulb for the aquarium.", "thai": "ฉันกำลังซื้อหลอดไฟสำหรับตู้ปลา"}
{"word": "light bulb", "english": "This light bulb is motion-activated.", "thai": "หลอดไฟนี้ทำงานด้วยเซ็นเซอร์เคลื่อนไหว"}
{"word": "light bulb", "english": "The light bulb in the stairwell burned out.", "thai": "หลอดไฟในบันไดขาด"}
{"word": "light bulb", "english": "I got a cheap light bulb from the sale.", "thai": "ฉันได้หลอดไฟราคาถูกจากงานเซล"}
{"word": "light bulb", "english": "This light bulb is part of a smart home system.", "thai": "หลอดไฟนี้เป็นส่วนหนึ่งของระบบสมาร์ทโฮม"}
{"word": "light bulb", "english": "The light bulb in my room is too yellow.", "thai": "หลอดไฟในห้องของฉันเหลืองเกินไป"}
{"word": "light bulb", "english": "I need a light bulb for the patio.", "thai": "ฉันต้องการหลอดไฟสำหรับลานบ้าน"}
{"word": "light bulb", "english": "The light bulb in the lantern is dimming.", "thai": "หลอดไฟในโคมไฟกำลังมืดลง"}
{"word": "light bulb", "english": "I’m testing a new light bulb brand.", "thai": "ฉันกำลังทดสอบหลอดไฟยี่ห้อใหม่"}
{"word": "light bulb", "english": "The light bulb in the backyard is broken.", "thai": "หลอดไฟในสวนหลังบ้านเสีย"}
{"word": "light bulb", "english": "This light bulb has a cool design.", "thai": "หลอดไฟนี้มีการออกแบบที่เท่"}
{"word": "light bulb", "english": "I need a light bulb for my grow light.", "thai": "ฉันต้องการหลอดไฟสำหรับไฟปลูกพืช"}
{"word": "light bulb", "english": "The light bulb in the mirror is too bright.", "thai": "หลอดไฟในกระจกสว่างเกินไป"}
{"word": "light bulb", "english": "I’m looking for a flicker-free light bulb.", "thai": "ฉันกำลังมองหาหลอดไฟที่ไม่กะพริบ"}
{"word": "light bulb", "english": "The light bulb in the hallway is loose.", "thai": "หลอดไฟในโถงทางเดินหลวม"}
{"word": "light bulb", "english": "This light bulb is eco-friendly.", "thai": "หลอดไฟนี้เป็นมิตรกับสิ่งแวดล้อม"}
{"word": "light bulb", "english": "I need a light bulb for my workshop.", "thai": "ฉันต้องการหลอดไฟสำหรับโรงงาน"}
{"word": "light bulb", "english": "The light bulb in the dining room is perfect.", "thai": "หลอดไฟในห้องอาหารสมบูรณ์แบบ"}
{"word": "light bulb", "english": "I’m replacing every light bulb in the house.", "thai": "ฉันกำลังเปลี่ยนหลอดไฟทุกดวงในบ้าน"}
{"word": "light bulb", "english": "This light bulb is hard to find.", "thai": "หลอดไฟนี้หายาก"}
{"word": "light bulb", "english": "The light bulb in the guest room is out.", "thai": "หลอดไฟในห้องรับแขกดับ"}
{"word": "light bulb", "english": "I need a light bulb for my sewing machine.", "thai": "ฉันต้องการหลอดไฟสำหรับเครื่องเย็บผ้า"}
{"word": "light bulb", "english": "This light bulb is too hot to touch.", "thai": "หลอดไฟนี้ร้อนเกินกว่าจะสัมผัส"}
{"word": "light bulb", "english": "The light bulb in the porch light is dead.", "thai": "หลอดไฟในไฟระเบียงเสีย"}
{"word": "light bulb", "english": "I’m installing a new light bulb in the nursery.", "thai": "ฉันกำลังติดตั้งหลอดไฟใหม่ในห้องเด็ก"}
{"word": "light bulb", "english": "This light bulb is supposed to be shatterproof.", "thai": "หลอดไฟนี้ควรจะกันแตก"}
{"word": "light bulb", "english": "The light bulb in the streetlamp is out.", "thai": "หลอดไฟในไฟถนนดับ"}
{"word": "light bulb", "english": "I need a light bulb for my camping lantern.", "thai": "ฉันต้องการหลอดไฟสำหรับโคมไฟแคมปิ้ง"}
{"word": "light bulb", "english": "This light bulb is voice-activated.", "thai": "หลอดไฟนี้ควบคุมด้วยเสียง"}
{"word": "light bulb", "english": "The light bulb in my flashlight is dim.", "thai": "หลอดไฟในไฟฉายของฉันมืด"}
{"word": "light bulb", "english": "I’m buying a light bulb for the chandelier.", "thai": "ฉันกำลังซื้อหลอดไฟสำหรับโคมระย้า"}
{"word": "light bulb", "english": "This light bulb has a five-year warranty.", "thai": "หลอดไฟนี้มีการรับประกันห้าปี"}
{"word": "light bulb", "english": "The light bulb in the lamp is buzzing.", "thai": "หลอดไฟในโคมไฟกำลังส่งเสียงหึ่ง"}
{"word": "light bulb", "english": "I need a light bulb for my makeup mirror.", "thai": "ฉันต้องการหลอดไฟสำหรับกระจกแต่งหน้า"}
{"word": "light bulb", "english": "This light bulb is perfect for photography.", "thai": "หลอดไฟนี้เหมาะสำหรับการถ่ายภาพ"}
{"word": "light bulb", "english": "The light bulb in the entryway is too dim.", "thai": "หลอดไฟที่ทางเข้ามืดเกินไป"}
{"word": "light bulb", "english": "I’m switching to a brighter light bulb.", "thai": "ฉันกำลังเปลี่ยนไปใช้หลอดไฟที่สว่างกว่า"}
{"word": "light bulb", "english": "This light bulb is part of a starter kit.", "thai": "หลอดไฟนี้เป็นส่วนหนึ่งของชุดเริ่มต้น"}
{"word": "clock", "english": "The clock on the wall is ticking loudly.", "thai": "นาฬิกาบนผนังกำลังเดินดัง"}
{"word": "clock", "english": "I need to set the clock in my bedroom.", "thai": "ฉันต้องตั้งนาฬิกาในห้องนอน"}
{"word": "clock", "english": "The clock in the kitchen stopped working.", "thai": "นาฬิกาในครัวหยุดทำงาน"}
{"word": "clock", "english": "Can you check the time on the clock?", "thai": "ช่วยดูเวลาที่นาฬิกาได้ไหม"}
{"word": "clock", "english": "I bought a new clock for the living room.", "thai": "ฉันซื้อนาฬิกาใหม่สำหรับห้องนั่งเล่น"}
{"word": "clock", "english": "The clock is running five minutes fast.", "thai": "นาฬิกาเดินเร็วไปห้านาที"}
{"word": "clock", "english": "I love the antique clock in the hallway.", "thai": "ฉันรักนาฬิกาโบราณในโถงทางเดิน"}
{"word": "clock", "english": "The clock on my phone is more accurate.", "thai": "นาฬิกาในโทรศัพท์ของฉันแม่นยำกว่า"}
{"word": "clock", "english": "I forgot to wind the clock last night.", "thai": "เมื่อคืนฉันลืมไขลานนาฬิกา"}
{"word": "clock", "english": "The clock in the office is always slow.", "thai": "นาฬิกาในออฟฟิศมักจะช้า"}
{"word": "clock", "english": "I need a clock with a loud alarm.", "thai": "ฉันต้องการนาฬิกาที่มีเสียงปลุกดัง"}
{"word": "clock", "english": "The clock on the shelf is a family heirloom.", "thai": "นาฬิกาบนชั้นวางเป็นมรดกของครอบครัว"}
{"word": "clock", "english": "I broke the clock when I dropped it.", "thai": "ฉันทำนาฬิกาพังตอนที่ทำมันตก"}
{"word": "clock", "english": "The clock in the car is off by an hour.", "thai": "นาฬิกาในรถคลาดเคลื่อนไปหนึ่งชั่วโมง"}
{"word": "clock", "english": "I’m looking for a digital clock for my desk.", "thai": "ฉันกำลังมองหานาฬิกาดิจิทัลสำหรับโต๊ะทำงาน"}
{"word": "clock", "english": "The clock in the classroom is broken.", "thai": "นาฬิกาในห้องเรียนเสีย"}
{"word": "clock", "english": "I glanced at the clock during the meeting.", "thai": "ฉันมองนาฬิการะหว่างการประชุม"}
{"word": "clock", "english": "The clock on the tower chimes every hour.", "thai": "นาฬิกาบนหอคอยดังทุกชั่วโมง"}
{"word": "clock", "english": "I need to replace the battery in the clock.", "thai": "ฉันต้องเปลี่ยนแบตเตอรี่ในนาฬิกา"}
{"word": "clock", "english": "The clock in the dining room is elegant.", "thai": "นาฬิกาในห้องอาหารดูสง่างาม"}
{"word": "clock", "english": "I keep a clock on my nightstand.", "thai": "ฉันวางนาฬิกาไว้บนโต๊ะข้างเตียง"}
{"word": "clock", "english": "The clock is ticking too fast for me.", "thai": "นาฬิกาเดินเร็วเกินไปสำหรับฉัน"}
{"word": "clock", "english": "I got a cuckoo clock from Germany.", "thai": "ฉันได้นาฬิกาคูคูจากเยอรมนี"}
{"word": "clock", "english": "The clock in the library is silent.", "thai": "นาฬิกาในห้องสมุดเงียบสนิท"}
{"word": "clock", "english": "I set the clock back for daylight savings.", "thai": "ฉันตั้งนาฬิกาถอยหลังเพื่อปรับเวลาออมแสง"}
{"word": "clock", "english": "The clock on the fireplace is stunning.", "thai": "นาฬิกาบนเตาผิงดูน่าทึ่ง"}
{"word": "clock", "english": "I need a clock that glows in the dark.", "thai": "ฉันต้องการนาฬิกาที่เรืองแสงในที่มืด"}
{"word": "clock", "english": "The clock in the waiting room is annoying.", "thai": "นาฬิกาในห้องรอน่ารำคาญ"}
{"word": "clock", "english": "I’m late because my clock stopped.", "thai": "ฉันมาสายเพราะนาฬิกาของฉันหยุด"}
{"word": "clock", "english": "The clock on the microwave is flashing.", "thai": "นาฬิกาบนไมโครเวฟกำลังกะพริบ"}
{"word": "clock", "english": "I found an old clock in the attic.", "thai": "ฉันเจอนาฬิกาเก่าในห้องใต้หลังคา"}
{"word": "clock", "english": "The clock in my car is digital.", "thai": "นาฬิกาในรถของฉันเป็นแบบดิจิทัล"}
{"word": "clock", "english": "I’m shopping for a modern clock design.", "thai": "ฉันกำลังหานาฬิกาดีไซน์ทันสมัย"}
{"word": "clock", "english": "The clock on the stove is always wrong.", "thai": "นาฬิกาบนเตามักจะผิด"}
{"word": "clock", "english": "I need a clock for my home office.", "thai": "ฉันต้องการนาฬิกาสำหรับออฟฟิศที่บ้าน"}
{"word": "clock", "english": "The clock in the gym is hard to read.", "thai": "นาฬิกาในยิมอ่านยาก"}
{"word": "clock", "english": "I love how the clock chimes at noon.", "thai": "ฉันชอบที่นาฬิกาดังตอนเที่ยง"}
{"word": "clock", "english": "The clock on my desk is too small.", "thai": "นาฬิกาบนโต๊ะทำงานของฉันเล็กเกินไป"}
{"word": "clock", "english": "I’m fixing the clock in the guest room.", "thai": "ฉันกำลังซ่อมนาฬิกาในห้องรับแขก"}
{"word": "clock", "english": "The clock in the bar is vintage.", "thai": "นาฬิกาในบาร์เป็นแบบวินเทจ"}
{"word": "clock", "english": "I need a clock with big numbers.", "thai": "ฉันต้องการนาฬิกาที่มีตัวเลขใหญ่"}
{"word": "clock", "english": "The clock on the radio is always off.", "thai": "นาฬิกาบนวิทยุคลาดเคลื่อนเสมอ"}
{"word": "clock", "english": "I’m looking for a wall clock online.", "thai": "ฉันกำลังมองหานาฬิกาติดผนังทางออนไลน์"}
{"word": "clock", "english": "The clock in the lobby is huge.", "thai": "นาฬิกาในล็อบบี้ตัวใหญ่"}
{"word": "clock", "english": "I set the clock to wake me up early.", "thai": "ฉันตั้งนาฬิกาให้ปลุกฉันแต่เช้า"}
{"word": "clock", "english": "The clock in the study is too loud.", "thai": "นาฬิกาในห้องอ่านหนังสือดังเกินไป"}
{"word": "clock", "english": "I got a new clock for my birthday.", "thai": "ฉันได้นาฬิกาใหม่ในวันเกิด"}
{"word": "clock", "english": "The clock on the TV is out of sync.", "thai": "นาฬิกาบนทีวีไม่ตรงกัน"}
{"word": "clock", "english": "I need a clock that’s easy to read.", "thai": "ฉันต้องการนาฬิกาที่อ่านง่าย"}
{"word": "clock", "english": "The clock in the garage is dusty.", "thai": "นาฬิกาในโรงรถเต็มไปด้วยฝุ่น"}
{"word": "clock", "english": "I’m buying a clock for the nursery.", "thai": "ฉันกำลังซื้อนาฬิกาสำหรับห้องเด็ก"}
{"word": "clock", "english": "The clock on the computer is accurate.", "thai": "นาฬิกาบนคอมพิวเตอร์แม่นยำ"}
{"word": "clock", "english": "I broke the glass on the clock face.", "thai": "ฉันทำกระจกหน้านาฬิกาแตก"}
{"word": "clock", "english": "The clock in the shop is ticking fast.", "thai": "นาฬิกาในร้านเดินเร็ว"}
{"word": "clock", "english": "I need a clock for my workout room.", "thai": "ฉันต้องการนาฬิกาสำหรับห้องออกกำลังกาย"}
{"word": "clock", "english": "The clock in the basement is old.", "thai": "นาฬิกาในชั้นใต้ดินเก่า"}
{"word": "clock", "english": "I’m adjusting the clock for the new time zone.", "thai": "ฉันกำลังปรับนาฬิกาสำหรับเขตเวลาใหม่"}
{"word": "clock", "english": "The clock on the mantel is decorative.", "thai": "นาฬิกาบนหิ้งเตาผิงเป็นของตกแต่ง"}
{"word": "clock", "english": "I need a clock that doesn’t tick.", "thai": "ฉันต้องการนาฬิกาที่ไม่ส่งเสียงติ๊ก"}
{"word": "clock", "english": "The clock in the meeting room is modern.", "thai": "นาฬิกาในห้องประชุมดูทันสมัย"}
{"word": "clock", "english": "I’m late because the clock was wrong.", "thai": "ฉันมาสายเพราะนาฬิกาผิด"}
{"word": "clock", "english": "The clock on the stove is blinking.", "thai": "นาฬิกาบนเตากำลังกะพริบ"}
{"word": "clock", "english": "I found a cool clock at the flea market.", "thai": "ฉันเจอนาฬิกาเท่ๆ ที่ตลาดนัด"}
{"word": "clock", "english": "The clock in my office is too bright.", "thai": "นาฬิกาในออฟฟิศของฉันสว่างเกินไป"}
{"word": "clock", "english": "I need a clock for the bathroom.", "thai": "ฉันต้องการนาฬิกาสำหรับห้องน้ำ"}
{"word": "clock", "english": "The clock on the dashboard is broken.", "thai": "นาฬิกาบนแดชบอร์ดเสีย"}
{"word": "clock", "english": "I’m looking for a silent clock.", "thai": "ฉันกำลังมองหานาฬิกาแบบเงียบ"}
{"word": "clock", "english": "The clock in the cafe is quirky.", "thai": "นาฬิกาในคาเฟ่นั้นแปลกตา"}
{"word": "clock", "english": "I set the clock to chime every hour.", "thai": "ฉันตั้งนาฬิกาให้ดังทุกชั่วโมง"}
{"word": "clock", "english": "The clock on my wrist is digital.", "thai": "นาฬิกาที่ข้อมือของฉันเป็นแบบดิจิทัล"}
{"word": "clock", "english": "I need a clock for the patio.", "thai": "ฉันต้องการนาฬิกาสำหรับลานบ้าน"}
{"word": "clock", "english": "The clock in the studio is stylish.", "thai": "นาฬิกาในสตูดิโอมีสไตล์"}
{"word": "clock", "english": "I’m buying a clock for my classroom.", "thai": "ฉันกำลังซื้อนาฬิกาสำหรับห้องเรียน"}
{"word": "clock", "english": "The clock on the shelf is too loud.", "thai": "นาฬิกาบนชั้นวางดังเกินไป"}
{"word": "clock", "english": "I need a clock with a second hand.", "thai": "ฉันต้องการนาฬิกาที่มีเข็มวินาที"}
{"word": "clock", "english": "The clock in the park is huge.", "thai": "นาฬิกาในสวนสาธารณะตัวใหญ่"}
{"word": "clock", "english": "I’m fixing the clock in the den.", "thai": "ฉันกำลังซ่อมนาฬิกาในห้องพักผ่อน"}
{"word": "clock", "english": "The clock on the wall is too high.", "thai": "นาฬิกาบนผนังสูงเกินไป"}
{"word": "clock", "english": "I need a clock for my workshop.", "thai": "ฉันต้องการนาฬิกาสำหรับโรงงาน"}
{"word": "clock", "english": "The clock in the attic is dusty.", "thai": "นาฬิกาในห้องใต้หลังคาเต็มไปด้วยฝุ่น"}
{"word": "clock", "english": "I’m buying a clock for the porch.", "thai": "ฉันกำลังซื้อนาฬิกาสำหรับระเบียง"}
{"word": "clock", "english": "The clock in the hallway is ticking.", "thai": "นาฬิกาในโถงทางเดินกำลังเดิน"}
{"word": "clock", "english": "I need a clock that’s waterproof.", "thai": "ฉันต้องการนาฬิกาที่กันน้ำ"}
{"word": "clock", "english": "The clock on my laptop is off.", "thai": "นาฬิกาบนแล็ปท็อปของฉันคลาดเคลื่อน"}
{"word": "clock", "english": "I’m looking for a retro clock design.", "thai": "ฉันกำลังมองหานาฬิกาดีไซน์ย้อนยุค"}
{"word": "clock", "english": "The clock in the lounge is fancy.", "thai": "นาฬิกาในห้องนั่งเล่นดูหรูหรา"}
{"word": "clock", "english": "I need a clock for my sewing room.", "thai": "ฉันต้องการนาฬิกาสำหรับห้องเย็บผ้า"}
{"word": "clock", "english": "The clock on the counter is broken.", "thai": "นาฬิกาบนเคาน์เตอร์เสีย"}
{"word": "clock", "english": "I’m setting the clock for the new schedule.", "thai": "ฉันกำลังตั้งนาฬิกาสำหรับตารางเวลาใหม่"}
{"word": "clock", "english": "The clock in the bedroom is glowing.", "thai": "นาฬิกาในห้องนอนเรืองแสง"}
{"word": "clock", "english": "I need a clock with a loud tick.", "thai": "ฉันต้องการนาฬิกาที่มีเสียงติ๊กดัง"}
{"word": "clock", "english": "The clock in the store is modern.", "thai": "นาฬิกาในร้านดูทันสมัย"}
{"word": "clock", "english": "I’m buying a clock for the kitchen.", "thai": "ฉันกำลังซื้อนาฬิกาสำหรับครัว"}
{"word": "clock", "english": "The clock on the shelf is too old.", "thai": "นาฬิกาบนชั้นวางเก่าเกินไป"}
{"word": "clock", "english": "I need a clock for my study desk.", "thai": "ฉันต้องการนาฬิกาสำหรับโต๊ะอ่านหนังสือ"}
{"word": "clock", "english": "The clock in the garden is rusty.", "thai": "นาฬิกาในสวนขึ้นสนิม"}
{"word": "clock", "english": "I’m looking for a clock with a timer.", "thai": "ฉันกำลังมองหานาฬิกาที่มีตัวจับเวลา"}
{"word": "clock", "english": "The clock on the nightstand is ticking.", "thai": "นาฬิกาบนโต๊ะข้างเตียงกำลังเดิน"}
{"word": "clock", "english": "I need a clock for the meeting room.", "thai": "ฉันต้องการนาฬิกาสำหรับห้องประชุม"}
{"word": "clock", "english": "The clock in the house is too loud.", "thai": "นาฬิกาในบ้านดังเกินไป"}
{"word": "alarm clock", "english": "My alarm clock didn’t go off this morning.", "thai": "นาฬิกาปลุกของฉันไม่ดังเมื่อเช้านี้"}
{"word": "alarm clock", "english": "I need a new alarm clock for my bedroom.", "thai": "ฉันต้องการนาฬิกาปลุกใหม่สำหรับห้องนอน"}
{"word": "alarm clock", "english": "The alarm clock is too loud for me.", "thai": "นาฬิกาปลุกดังเกินไปสำหรับฉัน"}
{"word": "alarm clock", "english": "I forgot to set the alarm clock last night.", "thai": "เมื่อคืนฉันลืมตั้งนาฬิกาปลุก"}
{"word": "alarm clock", "english": "The alarm clock woke me up at six.", "thai": "นาฬิกาปลุกปลุกฉันตอนหกโมง"}
{"word": "alarm clock", "english": "I bought a digital alarm clock yesterday.", "thai": "เมื่อวานฉันซื้อนาฬิกาปลุกแบบดิจิทัล"}
{"word": "alarm clock", "english": "The alarm clock on my phone is unreliable.", "thai": "นาฬิกาปลุกในโทรศัพท์ของฉันไม่น่าเชื่อถือ"}
{"word": "alarm clock", "english": "Can you turn off the alarm clock?", "thai": "ช่วยปิดนาฬิกาปลุกได้ไหม"}
{"word": "alarm clock", "english": "My alarm clock has a snooze button.", "thai": "นาฬิกาปลุกของฉันมีปุ่มเลื่อนเวลาปลุก"}
{"word": "alarm clock", "english": "The alarm clock broke when it fell.", "thai": "นาฬิกาปลุกพังเมื่อมันตก"}
{"word": "alarm clock", "english": "I need an alarm clock that’s easy to set.", "thai": "ฉันต้องการนาฬิกาปลุกที่ตั้งง่าย"}
{"word": "alarm clock", "english": "The alarm clock is ticking all night.", "thai": "นาฬิกาปลุกเดินติ๊กทั้งคืน"}
{"word": "alarm clock", "english": "I set the alarm clock for seven a.m.", "thai": "ฉันตั้งนาฬิกาปลุกไว้เจ็ดโมงเช้า"}
{"word": "alarm clock", "english": "The alarm clock has a bright display.", "thai": "นาฬิกาปลุกมีหน้าจอสว่าง"}
{"word": "alarm clock", "english": "I’m looking for a loud alarm clock.", "thai": "ฉันกำลังมองหานาฬิกาปลุกที่เสียงดัง"}
{"word": "alarm clock", "english": "The alarm clock in the guest room is old.", "thai": "นาฬิกาปลุกในห้องรับแขกเก่า"}
{"word": "alarm clock", "english": "I hit snooze on the alarm clock twice.", "thai": "ฉันกดเลื่อนเวลานาฬิกาปลุกสองครั้ง"}
{"word": "alarm clock", "english": "The alarm clock is on my nightstand.", "thai": "นาฬิกาปลุกอยู่บนโต๊ะข้างเตียง"}
{"word": "alarm clock", "english": "I need an alarm clock with a radio.", "thai": "ฉันต้องการนาฬิกาปลุกที่มีวิทยุ"}
{"word": "alarm clock", "english": "The alarm clock stopped working suddenly.", "thai": "นาฬิกาปลุกหยุดทำงานกะทันหัน"}
{"word": "alarm clock", "english": "I got a new alarm clock for my trip.", "thai": "ฉันได้นาฬิกาปลุกใหม่สำหรับการเดินทาง"}
{"word": "alarm clock", "english": "The alarm clock is too quiet to hear.", "thai": "นาฬิกาปลุกเงียบเกินไปจนไม่ได้ยิน"}
{"word": "alarm clock", "english": "I’m buying an alarm clock online today.", "thai": "วันนี้ฉันจะซื้อนาฬิกาปลุกทางออนไลน์"}
{"word": "alarm clock", "english": "The alarm clock has a cool design.", "thai": "นาฬิกาปลุกมีดีไซน์เท่"}
{"word": "alarm clock", "english": "I need an alarm clock for early mornings.", "thai": "ฉันต้องการนาฬิกาปลุกสำหรับเช้าตรู่"}
{"word": "alarm clock", "english": "The alarm clock battery died last night.", "thai": "แบตเตอรี่นาฬิกาปลุกหมดเมื่อคืน"}
{"word": "alarm clock", "english": "I set two alarm clocks just in case.", "thai": "ฉันตั้งนาฬิกาปลุกสองตัวเผื่อไว้"}
{"word": "alarm clock", "english": "The alarm clock has a soothing sound.", "thai": "นาฬิกาปลุกมีเสียงที่นุ่มนวล"}
{"word": "alarm clock", "english": "I knocked over the alarm clock this morning.", "thai": "เช้านี้ฉันทำนาฬิกาปลุกล้ม"}
{"word": "alarm clock", "english": "The alarm clock is too complicated to use.", "thai": "นาฬิกาปลุกใช้งานยากเกินไป"}
{"word": "alarm clock", "english": "I need an alarm clock that vibrates.", "thai": "ฉันต้องการนาฬิกาปลุกที่สั่น"}
{"word": "alarm clock", "english": "The alarm clock woke the whole house.", "thai": "นาฬิกาปลุกปลุกทั้งบ้าน"}
{"word": "alarm clock", "english": "I forgot where I put the alarm clock.", "thai": "ฉันลืมว่าวางนาฬิกาปลุกไว้ที่ไหน"}
{"word": "alarm clock", "english": "The alarm clock is glowing in the dark.", "thai": "นาฬิกาปลุกเรืองแสงในที่มืด"}
{"word": "alarm clock", "english": "I need a small alarm clock for travel.", "thai": "ฉันต้องการนาฬิกาปลุกขนาดเล็กสำหรับเดินทาง"}
{"word": "alarm clock", "english": "The alarm clock is driving me crazy.", "thai": "นาฬิกาปลุกทำให้ฉันรำคาญ"}
{"word": "alarm clock", "english": "I set the alarm clock for a quick nap.", "thai": "ฉันตั้งนาฬิกาปลุกสำหรับงีบสั้นๆ"}
{"word": "alarm clock", "english": "The alarm clock has a backup battery.", "thai": "นาฬิกาปลุกมีแบตเตอรี่สำรอง"}
{"word": "alarm clock", "english": "I’m looking for a retro alarm clock.", "thai": "ฉันกำลังมองหานาฬิกาปลุกสไตล์ย้อนยุค"}
{"word": "alarm clock", "english": "The alarm clock is too bright at night.", "thai": "นาฬิกาปลุกสว่างเกินไปตอนกลางคืน"}
{"word": "alarm clock", "english": "I need an alarm clock with big numbers.", "thai": "ฉันต้องการนาฬิกาปลุกที่มีตัวเลขใหญ่"}
{"word": "alarm clock", "english": "The alarm clock didn’t wake me up.", "thai": "นาฬิกาปลุกไม่ได้ปลุกฉัน"}
{"word": "alarm clock", "english": "I’m buying an alarm clock for my kid.", "thai": "ฉันกำลังซื้อนาฬิกาปลุกให้ลูก"}
{"word": "alarm clock", "english": "The alarm clock is stuck at midnight.", "thai": "นาฬิกาปลุกค้างอยู่ที่เที่ยงคืน"}
{"word": "alarm clock", "english": "I need an alarm clock that’s reliable.", "thai": "ฉันต้องการนาฬิกาปลุกที่น่าเชื่อถือ"}
{"word": "alarm clock", "english": "The alarm clock has a gentle wake-up sound.", "thai": "นาฬิกาปลุกมีเสียงปลุกที่นุ่มนวล"}
{"word": "alarm clock", "english": "I broke the alarm clock by accident.", "thai": "ฉันทำนาฬิกาปลุกพังโดยไม่ได้ตั้งใจ"}
{"word": "alarm clock", "english": "The alarm clock is too old to work.", "thai": "นาฬิกาปลุกเก่าเกินไปจนใช้งานไม่ได้"}
{"word": "alarm clock", "english": "I’m setting the alarm clock for five a.m.", "thai": "ฉันกำลังตั้งนาฬิกาปลุกไว้ห้าโมงเช้า"}
{"word": "alarm clock", "english": "The alarm clock has a sunrise feature.", "thai": "นาฬิกาปลุกมีฟีเจอร์จำลองพระอาทิตย์ขึ้น"}
{"word": "alarm clock", "english": "I need an alarm clock for my office.", "thai": "ฉันต้องการนาฬิกาปลุกสำหรับออฟฟิศ"}
{"word": "alarm clock", "english": "The alarm clock is on the dresser.", "thai": "นาฬิกาปลุกอยู่บนโต๊ะเครื่องแป้ง"}
{"word": "alarm clock", "english": "I’m looking for a smart alarm clock.", "thai": "ฉันกำลังมองหานาฬิกาปลุกอัจฉริยะ"}
{"word": "alarm clock", "english": "The alarm clock keeps resetting itself.", "thai": "นาฬิกาปลุกรีเซ็ตตัวเองตลอด"}
{"word": "alarm clock", "english": "I need an alarm clock with a USB port.", "thai": "ฉันต้องการนาฬิกาปลุกที่มีพอร์ต USB"}
{"word": "alarm clock", "english": "The alarm clock is too hard to program.", "thai": "นาฬิกาปลุกตั้งโปรแกรมยากเกินไป"}
{"word": "alarm clock", "english": "I set the alarm clock for a reminder.", "thai": "ฉันตั้งนาฬิกาปลุกเพื่อเตือนความจำ"}
{"word": "alarm clock", "english": "The alarm clock is a gift from my mom.", "thai": "นาฬิกาปลุกเป็นของขวัญจากแม่"}
{"word": "alarm clock", "english": "I need an alarm clock that’s portable.", "thai": "ฉันต้องการนาฬิกาปลุกที่พกพาสะดวก"}
{"word": "alarm clock", "english": "The alarm clock is buzzing too loudly.", "thai": "นาฬิกาปลุกส่งเสียงดังเกินไป"}
{"word": "alarm clock", "english": "I’m buying an alarm clock for my dorm.", "thai": "ฉันกำลังซื้อนาฬิกาปลุกสำหรับหอพัก"}
{"word": "alarm clock", "english": "The alarm clock has a sleek design.", "thai": "นาฬิกาปลุกมีดีไซน์ทันสมัย"}
{"word": "alarm clock", "english": "I need an alarm clock for my workouts.", "thai": "ฉันต้องการนาฬิกาปลุกสำหรับการออกกำลังกาย"}
{"word": "alarm clock", "english": "The alarm clock is flashing the wrong time.", "thai": "นาฬิกาปลุกกะพริบเวลาไม่ถูกต้อง"}
{"word": "alarm clock", "english": "I’m looking for a vintage alarm clock.", "thai": "ฉันกำลังมองหานาฬิกาปลุกสไตล์วินเทจ"}
{"word": "alarm clock", "english": "The alarm clock woke me up too early.", "thai": "นาฬิกาปลุกปลุกฉันเร็วเกินไป"}
{"word": "alarm clock", "english": "I need an alarm clock with a dim display.", "thai": "ฉันต้องการนาฬิกาปลุกที่มีหน้าจอมืด"}
{"word": "alarm clock", "english": "The alarm clock is on sale today.", "thai": "นาฬิกาปลุกกำลังลดราคาวันนี้"}
{"word": "alarm clock", "english": "I set the alarm clock for my meeting.", "thai": "ฉันตั้งนาฬิกาปลุกสำหรับการประชุม"}
{"word": "alarm clock", "english": "The alarm clock has a backup power source.", "thai": "นาฬิกาปลุกมีแหล่งพลังงานสำรอง"}
{"word": "alarm clock", "english": "I need an alarm clock for my kid’s room.", "thai": "ฉันต้องการนาฬิกาปลุกสำหรับห้องของลูก"}
{"word": "alarm clock", "english": "The alarm clock is too small to see.", "thai": "นาฬิกาปลุกเล็กเกินไปจนมองไม่เห็น"}
{"word": "alarm clock", "english": "I’m buying an alarm clock for camping.", "thai": "ฉันกำลังซื้อนาฬิกาปลุกสำหรับแคมปิ้ง"}
{"word": "alarm clock", "english": "The alarm clock is making a weird noise.", "thai": "นาฬิกาปลุกส่งเสียงแปลกๆ"}
{"word": "alarm clock", "english": "I need an alarm clock with a timer.", "thai": "ฉันต้องการนาฬิกาปลุกที่มีตัวจับเวลา"}
{"word": "alarm clock", "english": "The alarm clock didn’t ring this morning.", "thai": "นาฬิกาปลุกไม่ดังเมื่อเช้านี้"}
{"word": "alarm clock", "english": "I’m looking for a cheap alarm clock.", "thai": "ฉันกำลังมองหานาฬิกาปลุกราคาถูก"}
{"word": "alarm clock", "english": "The alarm clock is in the wrong time zone.", "thai": "นาฬิกาปลุกอยู่ในเขตเวลาไม่ถูกต้อง"}
{"word": "alarm clock", "english": "I need an alarm clock for my study desk.", "thai": "ฉันต้องการนาฬิกาปลุกสำหรับโต๊ะอ่านหนังสือ"}
{"word": "alarm clock", "english": "The alarm clock is too heavy to move.", "thai": "นาฬิกาปลุกหนักเกินไปจนเคลื่อนย้ายไม่ได้"}
{"word": "alarm clock", "english": "I’m setting the alarm clock for my nap.", "thai": "ฉันกำลังตั้งนาฬิกาปลุกสำหรับการงีบ"}
{"word": "alarm clock", "english": "The alarm clock has a touch screen.", "thai": "นาฬิกาปลุกมีหน้าจอสัมผัส"}
{"word": "alarm clock", "english": "I need an alarm clock that’s durable.", "thai": "ฉันต้องการนาฬิกาปลุกที่ทนทาน"}
{"word": "alarm clock", "english": "The alarm clock is too old-fashioned.", "thai": "นาฬิกาปลุกดูเชยเกินไป"}
{"word": "alarm clock", "english": "I’m buying an alarm clock for my parents.", "thai": "ฉันกำลังซื้อนาฬิกาปลุกให้พ่อแม่"}
{"word": "alarm clock", "english": "The alarm clock has a loud buzzer.", "thai": "นาฬิกาปลุกมีเสียงบัสเซอร์ดัง"}
{"word": "alarm clock", "english": "I need an alarm clock for my hotel stay.", "thai": "ฉันต้องการนาฬิกาปลุกสำหรับการพักในโรงแรม"}
{"word": "alarm clock", "english": "The alarm clock is battery-operated.", "thai": "นาฬิกาปลุกใช้แบตเตอรี่"}
{"word": "alarm clock", "english": "I’m looking for an alarm clock with music.", "thai": "ฉันกำลังมองหานาฬิกาปลุกที่มีเพลง"}
{"word": "alarm clock", "english": "The alarm clock is stuck on one time.", "thai": "นาฬิกาปลุกค้างอยู่ที่เวลาเดียว"}
{"word": "alarm clock", "english": "I need an alarm clock for my guest room.", "thai": "ฉันต้องการนาฬิกาปลุกสำหรับห้องรับแขก"}
{"word": "alarm clock", "english": "The alarm clock has a modern look.", "thai": "นาฬิกาปลุกมีดีไซน์ทันสมัย"}
{"word": "alarm clock", "english": "I’m setting the alarm clock for my flight.", "thai": "ฉันกำลังตั้งนาฬิกาปลุกสำหรับเที่ยวบิน"}
{"word": "alarm clock", "english": "The alarm clock is too fancy for me.", "thai": "นาฬิกาปลุกดูหรูเกินไปสำหรับฉัน"}
{"word": "alarm clock", "english": "I need an alarm clock that’s easy to read.", "thai": "ฉันต้องการนาฬิกาปลุกที่อ่านง่าย"}
{"word": "alarm clock", "english": "The alarm clock woke me up on time.", "thai": "นาฬิกาปลุกปลุกฉันตรงเวลา"}
{"word": "alarm clock", "english": "I’m buying an alarm clock for my sister.", "thai": "ฉันกำลังซื้อนาฬิกาปลุกให้พี่สาว"}
{"word": "alarm clock", "english": "The alarm clock has a broken button.", "thai": "นาฬิกาปลุกมีปุ่มที่เสีย"}
{"word": "alarm clock", "english": "I need an alarm clock for my new apartment.", "thai": "ฉันต้องการนาฬิกาปลุกสำหรับอพาร์ทเมนต์ใหม่"}
{"word": "alarm clock", "english": "The alarm clock is too loud for my roommate.", "thai": "นาฬิกาปลุกดังเกินไปสำหรับรูมเมทของฉัน"}
{"word": "alarm clock", "english": "I’m looking for an alarm clock with a light.", "thai": "ฉันกำลังมองหานาฬิกาปลุกที่มีไฟ"}
{"word": "mirror", "english": "I need a new mirror for my bathroom.", "thai": "ฉันต้องการกระจกใหม่สำหรับห้องน้ำ"}
{"word": "mirror", "english": "The mirror in my bedroom is cracked.", "thai": "กระจกในห้องนอนของฉันแตก"}
{"word": "mirror", "english": "I caught my reflection in the mirror.", "thai": "ฉันเห็นภาพสะท้อนของตัวเองในกระจก"}
{"word": "mirror", "english": "The mirror on the wall is antique.", "thai": "กระจกบนผนังเป็นของโบราณ"}
{"word": "mirror", "english": "Can you clean the mirror in the hallway?", "thai": "ช่วยทำความสะอาดกระจกในโถงทางเดินได้ไหม"}
{"word": "mirror", "english": "I bought a full-length mirror yesterday.", "thai": "เมื่อวานฉันซื้อกระจกยาวเต็มตัว"}
{"word": "mirror", "english": "The mirror in the car is misaligned.", "thai": "กระจกในรถปรับไม่ตรง"}
{"word": "mirror", "english": "I need a mirror for my makeup table.", "thai": "ฉันต้องการกระจกสำหรับโต๊ะเครื่องสำอาง"}
{"word": "mirror", "english": "The mirror in the gym is huge.", "thai": "กระจกในยิมตัวใหญ่"}
{"word": "mirror", "english": "I broke the mirror by accident.", "thai": "ฉันทำกระจกแตกโดยไม่ได้ตั้งใจ"}
{"word": "mirror", "english": "The mirror in the dressing room is foggy.", "thai": "กระจกในห้องแต่งตัวมีฝ้า"}
{"word": "mirror", "english": "I’m looking for a decorative mirror.", "thai": "ฉันกำลังมองหากระจกตกแต่ง"}
{"word": "mirror", "english": "The mirror in the closet is too small.", "thai": "กระจกในตู้เสื้อผ้าเล็กเกินไป"}
{"word": "mirror", "english": "I need a mirror with better lighting.", "thai": "ฉันต้องการกระจกที่มีแสงดีกว่า"}
{"word": "mirror", "english": "The mirror on my dresser is wobbly.", "thai": "กระจกบนโต๊ะเครื่องแป้งของฉันโยกเยก"}
{"word": "mirror", "english": "I saw a smudge on the mirror.", "thai": "ฉันเห็นรอยเปื้อนบนกระจก"}
{"word": "mirror", "english": "The mirror in the entryway is stylish.", "thai": "กระจกที่ทางเข้าดูมีสไตล์"}
{"word": "mirror", "english": "I need a mirror for the guest room.", "thai": "ฉันต้องการกระจกสำหรับห้องรับแขก"}
{"word": "mirror", "english": "The mirror in the office is too high.", "thai": "กระจกในออฟฟิศสูงเกินไป"}
{"word": "mirror", "english": "I’m hanging a mirror in the living room.", "thai": "ฉันกำลังแขวนกระจกในห้องนั่งเล่น"}
{"word": "mirror", "english": "The mirror in the salon is spotless.", "thai": "กระจกในร้านเสริมสวยสะอาดไร้ที่ติ"}
{"word": "mirror", "english": "I need a mirror that doesn’t distort.", "thai": "ฉันต้องการกระจกที่ไม่บิดเบือน"}
{"word": "mirror", "english": "The mirror in the bathroom is steaming up.", "thai": "กระจกในห้องน้ำมีไอน้ำเกาะ"}
{"word": "mirror", "english": "I bought a round mirror for my room.", "thai": "ฉันซื้อกระจกกลมสำหรับห้องของฉัน"}
{"word": "mirror", "english": "The mirror in the store is cracked.", "thai": "กระจกในร้านแตก"}
{"word": "mirror", "english": "I need a mirror for my workout space.", "thai": "ฉันต้องการกระจกสำหรับพื้นที่ออกกำลังกาย"}
{"word": "mirror", "english": "The mirror on the door is heavy.", "thai": "กระจกที่ประตูหนัก"}
{"word": "mirror", "english": "I’m cleaning the mirror in the bedroom.", "thai": "ฉันกำลังทำความสะอาดกระจกในห้องนอน"}
{"word": "mirror", "english": "The mirror in the hallway is too big.", "thai": "กระจกในโถงทางเดินใหญ่เกินไป"}
{"word": "mirror", "english": "I need a mirror with a wooden frame.", "thai": "ฉันต้องการกระจกที่มีกรอบไม้"}
{"word": "mirror", "english": "The mirror in the car needs adjusting.", "thai": "กระจกในรถต้องปรับ"}
{"word": "mirror", "english": "I’m looking for a vintage mirror.", "thai": "ฉันกำลังมองหากระจกสไตล์วินเทจ"}
{"word": "mirror", "english": "The mirror in the dining room is fancy.", "thai": "กระจกในห้องอาหารดูหรูหรา"}
{"word": "mirror", "english": "I need a mirror for my new apartment.", "thai": "ฉันต้องการกระจกสำหรับอพาร์ทเมนต์ใหม่"}
{"word": "mirror", "english": "The mirror on the wall is tilted.", "thai": "กระจกบนผนังเอียง"}
{"word": "mirror", "english": "I saw myself in the mirror and laughed.", "thai": "ฉันเห็นตัวเองในกระจกแล้วหัวเราะ"}
{"word": "mirror", "english": "The mirror in the shop is enormous.", "thai": "กระจกในร้านใหญ่โต"}
{"word": "mirror", "english": "I need a mirror for my vanity table.", "thai": "ฉันต้องการกระจกสำหรับโต๊ะเครื่องแป้ง"}
{"word": "mirror", "english": "The mirror in the gym is scratched.", "thai": "กระจกในยิมมีรอยขีดข่วน"}
{"word": "mirror", "english": "I’m buying a mirror for the nursery.", "thai": "ฉันกำลังซื้อกระจกสำหรับห้องเด็ก"}
{"word": "mirror", "english": "The mirror in the lobby is stunning.", "thai": "กระจกในล็อบบี้ดูน่าทึ่ง"}
{"word": "mirror", "english": "I need a mirror that’s easy to clean.", "thai": "ฉันต้องการกระจกที่ทำความสะอาดง่าย"}
{"word": "mirror", "english": "The mirror in the closet is too narrow.", "thai": "กระจกในตู้เสื้อผ้าแคบเกินไป"}
{"word": "mirror", "english": "I’m installing a mirror in the bathroom.", "thai": "ฉันกำลังติดตั้งกระจกในห้องน้ำ"}
{"word": "mirror", "english": "The mirror on the dresser is dusty.", "thai": "กระจกบนโต๊ะเครื่องแป้งเต็มไปด้วยฝุ่น"}
{"word": "mirror", "english": "I need a mirror for my dance studio.", "thai": "ฉันต้องการกระจกสำหรับสตูดิโอเต้นรำ"}
{"word": "mirror", "english": "The mirror in the car is loose.", "thai": "กระจกในรถหลวม"}
{"word": "mirror", "english": "I’m looking for a framed mirror online.", "thai": "ฉันกำลังมองหากระจกมีกรอบทางออนไลน์"}
{"word": "mirror", "english": "The mirror in the bedroom is too small.", "thai": "กระจกในห้องนอนเล็กเกินไป"}
{"word": "mirror", "english": "I need a mirror for my workout room.", "thai": "ฉันต้องการกระจกสำหรับห้องออกกำลังกาย"}
{"word": "mirror", "english": "The mirror on the wall is chipped.", "thai": "กระจกบนผนังบิ่น"}
{"word": "mirror", "english": "I’m cleaning the mirror in the living room.", "thai": "ฉันกำลังทำความสะอาดกระจกในห้องนั่งเล่น"}
{"word": "mirror", "english": "The mirror in the salon is perfect.", "thai": "กระจกในร้านเสริมสวยสมบูรณ์แบบ"}
{"word": "mirror", "english": "I need a mirror for my dressing area.", "thai": "ฉันต้องการกระจกสำหรับพื้นที่แต่งตัว"}
{"word": "mirror", "english": "The mirror in the hallway is foggy.", "thai": "กระจกในโถงทางเดินมีฝ้า"}
{"word": "mirror", "english": "I’m buying a mirror for my office.", "thai": "ฉันกำลังซื้อกระจกสำหรับออฟฟิศ"}
{"word": "mirror", "english": "The mirror on the door is cracked.", "thai": "กระจกที่ประตูแตก"}
{"word": "mirror", "english": "I need a mirror with a modern design.", "thai": "ฉันต้องการกระจกที่มีดีไซน์ทันสมัย"}
{"word": "mirror", "english": "The mirror in the bathroom is too high.", "thai": "กระจกในห้องน้ำสูงเกินไป"}
{"word": "mirror", "english": "I’m looking for a round mirror.", "thai": "ฉันกำลังมองหากระจกกลม"}
{"word": "mirror", "english": "The mirror in the store is dirty.", "thai": "กระจกในร้านสกปรก"}
{"word": "mirror", "english": "I need a mirror for my makeup routine.", "thai": "ฉันต้องการกระจกสำหรับการแต่งหน้า"}
{"word": "mirror", "english": "The mirror in the gym is too low.", "thai": "กระจกในยิมต่ำเกินไป"}
{"word": "mirror", "english": "I’m hanging a mirror in the entryway.", "thai": "ฉันกำลังแขวนกระจกที่ทางเข้า"}
{"word": "mirror", "english": "The mirror on the dresser is antique.", "thai": "กระจกบนโต๊ะเครื่องแป้งเป็นของโบราณ"}
{"word": "mirror", "english": "I need a mirror for my sewing room.", "thai": "ฉันต้องการกระจกสำหรับห้องเย็บผ้า"}
{"word": "mirror", "english": "The mirror in the bedroom is heavy.", "thai": "กระจกในห้องนอนหนัก"}
{"word": "mirror", "english": "I’m cleaning the mirror in the guest room.", "thai": "ฉันกำลังทำความสะอาดกระจกในห้องรับแขก"}
{"word": "mirror", "english": "The mirror in the closet is perfect.", "thai": "กระจกในตู้เสื้อผ้าสมบูรณ์แบบ"}
{"word": "mirror", "english": "I need a mirror for my new house.", "thai": "ฉันต้องการกระจกสำหรับบ้านใหม่"}
{"word": "mirror", "english": "The mirror on the wall is too fancy.", "thai": "กระจกบนผนังหรูเกินไป"}
{"word": "mirror", "english": "I’m looking for a cheap mirror.", "thai": "ฉันกำลังมองหากระจกราคาถูก"}
{"word": "mirror", "english": "The mirror in the dining room is huge.", "thai": "กระจกในห้องอาหารตัวใหญ่"}
{"word": "mirror", "english": "I need a mirror for my art studio.", "thai": "ฉันต้องการกระจกสำหรับสตูดิโอศิลปะ"}
{"word": "mirror", "english": "The mirror in the car is scratched.", "thai": "กระจกในรถมีรอยขีดข่วน"}
{"word": "mirror", "english": "I’m buying a mirror for the bathroom.", "thai": "ฉันกำลังซื้อกระจกสำหรับห้องน้ำ"}
{"word": "mirror", "english": "The mirror in the hallway is tilted.", "thai": "กระจกในโถงทางเดินเอียง"}
{"word": "mirror", "english": "I need a mirror with a sturdy frame.", "thai": "ฉันต้องการกระจกที่มีกรอบแข็งแรง"}
{"word": "mirror", "english": "The mirror in the shop is modern.", "thai": "กระจกในร้านดูทันสมัย"}
{"word": "mirror", "english": "I’m cleaning the mirror in the office.", "thai": "ฉันกำลังทำความสะอาดกระจกในออฟฟิศ"}
{"word": "mirror", "english": "The mirror on the dresser is too small.", "thai": "กระจกบนโต๊ะเครื่องแป้งเล็กเกินไป"}
{"word": "mirror", "english": "I need a mirror for my yoga room.", "thai": "ฉันต้องการกระจกสำหรับห้องโยคะ"}
{"word": "mirror", "english": "The mirror in the bedroom is foggy.", "thai": "กระจกในห้องนอนมีฝ้า"}
{"word": "mirror", "english": "I’m looking for a tall mirror.", "thai": "ฉันกำลังมองหากระจกสูง"}
{"word": "mirror", "english": "The mirror in the salon is cracked.", "thai": "กระจกในร้านเสริมสวยแตก"}
{"word": "mirror", "english": "I need a mirror for my dressing room.", "thai": "ฉันต้องการกระจกสำหรับห้องแต่งตัว"}
{"word": "mirror", "english": "The mirror on the wall is heavy.", "thai": "กระจกบนผนังหนัก"}
{"word": "mirror", "english": "I’m buying a mirror for my guest room.", "thai": "ฉันกำลังซื้อกระจกสำหรับห้องรับแขก"}
{"word": "mirror", "english": "The mirror in the bathroom is perfect.", "thai": "กระจกในห้องน้ำสมบูรณ์แบบ"}
{"word": "mirror", "english": "I need a mirror with a light.", "thai": "ฉันต้องการกระจกที่มีไฟ"}
{"word": "mirror", "english": "The mirror in the closet is dusty.", "thai": "กระจกในตู้เสื้อผ้าเต็มไปด้วยฝุ่น"}
{"word": "mirror", "english": "I’m cleaning the mirror in the nursery.", "thai": "ฉันกำลังทำความสะอาดกระจกในห้องเด็ก"}
{"word": "mirror", "english": "The mirror on the door is too narrow.", "thai": "กระจกที่ประตูแคบเกินไป"}
{"word": "mirror", "english": "I need a mirror for my new office.", "thai": "ฉันต้องการกระจกสำหรับออฟฟิศใหม่"}
{"word": "mirror", "english": "The mirror in the hallway is modern.", "thai": "กระจกในโถงทางเดินดูทันสมัย"}
{"word": "mirror", "english": "I’m looking for a mirror with a gold frame.", "thai": "ฉันกำลังมองหากระจกที่มีกรอบสีทอง"}
{"word": "mirror", "english": "The mirror in the bedroom is too big.", "thai": "กระจกในห้องนอนใหญ่เกินไป"}
{"word": "mirror", "english": "I need a mirror for my workout space.", "thai": "ฉันต้องการกระจกสำหรับพื้นที่ออกกำลังกาย"}
{"word": "mirror", "english": "The mirror on the wall is perfect.", "thai": "กระจกบนผนังสมบูรณ์แบบ"}
{"word": "mirror", "english": "I’m buying a mirror for my living room.", "thai": "ฉันกำลังซื้อกระจกสำหรับห้องนั่งเล่น"}
{"word": "mirror", "english": "The mirror in the bathroom is cracked.", "thai": "กระจกในห้องน้ำแตก"}
{"word": "mirror", "english": "I need a mirror for my makeup station.", "thai": "ฉันต้องการกระจกสำหรับสถานีแต่งหน้า"}
{"word": "comb", "english": "I lost my comb in the bathroom.", "thai": "ฉันทำหวีหายในห้องน้ำ"}
{"word": "comb", "english": "Can you pass me the comb on the dresser?", "thai": "ช่วยส่งหวีบนโต๊ะเครื่องแป้งให้ฉันหน่อยได้ไหม"}
{"word": "comb", "english": "I need a new comb for my hair.", "thai": "ฉันต้องการหวีใหม่สำหรับผม"}
{"word": "comb", "english": "The comb got stuck in my tangled hair.", "thai": "หวีติดอยู่ในผมที่พันกัน"}
{"word": "comb", "english": "I bought a wooden comb at the market.", "thai": "ฉันซื้อหวีไม้ที่ตลาด"}
{"word": "comb", "english": "The comb broke while I was using it.", "thai": "หวีหักตอนที่ฉันใช้มัน"}
{"word": "comb", "english": "I found a comb in my backpack.", "thai": "ฉันเจอหวีในกระเป๋าเป้"}
{"word": "comb", "english": "This comb is too small for my thick hair.", "thai": "หวีนี้เล็กเกินไปสำหรับผมหนาของฉัน"}
{"word": "comb", "english": "I need a comb with wide teeth.", "thai": "ฉันต้องการหวีที่มีซี่กว้าง"}
{"word": "comb", "english": "The comb is tangled with hair.", "thai": "หวีมีผมพันอยู่"}
{"word": "comb", "english": "I forgot my comb at the hotel.", "thai": "ฉันลืมหวีไว้ที่โรงแรม"}
{"word": "comb", "english": "Can you clean the comb after using it?", "thai": "ช่วยทำความสะอาดหวีหลังใช้ได้ไหม"}
{"word": "comb", "english": "I’m looking for a pocket comb.", "thai": "ฉันกำลังมองหาหวีพกพา"}
{"word": "comb", "english": "The comb in my bag is broken.", "thai": "หวีในกระเป๋าของฉันหัก"}
{"word": "comb", "english": "I need a comb for my curly hair.", "thai": "ฉันต้องการหวีสำหรับผมหยิก"}
{"word": "comb", "english": "The comb is too rough on my scalp.", "thai": "หวีนี้หยาบเกินไปสำหรับหนังศีรษะของฉัน"}
{"word": "comb", "english": "I got a new comb for my styling kit.", "thai": "ฉันได้หวีใหม่สำหรับชุดจัดแต่งทรงผม"}
{"word": "comb", "english": "The comb slipped out of my hand.", "thai": "หวีหลุดจากมือของฉัน"}
{"word": "comb", "english": "I need a comb that doesn’t snag.", "thai": "ฉันต้องการหวีที่ไม่ทำให้ผมติด"}
{"word": "comb", "english": "The comb on the sink is dirty.", "thai": "หวีบนอ่างล้างหน้าสกปรก"}
{"word": "comb", "english": "I’m buying a comb for my daughter.", "thai": "ฉันกำลังซื้อหวีให้ลูกสาว"}
{"word": "comb", "english": "The comb in the drawer is old.", "thai": "หวีในลิ้นชักเก่า"}
{"word": "comb", "english": "I need a comb for my beard.", "thai": "ฉันต้องการหวีสำหรับหนวดเคราของฉัน"}
{"word": "comb", "english": "The comb is too flimsy to use.", "thai": "หวีนี้บางเกินไปจนใช้ไม่ได้"}
{"word": "comb", "english": "I found a comb at the salon.", "thai": "ฉันเจอหวีที่ร้านทำผม"}
{"word": "comb", "english": "The comb is perfect for detangling.", "thai": "หวีนี้เหมาะสำหรับการแก้ผมพันกัน"}
{"word": "comb", "english": "I need a comb with a sturdy handle.", "thai": "ฉันต้องการหวีที่มีด้ามจับแข็งแรง"}
{"word": "comb", "english": "The comb in my purse is missing.", "thai": "หวีในกระเป๋าถือของฉันหายไป"}
{"word": "comb", "english": "I’m looking for a travel-sized comb.", "thai": "ฉันกำลังมองหาหวีขนาดพกพา"}
{"word": "comb", "english": "The comb broke while brushing my hair.", "thai": "หวีหักตอนที่ฉันหวีผม"}
{"word": "comb", "english": "I need a comb for my wet hair.", "thai": "ฉันต้องการหวีสำหรับผมเปียก"}
{"word": "comb", "english": "The comb on the counter is new.", "thai": "หวีบนเคาน์เตอร์เป็นของใหม่"}
{"word": "comb", "english": "I got a comb with a cool design.", "thai": "ฉันได้หวีที่มีดีไซน์เท่"}
{"word": "comb", "english": "The comb is too sharp for my hair.", "thai": "หวีนี้คมเกินไปสำหรับผมของฉัน"}
{"word": "comb", "english": "I need a comb for my styling tools.", "thai": "ฉันต้องการหวีสำหรับอุปกรณ์จัดแต่งทรงผม"}
{"word": "comb", "english": "The comb in the bathroom is cracked.", "thai": "หวีในห้องน้ำแตก"}
{"word": "comb", "english": "I’m buying a comb for my son.", "thai": "ฉันกำลังซื้อหวีให้ลูกชาย"}
{"word": "comb", "english": "The comb is tangled with loose hair.", "thai": "หวีมีผมหลุดร่วงพันอยู่"}
{"word": "comb", "english": "I need a comb that’s easy to clean.", "thai": "ฉันต้องการหวีที่ทำความสะอาดง่าย"}
{"word": "comb", "english": "The comb in my pocket is handy.", "thai": "หวีในกระเป๋าของฉันสะดวก"}
{"word": "comb", "english": "I’m looking for a metal comb.", "thai": "ฉันกำลังมองหาหวีโลหะ"}
{"word": "comb", "english": "The comb on the table is too big.", "thai": "หวีบนโต๊ะใหญ่เกินไป"}
{"word": "comb", "english": "I need a comb for my fine hair.", "thai": "ฉันต้องการหวีสำหรับผมบาง"}
{"word": "comb", "english": "The comb in the car is old.", "thai": "หวีในรถเก่า"}
{"word": "comb", "english": "I broke the comb while detangling.", "thai": "ฉันทำหวีหักตอนแก้ผมพันกัน"}
{"word": "comb", "english": "The comb is perfect for my short hair.", "thai": "หวีนี้เหมาะสำหรับผมสั้นของฉัน"}
{"word": "comb", "english": "I need a comb for my travel bag.", "thai": "ฉันต้องการหวีสำหรับกระเป๋าเดินทาง"}
{"word": "comb", "english": "The comb in the salon is professional.", "thai": "หวีในร้านทำผมดูเป็นมืออาชีพ"}
{"word": "comb", "english": "I’m buying a comb for my barber kit.", "thai": "ฉันกำลังซื้อหวีสำหรับชุดตัดผม"}
{"word": "comb", "english": "The comb is too heavy to carry.", "thai": "หวีนี้หนักเกินกว่าที่จะพกพา"}
{"word": "comb", "english": "I need a comb for my thick curls.", "thai": "ฉันต้องการหวีสำหรับผมหยิกหนา"}
{"word": "comb", "english": "The comb on the shelf is dusty.", "thai": "หวีบนชั้นวางเต็มไปด้วยฝุ่น"}
{"word": "comb", "english": "I’m looking for a plastic comb.", "thai": "ฉันกำลังมองหาหวีพลาสติก"}
{"word": "comb", "english": "The comb in my drawer is broken.", "thai": "หวีในลิ้นชักของฉันหัก"}
{"word": "comb", "english": "I need a comb for my pet’s fur.", "thai": "ฉันต้องการหวีสำหรับขนสัตว์เลี้ยง"}
{"word": "comb", "english": "The comb is too flimsy for my hair.", "thai": "หวีนี้บางเกินไปสำหรับผมของฉัน"}
{"word": "comb", "english": "I got a comb from the drugstore.", "thai": "ฉันได้หวีจากร้านขายยา"}
{"word": "comb", "english": "The comb in the gym bag is new.", "thai": "หวีในกระเป๋ายิมเป็นของใหม่"}
{"word": "comb", "english": "I need a comb for my long hair.", "thai": "ฉันต้องการหวีสำหรับผมยาว"}
{"word": "comb", "english": "The comb on the counter is too small.", "thai": "หวีบนเคาน์เตอร์เล็กเกินไป"}
{"word": "comb", "english": "I’m buying a comb for my sister.", "thai": "ฉันกำลังซื้อหวีให้พี่สาว"}
{"word": "comb", "english": "The comb is stuck in my hairbrush.", "thai": "หวีติดอยู่ในแปรงผม"}
{"word": "comb", "english": "I need a comb with fine teeth.", "thai": "ฉันต้องการหวีที่มีซี่ละเอียด"}
{"word": "comb", "english": "The comb in my purse is cracked.", "thai": "หวีในกระเป๋าถือของฉันแตก"}
{"word": "comb", "english": "I’m looking for a foldable comb.", "thai": "ฉันกำลังมองหาหวีพับได้"}
{"word": "comb", "english": "The comb on the sink is wet.", "thai": "หวีบนอ่างล้างหน้าเปียก"}
{"word": "comb", "english": "I need a comb for my styling routine.", "thai": "ฉันต้องการหวีสำหรับการจัดแต่งทรงผม"}
{"word": "comb", "english": "The comb in the bathroom is old.", "thai": "หวีในห้องน้ำเก่า"}
{"word": "comb", "english": "I got a comb with a mirror attached.", "thai": "ฉันได้หวีที่มีกระจกติดอยู่"}
{"word": "comb", "english": "The comb is too rough for my scalp.", "thai": "หวีนี้หยาบเกินไปสำหรับหนังศีรษะของฉัน"}
{"word": "comb", "english": "I need a comb for my mustache.", "thai": "ฉันต้องการหวีสำหรับหนวดของฉัน"}
{"word": "comb", "english": "The comb in my bag is missing teeth.", "thai": "หวีในกระเป๋าของฉันมีซี่หาย"}
{"word": "comb", "english": "I’m buying a comb for my travel kit.", "thai": "ฉันกำลังซื้อหวีสำหรับชุดเดินทาง"}
{"word": "comb", "english": "The comb on the dresser is new.", "thai": "หวีบนโต๊ะเครื่องแป้งเป็นของใหม่"}
{"word": "comb", "english": "I need a comb that’s durable.", "thai": "ฉันต้องการหวีที่ทนทาน"}
{"word": "comb", "english": "The comb in the car is handy.", "thai": "หวีในรถสะดวก"}
{"word": "comb", "english": "I’m looking for a bamboo comb.", "thai": "ฉันกำลังมองหาหวีไม้ไผ่"}
{"word": "comb", "english": "The comb on the table is too heavy.", "thai": "หวีบนโต๊ะหนักเกินไป"}
{"word": "comb", "english": "I need a comb for my daughter’s hair.", "thai": "ฉันต้องการหวีสำหรับผมของลูกสาว"}
{"word": "comb", "english": "The comb in the salon is high-quality.", "thai": "หวีในร้านทำผมมีคุณภาพสูง"}
{"word": "comb", "english": "I got a comb from the barber shop.", "thai": "ฉันได้หวีจากร้านตัดผม"}
{"word": "comb", "english": "The comb is perfect for my wavy hair.", "thai": "หวีนี้เหมาะสำหรับผมลอนของฉัน"}
{"word": "comb", "english": "I need a comb for my styling products.", "thai": "ฉันต้องการหวีสำหรับผลิตภัณฑ์จัดแต่งทรงผม"}
{"word": "comb", "english": "The comb in my pocket is broken.", "thai": "หวีในกระเป๋าของฉันหัก"}
{"word": "comb", "english": "I’m buying a comb for my brother.", "thai": "ฉันกำลังซื้อหวีให้น้องชาย"}
{"word": "comb", "english": "The comb on the shelf is too big.", "thai": "หวีบนชั้นวางใหญ่เกินไป"}
{"word": "comb", "english": "I need a comb for my thin hair.", "thai": "ฉันต้องการหวีสำหรับผมบาง"}
{"word": "comb", "english": "The comb in the bathroom is dirty.", "thai": "หวีในห้องน้ำสกปรก"}
{"word": "comb", "english": "I’m looking for a comb with a grip.", "thai": "ฉันกำลังมองหาหวีที่มีด้ามจับ"}
{"word": "comb", "english": "The comb on the counter is cracked.", "thai": "หวีบนเคาน์เตอร์แตก"}
{"word": "comb", "english": "I need a comb for my daily routine.", "thai": "ฉันต้องการหวีสำหรับกิจวัตรประจำวัน"}
{"word": "comb", "english": "The comb in my bag is too small.", "thai": "หวีในกระเป๋าของฉันเล็กเกินไป"}
{"word": "comb", "english": "I’m buying a comb for my mom.", "thai": "ฉันกำลังซื้อหวีให้แม่"}
{"word": "comb", "english": "The comb is perfect for my long curls.", "thai": "หวีนี้เหมาะสำหรับผมหยิกยาวของฉัน"}
{"word": "comb", "english": "I need a comb that’s lightweight.", "thai": "ฉันต้องการหวีที่น้ำหนักเบา"}
{"word": "comb", "english": "The comb in the drawer is new.", "thai": "หวีในลิ้นชักเป็นของใหม่"}
{"word": "comb", "english": "I’m looking for a comb for my pet.", "thai": "ฉันกำลังมองหาหวีสำหรับสัตว์เลี้ยง"}
{"word": "comb", "english": "The comb on the sink is too old.", "thai": "หวีบนอ่างล้างหน้าเก่าเกินไป"}
{"word": "comb", "english": "I need a comb for my hairbrush set.", "thai": "ฉันต้องการหวีสำหรับชุดแปรงผม"}
{"word": "comb", "english": "The comb in the car is missing.", "thai": "หวีในรถหายไป"}
{"word": "hairbrush", "english": "I left my hairbrush in the bathroom.", "thai": "ฉันทิ้งแปรงผมไว้ในห้องน้ำ"}
{"word": "hairbrush", "english": "Can you grab the hairbrush from the dresser?", "thai": "ช่วยหยิบแปรงผมจากโต๊ะเครื่องแป้งได้ไหม"}
{"word": "hairbrush", "english": "I need a new hairbrush for my hair.", "thai": "ฉันต้องการแปรงผมใหม่สำหรับผมของฉัน"}
{"word": "hairbrush", "english": "The hairbrush got tangled in my curls.", "thai": "แปรงผมติดอยู่ในผมหยิกของฉัน"}
{"word": "hairbrush", "english": "I bought a wooden hairbrush at the store.", "thai": "ฉันซื้อแปรงผมไม้ที่ร้าน"}
{"word": "hairbrush", "english": "The hairbrush broke while I was using it.", "thai": "แปรงผมหักตอนที่ฉันใช้มัน"}
{"word": "hairbrush", "english": "I found a hairbrush in my purse.", "thai": "ฉันเจอแปรงผมในกระเป๋าถือ"}
{"word": "hairbrush", "english": "This hairbrush is too harsh for my scalp.", "thai": "แปรงผมนี้แข็งเกินไปสำหรับหนังศีรษะของฉัน"}
{"word": "hairbrush", "english": "I need a hairbrush with soft bristles.", "thai": "ฉันต้องการแปรงผมที่มีขนแปรงนุ่ม"}
{"word": "hairbrush", "english": "The hairbrush is full of hair.", "thai": "แปรงผมเต็มไปด้วยเส้นผม"}
{"word": "hairbrush", "english": "I forgot my hairbrush at the gym.", "thai": "ฉันลืมแปรงผมไว้ที่ยิม"}
{"word": "hairbrush", "english": "Can you clean the hairbrush after using it?", "thai": "ช่วยทำความสะอาดแปรงผมหลังใช้ได้ไหม"}
{"word": "hairbrush", "english": "I’m looking for a travel hairbrush.", "thai": "ฉันกำลังมองหาแปรงผมสำหรับเดินทาง"}
{"word": "hairbrush", "english": "The hairbrush in my bag is broken.", "thai": "แปรงผมในกระเป๋าของฉันหัก"}
{"word": "hairbrush", "english": "I need a hairbrush for my thick hair.", "thai": "ฉันต้องการแปรงผมสำหรับผมหนาของฉัน"}
{"word": "hairbrush", "english": "The hairbrush is too rough on my hair.", "thai": "แปรงผมนี้หยาบเกินไปสำหรับผมของฉัน"}
{"word": "hairbrush", "english": "I got a new hairbrush for my styling kit.", "thai": "ฉันได้แปรงผมใหม่สำหรับชุดจัดแต่งทรงผม"}
{"word": "hairbrush", "english": "The hairbrush slipped from my hand.", "thai": "แปรงผมหลุดจากมือของฉัน"}
{"word": "hairbrush", "english": "I need a hairbrush that doesn’t pull.", "thai": "ฉันต้องการแปรงผมที่ไม่ดึงผม"}
{"word": "hairbrush", "english": "The hairbrush on the sink is dirty.", "thai": "แปรงผมบนอ่างล้างหน้าสกปรก"}
{"word": "hairbrush", "english": "I’m buying a hairbrush for my daughter.", "thai": "ฉันกำลังซื้อแปรงผมให้ลูกสาว"}
{"word": "hairbrush", "english": "The hairbrush in the drawer is old.", "thai": "แปรงผมในลิ้นชักเก่า"}
{"word": "hairbrush", "english": "I need a hairbrush for my curly hair.", "thai": "ฉันต้องการแปรงผมสำหรับผมหยิก"}
{"word": "hairbrush", "english": "The hairbrush is too heavy to carry.", "thai": "แปรงผมนี้หนักเกินกว่าที่จะพกพา"}
{"word": "hairbrush", "english": "I found a hairbrush at the salon.", "thai": "ฉันเจอแปรงผมที่ร้านทำผม"}
{"word": "hairbrush", "english": "The hairbrush is great for detangling.", "thai": "แปรงผมนี้เหมาะสำหรับการแก้ผมพันกัน"}
{"word": "hairbrush", "english": "I need a hairbrush with a sturdy handle.", "thai": "ฉันต้องการแปรงผมที่มีด้ามจับแข็งแรง"}
{"word": "hairbrush", "english": "The hairbrush in my purse is missing.", "thai": "แปรงผมในกระเป๋าถือของฉันหายไป"}
{"word": "hairbrush", "english": "I’m looking for a compact hairbrush.", "thai": "ฉันกำลังมองหาแปรงผมขนาดกะทัดรัด"}
{"word": "hairbrush", "english": "The hairbrush broke while brushing my hair.", "thai": "แปรงผมหักตอนที่ฉันแปรงผม"}
{"word": "hairbrush", "english": "I need a hairbrush for wet hair.", "thai": "ฉันต้องการแปรงผมสำหรับผมเปียก"}
{"word": "hairbrush", "english": "The hairbrush on the counter is new.", "thai": "แปรงผมบนเคาน์เตอร์เป็นของใหม่"}
{"word": "hairbrush", "english": "I got a hairbrush with a cool design.", "thai": "ฉันได้แปรงผมที่มีดีไซน์เท่"}
{"word": "hairbrush", "english": "The hairbrush is too stiff for my hair.", "thai": "แปรงผมนี้แข็งเกินไปสำหรับผมของฉัน"}
{"word": "hairbrush", "english": "I need a hairbrush for my styling tools.", "thai": "ฉันต้องการแปรงผมสำหรับอุปกรณ์จัดแต่งทรงผม"}
{"word": "hairbrush", "english": "The hairbrush in the bathroom is cracked.", "thai": "แปรงผมในห้องน้ำแตก"}
{"word": "hairbrush", "english": "I’m buying a hairbrush for my son.", "thai": "ฉันกำลังซื้อแปรงผมให้ลูกชาย"}
{"word": "hairbrush", "english": "The hairbrush is tangled with hair.", "thai": "แปรงผมมีผมพันอยู่"}
{"word": "hairbrush", "english": "I need a hairbrush that’s easy to clean.", "thai": "ฉันต้องการแปรงผมที่ทำความสะอาดง่าย"}
{"word": "hairbrush", "english": "The hairbrush in my pocket is handy.", "thai": "แปรงผมในกระเป๋าของฉันสะดวก"}
{"word": "hairbrush", "english": "I’m looking for a bamboo hairbrush.", "thai": "ฉันกำลังมองหาแปรงผมไม้ไผ่"}
{"word": "hairbrush", "english": "The hairbrush on the table is too big.", "thai": "แปรงผมบนโต๊ะใหญ่เกินไป"}
{"word": "hairbrush", "english": "I need a hairbrush for my fine hair.", "thai": "ฉันต้องการแปรงผมสำหรับผมบาง"}
{"word": "hairbrush", "english": "The hairbrush in the car is old.", "thai": "แปรงผมในรถเก่า"}
{"word": "hairbrush", "english": "I broke the hairbrush while detangling.", "thai": "ฉันทำแปรงผมหักตอนแก้ผมพันกัน"}
{"word": "hairbrush", "english": "The hairbrush is perfect for my short hair.", "thai": "แปรงผมนี้เหมาะสำหรับผมสั้นของฉัน"}
{"word": "hairbrush", "english": "I need a hairbrush for my travel bag.", "thai": "ฉันต้องการแปรงผมสำหรับกระเป๋าเดินทาง"}
{"word": "hairbrush", "english": "The hairbrush in the salon is professional.", "thai": "แปรงผมในร้านทำผมดูเป็นมืออาชีพ"}
{"word": "hairbrush", "english": "I’m buying a hairbrush for my barber kit.", "thai": "ฉันกำลังซื้อแปรงผมสำหรับชุดตัดผม"}
{"word": "hairbrush", "english": "The hairbrush is too flimsy to use.", "thai": "แปรงผมนี้บางเกินไปจนใช้ไม่ได้"}
{"word": "hairbrush", "english": "I got a hairbrush from the drugstore.", "thai": "ฉันได้แปรงผมจากร้านขายยา"}
{"word": "hairbrush", "english": "The hairbrush in the gym bag is new.", "thai": "แปรงผมในกระเป๋ายิมเป็นของใหม่"}
{"word": "hairbrush", "english": "I need a hairbrush for my long hair.", "thai": "ฉันต้องการแปรงผมสำหรับผมยาว"}
{"word": "hairbrush", "english": "The hairbrush on the counter is too small.", "thai": "แปรงผมบนเคาน์เตอร์เล็กเกินไป"}
{"word": "hairbrush", "english": "I’m buying a hairbrush for my sister.", "thai": "ฉันกำลังซื้อแปรงผมให้พี่สาว"}
{"word": "hairbrush", "english": "The hairbrush is stuck in my hair.", "thai": "แปรงผมติดอยู่ในผมของฉัน"}
{"word": "hairbrush", "english": "I need a hairbrush with natural bristles.", "thai": "ฉันต้องการแปรงผมที่มีขนแปรงธรรมชาติ"}
{"word": "hairbrush", "english": "The hairbrush in my purse is cracked.", "thai": "แปรงผมในกระเป๋าถือของฉันแตก"}
{"word": "hairbrush", "english": "I’m looking for a foldable hairbrush.", "thai": "ฉันกำลังมองหาแปรงผมพับได้"}
{"word": "hairbrush", "english": "The hairbrush on the sink is wet.", "thai": "แปรงผมบนอ่างล้างหน้าเปียก"}
{"word": "hairbrush", "english": "I need a hairbrush for my styling routine.", "thai": "ฉันต้องการแปรงผมสำหรับการจัดแต่งทรงผม"}
{"word": "hairbrush", "english": "The hairbrush in the bathroom is old.", "thai": "แปรงผมในห้องน้ำเก่า"}
{"word": "hairbrush", "english": "I got a hairbrush with a mirror attached.", "thai": "ฉันได้แปรงผมที่มีกระจกติดอยู่"}
{"word": "hairbrush", "english": "The hairbrush is too rough for my scalp.", "thai": "แปรงผมนี้หยาบเกินไปสำหรับหนังศีรษะของฉัน"}
{"word": "hairbrush", "english": "I need a hairbrush for my daughter’s hair.", "thai": "ฉันต้องการแปรงผมสำหรับผมของลูกสาว"}
{"word": "hairbrush", "english": "The hairbrush in the salon is high-quality.", "thai": "แปรงผมในร้านทำผมมีคุณภาพสูง"}
{"word": "hairbrush", "english": "I got a hairbrush from the barber shop.", "thai": "ฉันได้แปรงผมจากร้านตัดผม"}
{"word": "hairbrush", "english": "The hairbrush is perfect for my wavy hair.", "thai": "แปรงผมนี้เหมาะสำหรับผมลอนของฉัน"}
{"word": "hairbrush", "english": "I need a hairbrush for my styling products.", "thai": "ฉันต้องการแปรงผมสำหรับผลิตภัณฑ์จัดแต่งทรงผม"}
{"word": "hairbrush", "english": "The hairbrush in my bag is missing.", "thai": "แปรงผมในกระเป๋าของฉันหายไป"}
{"word": "hairbrush", "english": "I’m buying a hairbrush for my brother.", "thai": "ฉันกำลังซื้อแปรงผมให้น้องชาย"}
{"word": "hairbrush", "english": "The hairbrush on the shelf is too big.", "thai": "แปรงผมบนชั้นวางใหญ่เกินไป"}
{"word": "hairbrush", "english": "I need a hairbrush for my thin hair.", "thai": "ฉันต้องการแปรงผมสำหรับผมบาง"}
{"word": "hairbrush", "english": "The hairbrush in the bathroom is dirty.", "thai": "แปรงผมในห้องน้ำสกปรก"}
{"word": "hairbrush", "english": "I’m looking for a hairbrush with a grip.", "thai": "ฉันกำลังมองหาแปรงผมที่มีด้ามจับ"}
{"word": "hairbrush", "english": "The hairbrush on the counter is cracked.", "thai": "แปรงผมบนเคาน์เตอร์แตก"}
{"word": "hairbrush", "english": "I need a hairbrush for my daily routine.", "thai": "ฉันต้องการแปรงผมสำหรับกิจวัตรประจำวัน"}
{"word": "hairbrush", "english": "The hairbrush in my bag is too small.", "thai": "แปรงผมในกระเป๋าของฉันเล็กเกินไป"}
{"word": "hairbrush", "english": "I’m buying a hairbrush for my mom.", "thai": "ฉันกำลังซื้อแปรงผมให้แม่"}
{"word": "hairbrush", "english": "The hairbrush is perfect for my long curls.", "thai": "แปรงผมนี้เหมาะสำหรับผมหยิกยาวของฉัน"}
{"word": "hairbrush", "english": "I need a hairbrush that’s lightweight.", "thai": "ฉันต้องการแปรงผมที่น้ำหนักเบา"}
{"word": "hairbrush", "english": "The hairbrush in the drawer is new.", "thai": "แปรงผมในลิ้นชักเป็นของใหม่"}
{"word": "hairbrush", "english": "I’m looking for a hairbrush for my pet.", "thai": "ฉันกำลังมองหาแปรงผมสำหรับสัตว์เลี้ยง"}
{"word": "hairbrush", "english": "The hairbrush on the sink is too old.", "thai": "แปรงผมบนอ่างล้างหน้าเก่าเกินไป"}
{"word": "hairbrush", "english": "I need a hairbrush for my hairbrush set.", "thai": "ฉันต้องการแปรงผมสำหรับชุดแปรงผม"}
{"word": "hairbrush", "english": "The hairbrush in the car is missing.", "thai": "แปรงผมในรถหายไป"}
{"word": "hairbrush", "english": "I got a hairbrush with soft bristles.", "thai": "ฉันได้แปรงผมที่มีขนแปรงนุ่ม"}
{"word": "hairbrush", "english": "The hairbrush on the table is dusty.", "thai": "แปรงผมบนโต๊ะเต็มไปด้วยฝุ่น"}
{"word": "hairbrush", "english": "I need a hairbrush for my thick curls.", "thai": "ฉันต้องการแปรงผมสำหรับผมหยิกหนา"}
{"word": "hairbrush", "english": "The hairbrush in the salon is expensive.", "thai": "แปรงผมในร้านทำผมราคาแพง"}
{"word": "hairbrush", "english": "I’m buying a hairbrush for my travel kit.", "thai": "ฉันกำลังซื้อแปรงผมสำหรับชุดเดินทาง"}
{"word": "hairbrush", "english": "The hairbrush on the dresser is new.", "thai": "แปรงผมบนโต๊ะเครื่องแป้งเป็นของใหม่"}
{"word": "hairbrush", "english": "I need a hairbrush that’s durable.", "thai": "ฉันต้องการแปรงผมที่ทนทาน"}
{"word": "hairbrush", "english": "The hairbrush in the gym is handy.", "thai": "แปรงผมในยิมสะดวก"}
{"word": "hairbrush", "english": "I’m looking for a hairbrush with a mirror.", "thai": "ฉันกำลังมองหาแปรงผมที่มีกระจก"}
{"word": "hairbrush", "english": "The hairbrush on the shelf is too heavy.", "thai": "แปรงผมบนชั้นวางหนักเกินไป"}
{"word": "hairbrush", "english": "I need a hairbrush for my son’s hair.", "thai": "ฉันต้องการแปรงผมสำหรับผมของลูกชาย"}
{"word": "hairbrush", "english": "The hairbrush in the bathroom is wet.", "thai": "แปรงผมในห้องน้ำเปiaก"}
{"word": "hairbrush", "english": "I’m buying a hairbrush for my new apartment.", "thai": "ฉันกำลังซื้อแปรงผมสำหรับอพาร์ทเมนต์ใหม่"}
{"word": "hairbrush", "english": "The hairbrush is perfect for my straight hair.", "thai": "แปรงผมนี้เหมาะสำหรับผมตรงของฉัน"}
{"word": "hairbrush", "english": "I need a hairbrush for my daily styling.", "thai": "ฉันต้องการแปรงผมสำหรับการจัดแต่งทรงผมประจำวัน"}
{"word": "hairbrush", "english": "The hairbrush in my purse is too big.", "thai": "แปรงผมในกระเป๋าถือของฉันใหญ่เกินไป"}
