{"word":"recharges","english":"Listening to music recharges my energy after a long day.","thai":"การฟังเพลงเติมพลังให้ฉันหลังจากวันที่ยาวนาน"}
{"word":"energy","english":"I need to channel my energy into finishing this project.","thai":"ฉันต้องใช้พลังของฉันให้หมดไปกับการทำโปรเจกต์นี้ให้เสร็จ"}
{"word":"channel","english":"We should channel our efforts to clean up the local park.","thai":"เราควรรวมพลังเพื่อทำความสะอาดสวนสาธารณะในท้องถิ่น"}
{"word":"efforts","english":"Her efforts to learn Thai paid off during the trip.","thai":"ความพยายามของเธอในการเรียนภาษาไทยได้ผลตอบแทนระหว่างการเดินทาง"}
{"word":"learn","english":"I want to learn how to cook authentic Thai food.","thai":"ฉันอยากเรียนวิธีทำอาหารไทยแท้ๆ"}
{"word":"cook","english":"Let’s cook up some fun at the barbecue this weekend.","thai":"มาทำให้สนุกสุดเหวี่ยงที่งานบาร์บีคิวสุดสัปดาห์นี้กันเถอะ"}
{"word":"fun","english":"Hiking with friends is always so much fun.","thai":"การเดินป่ากับเพื่อนๆ มันสนุกมากเลย"}
{"word":"friends","english":"My friends always pick me up when I’m feeling down.","thai":"เพื่อนๆ ของฉันคอยให้กำลังใจฉันเสมอเมื่อฉันรู้สึกแย่"}
{"word":"pick","english":"I need to pick out a new outfit for the party.","thai":"ฉันต้องเลือกชุดใหม่สำหรับงานปาร์ตี้"}
{"word":"outfit","english":"That outfit looks dope on you!","thai":"ชุดนั้นดูเท่มากเลยบนตัวคุณ!"}
{"word":"looks","english":"This coffee shop looks cozy; let’s hang out here.","thai":"ร้านกาแฟนี้ดูอบอุ่น มาจอยกันที่นี่เถอะ"}
{"word":"hang","english":"We should hang out at the arcade this weekend.","thai":"เราควรไปเที่ยวที่ตู้เกมสุดสัปดาห์นี้"}
{"word":"weekend","english":"The weekend is perfect for binge-watching new shows.","thai":"สุดสัปดาห์เหมาะมากสำหรับการดูซีรีส์ใหม่แบบมาราธอน"}
{"word":"perfect","english":"This smoothie tastes perfect after a workout.","thai":"สมูทตี้นี้อร่อยสุดๆ หลังออกกำลังกาย"}
{"word":"workout","english":"I need to step up my workout routine for the marathon.","thai":"ฉันต้องเพิ่มความเข้มข้นให้กับการออกกำลังกายเพื่อเตรียมวิ่งมาราธอน"}
{"word":"step","english":"Let’s step outside and enjoy the cool breeze.","thai":"ออกไปข้างนอกสูดอากาศเย็นๆ กันเถอะ"}
{"word":"breeze","english":"The evening breeze makes stargazing so relaxing.","thai":"สายลมยามเย็นทำให้การดูดาวผ่อนคลายมาก"}
{"word":"relaxing","english":"Reading a book is my go-to relaxing activity.","thai":"การอ่านหนังสือคือกิจกรรมผ่อนคลายที่ฉันชอบ"}
{"word":"book","english":"I couldn’t put down that thriller book last night.","thai":"เมื่อคืนฉันวางหนังสือทริลเลอร์เล่มนั้นไม่ลงเลย"}
{"word":"put","english":"Let’s put together a game night with the crew.","thai":"มาจัดค่ำคืนเล่นเกมกับเพื่อนๆ กันเถอะ"}
{"word":"game","english":"This new video game is totally addictive.","thai":"วิดีโอเกมใหม่นี้นี่มันติดหนึบเลย"}
{"word":"addictive","english":"Social media can be super addictive if you’re not careful.","thai":"โซเชียลมีเดียอาจทำให้ติดได้มากถ้าไม่ระวัง"}
{"word":"careful","english":"Be careful not to spill the beans about the surprise.","thai":"ระวังอย่าเผลอหลุดปากเรื่องเซอร์ไพรส์นะ"}
{"word":"spill","english":"I didn’t mean to spill coffee on my new shirt.","thai":"ฉันไม่ได้ตั้งใจทำกาแฟหกใส่เสื้อใหม่"}
{"word":"coffee","english":"Let’s grab some coffee and catch up soon.","thai":"ไปจิบกาแฟและอัพเดตเรื่องราวกันเร็วๆ นี้เถอะ"}
{"word":"catch","english":"I hope to catch the new movie this weekend.","thai":"ฉันหวังว่าจะได้ดูหนังใหม่สุดสัปดาห์นี้"}
{"word":"movie","english":"That movie totally blew my mind last night.","thai":"หนังเรื่องนั้นทำฉันตื่นเต้นสุดๆ เมื่อคืน"}
{"word":"mind","english":"Yoga helps me clear my mind after a busy day.","thai":"โยคะช่วยให้ฉันปลอดโปร่งจิตใจหลังจากวันที่วุ่นวาย"}
{"word":"clear","english":"The instructions weren’t clear, so I messed up.","thai":"คำแนะนำไม่ชัดเจน ฉันเลยทำพลาด"}
{"word":"messed","english":"I messed up the recipe, but it still tasted okay.","thai":"ฉันทำสูตรอาหารพัง แต่รสชาติก็ยังโอเค"}
{"word":"tasted","english":"This dish tasted amazing at the new restaurant.","thai":"อาหารจานนี้อร่อยสุดๆ ที่ร้านใหม่"}
{"word":"amazing","english":"Her presentation skills are absolutely amazing.","thai":"ทักษะการนำเสนอของเธอนั้นสุดยอดมาก"}
{"word":"skills","english":"I’m trying to brush up on my coding skills.","thai":"ฉันกำลังพยายามพัฒนาทักษะการเขียนโค้ด"}
{"word":"brush","english":"I need to brush off the negativity and stay focused.","thai":"ฉันต้องปัดเป่าความคิดลบและตั้งใจทำงาน"}
{"word":"focused","english":"Staying focused during meetings is tough sometimes.","thai":"การมีสมาธิในที่ประชุมบางครั้งก็ยาก"}
{"word":"meetings","english":"We ran into some issues during our team meetings.","thai":"เราเจอปัญหาบางอย่างในที่ประชุมทีม"}
{"word":"ran","english":"I ran into an old friend at the mall yesterday.","thai":"เมื่อวานฉันบังเอิญเจอเพื่อนเก่าที่ห้าง"}
{"word":"friend","english":"My best friend always knows how to cheer me up.","thai":"เพื่อนสนิทของฉันรู้วิธีทำให้ฉันรู้สึกดีขึ้นเสมอ"}
{"word":"cheer","english":"Let’s cheer on our team at the game tonight.","thai":"ไปเชียร์ทีมของเราที่แข่งคืนนี้กันเถอะ"}
{"word":"team","english":"Our team needs to pull together for this project.","thai":"ทีมของเราต้องรวมพลังเพื่อโปรเจกต์นี้"}
{"word":"pull","english":"I had to pull an all-nighter to finish my essay.","thai":"ฉันต้องอดหลับอดนอนเพื่อเขียนเรียงความให้เสร็จ"}
{"word":"essay","english":"Writing an essay on sustainability is challenging.","thai":"การเขียนเรียงความเกี่ยวกับความยั่งยืนนั้นท้าทาย"}
{"word":"challenging","english":"Learning to surf was challenging but so rewarding.","thai":"การเรียนเซิร์ฟนั้นท้าทายแต่คุ้มค่ามาก"}
{"word":"rewarding","english":"Volunteering at the shelter is incredibly rewarding.","thai":"การเป็นอาสาสมัครที่ศูนย์พักพิงนั้นให้รางวัลใจมาก"}
{"word":"shelter","english":"The animal shelter needs more supplies this month.","thai":"ศูนย์พักพิงสัตว์ต้องการอุปกรณ์เพิ่มในเดือนนี้"}
{"word":"supplies","english":"I stocked up on supplies for the camping trip.","thai":"ฉันตุนของใช้สำหรับทริปแคมป์ปิ้งไว้แล้ว"}
{"word":"trip","english":"The road trip to the mountains was unforgettable.","thai":"ทริปขับรถไปภูเขานั้นลืมไม่ลงเลย"}
{"word":"unforgettable","english":"Her performance was unforgettable at the festival.","thai":"การแสดงของเธอที่งานเทศกาลนั้นน่าจดจำ"}
{"word":"performance","english":"His performance in the play got rave reviews.","thai":"การแสดงของเขาในละครได้รับคำชมอย่างล้นหลาม"}
{"word":"reviews","english":"I always check out reviews before buying gadgets.","thai":"ฉันมักจะดูรีวิวก่อนซื้ออุปกรณ์"}
{"word":"check","english":"Can you check in with the team about the deadline?","thai":"คุณช่วยเช็คกับทีมเรื่องกำหนดส่งได้ไหม?"}
{"word":"deadline","english":"Missing the deadline stressed me out big time.","thai":"การพลาดกำหนดส่งทำให้ฉันเครียดมาก"}
{"word":"time","english":"Let’s make time to hit up the new diner.","thai":"มาหาเวลากันไปลองร้านอาหารใหม่เถอะ"}
{"word":"hit","english":"The new song hit all the right vibes.","thai":"เพลงใหม่นี้มันโดนใจสุดๆ"}
{"word":"vibes","english":"The beach gives off such chill vibes.","thai":"ชายหาดให้ความรู้สึกชิลมาก"}
{"word":"chill","english":"I just want to chill with a good book tonight.","thai":"คืนนี้ฉันแค่อยากชิลกับหนังสือดีๆ"}
{"word":"good","english":"A good workout always lifts my mood.","thai":"การออกกำลังกายที่ดีช่วยยกระดับอารมณ์ของฉัน"}
{"word":"mood","english":"The rainy weather put me in a cozy mood.","thai":"อากาศฝนตกทำให้ฉันรู้สึกอยากอยู่เงียบๆ"}
{"word":"weather","english":"The weather forecast says it’ll clear up soon.","thai":"พยากรณ์อากาศบอกว่าจะปลอดโปร่งในไม่ช้า"}
{"word":"forecast","english":"The economic forecast looks promising this year.","thai":"พยากรณ์เศรษฐกิจดูดีในปีนี้"}
{"word":"promising","english":"Her startup idea sounds really promising.","thai":"ไอเดียสตาร์ทอัพของเธอดูมีแววมาก"}
{"word":"idea","english":"I came up with a cool idea for the fundraiser.","thai":"ฉันคิดไอเดียเจ๋งๆ สำหรับงานระดมทุนได้"}
{"word":"cool","english":"This new app is super cool and user-friendly.","thai":"แอปใหม่นี้น่าใช้และเจ๋งมาก"}
{"word":"app","english":"I downloaded an app to track my daily habits.","thai":"ฉันดาวน์โหลดแอปเพื่อติดตามพฤติกรรมประจำวัน"}
{"word":"track","english":"Let’s track down some deals at the flea market.","thai":"ไปหาดีลดีๆ ที่ตลาดนัดกันเถอะ"}
{"word":"deals","english":"I scored some awesome deals during the sale.","thai":"ฉันได้ดีลเจ๋งๆ ระหว่างเซล"}
{"word":"awesome","english":"The concert last night was totally awesome.","thai":"คอนเสิร์ตเมื่อคืนมันสุดยอดมาก"}
{"word":"concert","english":"I’m pumped for the jazz concert this weekend.","thai":"ฉันตื่นเต้นกับคอนเสิร์ตแจ๊สสุดสัปดาห์นี้"}
{"word":"pumped","english":"I’m so pumped to try rock climbing tomorrow.","thai":"ฉันตื่นเต้นมากที่จะลองปีนหน้าผาในวันพรุ่งนี้"}
{"word":"try","english":"Let’s try out that new sushi place downtown.","thai":"ไปลองร้านซูชิใหม่ในตัวเมืองกันเถอะ"}
{"word":"place","english":"This place has the best tacos in town.","thai":"ร้านนี้มีทาโก้ที่ดีที่สุดในเมือง"}
{"word":"best","english":"My best buddy is throwing a barbecue tomorrow.","thai":"เพื่อนสนิทของฉันจะจัดงานบาร์บีคิวพรุ่งนี้"}
{"word":"buddy","english":"My study buddy helped me ace the exam.","thai":"เพื่อนเรียนของฉันช่วยให้ฉันสอบได้คะแนนดี"}
{"word":"ace","english":"I hope to ace my job interview next week.","thai":"ฉันหวังว่าจะทำได้ดีในการสัมภาษณ์งานสัปดาห์หน้า"}
{"word":"interview","english":"The podcast interview with the author was inspiring.","thai":"การสัมภาษณ์ในพอดแคสต์กับนักเขียนนั้นสร้างแรงบันดาลใจ"}
{"word":"inspiring","english":"Her story about volunteering abroad is so inspiring.","thai":"เรื่องราวของเธอเกี่ยวกับการเป็นอาสาสมัครในต่างประเทศช่างสร้างแรงบันดาลใจ"}
{"word":"story","english":"I love hearing my grandma’s old family story.","thai":"ฉันรักการฟังเรื่องครอบครัวเก่าๆ จากคุณย่า"}
{"word":"love","english":"I’d love to join the photography club this month.","thai":"ฉันอยากเข้าร่วมชมรมถ่ายภาพในเดือนนี้"}
{"word":"join","english":"Let’s join the community cleanup this Saturday.","thai":"ไปเข้าร่วมการทำความสะอาดชุมชนวันเสาร์นี้กันเถอะ"}
{"word":"community","english":"The community center hosts awesome art classes.","thai":"ศูนย์ชุมชนจัดคลาสศิลปะที่เจ๋งมาก"}
{"word":"classes","english":"I signed up for cooking classes to learn new recipes.","thai":"ฉันสมัครเรียนคลาสทำอาหารเพื่อเรียนสูตรใหม่ๆ"}
{"word":"recipes","english":"Sharing family recipes brings us closer together.","thai":"การแบ่งปันสูตรอาหารครอบครัวทำให้เราใกล้ชิดกันมากขึ้น"}
{"word":"closer","english":"Running every morning brings me closer to my fitness goals.","thai":"การวิ่งทุกเช้าทำให้ฉันเข้าใกล้เป้าหมายฟิตเนสมากขึ้น"}
{"word":"fitness","english":"Fitness challenges keep me motivated to stay active.","thai":"ความท้าทายด้านฟิตเนสทำให้ฉันมีแรงจูงใจให้แอคทีฟ"}
{"word":"motivated","english":"I’m motivated to start my own small business.","thai":"ฉันมีแรงจูงใจที่จะเริ่มธุรกิจเล็กๆ ของตัวเอง"}
{"word":"business","english":"Networking is key to growing your business.","thai":"การสร้างเครือข่ายเป็นกุญแจสำคัญในการขยายธุรกิจ"}
{"word":"key","english":"Finding the key to work-life balance is tough.","thai":"การหาความสมดุลระหว่างงานและชีวิตนั้นยาก"}
{"word":"balance","english":"I need to balance my budget better this month.","thai":"ฉันต้องจัดการงบประมาณให้ดีขึ้นในเดือนนี้"}
{"word":"budget","english":"Sticking to a budget helps me save for travel.","thai":"การยึดตามงบประมาณช่วยให้ฉันเก็บเงินไปเที่ยว"}
{"word":"save","english":"I’m trying to save up for a new laptop.","thai":"ฉันกำลังพยายามเก็บเงินซื้อแล็ปท็อปใหม่"}
{"word":"laptop","english":"My laptop crashed during an important meeting.","thai":"แล็ปท็อปของฉันพังระหว่างประชุมสำคัญ"}
{"word":"meeting","english":"Let’s set up a meeting to discuss the project.","thai":"มานัดประชุมเพื่อคุยเรื่องโปรเจกต์กันเถอะ"}
{"word":"discuss","english":"We need to discuss our holiday plans soon.","thai":"เราต้องคุยเรื่องแผนวันหยุดเร็วๆ นี้"}
{"word":"plans","english":"I’m making plans to hike the Appalachian Trail.","thai":"ฉันกำลังวางแผนไปเดินป่าเส้นทางแอปพาเลเชียน"}
{"word":"hike","english":"A good hike always clears my head.","thai":"การเดินป่าที่ดีช่วยให้ฉันปลอดโปร่ง"}
{"word":"head","english":"I can’t get that song out of my head.","thai":"ฉันเอาเพลงนั้นออกจากหัวไม่ได้เลย"}
{"word":"song","english":"Her new song dropped on Spotify yesterday.","thai":"เพลงใหม่ของเธอลงในสปอติฟายเมื่อวานนี้"}
{"word":"dropped","english":"I dropped my phone in the pool yesterday.","thai":"เมื่อวานฉันทำโทรศัพท์ตกในสระน้ำ"}
{"word":"phone","english":"I need to charge my phone before we head out.","thai":"ฉันต้องชาร์จโทรศัพท์ก่อนที่เราจะออกไป"}
{"word":"charge","english":"The restaurant didn’t charge us for the extra drinks.","thai":"ร้านอาหารไม่ได้คิดเงินเราเพิ่มสำหรับเครื่องดื่มพิเศษ"}
{"word":"drinks","english":"Let’s grab some drinks at the new bar tonight.","thai":"ไปจิบเครื่องดื่มที่บาร์ใหม่คืนนี้กันเถอะ"}
{"word":"grab","english":"I’ll grab a quick nap before the meeting.","thai":"ฉันจะงีบสักหน่อยก่อนประชุม"}
{"word":"nap","english":"A short nap always boosts my productivity.","thai":"การงีบสั้นๆ ช่วยเพิ่มประสิทธิภาพการทำงานของฉันเสมอ"}
{"word":"productivity","english":"Using a planner really improves my productivity.","thai":"การใช้แพลนเนอร์ช่วยเพิ่มประสิทธิภาพการทำงานของฉันจริงๆ"}
{"word":"planner","english":"My planner is filled with deadlines this month.","thai":"แพลนเนอร์ของฉันเต็มไปด้วยกำหนดส่งในเดือนนี้"}
{"word":"deadlines","english":"Meeting tight deadlines keeps me on my toes.","thai":"การทำตามกำหนดส่งที่กระชั้นชิดทำให้ฉันต้องตื่นตัว"}
{"word":"toes","english":"Dancing all night kept me on my toes.","thai":"การเต้นทั้งคืนทำให้ฉันต้องตื่นตัว"}
{"word":"dancing","english":"Dancing at the festival was so much fun.","thai":"การเต้นในงานเทศกาลนั้นสนุกมาก"}
{"word":"festival","english":"The music festival drew a huge crowd.","thai":"งานเทศกาลดนตรีดึงดูดผู้คนจำนวนมาก"}
{"word":"crowd","english":"I got lost in the crowd at the concert.","thai":"ฉันหลงอยู่ในฝูงชนที่คอนเสิร์ต"}
{"word":"lost","english":"I lost my keys somewhere in the house.","thai":"ฉันทำกุญแจหายที่ไหนสักแห่งในบ้าน"}
{"word":"keys","english":"I left my keys on the kitchen counter.","thai":"ฉันวางกุญแจไว้บนเคาน์เตอร์ครัว"}
{"word":"kitchen","english":"The kitchen smells amazing when I bake cookies.","thai":"ครัวหอมฟุ้งเมื่อฉันอบคุกกี้"}
{"word":"smells","english":"This candle smells like fresh lavender.","thai":"เทียนนี้มีกลิ่นเหมือนลาเวนเดอร์สด"}
{"word":"fresh","english":"I love buying fresh produce at the farmer’s market.","thai":"ฉันรักการซื้อผักผลไม้สดที่ตลาดเกษตรกร"}
{"word":"market","english":"The stock market has been wild lately.","thai":"ตลาดหุ้นช่วงนี้ผันผวนมาก"}
{"word":"wild","english":"The party last night got totally wild.","thai":"ปาร์ตี้เมื่อคืนมันสุดเหวี่ยงมาก"}
{"word":"party","english":"I’m throwing a party for my birthday next week.","thai":"ฉันจะจัดปาร์ตี้วันเกิดสัปดาห์หน้า"}
{"word":"birthday","english":"Her birthday gift was a handmade bracelet.","thai":"ของขวัญวันเกิดของเธอคือกำไลทำมือ"}
{"word":"gift","english":"I need to pick out a gift for my mom.","thai":"ฉันต้องเลือกของขวัญให้แม่"}
{"word":"pick","english":"Can you pick up some groceries on your way home?","thai":"ช่วยซื้อของชำตอนกลับบ้านได้ไหม?"}
{"word":"groceries","english":"I forgot to buy milk with the groceries.","thai":"ฉันลืมซื้อนมตอนซื้อของชำ"}
{"word":"milk","english":"I spilled milk all over the counter this morning.","thai":"เช้านี้ฉันทำนมหกเลอะเคาน์เตอร์"}
{"word":"morning","english":"Morning jogs help me start the day right.","thai":"การวิ่งตอนเช้าช่วยให้ฉันเริ่มวันได้ดี"}
{"word":"jogs","english":"She jogs around the park every evening.","thai":"เธอวิ่งรอบสวนสาธารณะทุกเย็น"}
{"word":"park","english":"The park is perfect for a weekend picnic.","thai":"สวนสาธารณะเหมาะสำหรับปิกนิกสุดสัปดาห์"}
{"word":"picnic","english":"We had a blast at the company picnic.","thai":"เราสนุกสุดเหวี่ยงที่ปิกนิกของบริษัท"}
{"word":"blast","english":"Playing board games with friends is a blast.","thai":"การเล่นบอร์ดเกมกับเพื่อนๆ มันสนุกมาก"}
{"word":"games","english":"Video games keep me entertained for hours.","thai":"วิดีโอเกมทำให้ฉันเพลิดเพลินได้เป็นชั่วโมง"}
{"word":"entertained","english":"Her stories always keep me entertained.","thai":"เรื่องเล่าของเธอทำให้ฉันเพลิดเพลินเสมอ"}
{"word":"stories","english":"I love reading bedtime stories to my kids.","thai":"ฉันรักการอ่านนิทานก่อนนอนให้ลูกๆ"}
{"word":"kids","english":"The kids are excited for the school trip.","thai":"เด็กๆ ตื่นเต้นกับทริปโรงเรียน"}
{"word":"excited","english":"I’m so excited to try the new yoga class.","thai":"ฉันตื่นเต้นมากที่จะลองคลาสโยคะใหม่"}
{"word":"yoga","english":"Yoga helps me stay calm and focused.","thai":"โยคะช่วยให้ฉันสงบและมีสมาธิ"}
{"word":"calm","english":"The ocean view always makes me feel calm.","thai":"วิวทะเลทำให้ฉันรู้สึกสงบเสมอ"}
{"word":"view","english":"The view from the mountain top was breathtaking.","thai":"วิวจากยอดเขานั้นน่าทึ่ง"}
{"word":"breathtaking","english":"The sunset last night was absolutely breathtaking.","thai":"พระอาทิตย์ตกเมื่อคืนนั้นสวยงามมาก"}
{"word":"sunset","english":"Watching the sunset is my favorite evening ritual.","thai":"การดูพระอาทิตย์ตกคือพิธีกรรมยามเย็นที่ฉันชอบ"}
{"word":"evening","english":"Evening walks with my dog are so relaxing.","thai":"การเดินเล่นตอนเย็นกับหมาเป็นอะไรที่ผ่อนคลายมาก"}
{"word":"dog","english":"My dog loves chasing squirrels in the yard.","thai":"หมาของฉันชอบวิ่งไล่กระรอกในสวน"}
{"word":"yard","english":"The kids are playing soccer in the yard.","thai":"เด็กๆ กำลังเล่นฟุตบอลในสวน"}
{"word":"soccer","english":"Watching soccer matches gets me so pumped.","thai":"การดูการแข่งขันฟุตบอลทำให้ฉันตื่นเต้นมาก"}
{"word":"matches","english":"I ran out of matches to light the campfire.","thai":"ฉันไม่มีไม้ขีดไฟจุดกองไฟแล้ว"}
{"word":"campfire","english":"We roasted marshmallows by the campfire last night.","thai":"เมื่อคืนเราเอาขนมมาร์ชเมลโลว์ไปย่างที่กองไฟ"}
{"word":"marshmallows","english":"The kids love eating marshmallows at the bonfire.","thai":"เด็กๆ ชอบกินมาร์ชเมลโลว์ที่กองไฟ"}
{"word":"bonfire","english":"The bonfire warmed us up during the chilly night.","thai":"กองไฟทำให้เราอบอุ่นในคืนที่หนาวเย็น"}
{"word":"chilly","english":"The chilly weather calls for hot cocoa.","thai":"อากาศหนาวๆ แบบนี้ต้องจิบโกโก้ร้อน"}
{"word":"cocoa","english":"I spilled cocoa powder all over the kitchen.","thai":"ฉันทำผงโกโก้หกเลอะครัว"}
{"word":"powder","english":"I use protein powder after my workouts.","thai":"ฉันใช้ผงโปรตีนหลังออกกำลังกาย"}
{"word":"workouts","english":"My workouts have been intense this week.","thai":"การออกกำลังกายของฉันสัปดาห์นี้หนักหน่วงมาก"}
{"word":"intense","english":"The debate in class got pretty intense.","thai":"การโต้วาทีในชั้นเรียนค่อนข้างดุเดือด"}
{"word":"class","english":"I’m taking a photography class this semester.","thai":"ฉันลงเรียนคลาสถ่ายภาพในเทอมนี้"}
{"word":"photography","english":"Photography lets me capture life’s best moments.","thai":"การถ่ายภาพทำให้ฉันเก็บช่วงเวลาดีๆ ของชีวิตได้"}
{"word":"capture","english":"I tried to capture the lightning on camera.","thai":"ฉันพยายามจับภาพฟ้าผ่าด้วยกล้อง"}
{"word":"camera","english":"My new camera takes stunning photos.","thai":"กล้องใหม่ของฉันถ่ายรูปได้สวยมาก"}
{"word":"photos","english":"I posted some photos from the trip online.","thai":"ฉันโพสต์รูปจากทริปลงออนไลน์"}
{"word":"online","english":"I found a great deal online for concert tickets.","thai":"ฉันเจอดีลดีๆ ออนไลน์สำหรับตั๋วคอนเสิร์ต"}
{"word":"deal","english":"Let’s make a deal to split the chores.","thai":"มาทำข้อตกลงแบ่งงานบ้านกันเถอะ"}
{"word":"chores","english":"Doing chores on Saturday mornings is my routine.","thai":"การทำความสะอาดบ้านเช้าวันเสาร์คือกิจวัตรของฉัน"}
{"word":"routine","english":"My morning routine includes meditation and coffee.","thai":"กิจวัตรตอนเช้าของฉันรวมถึงการทำสมาธิและกาแฟ"}
{"word":"meditation","english":"Meditation helps me manage stress every day.","thai":"การทำสมาธิช่วยให้ฉันจัดการกับความเครียดได้ทุกวัน"}
{"word":"stress","english":"Work stress is getting to me lately.","thai":"ความเครียดจากงานเริ่มทำให้ฉันลำบาก"}
{"word":"work","english":"I need to work on my public speaking skills.","thai":"ฉันต้องพัฒนาทักษะการพูดในที่สาธารณะ"}
{"word":"skills","english":"Her cooking skills are out of this world.","thai":"ทักษะการทำอาหารของเธอนั้นสุดยอดมาก"}
{"word":"cooking","english":"Cooking dinner with friends is always a blast.","thai":"การทำอาหารเย็นกับเพื่อนๆ มันสนุกมาก"}
{"word":"dinner","english":"I’m hosting a dinner party this weekend.","thai":"ฉันจะจัดงานเลี้ยงอาหารค่ำสุดสัปดาห์นี้"}
{"word":"hosting","english":"Hosting game night is my favorite tradition.","thai":"การเป็นเจ้าภาพจัดค่ำคืนเล่นเกมคือประเพณีที่ฉันชอบ"}
{"word":"tradition","english":"Our family tradition includes baking holiday cookies.","thai":"ประเพณีครอบครัวของเราคือการอบคุกกี้วันหยุด"}
{"word":"holiday","english":"I’m planning a holiday getaway to the beach.","thai":"ฉันกำลังวางแผนพักผ่อนวันหยุดที่ชายหาด"}
{"word":"getaway","english":"A weekend getaway sounds perfect right now.","thai":"การพักผ่อนสุดสัปดาห์ฟังดูดีมากตอนนี้"}
{"word":"perfect","english":"The weather is perfect for a hike today.","thai":"อากาศวันนี้เหมาะสำหรับการเดินป่า"}
{"word":"hike","english":"Let’s hike up the trail this afternoon.","thai":"ไปเดินป่าตามเส้นทางบ่ายนี้กันเถอะ"}
{"word":"trail","english":"The trail was muddy after last night’s rain.","thai":"เส้นทางนั้นเละหลังฝนตกเมื่อคืน"}
{"word":"rain","english":"I love listening to rain while reading a book.","thai":"ฉันชอบฟังเสียงฝนขณะอ่านหนังสือ"}
{"word":"book","english":"This book on mindfulness is really eye-opening.","thai":"หนังสือเกี่ยวกับการมีสติเล่มนี้เปิดโลกมาก"}
{"word":"mindfulness","english":"Practicing mindfulness helps me stay grounded.","thai":"การฝึกสติช่วยให้ฉันมั่นคง"}
{"word":"grounded","english":"Staying grounded keeps my anxiety in check.","thai":"การมั่นคงช่วยควบคุมความวิตกกังวลของฉัน"}
{"word":"anxiety","english":"Talking to friends eases my anxiety.","thai":"การคุยกับเพื่อนช่วยลดความวิตกกังวลของฉัน"}
{"word":"eases","english":"A warm bath eases my sore muscles.","thai":"การอาบน้ำอุ่นช่วยผ่อนคลายกล้ามเนื้อที่เมื่อย"}
{"word":"bath","english":"I love a long bath with scented candles.","thai":"ฉันชอบแช่น้ำนานๆ พร้อมเทียนหอม"}
{"word":"candles","english":"Candles add such a cozy vibe to my room.","thai":"เทียนเพิ่มบรรยากาศอบอุ่นให้ห้องของฉัน"}
{"word":"cozy","english":"This coffee shop has a super cozy atmosphere.","thai":"ร้านกาแฟนี้มีบรรยากาศอบอุ่นมาก"}
{"word":"atmosphere","english":"The atmosphere at the concert was electric.","thai":"บรรยากาศในคอนเสิร์ตนั้นตื่นเต้นสุดๆ"}
{"word":"electric","english":"The electric guitar solo stole the show.","thai":"การโซโล่กีตาร์ไฟฟ้าขโมยซีนไปเลย"}
{"word":"show","english":"I can’t wait to show off my new dance moves.","thai":"ฉันรอไม่ไหวที่จะโชว์ท่าเต้นใหม่"}
{"word":"dance","english":"Let’s dance the night away at the club.","thai":"ไปเต้นทั้งคืนที่คลับกันเถอะ"}
{"word":"club","english":"Joining the book club was a great decision.","thai":"การเข้าร่วมชมรมหนังสือเป็นการตัดสินใจที่ดี"}
{"word":"decision","english":"Making a quick decision can be tough sometimes.","thai":"การตัดสินใจเร็วๆ บางครั้งก็ยาก"}
{"word":"quick","english":"I need a quick snack before the meeting.","thai":"ฉันต้องการของว่างเร็วๆ ก่อนประชุม"}
{"word":"snack","english":"I grabbed a snack from the vending machine.","thai":"ฉันหยิบของว่างจากตู้หยอดเหรียญ"}
{"word":"machine","english":"The coffee machine broke down this morning.","thai":"เครื่องชงกาแฟเสียเช้านี้"}
{"word":"broke","english":"I broke my favorite mug by accident.","thai":"ฉันเผลอทำแก้วใบโปรดแตก"}
{"word":"mug","english":"This mug keeps my coffee warm for hours.","thai":"แก้วใบนี้เก็บกาแฟให้อุ่นได้นานหลายชั่วโมง"}
{"word":"warm","english":"A warm blanket is perfect for movie nights.","thai":"ผ้าห่มอุ่นๆ เหมาะสำหรับคืนดูหนัง"}
{"word":"movie","english":"The new movie got rave reviews online.","thai":"หนังใหม่ได้รับคำชมล้นหลามทางออนไลน์"}
{"word":"reviews","english":"I always read reviews before booking a hotel.","thai":"ฉันมักอ่านรีวิวก่อนจองโรงแรม"}
{"word":"booking","english":"Booking flights early saves a ton of money.","thai":"การจองตั๋วเครื่องบินล่วงหน้าช่วยประหยัดเงินได้เยอะ"}
{"word":"flights","english":"Booking flights early saves a lot of cash.","thai":"การจองตั๋วเครื่องบินล่วงหน้าช่วยประหยัดเงินได้เยอะ"}
{"word":"cash","english":"I need some cash for the food truck festival.","thai":"ฉันต้องการเงินสดสำหรับงานเทศกาลฟู้ดทรัค"}
{"word":"festival","english":"The local festival had amazing live music.","thai":"งานเทศกาลท้องถิ่นมีดนตรีสดที่ยอดเยี่ยม"}
{"word":"music","english":"I always blast music while cleaning the house.","thai":"ฉันเปิดเพลงดังๆ เสมอตอนทำความสะอาดบ้าน"}
{"word":"blast","english":"Hanging out with friends is always a blast.","thai":"การไปเที่ยวกับเพื่อนๆ มันสนุกสุดๆ เสมอ"}
{"word":"friends","english":"My friends always cheer me up when I’m down.","thai":"เพื่อนๆ ของฉันคอยให้กำลังใจเมื่อฉันรู้สึกแย่"}
{"word":"cheer","english":"I love to cheer for my team at games.","thai":"ฉันชอบเชียร์ทีมของฉันในเกมการแข่งขัน"}
{"word":"games","english":"Board games make family nights so much fun.","thai":"บอร์ดเกมทำให้คืนครอบครัวสนุกมาก"}
{"word":"fun","english":"Baking cookies with my kids is super fun.","thai":"การอบคุกกี้กับลูกๆ นั้นสนุกสุดๆ"}
{"word":"cookies","english":"I ate too many cookies at the bake sale.","thai":"ฉันกินคุกกี้เยอะเกินไปที่งานขายของอบ"}
{"word":"sale","english":"The big sale at the mall was a steal.","thai":"เซลใหญ่ที่ห้างนั้นถูกสุดๆ"}
{"word":"mall","english":"I ran into my cousin at the mall yesterday.","thai":"เมื่อวานฉันบังเอิญเจอญาติที่ห้าง"}
{"word":"ran","english":"I ran a 5K for charity last weekend.","thai":"ฉันวิ่ง 5K เพื่อการกุศลเมื่อสุดสัปดาห์ที่แล้ว"}
{"word":"charity","english":"Volunteering for charity feels so rewarding.","thai":"การเป็นอาสาสมัครเพื่อการกุศลรู้สึกคุ้มค่ามาก"}
{"word":"rewarding","english":"Teaching kids to read is incredibly rewarding.","thai":"การสอนเด็กๆ อ่านหนังสือให้รางวัลใจมาก"}
{"word":"read","english":"I love to read thrillers before bed.","thai":"ฉันชอบอ่านนิยายระทึกขวัญก่อนนอน"}
{"word":"bed","english":"I need a new pillow for my bed.","thai":"ฉันต้องการหมอนใหม่สำหรับเตียงของฉัน"}
{"word":"pillow","english":"This pillow makes my naps so comfy.","thai":"หมอนนี้ทำให้การงีบของฉันสบายมาก"}
{"word":"naps","english":"Taking naps on weekends recharges my energy.","thai":"การงีบในวันหยุดสุดสัปดาห์เติมพลังให้ฉัน"}
{"word":"energy","english":"I’m full of energy after my morning coffee.","thai":"ฉันเต็มไปด้วยพลังหลังจากกาแฟตอนเช้า"}
{"word":"coffee","english":"This coffee shop has the best lattes.","thai":"ร้านกาแฟนี้มีลาเต้ที่ดีที่สุด"}
{"word":"shop","english":"I need to shop for new running shoes.","thai":"ฉันต้องซื้อรองเท้าวิ่งคู่ใหม่"}
{"word":"shoes","english":"My shoes got soaked in the rain yesterday.","thai":"รองเท้าของฉันเปียกฝนเมื่อวาน"}
{"word":"rain","english":"The rain canceled our outdoor movie night.","thai":"ฝนทำให้ต้องยกเลิกคืนดูหนังกลางแจ้ง"}
{"word":"movie","english":"That new movie was totally worth watching.","thai":"หนังใหม่นั้นคุ้มค่าที่จะดูมาก"}
{"word":"worth","english":"This old watch is worth a fortune now.","thai":"นาฬิกาเก่านี้ตอนนี้มีมูลค่ามหาศาล"}
{"word":"watch","english":"I watch cooking shows to learn new recipes.","thai":"ฉันดูรายการทำอาหารเพื่อเรียนสูตรใหม่ๆ"}
{"word":"cooking","english":"Cooking dinner together strengthens our bond.","thai":"การทำอาหารเย็นด้วยกันช่วยกระชับความสัมพันธ์"}
{"word":"dinner","english":"I burned the dinner trying to multitask.","thai":"ฉันเผลอเผาอาหารเย็นเพราะพยายามทำหลายอย่างพร้อมกัน"}
{"word":"multitask","english":"I struggle to multitask during busy workdays.","thai":"ฉันลำบากในการทำหลายอย่างพร้อมกันในวันทำงานที่วุ่นวาย"}
{"word":"workdays","english":"Long workdays leave me exhausted by evening.","thai":"วันทำงานที่ยาวนานทำให้ฉันเหนื่อยล้าในตอนเย็น"}
{"word":"evening","english":"Evening yoga helps me unwind after work.","thai":"โยคะตอนเย็นช่วยให้ฉันผ่อนคลายหลังเลิกงาน"}
{"word":"yoga","english":"Yoga classes improve my flexibility and calm.","thai":"คลาสโยคะช่วยเพิ่มความยืดหยุ่นและความสงบของฉัน"}
{"word":"calm","english":"Her voice is so calm during meditation sessions.","thai":"น้ำเสียงของเธอสงบมากในช่วงฝึกสมาธิ"}
{"word":"voice","english":"I lost my voice cheering at the game.","thai":"ฉันเสียงแหบจากการเชียร์ในเกม"}
{"word":"game","english":"The soccer game went into overtime last night.","thai":"เกมฟุตบอลเมื่อคืนยืดเยื้อถึงต่อเวลา"}
{"word":"overtime","english":"Working overtime this week is wearing me out.","thai":"การทำงานล่วงเวลาสัปดาห์นี้ทำให้ฉันเหนื่อย"}
{"word":"wearing","english":"These old jeans are wearing out fast.","thai":"ยีนส์ตัวเก่านี้เริ่มขาดเร็วมาก"}
{"word":"jeans","english":"I found the perfect jeans at the thrift store.","thai":"ฉันเจอยีนส์ที่ถูกใจในร้านมือสอง"}
{"word":"store","english":"The grocery store was packed this morning.","thai":"ร้านขายของชำแน่นไปด้วยผู้คนเช้านี้"}
{"word":"packed","english":"My suitcase is packed for the weekend trip.","thai":"กระเป๋าเดินทางของฉันพร้อมแล้วสำหรับทริปสุดสัปดาห์"}
{"word":"trip","english":"The road trip to the coast was epic.","thai":"ทริปขับรถไปชายฝั่งนั้นยอดเยี่ยมมาก"}
{"word":"coast","english":"I love walking along the coast at sunset.","thai":"ฉันชอบเดินเลียบชายฝั่งตอนพระอาทิตย์ตก"}
{"word":"sunset","english":"The sunset view from the hill was stunning.","thai":"วิวพระอาทิตย์ตกจากบนเขานั้นสวยงามมาก"}
{"word":"view","english":"This hotel room has an amazing view.","thai":"ห้องโรงแรมนี้มีวิวที่ยอดเยี่ยม"}
{"word":"room","english":"I need to clean my room before guests arrive.","thai":"ฉันต้องทำความสะอาดห้องก่อนแขกจะมา"}
{"word":"clean","english":"I clean out my closet every spring.","thai":"ฉันทำความสะอาดตู้เสื้อผ้าทุกฤดูใบไม้ผลิ"}
{"word":"closet","english":"My closet is stuffed with old clothes.","thai":"ตู้เสื้อผ้าของฉันเต็มไปด้วยเสื้อผ้าเก่า"}
{"word":"clothes","english":"I donated some clothes to the local shelter.","thai":"ฉันบริจาคเสื้อผ้าบางส่วนให้ศูนย์พักพิงท้องถิ่น"}
{"word":"shelter","english":"The animal shelter needs more volunteers.","thai":"ศูนย์พักพิงสัตว์ต้องการอาสาสมัครเพิ่ม"}
{"word":"volunteers","english":"Volunteers helped set up the community event.","thai":"อาสาสมัครช่วยจัดงานชุมชน"}
{"word":"event","english":"The charity event raised a ton of money.","thai":"งานการกุศลระดมทุนได้เยอะมาก"}
{"word":"money","english":"I’m saving money for a new laptop.","thai":"ฉันกำลังเก็บเงินซื้อแล็ปท็อปใหม่"}
{"word":"laptop","english":"My laptop crashed during an important presentation.","thai":"แล็ปท็อปของฉันพังระหว่างนำเสนองานสำคัญ"}
{"word":"presentation","english":"Her presentation at the seminar was flawless.","thai":"การนำเสนอของเธอในงานสัมมนานั้นไร้ที่ติ"}
{"word":"seminar","english":"The coding seminar taught me new skills.","thai":"สัมมนาการเขียนโค้ดสอนทักษะใหม่ให้ฉัน"}
{"word":"skills","english":"I’m brushing up on my photography skills.","thai":"ฉันกำลังพัฒนาทักษะการถ่ายภาพ"}
{"word":"photography","english":"Photography captures moments I’ll never forget.","thai":"การถ่ายภาพเก็บช่วงเวลาที่ฉันจะไม่มีวันลืม"}
{"word":"moments","english":"Sharing quiet moments with my partner is special.","thai":"การแบ่งปันช่วงเวลาสงบกับคู่รักนั้นพิเศษมาก"}
{"word":"partner","english":"My business partner has some great ideas.","thai":"หุ้นส่วนธุรกิจของฉันมีไอเดียเจ๋งๆ"}
{"word":"ideas","english":"Brainstorming new ideas keeps my team inspired.","thai":"การระดมสมองหาไอเดียใหม่ๆ ทำให้ทีมของฉันมีแรงบันดาลใจ"}
{"word":"team","english":"Our team pulled together to meet the deadline.","thai":"ทีมของเราร่วมแรงร่วมใจเพื่อให้ทันกำหนดส่ง"}
{"word":"deadline","english":"Missing the deadline stressed me out big time.","thai":"การพลาดกำหนดส่งทำให้ฉันเครียดมาก"}
{"word":"time","english":"I need to make time for my hobbies.","thai":"ฉันต้องหาเวลาให้งานอดิเรก"}
{"word":"hobbies","english":"My hobbies include painting and hiking.","thai":"งานอดิเรกของฉันรวมถึงการวาดภาพและเดินป่า"}
{"word":"painting","english":"Painting the living room took all weekend.","thai":"การทาสีห้องนั่งเล่นใช้เวลาทั้งสุดสัปดาห์"}
{"word":"weekend","english":"I’m planning a chill weekend with friends.","thai":"ฉันวางแผนสุดสัปดาห์แบบชิลๆ กับเพื่อนๆ"}
{"word":"chill","english":"Let’s chill at the beach this afternoon.","thai":"ไปชิลที่ชายหาดบ่ายนี้กันเถอะ"}
{"word":"beach","english":"The beach was packed with tourists yesterday.","thai":"ชายหาดเมื่อวานเต็มไปด้วยนักท่องเที่ยว"}
{"word":"tourists","english":"Tourists love the local food market.","thai":"นักท่องเที่ยวชอบตลาดอาหารท้องถิ่น"}
{"word":"food","english":"Trying new food is my favorite part of travel.","thai":"การลองอาหารใหม่คือส่วนที่ฉันชอบที่สุดของการเดินทาง"}
{"word":"travel","english":"Travel broadens my perspective on life.","thai":"การเดินทางขยายมุมมองชีวิตของฉัน"}
{"word":"perspective","english":"Her perspective on sustainability is inspiring.","thai":"มุมมองของเธอเกี่ยวกับความยั่งยืนนั้นสร้างแรงบันดาลใจ"}
{"word":"sustainability","english":"Sustainability is a key focus for our project.","thai":"ความยั่งยืนคือจุดเน้นสำคัญของโปรเจกต์เรา"}
{"word":"project","english":"This group project is driving me nuts.","thai":"โปรเจกต์กลุ่มนี้ทำให้ฉันแทบคลั่ง"}
{"word":"group","english":"Our study group meets every Tuesday night.","thai":"กลุ่มเรียนของเรานัดเจอกันทุกคืนวันอังคาร"}
{"word":"night","english":"Stargazing at night is so peaceful.","thai":"การดูดาวตอนกลางคืนนั้นสงบมาก"}
{"word":"peaceful","english":"The garden is my peaceful escape from stress.","thai":"สวนคือที่หลบหนีความเครียดอันเงียบสงบของฉัน"}
{"word":"garden","english":"I planted tomatoes in my backyard garden.","thai":"ฉันปลูกมะเขือเทศในสวนหลังบ้าน"}
{"word":"backyard","english":"We set up a barbecue in the backyard.","thai":"เราจัดงานบาร์บีคิวที่สวนหลังบ้าน"}
{"word":"barbecue","english":"The barbecue sauce was homemade and delicious.","thai":"ซอสบาร์บีคิวทำเองและอร่อยมาก"}
{"word":"delicious","english":"This pizza is absolutely delicious.","thai":"พิซซ่านี้อร่อยสุดๆ"}
{"word":"pizza","english":"I ordered pizza for the game night.","thai":"ฉันสั่งพิซซ่าสำหรับค่ำคืนเล่นเกม"}
{"word":"ordered","english":"I ordered a new bookcase for my office.","thai":"ฉันสั่งชั้นวางหนังสือใหม่สำหรับออฟฟิศ"}
{"word":"office","english":"The office vibe is so chill on Fridays.","thai":"บรรยากาศในออฟฟิศชิลมากในวันศุกร์"}
{"word":"vibe","english":"This song has such a great vibe.","thai":"เพลงนี้มีฟีลที่ดีมาก"}
{"word":"song","english":"I can’t stop humming that catchy song.","thai":"ฉันหยุดฮัมเพลงติดหูนั้นไม่ได้เลย"}
{"word":"catchy","english":"The ad’s catchy slogan stuck in my head.","thai":"สโลแกนติดหูของโฆษณานั้นติดอยู่ในหัวฉัน"}
{"word":"head","english":"I need to clear my head with a walk.","thai":"ฉันต้องปลอดโปร่งสมองด้วยการเดินเล่น"}
{"word":"walk","english":"A morning walk boosts my mood instantly.","thai":"การเดินตอนเช้าช่วยยกระดับอารมณ์ของฉันทันที"}
{"word":"mood","english":"Her positive mood is totally contagious.","thai":"อารมณ์เชิงบวกของเธอติดต่อกันได้จริงๆ"}
{"word":"positive","english":"I got positive feedback on my latest design.","thai":"ฉันได้รับคำติชมเชิงบวกจากงานออกแบบล่าสุด"}
{"word":"feedback","english":"Giving honest feedback helps the team grow.","thai":"การให้คำติชมอย่างตรงไปตรงมาช่วยให้ทีมเติบโต"}
{"word":"grow","english":"I want to grow my own herbs at home.","thai":"ฉันอยากปลูกสมุนไพรด้วยตัวเองที่บ้าน"}
{"word":"herbs","english":"Fresh herbs make every dish taste better.","thai":"สมุนไพรสดทำให้ทุกจานรสชาติดีขึ้น"}
{"word":"taste","english":"This wine has a bold and fruity taste.","thai":"ไวน์นี้มีรสชาติเข้มข้นและผลไม้"}
{"word":"wine","english":"I spilled wine on my favorite shirt.","thai":"ฉันทำไวน์หกใส่เสื้อตัวโปรด"}
{"word":"shirt","english":"This new shirt looks awesome on you.","thai":"เสื้อใหม่ตัวนี้ดูเจ๋งมากบนตัวคุณ"}
{"word":"awesome","english":"This new game is totally awesome to play.","thai":"เกมใหม่นี้สนุกสุดๆ เลย"}
{"word":"game","english":"Watching the game with friends is always a blast.","thai":"การดูเกมกับเพื่อนๆ มันสนุกสุดยอดเสมอ"}
{"word":"friends","english":"My friends always show up for movie nights.","thai":"เพื่อนๆ ของฉันมักจะมาปรากฏตัวในคืนดูหนัง"}
{"word":"movie","english":"That movie had me on the edge of my seat.","thai":"หนังเรื่องนั้นทำให้ฉันลุ้นจนนั่งไม่ติด"}
{"word":"seat","english":"I grabbed a front-row seat at the concert.","thai":"ฉันได้ที่นั่งแถวหน้าที่คอนเสิร์ต"}
{"word":"concert","english":"The concert last night was absolutely electric.","thai":"คอนเสิร์ตเมื่อคืนมันตื่นเต้นสุดๆ"}
{"word":"electric","english":"The electric vibe at the festival was contagious.","thai":"บรรยากาศที่เต็มไปด้วยพลังในงานเทศกาลนั้นติดต่อกันได้"}
{"word":"festival","english":"The food festival had the best tacos ever.","thai":"งานเทศกาลอาหารมีทาโก้ที่อร่อยที่สุดเท่าที่เคยมี"}
{"word":"food","english":"I’m trying to cut back on junk food.","thai":"ฉันกำลังพยายามลดการกินอาหารขยะ"}
{"word":"cut","english":"I cut my finger while chopping vegetables.","thai":"ฉันบาดนิ้วขณะหั่นผัก"}
{"word":"vegetables","english":"Fresh vegetables make my salads so tasty.","thai":"ผักสดทำให้สลัดของฉันอร่อยมาก"}
{"word":"tasty","english":"This homemade soup is super tasty.","thai":"ซุปทำเองนี้อร่อยสุดๆ"}
{"word":"soup","english":"I spilled soup all over my new shirt.","thai":"ฉันทำซุปหกเลอะเสื้อใหม่"}
{"word":"shirt","english":"This shirt looks perfect for the beach party.","thai":"เสื้อตัวนี้ดูเหมาะมากสำหรับปาร์ตี้ชายหาด"}
{"word":"beach","english":"I love to chill out at the beach on weekends.","thai":"ฉันชอบไปพักผ่อนที่ชายหาดในวันหยุดสุดสัปดาห์"}
{"word":"chill","english":"Let’s chill with some coffee this afternoon.","thai":"ไปจิบกาแฟชิลๆ กันบ่ายนี้เถอะ"}
{"word":"coffee","english":"This coffee shop has the coziest vibe.","thai":"ร้านกาแฟนี้มีบรรยากาศที่อบอุ่นสุดๆ"}
{"word":"shop","english":"I need to shop for new running gear.","thai":"ฉันต้องซื้ออุปกรณ์วิ่งใหม่"}
{"word":"gear","english":"My camping gear is ready for the trip.","thai":"อุปกรณ์แคมป์ปิ้งของฉันพร้อมสำหรับทริปแล้ว"}
{"word":"trip","english":"The road trip was a total adventure.","thai":"ทริปขับรถนั้นเป็นการผจญภัยสุดๆ"}
{"word":"adventure","english":"Hiking in the mountains is my kind of adventure.","thai":"การเดินป่าในภูเขาคือการผจญภัยที่ฉันชอบ"}
{"word":"mountains","english":"The mountains look stunning in the morning light.","thai":"ภูเขาดูสวยงามในแสงยามเช้า"}
{"word":"light","english":"This new lamp gives off perfect light.","thai":"โคมไฟใหม่นี้ให้แสงที่สมบูรณ์แบบ"}
{"word":"lamp","english":"I knocked over the lamp while vacuuming.","thai":"ฉันทำโคมไฟล้มขณะดูดฝุ่น"}
{"word":"vacuuming","english":"Vacuuming the house takes up my whole morning.","thai":"การดูดฝุ่นบ้านใช้เวลาทั้งเช้าของฉัน"}
{"word":"morning","english":"Morning jogs help me start the day right.","thai":"การวิ่งตอนเช้าช่วยให้ฉันเริ่มวันได้ดี"}
{"word":"jogs","english":"She jogs around the park every evening.","thai":"เธอวิ่งรอบสวนสาธารณะทุกเย็น"}
{"word":"park","english":"The park is perfect for a weekend picnic.","thai":"สวนสาธารณะเหมาะสำหรับปิกนิกสุดสัปดาห์"}
{"word":"picnic","english":"We packed sandwiches for the picnic.","thai":"เราแพ็คแซนด์วิชสำหรับปิกนิก"}
{"word":"sandwiches","english":"These sandwiches taste amazing with fresh bread.","thai":"แซนด์วิชเหล่านี้อร่อยมากเมื่อใช้ขนมปังสด"}
{"word":"bread","english":"I baked some bread for dinner tonight.","thai":"ฉันอบขนมปังสำหรับอาหารเย็นคืนนี้"}
{"word":"dinner","english":"Dinner with family always warms my heart.","thai":"อาหารเย็นกับครอบครัวทำให้ใจฉันอบอุ่นเสมอ"}
{"word":"family","english":"My family loves game nights on Fridays.","thai":"ครอบครัวของฉันชอบคืนเล่นเกมในวันศุกร์"}
{"word":"nights","english":"Starry nights are perfect for deep conversations.","thai":"คืนที่มีดวงดาวเหมาะสำหรับการสนทนาลึกซึ้ง"}
{"word":"conversations","english":"Our conversations always spark new ideas.","thai":"การสนทนาของเรามักจุดประกายไอเดียใหม่ๆ"}
{"word":"ideas","english":"I’m brainstorming ideas for my art project.","thai":"ฉันกำลังระดมสมองหาไอเดียสำหรับโปรเจกต์ศิลปะ"}
{"word":"art","english":"Her art exhibit was absolutely inspiring.","thai":"นิทรรศการศิลปะของเธอนั้นสร้างแรงบันดาลใจมาก"}
{"word":"inspiring","english":"His speech was so inspiring to the team.","thai":"คำพูดของเขาสร้างแรงบันดาลใจให้ทีมมาก"}
{"word":"team","english":"Our team needs to step up this quarter.","thai":"ทีมของเราต้องพัฒนาขึ้นในไตรมาสนี้"}
{"word":"step","english":"I need to step away from work to relax.","thai":"ฉันต้องพักจากงานเพื่อผ่อนคลาย"}
{"word":"relax","english":"A hot bath helps me relax after a long day.","thai":"การอาบน้ำร้อนช่วยให้ฉันผ่อนคลายหลังจากวันที่ยาวนาน"}
{"word":"bath","english":"I dropped my phone in the bath by accident.","thai":"ฉันทำโทรศัพท์ตกในอ่างน้ำโดยไม่ตั้งใจ"}
{"word":"phone","english":"My phone battery dies way too fast.","thai":"แบตเตอรี่โทรศัพท์ของฉันหมดเร็วเกินไป"}
{"word":"battery","english":"I need a new battery for my laptop.","thai":"ฉันต้องการแบตเตอรี่ใหม่สำหรับแล็ปท็อป"}
{"word":"laptop","english":"My laptop crashed during an online meeting.","thai":"แล็ปท็อปของฉันพังระหว่างประชุมออนไลน์"}
{"word":"meeting","english":"The team meeting got heated over deadlines.","thai":"การประชุมทีมร้อนแรงเรื่องกำหนดส่ง"}
{"word":"deadlines","english":"I’m stressed about hitting all my deadlines.","thai":"ฉันเครียดกับการทำตามกำหนดส่งทั้งหมด"}
{"word":"stressed","english":"I’m super stressed about my final exams.","thai":"ฉันเครียดมากเกี่ยวกับการสอบปลายภาค"}
{"word":"exams","english":"Studying for exams is draining my energy.","thai":"การอ่านหนังสือสอบทำให้ฉันหมดพลัง"}
{"word":"energy","english":"A quick nap boosts my energy instantly.","thai":"การงีบสั้นๆ ช่วยเพิ่มพลังให้ฉันทันที"}
{"word":"nap","english":"I took a nap after a long hike.","thai":"ฉันงีบหลังจากเดินป่านาน"}
{"word":"hike","english":"The hike up the hill was totally worth it.","thai":"การเดินป่าขึ้นเขานั้นคุ้มค่ามาก"}
{"word":"hill","english":"We sled down the hill during the snowstorm.","thai":"เรานั่งเลื่อนลงเขาระหว่างพายุหิมะ"}
{"word":"snowstorm","english":"The snowstorm canceled our outdoor plans.","thai":"พายุหิมะทำให้ต้องยกเลิกแผนกลางแจ้งของเรา"}
{"word":"plans","english":"I’m making plans for a summer getaway.","thai":"ฉันกำลังวางแผนพักผ่อนช่วงฤดูร้อน"}
{"word":"getaway","english":"A beach getaway sounds like paradise.","thai":"การพักผ่อนที่ชายหาดฟังดูเหมือนสวรรค์"}
{"word":"paradise","english":"This tropical island feels like pure paradise.","thai":"เกาะเขตร้อนนี้รู้สึกเหมือนสวรรค์ล้วนๆ"}
{"word":"island","english":"We explored the island on a rented scooter.","thai":"เราเที่ยวรอบเกาะด้วยสกู๊ตเตอร์เช่า"}
{"word":"scooter","english":"My scooter broke down on the way home.","thai":"สกู๊ตเตอร์ของฉันเสียระหว่างทางกลับบ้าน"}
{"word":"home","english":"I love coming home to my cozy apartment.","thai":"ฉันชอบกลับบ้านมาที่อพาร์ตเมนต์แสนสบาย"}
{"word":"cozy","english":"This blanket makes my couch super cozy.","thai":"ผ้าห่มนี้ทำให้โซฟาของฉันสบายสุดๆ"}
{"word":"couch","english":"I crashed on the couch watching Netflix.","thai":"ฉันหลับคาโซฟาขณะดูเน็ตฟลิกซ์"}
{"word":"watching","english":"Watching the sunset is my evening ritual.","thai":"การดูพระอาทิตย์ตกคือพิธีกรรมยามเย็นของฉัน"}
{"word":"sunset","english":"The sunset over the lake was breathtaking.","thai":"พระอาทิตย์ตกเหนือทะเลสาบนั้นน่าทึ่ง"}
{"word":"lake","english":"We went fishing at the lake last weekend.","thai":"เราไปตกปลาที่ทะเลสาบเมื่อสุดสัปดาห์ที่แล้ว"}
{"word":"fishing","english":"Fishing with my dad is a cherished memory.","thai":"การตกปลากับพ่อคือความทรงจำที่ล้ำค่า"}
{"word":"memory","english":"This photo brings back such a sweet memory.","thai":"รูปนี้ทำให้ฉันนึกถึงความทรงจำที่หวานชื่น"}
{"word":"photo","english":"I snapped a photo of the festival decorations.","thai":"ฉันถ่ายรูปของตกแต่งในงานเทศกาล"}
{"word":"decorations","english":"The holiday decorations lit up the whole street.","thai":"ของตกแต่งวันหยุดทำให้ทั้งถนนสว่างไสว"}
{"word":"holiday","english":"I’m planning a holiday party with friends.","thai":"ฉันกำลังวางแผนจัดปาร์ตี้วันหยุดกับเพื่อนๆ"}
{"word":"party","english":"The dance party got wild after midnight.","thai":"ปาร์ตี้เต้นรำเริ่มคึกคักหลังเที่ยงคืน"}
{"word":"dance","english":"I’m taking dance lessons to impress my date.","thai":"ฉันกำลังเรียนเต้นเพื่อสร้างความประทับใจให้เดตของฉัน"}
{"word":"lessons","english":"Piano lessons are boosting my confidence.","thai":"บทเรียนเปียโนช่วยเพิ่มความมั่นใจให้ฉัน"}
{"word":"confidence","english":"Her confidence shines in every presentation.","thai":"ความมั่นใจของเธอเปล่งประกายในทุกการนำเสนอ"}
{"word":"presentation","english":"I nailed my presentation at the conference.","thai":"ฉันทำการนำเสนอที่งานประชุมได้เยี่ยมมาก"}
{"word":"conference","english":"The tech conference had some cool speakers.","thai":"งานประชุมเทคโนโลยีมีวิทยากรเจ๋งๆ"}
{"word":"cool","english":"This new app is super cool to use.","thai":"แอปใหม่นี้ใช้งานเจ๋งมาก"}
{"word":"app","english":"I downloaded an app for meditation practice.","thai":"ฉันดาวน์โหลดแอปสำหรับฝึกสมาธิ"}
{"word":"meditation","english":"Meditation helps me stay calm under pressure.","thai":"การทำสมาธิช่วยให้ฉันสงบเมื่อเจอแรงกดดัน"}
{"word":"calm","english":"The calm forest trail was so peaceful.","thai":"เส้นทางป่าที่เงียบสงบนั้นสงบมาก"}
{"word":"forest","english":"We got lost in the forest during our hike.","thai":"เราหลงอยู่ในป่าระหว่างเดินป่า"}
{"word":"lost","english":"I lost my keys at the gym yesterday.","thai":"ฉันทำกุญแจหายที่ยิมเมื่อวาน"}
{"word":"gym","english":"Hitting the gym early feels so energizing.","thai":"การไปยิมแต่เช้ารู้สึกเติมพลังมาก"}
{"word":"energizing","english":"A good workout is always so energizing.","thai":"การออกกำลังกายที่ดีทำให้รู้สึกมีพลังเสมอ"}
{"word":"workout","english":"My workout routine keeps me in shape.","thai":"ตารางออกกำลังกายของฉันช่วยให้ฉันรักษาหุ่น"}
{"word":"shape","english":"This new diet is getting me in shape.","thai":"อาหารใหม่นี้ช่วยให้ฉันมีหุ่นดี"}
{"word":"diet","english":"I’m trying a vegan diet for a month.","thai":"ฉันกำลังลองกินอาหารวีแกนเป็นเวลาหนึ่งเดือน"}
{"word":"vegan","english":"Vegan recipes can be surprisingly delicious.","thai":"สูตรอาหารวีแกนอร่อยได้อย่างน่าประหลาดใจ"}
{"word":"recipes","english":"I found some great recipes online.","thai":"ฉันเจอสูตรอาหารดีๆ บนออนไลน์"}
{"word":"online","english":"Shopping online saves me so much time.","thai":"การช้อปปิ้งออนไลน์ช่วยประหยัดเวลาได้เยอะ"}
{"word":"time","english":"I need to make time for my yoga class.","thai":"ฉันต้องหาเวลาไปคลาสโยคะ"}
{"word":"class","english":"The cooking class was a total hit.","thai":"คลาสทำอาหารนั้นได้รับความนิยมสุดๆ"}
{"word":"hit","english":"Her new song is a massive hit.","thai":"เพลงใหม่ของเธอฮิตมาก"}
{"word":"song","english":"I can’t stop singing that catchy song.","thai":"ฉันหยุดร้องเพลงติดหูนั้นไม่ได้"}
{"word":"catchy","english":"The ad’s catchy slogan stuck with me.","thai":"สโลแกนติดหูของโฆษณานั้นติดอยู่ในใจฉัน"}
{"word":"slogan","english":"The brand’s new slogan is super clever.","thai":"สโลแกนใหม่ของแบรนด์นั้นฉลาดมาก"}
