{"word": "add up", "english": "The numbers just don’t add up in this budget.", "thai": "ตัวเลขในงบประมาณนี้มันไม่สมเหตุสมผลเลย"}
{"word": "add up", "english": "Her excuses didn’t add up, so I got suspicious.", "thai": "คำแก้ตัวของเธอมันไม่สมเหตุสมผลเลย ฉันเลยเริ่มสงสัย"}
{"word": "add up", "english": "Let’s add up the scores to see who won.", "thai": "มาบวกคะแนนกันดูว่าใครชนะ"}
{"word": "add up", "english": "The receipts add up to more than I expected.", "thai": "ใบเสร็จรวมกันแล้วมากกว่าที่ฉันคาดไว้"}
{"word": "add up", "english": "His story doesn’t add up with the evidence.", "thai": "เรื่องราวของเขาไม่สอดคล้องกับหลักฐาน"}
{"word": "add up", "english": "We need to add up all the expenses for the trip.", "thai": "เราต้องบวกรายจ่ายทั้งหมดสำหรับทริปนี้"}
{"word": "add up", "english": "The points you made don’t really add up.", "thai": "ประเด็นที่คุณพูดมันไม่ค่อยสมเหตุสมผล"}
{"word": "add up", "english": "Can you add up the total cost of these items?", "thai": "คุณช่วยบวกราคารวมของสิ่งของเหล่านี้ได้ไหม"}
{"word": "add up", "english": "The hours I worked this week add up to forty.", "thai": "ชั่วโมงที่ฉันทำงานสัปดาห์นี้รวมได้สี่สิบชั่วโมง"}
{"word": "add up", "english": "It’s weird how her timeline doesn’t add up.", "thai": "มันแปลกที่ไทม์ไลน์ของเธอมันไม่สมเหตุสมผล"}
{"word": "add up", "english": "Let’s add up the votes to find the winner.", "thai": "มาบวกคะแนนโหวตเพื่อหาผู้ชนะกัน"}
{"word": "add up", "english": "The savings will add up over time if you’re consistent.", "thai": "เงินออมจะเพิ่มขึ้นเมื่อเวลาผ่านไปถ้าคุณทำสม่ำเสมอ"}
{"word": "add up", "english": "His explanation doesn’t add up to me.", "thai": "คำอธิบายของเขาไม่สมเหตุสมผลสำหรับฉัน"}
{"word": "add up", "english": "The calories in this meal add up quickly.", "thai": "แคลอรี่ในมื้อนี้เพิ่มขึ้นอย่างรวดเร็ว"}
{"word": "add up", "english": "I tried to add up the figures, but I got confused.", "thai": "ฉันพยายามบวกตัวเลข แต่ฉันสับสน"}
{"word": "add up", "english": "The clues don’t add up to a clear conclusion.", "thai": "เบาะแสไม่นำไปสู่ข้อสรุปที่ชัดเจน"}
{"word": "add up", "english": "Small changes can add up to big results.", "thai": "การเปลี่ยนแปลงเล็กๆ น้อยๆ สามารถรวมกันเป็นผลลัพธ์ใหญ่ได้"}
{"word": "add up", "english": "The costs of this project are starting to add up.", "thai": "ค่าใช้จ่ายของโปรเจกต์นี้เริ่มรวมกันมากขึ้น"}
{"word": "add up", "english": "Her version of the story doesn’t add up.", "thai": "เรื่องราวในเวอร์ชันของเธอมันไม่สมเหตุสมผล"}
{"word": "add up", "english": "Let’s add up the tips we got tonight.", "thai": "มาบวกทิปที่เราได้คืนนี้กัน"}
{"word": "add up", "english": "The benefits of this plan really add up.", "thai": "ประโยชน์ของแผนนี้มันรวมกันเยอะจริงๆ"}
{"word": "add up", "english": "The miles we walked today add up to ten.", "thai": "ไมล์ที่เราเดินวันนี้รวมได้สิบไมล์"}
{"word": "add up", "english": "Your argument doesn’t add up logically.", "thai": "ข้อโต้แย้งของคุณมันไม่สมเหตุสมผลในเชิงตรรกะ"}
{"word": "add up", "english": "The donations will add up if everyone chips in.", "thai": "เงินบริจาคจะรวมกันได้ถ้าทุกคนช่วยสมทบ"}
{"word": "add up", "english": "The evidence doesn’t add up to a conviction.", "thai": "หลักฐานไม่เพียงพอที่จะนำไปสู่การตัดสินลงโทษ"}
{"word": "add up", "english": "Let’s add up the hours we spent on this.", "thai": "มาบวกชั่วโมงที่เราใช้ไปกับเรื่องนี้กัน"}
{"word": "add up", "english": "The numbers in this report don’t add up right.", "thai": "ตัวเลขในรายงานนี้มันบวกไม่ถูกต้อง"}
{"word": "add up", "english": "Her reasons for leaving just don’t add up.", "thai": "เหตุผลที่เธอจากไปมันไม่สมเหตุสมผลเลย"}
{"word": "add up", "english": "The groceries add up to a hundred bucks.", "thai": "ของชำรวมกันได้ร้อยเหรียญ"}
{"word": "add up", "english": "The pieces of this puzzle don’t add up.", "thai": "ชิ้นส่วนของปริศนานี้มันไม่ลงตัว"}
{"word": "add up", "english": "Saving a little each day can add up.", "thai": "การออมเล็กน้อยทุกวันสามารถรวมกันได้เยอะ"}
{"word": "add up", "english": "The facts in his statement don’t add up.", "thai": "ข้อเท็จจริงในคำพูดของเขาไม่สมเหตุสมผล"}
{"word": "add up", "english": "Let’s add up the points from the game.", "thai": "มาบวกคะแนนจากเกมนี้กัน"}
{"word": "add up", "english": "The expenses for the party add up fast.", "thai": "ค่าใช้จ่ายสำหรับงานปาร์ตี้รวมกันเร็วมาก"}
{"word": "add up", "english": "Her story about last night doesn’t add up.", "thai": "เรื่องราวของเธอเกี่ยวกับเมื่อคืนไม่สมเหตุสมผล"}
{"word": "add up", "english": "The totals don’t add up on this spreadsheet.", "thai": "ยอดรวมในสเปรดชีตนี้มันบวกไม่ถูก"}
{"word": "add up", "english": "Small efforts add up to big changes.", "thai": "ความพยายามเล็กๆ รวมกันเป็นการเปลี่ยนแปลงใหญ่"}
{"word": "add up", "english": "The hours you put in really add up.", "thai": "ชั่วโมงที่คุณทุ่มเทมันรวมกันเยอะจริงๆ"}
{"word": "add up", "english": "His claims don’t add up with the facts.", "thai": "คำกล่าวอ้างของเขาไม่สอดคล้องกับข้อเท็จจริง"}
{"word": "add up", "english": "The bill will add up if we order more.", "thai": "บิลจะเพิ่มขึ้นถ้าเราสั่งเพิ่ม"}
{"word": "add up", "english": "The numbers in this equation don’t add up.", "thai": "ตัวเลขในสมการนี้มันบวกไม่ลงตัว"}
{"word": "add up", "english": "Let’s add up the miles we drove today.", "thai": "มาบวกไมล์ที่เราขับวันนี้กัน"}
{"word": "add up", "english": "The inconsistencies in her story add up.", "thai": "ความไม่สอดคล้องในเรื่องราวของเธอมันรวมกันเยอะ"}
{"word": "add up", "english": "The savings from coupons can really add up.", "thai": "เงินที่ประหยัดจากคูปองสามารถรวมกันได้เยอะ"}
{"word": "add up", "english": "The data points don’t add up to a trend.", "thai": "จุดข้อมูลไม่นำไปสู่แนวโน้ม"}
{"word": "add up", "english": "Let’s add up the costs before deciding.", "thai": "มาบวกราคาก่อนตัดสินใจกัน"}
{"word": "add up", "english": "Her explanation didn’t add up at all.", "thai": "คำอธิบายของเธอมันไม่สมเหตุสมผลเลย"}
{"word": "add up", "english": "The minutes we waited add up to an hour.", "thai": "นาทีที่เรารอรวมได้หนึ่งชั่วโมง"}
{"word": "add up", "english": "The benefits of recycling really add up.", "thai": "ประโยชน์ของการรีไซเคิลมันรวมกันเยอะจริงๆ"}
{"word": "add up", "english": "His math doesn’t add up in this problem.", "thai": "คณิตศาสตร์ของเขาในโจทย์นี้มันบวกไม่ถูก"}
{"word": "add up", "english": "The costs of repairs are starting to add up.", "thai": "ค่าใช้จ่ายในการซ่อมเริ่มรวมกันมากขึ้น"}
{"word": "add up", "english": "The details in his alibi don’t add up.", "thai": "รายละเอียดในคำแก้ตัวของเขาไม่สมเหตุสมผล"}
{"word": "add up", "english": "Let’s add up the donations we collected.", "thai": "มาบวกเงินบริจาคที่เราเก็บได้กัน"}
{"word": "add up", "english": "The hours spent studying will add up.", "thai": "ชั่วโมงที่ใช้ในการเรียนจะรวมกันเยอะ"}
{"word": "add up", "english": "The numbers on this chart don’t add up.", "thai": "ตัวเลขในแผนภูมินี้มันบวกไม่ถูก"}
{"word": "add up", "english": "Her lies are starting to add up.", "thai": "คำโกหกของเธอเริ่มรวมกันมากขึ้น"}
{"word": "add up", "english": "The savings from this deal add up nicely.", "thai": "เงินที่ประหยัดจากดีลนี้รวมกันได้ดี"}
{"word": "add up", "english": "The evidence doesn’t add up to a crime.", "thai": "หลักฐานไม่เพียงพอที่จะเป็นคดีอาชญากรรม"}
{"word": "add up", "english": "Let’s add up the items in the cart.", "thai": "มาบวกจำนวนของในตะกร้ากัน"}
{"word": "add up", "english": "The hours we worked add up to overtime.", "thai": "ชั่วโมงที่เราทำงานรวมได้เป็นโอที"}
{"word": "add up", "english": "His excuses don’t add up to anything believable.", "thai": "คำแก้ตัวของเขาไม่สมเหตุสมผลเลยสักนิด"}
{"word": "add up", "english": "The costs of eating out really add up.", "thai": "ค่าใช้จ่ายในการกินข้าวนอกบ้านมันรวมกันเยอะ"}
{"word": "add up", "english": "The clues in this case don’t add up.", "thai": "เบาะแสในคดีนี้มันไม่ลงตัว"}
{"word": "add up", "english": "Small savings add up over the years.", "thai": "เงินออมเล็กๆ รวมกันได้เยอะเมื่อผ่านไปหลายปี"}
{"word": "add up", "english": "The numbers in your calculation don’t add up.", "thai": "ตัวเลขในการคำนวณของคุณมันบวกไม่ถูก"}
{"word": "add up", "english": "Her story about the accident doesn’t add up.", "thai": "เรื่องราวของเธอเกี่ยวกับอุบัติเหตุไม่สมเหตุสมผล"}
{"word": "add up", "english": "Let’s add up the scores from all rounds.", "thai": "มาบวกคะแนนจากทุกยกกัน"}
{"word": "add up", "english": "The expenses for this month add up quickly.", "thai": "ค่าใช้จ่ายสำหรับเดือนนี้รวมกันเร็วมาก"}
{"word": "add up", "english": "The facts don’t add up to his version.", "thai": "ข้อเท็จจริงไม่สอดคล้องกับเวอร์ชันของเขา"}
{"word": "add up", "english": "The tips from today add up to a lot.", "thai": "ทิปจากวันนี้รวมกันได้เยอะ"}
{"word": "add up", "english": "The inconsistencies in his report add up.", "thai": "ความไม่สอดคล้องในรายงานของเขามันรวมกันเยอะ"}
{"word": "add up", "english": "The savings from this plan will add up.", "thai": "เงินที่ประหยัดจากแผนนี้จะรวมกันได้เยอะ"}
{"word": "add up", "english": "The numbers in this puzzle don’t add up.", "thai": "ตัวเลขในปริศนานี้มันบวกไม่ลงตัว"}
{"word": "add up", "english": "Let’s add up the total hours worked.", "thai": "มาบวกชั่วโมงทำงานทั้งหมดกัน"}
{"word": "add up", "english": "Her explanation of the delay doesn’t add up.", "thai": "คำอธิบายของเธอเกี่ยวกับความล่าช้ามันไม่สมเหตุสมผล"}
{"word": "add up", "english": "The costs of this hobby add up over time.", "thai": "ค่าใช้จ่ายของงานอดิเรกนี้รวมกันเยอะเมื่อเวลาผ่านไป"}
{"word": "add up", "english": "The points in your argument don’t add up.", "thai": "ประเด็นในข้อโต้แย้งของคุณมันไม่สมเหตุสมผล"}
{"word": "add up", "english": "The receipts add up to more than my budget.", "thai": "ใบเสร็จรวมกันแล้วมากกว่างบของฉัน"}
{"word": "add up", "english": "The evidence doesn’t add up to his story.", "thai": "หลักฐานไม่สอดคล้องกับเรื่องราวของเขา"}
{"word": "add up", "english": "Let’s add up the calories in this meal.", "thai": "มาบวกแคลอรี่ในมื้อนี้กัน"}
{"word": "add up", "english": "The hours we spent add up to a full day.", "thai": "ชั่วโมงที่เราใช้ไปรวมได้หนึ่งวันเต็ม"}
{"word": "add up", "english": "The benefits of this choice really add up.", "thai": "ประโยชน์ของตัวเลือกนี้มันรวมกันเยอะจริงๆ"}
{"word": "add up", "english": "His math errors always add up in tests.", "thai": "ข้อผิดพลาดทางคณิตศาสตร์ของเขามักจะรวมกันเยอะในการสอบ"}
{"word": "add up", "english": "The costs of maintenance are starting to add up.", "thai": "ค่าใช้จ่ายในการบำรุงรักษาเริ่มรวมกันมากขึ้น"}
{"word": "add up", "english": "Her reasons for quitting don’t add up.", "thai": "เหตุผลที่เธอลาออกมันไม่สมเหตุสมผล"}
{"word": "add up", "english": "Let’s add up the money we saved this month.", "thai": "มาบวกเงินที่เราประหยัดได้เดือนนี้กัน"}
{"word": "add up", "english": "The clues don’t add up to a solution.", "thai": "เบาะแสไม่นำไปสู่คำตอบ"}
{"word": "add up", "english": "The time spent on this adds up quickly.", "thai": "เวลาที่ใช้ไปกับเรื่องนี้รวมกันเร็วมาก"}
{"word": "add up", "english": "His story about the trip doesn’t add up.", "thai": "เรื่องราวของเขาเกี่ยวกับทริปนี้ไม่สมเหตุสมผล"}
{"word": "add up", "english": "The savings from this habit will add up.", "thai": "เงินที่ประหยัดจากนิสัยนี้จะรวมกันได้เยอะ"}
{"word": "add up", "english": "The numbers in this budget don’t add up.", "thai": "ตัวเลขในงบประมาณนี้มันบวกไม่ถูก"}
{"word": "add up", "english": "The points you raised don’t add up clearly.", "thai": "ประเด็นที่คุณหยิบยกมามันไม่สมเหตุสมผลชัดเจน"}
{"word": "add up", "english": "The expenses for the event add up fast.", "thai": "ค่าใช้จ่ายสำหรับงานนี้รวมกันเร็วมาก"}
{"word": "add up", "english": "Her account of the meeting doesn’t add up.", "thai": "คำบอกเล่าของเธอเกี่ยวกับการประชุมไม่สมเหตุสมผล"}
{"word": "add up", "english": "Let’s add up the votes from the poll.", "thai": "มาบวกคะแนนจากโพลนี้กัน"}
{"word": "add up", "english": "The benefits of this strategy add up over time.", "thai": "ประโยชน์ของกลยุทธ์นี้รวมกันได้เยอะเมื่อเวลาผ่านไป"}
{"word": "add up", "english": "The figures in this analysis don’t add up.", "thai": "ตัวเลขในการวิเคราะห์นี้มันบวกไม่ถูก"}
{"word": "add up", "english": "The time we spent waiting adds up to hours.", "thai": "เวลาที่เรารอรวมกันได้หลายชั่วโมง"}
{"word": "add up", "english": "Her excuses for being late don’t add up.", "thai": "คำแก้ตัวของเธอที่มาสายมันไม่สมเหตุสมผล"}
{"word": "add up", "english": "The costs of this vacation will add up.", "thai": "ค่าใช้จ่ายของวันหยุดนี้จะรวมกันเยอะ"}
{"word": "ask out", "english": "I’m too shy to ask her out.", "thai": "ฉันเขินเกินกว่าจะชวนเธอออกไป"}
{"word": "ask out", "english": "He finally got the courage to ask her out.", "thai": "ในที่สุดเขาก็กล้าชวนเธอออกไป"}
{"word": "ask out", "english": "Did you ask her out on a date?", "thai": "คุณชวนเธอออกเดทหรือยัง"}
{"word": "ask out", "english": "She’s waiting for him to ask her out.", "thai": "เธอกำลังรอให้เขาชวนเธอออกไป"}
{"word": "ask out", "english": "I’m planning to ask him out this weekend.", "thai": "ฉันวางแผนจะชวนเขาออกไปสุดสัปดาห์นี้"}
{"word": "ask out", "english": "He was too nervous to ask her out.", "thai": "เขาเกร็งเกินกว่าจะชวนเธอออกไป"}
{"word": "ask out", "english": "Why don’t you just ask her out already?", "thai": "ทำไมคุณไม่ชวนเธอออกไปสักทีล่ะ"}
{"word": "ask out", "english": "She said yes when I asked her out!", "thai": "เธอตอบตกลงตอนฉันชวนเธอออกไป!"}
{"word": "ask out", "english": "I’m thinking of asking him out for coffee.", "thai": "ฉันกำลังคิดจะชวนเขาออกไปดื่มกาแฟ"}
{"word": "ask out", "english": "He asked her out, but she said no.", "thai": "เขาชวนเธอออกไป แต่เธอปฏิเสธ"}
{"word": "ask out", "english": "Have you ever asked someone out before?", "thai": "คุณเคยชวนใครออกไปบ้างไหม"}
{"word": "ask out", "english": "She’s hoping he’ll ask her out soon.", "thai": "เธอหวังว่าเขาจะชวนเธอออกไปเร็วๆ นี้"}
{"word": "ask out", "english": "I don’t know how to ask her out.", "thai": "ฉันไม่รู้ว่าจะชวนเธอออกไปยังไง"}
{"word": "ask out", "english": "He asked her out to the movies.", "thai": "เขาชวนเธอออกไปดูหนัง"}
{"word": "ask out", "english": "She was thrilled when he asked her out.", "thai": "เธอดีใจมากตอนเขาชวนเธอออกไป"}
{"word": "ask out", "english": "I’m scared to ask him out in person.", "thai": "ฉันกลัวที่จะชวนเขาออกไปแบบตัวต่อตัว"}
{"word": "ask out", "english": "He asked her out over text.", "thai": "เขาชวนเธอออกไปผ่านข้อความ"}
{"word": "ask out", "english": "Why is it so hard to ask someone out?", "thai": "ทำไมการชวนใครสักคนออกไปมันยากจัง"}
{"word": "ask out", "english": "She asked him out to dinner tonight.", "thai": "เธอชวนเขาออกไปกินข้าวเย็นคืนนี้"}
{"word": "ask out", "english": "I’m going to ask her out tomorrow.", "thai": "ฉันจะชวนเธอออกไปพรุ่งนี้"}
{"word": "ask out", "english": "He didn’t expect her to ask him out.", "thai": "เขาไม่คิดว่าเธอจะชวนเขาออกไป"}
{"word": "ask out", "english": "I want to ask her out but I’m nervous.", "thai": "ฉันอยากชวนเธอออกไปแต่ฉันตื่นเต้น"}
{"word": "ask out", "english": "She’s too shy to ask him out first.", "thai": "เธอเขินเกินกว่าจะชวนเขาออกไปก่อน"}
{"word": "ask out", "english": "He asked her out for a second date.", "thai": "เขาชวนเธอออกไปเดทครั้งที่สอง"}
{"word": "ask out", "english": "I’m not sure if I should ask her out.", "thai": "ฉันไม่แน่ใจว่าควรชวนเธอออกไปดีไหม"}
{"word": "ask out", "english": "She asked him out to a concert.", "thai": "เธอชวนเขาออกไปดูคอนเสิร์ต"}
{"word": "ask out", "english": "He’s been wanting to ask her out for weeks.", "thai": "เขาอยากชวนเธอออกไปมาหลายสัปดาห์แล้ว"}
{"word": "ask out", "english": "I finally asked her out and she said yes!", "thai": "ในที่สุดฉันก็ชวนเธอออกไปและเธอตอบตกลง!"}
{"word": "ask out", "english": "He’s too afraid to ask her out.", "thai": "เขากลัวเกินกว่าจะชวนเธอออกไป"}
{"word": "ask out", "english": "She asked him out on a whim.", "thai": "เธอชวนเขาออกไปแบบไม่ทันคิด"}
{"word": "ask out", "english": "I don’t want to ask her out yet.", "thai": "ฉันยังไม่อยากชวนเธอออกไปตอนนี้"}
{"word": "ask out", "english": "He asked her out to a fancy restaurant.", "thai": "เขาชวนเธอออกไปที่ร้านอาหารหรู"}
{"word": "ask out", "english": "She’s nervous about asking him out.", "thai": "เธอตื่นเต้นที่จะชวนเขาออกไป"}
{"word": "ask out", "english": "I’m going to ask him out after class.", "thai": "ฉันจะชวนเขาออกไปหลังเลิกเรียน"}
{"word": "ask out", "english": "He asked her out, but she’s already taken.", "thai": "เขาชวนเธอออกไป แต่เธอมีแฟนแล้ว"}
{"word": "ask out", "english": "She asked him out for drinks.", "thai": "เธอชวนเขาออกไปดื่มอะไรสักหน่อย"}
{"word": "ask out", "english": "I’m too scared to ask her out right now.", "thai": "ฉันกลัวเกินกว่าจะชวนเธอออกไปตอนนี้"}
{"word": "ask out", "english": "He asked her out to the school dance.", "thai": "เขาชวนเธอออกไปงานเต้นรำของโรงเรียน"}
{"word": "ask out", "english": "She’s waiting for the right moment to ask him out.", "thai": "เธอกำลังรอจังหวะเหมาะที่จะชวนเขาออกไป"}
{"word": "ask out", "english": "I asked her out, but she wasn’t interested.", "thai": "ฉันชวนเธอออกไป แต่เธอไม่สนใจ"}
{"word": "ask out", "english": "He’s planning to ask her out next week.", "thai": "เขาวางแผนจะชวนเธอออกไปสัปดาห์หน้า"}
{"word": "ask out", "english": "She asked him out to a picnic.", "thai": "เธอชวนเขาออกไปปิกนิก"}
{"word": "ask out", "english": "I don’t know how to ask him out without sounding awkward.", "thai": "ฉันไม่รู้จะชวนเขาออกไปยังไงโดยไม่ดูเก้ๆ กังๆ"}
{"word": "ask out", "english": "He asked her out in front of everyone.", "thai": "เขาชวนเธอออกไปต่อหน้าทุกคน"}
{"word": "ask out", "english": "She’s too nervous to ask him out herself.", "thai": "เธอตื่นเต้นเกินกว่าจะชวนเขาออกไปเอง"}
{"word": "ask out", "english": "I’m going to ask her out to a game.", "thai": "ฉันจะชวนเธอออกไปดูการแข่งขัน"}
{"word": "ask out", "english": "He asked her out, but she had other plans.", "thai": "เขาชวนเธอออกไป แต่เธอมีแผนอื่นแล้ว"}
{"word": "ask out", "english": "She asked him out to a new café.", "thai": "เธอชวนเขาออกไปที่คาเฟ่ใหม่"}
{"word": "ask out", "english": "I’m not ready to ask her out yet.", "thai": "ฉันยังไม่พร้อมที่จะชวนเธอออกไป"}
{"word": "ask out", "english": "He asked her out to a comedy show.", "thai": "เขาชวนเธอออกไปดูโชว์ตลก"}
{"word": "ask out", "english": "She’s been hinting for him to ask her out.", "thai": "เธอส่งสัญญาณให้เขาชวนเธอออกไป"}
{"word": "ask out", "english": "I’m too shy to ask him out in person.", "thai": "ฉันเขินเกินกว่าจะชวนเขาออกไปแบบตัวต่อตัว"}
{"word": "ask out", "english": "He asked her out to a local festival.", "thai": "เขาชวนเธอออกไปงานเทศกาลท้องถิ่น"}
{"word": "ask out", "english": "She asked him out to a hiking trip.", "thai": "เธอชวนเขาออกไปเดินป่า"}
{"word": "ask out", "english": "I’m nervous about asking her out tomorrow.", "thai": "ฉันตื่นเต้นที่จะชวนเธอออกไปพรุ่งนี้"}
{"word": "ask out", "english": "He asked her out to a museum.", "thai": "เขาชวนเธอออกไปที่พิพิธภัณฑ์"}
{"word": "ask out", "english": "She’s too scared to ask him out first.", "thai": "เธอกลัวเกินกว่าจะชวนเขาออกไปก่อน"}
{"word": "ask out", "english": "I’m going to ask him out to a party.", "thai": "ฉันจะชวนเขาออกไปงานปาร์ตี้"}
{"word": "ask out", "english": "He asked her out, but she’s not ready.", "thai": "เขาชวนเธอออกไป แต่เธอยังไม่พร้อม"}
{"word": "ask out", "english": "She asked him out to an art gallery.", "thai": "เธอชวนเขาออกไปที่หอศิลป์"}
{"word": "ask out", "english": "I don’t want to ask her out over text.", "thai": "ฉันไม่อยากชวนเธอออกไปผ่านข้อความ"}
{"word": "ask out", "english": "He asked her out to a cooking class.", "thai": "เขาชวนเธอออกไปเรียนทำอาหาร"}
{"word": "ask out", "english": "She’s hoping he’ll ask her out to prom.", "thai": "เธอหวังว่าเขาจะชวนเธอออกไปงานพรอม"}
{"word": "ask out", "english": "I’m too nervous to ask him out today.", "thai": "ฉันตื่นเต้นเกินกว่าจะชวนเขาออกไปวันนี้"}
{"word": "ask out", "english": "He asked her out to a karaoke night.", "thai": "เขาชวนเธอออกไปร้องคาราโอเกะ"}
{"word": "ask out", "english": "She asked him out for a walk in the park.", "thai": "เธอชวนเขาออกไปเดินเล่นในสวนสาธารณะ"}
{"word": "ask out", "english": "I’m not sure when to ask her out.", "thai": "ฉันไม่แน่ใจว่าจะชวนเธอออกไปเมื่อไหร่"}
{"word": "ask out", "english": "He asked her out to a trivia night.", "thai": "เขาชวนเธอออกไปเล่นเกมตอบคำถาม"}
{"word": "ask out", "english": "She’s waiting for him to ask her out again.", "thai": "เธอกำลังรอให้เขาชวนเธอออกไปอีกครั้ง"}
{"word": "ask out", "english": "I’m going to ask him out to a movie.", "thai": "ฉันจะชวนเขาออกไปดูหนัง"}
{"word": "ask out", "english": "He asked her out, but she’s busy.", "thai": "เขาชวนเธอออกไป แต่เธอยุ่ง"}
{"word": "ask out", "english": "She asked him out to a book club.", "thai": "เธอชวนเขาออกไปที่ชมรมหนังสือ"}
{"word": "ask out", "english": "I’m too afraid to ask her out yet.", "thai": "ฉันกลัวเกินกว่าจะชวนเธอออกไปตอนนี้"}
{"word": "ask out", "english": "He asked her out to a dance class.", "thai": "เขาชวนเธอออกไปเรียนเต้น"}
{"word": "ask out", "english": "She’s nervous about asking him out first.", "thai": "เธอตื่นเต้นที่จะชวนเขาออกไปก่อน"}
{"word": "ask out", "english": "I’m going to ask her out to a concert.", "thai": "ฉันจะชวนเธอออกไปดูคอนเสิร์ต"}
{"word": "ask out", "english": "He asked her out to a new restaurant.", "thai": "เขาชวนเธอออกไปที่ร้านอาหารใหม่"}
{"word": "ask out", "english": "She asked him out to a beach day.", "thai": "เธอชวนเขาออกไปเที่ยวชายหาด"}
{"word": "ask out", "english": "I don’t know if I should ask him out.", "thai": "ฉันไม่รู้ว่าควรชวนเขาออกไปดีไหม"}
{"word": "ask out", "english": "He asked her out to a comedy club.", "thai": "เขาชวนเธอออกไปที่คลับตลก"}
{"word": "ask out", "english": "She’s too shy to ask him out herself.", "thai": "เธอเขินเกินกว่าจะชวนเขาออกไปเอง"}
{"word": "ask out", "english": "I’m going to ask her out to a festival.", "thai": "ฉันจะชวนเธอออกไปงานเทศกาล"}
{"word": "ask out", "english": "He asked her out, but she declined.", "thai": "เขาชวนเธอออกไป แต่เธอปฏิเสธ"}
{"word": "ask out", "english": "She asked him out to a wine tasting.", "thai": "เธอชวนเขาออกไปชิมไวน์"}
{"word": "ask out", "english": "I’m nervous to ask her out in person.", "thai": "ฉันตื่นเต้นที่จะชวนเธอออกไปแบบตัวต่อตัว"}
{"word": "ask out", "english": "He asked her out to a bowling night.", "thai": "เขาชวนเธอออกไปเล่นโบว์ลิ่ง"}
{"word": "ask out", "english": "She’s hoping he’ll ask her out to dinner.", "thai": "เธอหวังว่าเขาจะชวนเธอออกไปกินข้าวเย็น"}
{"word": "ask out", "english": "I’m too scared to ask him out yet.", "thai": "ฉันกลัวเกินกว่าจะชวนเขาออกไปตอนนี้"}
{"word": "ask out", "english": "He asked her out to a local fair.", "thai": "เขาชวนเธอออกไปงานแฟร์ท้องถิ่น"}
{"word": "ask out", "english": "She asked him out to a skating rink.", "thai": "เธอชวนเขาออกไปที่ลานสเก็ต"}
{"word": "ask out", "english": "I’m not sure how to ask her out.", "thai": "ฉันไม่แน่ใจว่าจะชวนเธอออกไปยังไง"}
{"word": "ask out", "english": "He asked her out to a rooftop bar.", "thai": "เขาชวนเธอออกไปที่บาร์บนดาดฟ้า"}
{"word": "ask out", "english": "She’s waiting for him to ask her out first.", "thai": "เธอกำลังรอให้เขาชวนเธอออกไปก่อน"}
{"word": "ask out", "english": "I’m going to ask him out to a play.", "thai": "ฉันจะชวนเขาออกไปดูการแสดง"}
{"word": "ask out", "english": "He asked her out, but she’s not sure.", "thai": "เขาชวนเธอออกไป แต่เธอยังไม่แน่ใจ"}
{"word": "ask out", "english": "She asked him out to a farmer’s market.", "thai": "เธอชวนเขาออกไปที่ตลาดนัดเกษตรกร"}
{"word": "ask out", "english": "I’m too nervous to ask her out yet.", "thai": "ฉันตื่นเต้นเกินกว่าจะชวนเธอออกไปตอนนี้"}
{"word": "ask out", "english": "He asked her out to a jazz club.", "thai": "เขาชวนเธอออกไปที่คลับแจ๊ส"}
{"word": "ask out", "english": "She’s scared to ask him out herself.", "thai": "เธอกลัวที่จะชวนเขาออกไปเอง"}
{"word": "ask out", "english": "I’m going to ask her out to a zoo.", "thai": "ฉันจะชวนเธอออกไปที่สวนสัตว์"}
{"word": "ask out", "english": "He asked her out to a cooking workshop.", "thai": "เขาชวนเธอออกไปที่เวิร์กช็อปทำอาหาร"}
{"word": "calm down", "english": "You need to calm down before we talk.", "thai": "คุณต้องใจเย็นก่อนที่เราจะคุยกัน"}
{"word": "calm down", "english": "Hey, just calm down, everything’s okay.", "thai": "เฮ้ ใจเย็นๆ ทุกอย่างโอเค"}
{"word": "calm down", "english": "I told her to calm down, but she’s still upset.", "thai": "ฉันบอกให้เธอใจเย็น แต่เธอยังคงโกรธอยู่"}
{"word": "calm down", "english": "Can you please calm down and explain this?", "thai": "ช่วยใจเย็นแล้วอธิบายเรื่องนี้หน่อยได้ไหม"}
{"word": "calm down", "english": "He needs to calm down before he makes things worse.", "thai": "เขาต้องใจเย็นก่อนที่เขาจะทำให้เรื่องแย่ลง"}
{"word": "calm down", "english": "Just take a deep breath and calm down.", "thai": "หายใจลึกๆ แล้วใจเย็นลงหน่อย"}
{"word": "calm down", "english": "She was yelling, so I told her to calm down.", "thai": "เธอตะโกน ฉันเลยบอกให้เธอใจเย็น"}
{"word": "calm down", "english": "Calm down, it’s not worth getting mad over.", "thai": "ใจเย็นๆ มันไม่คุ้มที่จะโกรธหรอก"}
{"word": "calm down", "english": "I’m trying to calm down, but it’s hard.", "thai": "ฉันพยายามใจเย็น แต่มันยาก"}
{"word": "calm down", "english": "He told me to calm down, but I was too angry.", "thai": "เขาบอกให้ฉันใจเย็น แต่ฉันโกรธเกินไป"}
{"word": "calm down", "english": "Let’s all calm down and talk this out.", "thai": "ทุกคนใจเย็นกันหน่อยแล้วมาคุยกัน"}
{"word": "calm down", "english": "She needs some time to calm down.", "thai": "เธอต้องการเวลาสักพักเพื่อใจเย็นลง"}
{"word": "calm down", "english": "Calm down, you’re making a scene.", "thai": "ใจเย็นๆ คุณกำลังทำให้เป็นเรื่องใหญ่"}
{"word": "calm down", "english": "I can’t calm down when you’re yelling at me!", "thai": "ฉันใจเย็นไม่ได้หรอกถ้าคุณตะโกนใส่ฉัน!"}
{"word": "calm down", "english": "He’s too worked up to calm down right now.", "thai": "เขาวิตกเกินไปที่จะใจเย็นตอนนี้"}
{"word": "calm down", "english": "Please calm down, we can fix this.", "thai": "กรุณาใจเย็น เราจะแก้ไขได้"}
{"word": "calm down", "english": "She started to calm down after a few minutes.", "thai": "เธอเริ่มใจเย็นลงหลังจากผ่านไปไม่กี่นาที"}
{"word": "calm down", "english": "Calm down, it’s just a small mistake.", "thai": "ใจเย็นๆ มันแค่ความผิดพลาดเล็กๆ"}
{"word": "calm down", "english": "I need you to calm down so we can think clearly.", "thai": "ฉันต้องการให้คุณใจเย็นเพื่อเราจะได้คิดได้ชัดเจน"}
{"word": "calm down", "english": "He was told to calm down by the teacher.", "thai": "ครูบอกให้เขาใจเย็น"}
{"word": "calm down", "english": "Just calm down and listen to me for a second.", "thai": "ใจเย็นแล้วฟังฉันสักครู่"}
{"word": "calm down", "english": "She’s too upset to calm down right now.", "thai": "เธอโกรธเกินไปที่จะใจเย็นตอนนี้"}
{"word": "calm down", "english": "Calm down, it’s not the end of the world.", "thai": "ใจเย็นๆ มันไม่ใช่วันสิ้นโลก"}
{"word": "calm down", "english": "I’m trying to help, but you need to calm down.", "thai": "ฉันพยายามช่วย แต่คุณต้องใจเย็น"}
{"word": "calm down", "english": "He won’t calm down until he gets an apology.", "thai": "เขาจะไม่ใจเย็นจนกว่าจะได้คำขอโทษ"}
{"word": "calm down", "english": "Calm down, we’ll figure this out together.", "thai": "ใจเย็นๆ เราจะแก้ไขเรื่องนี้ด้วยกัน"}
{"word": "calm down", "english": "She took a walk to calm down.", "thai": "เธอไปเดินเล่นเพื่อใจเย็นลง"}
{"word": "calm down", "english": "I told him to calm down, but he ignored me.", "thai": "ฉันบอกให้เขาใจเย็น แต่เขาไม่สนใจ"}
{"word": "calm down", "english": "Calm down, you’re scaring the kids.", "thai": "ใจเย็นๆ คุณกำลังทำให้เด็กๆ กลัว"}
{"word": "calm down", "english": "He needs to calm down before driving.", "thai": "เขาต้องใจเย็นก่อนขับรถ"}
{"word": "calm down", "english": "Please calm down, you’re overreacting.", "thai": "กรุณาใจเย็น คุณกำลังตื่นตูมเกินไป"}
{"word": "calm down", "english": "She tried to calm down by listening to music.", "thai": "เธอพยายามใจเย็นโดยการฟังเพลง"}
{"word": "calm down", "english": "Calm down, it’s just a game.", "thai": "ใจเย็นๆ มันแค่เกม"}
{"word": "calm down", "english": "I can’t calm down when I’m this stressed.", "thai": "ฉันใจเย็นไม่ได้ตอนที่เครียดขนาดนี้"}
{"word": "calm down", "english": "He told her to calm down, but she stormed off.", "thai": "เขาบอกให้เธอใจเย็น แต่เธอเดินหนีไป"}
{"word": "calm down", "english": "Let’s take a break to calm down.", "thai": "มาพักสักหน่อยเพื่อใจเย็นลง"}
{"word": "calm down", "english": "She’s too angry to calm down easily.", "thai": "เธอโกรธเกินไปที่จะใจเย็นได้ง่ายๆ"}
{"word": "calm down", "english": "Calm down, we’re not in a rush.", "thai": "ใจเย็นๆ เราไม่ได้รีบ"}
{"word": "calm down", "english": "I need some time to calm down after that argument.", "thai": "ฉันต้องการเวลาสักหน่อยเพื่อใจเย็นหลังจากการโต้เถียงนั้น"}
{"word": "calm down", "english": "He was shouting, so I told him to calm down.", "thai": "เขาตะโกน ฉันเลยบอกให้เขาใจเย็น"}
{"word": "calm down", "english": "Calm down, you’re going to hurt yourself.", "thai": "ใจเย็นๆ คุณจะทำร้ายตัวเองนะ"}
{"word": "calm down", "english": "She took a deep breath to calm down.", "thai": "เธอหายใจลึกๆ เพื่อใจเย็นลง"}
{"word": "calm down", "english": "I’m trying to calm down, but it’s not easy.", "thai": "ฉันพยายามใจเย็น แต่มันไม่ง่าย"}
{"word": "calm down", "english": "He needs to calm down before the meeting.", "thai": "เขาต้องใจเย็นก่อนการประชุม"}
{"word": "calm down", "english": "Calm down, let’s not make this worse.", "thai": "ใจเย็นๆ อย่าทำให้เรื่องแย่ลง"}
{"word": "calm down", "english": "She was told to calm down by her boss.", "thai": "เจ้านายบอกให้เธอใจเย็น"}
{"word": "calm down", "english": "Just calm down and tell me what happened.", "thai": "ใจเย็นๆ แล้วบอกฉันว่าเกิดอะไรขึ้น"}
{"word": "calm down", "english": "He’s too upset to calm down right now.", "thai": "เขาโกรธเกินไปที่จะใจเย็นตอนนี้"}
{"word": "calm down", "english": "Calm down, it’s not a big deal.", "thai": "ใจเย็นๆ มันไม่ใช่เรื่องใหญ่"}
{"word": "calm down", "english": "I told her to calm down, but she kept crying.", "thai": "ฉันบอกให้เธอใจเย็น แต่เธอยังร้องไห้อยู่"}
{"word": "calm down", "english": "He took a moment to calm down.", "thai": "เขาใช้เวลาสักครู่เพื่อใจเย็นลง"}
{"word": "calm down", "english": "Calm down, you’re getting too worked up.", "thai": "ใจเย็นๆ คุณกำลังตื่นเต้นเกินไป"}
{"word": "calm down", "english": "She needs to calm down before she says something she regrets.", "thai": "เธอต้องใจเย็นก่อนจะพูดอะไรที่อาจเสียใจ"}
{"word": "calm down", "english": "I can’t calm down when I’m this angry!", "thai": "ฉันใจเย็นไม่ได้ตอนที่โกรธขนาดนี้!"}
{"word": "calm down", "english": "He told me to calm down, but I was furious.", "thai": "เขาบอกให้ฉันใจเย็น แต่ฉันโกรธมาก"}
{"word": "calm down", "english": "Calm down, we’ll find a solution.", "thai": "ใจเย็นๆ เราจะหาทางออก"}
{"word": "calm down", "english": "She tried to calm down by meditating.", "thai": "เธอพยายามใจเย็นโดยการนั่งสมาธิ"}
{"word": "calm down", "english": "Please calm down, you’re making me nervous.", "thai": "กรุณาใจเย็น คุณทำให้ฉันตื่นเต้น"}
{"word": "calm down", "english": "He needs to calm down before he talks to her.", "thai": "เขาต้องใจเย็นก่อนจะคุยกับเธอ"}
{"word": "calm down", "english": "Calm down, it’s just a misunderstanding.", "thai": "ใจเย็นๆ มันแค่ความเข้าใจผิด"}
{"word": "calm down", "english": "I’m trying to calm down, but I’m still upset.", "thai": "ฉันพยายามใจเย็น แต่ฉันยังโกรธอยู่"}
{"word": "calm down", "english": "She was told to calm down during the argument.", "thai": "เธอถูกบอกให้ใจเย็นระหว่างการโต้เถียง"}
{"word": "calm down", "english": "Calm down, let’s not fight over this.", "thai": "ใจเย็นๆ อย่าทะเลาะกันเรื่องนี้"}
{"word": "calm down", "english": "He took a nap to calm down.", "thai": "เขางีบเพื่อใจเย็นลง"}
{"word": "calm down", "english": "I told him to calm down, but he was too mad.", "thai": "ฉันบอกให้เขาใจเย็น แต่เขาโกรธเกินไป"}
{"word": "calm down", "english": "Calm down, you’re blowing this out of proportion.", "thai": "ใจเย็นๆ คุณกำลังทำให้มันเกินเลย"}
{"word": "calm down", "english": "She needs some space to calm down.", "thai": "เธอต้องการพื้นที่เพื่อใจเย็นลง"}
{"word": "calm down", "english": "Please calm down, we’re on the same side.", "thai": "กรุณาใจเย็น เราเป็นพวกเดียวกัน"}
{"word": "calm down", "english": "He tried to calm down by counting to ten.", "thai": "เขาพยายามใจเย็นโดยการนับถึงสิบ"}
{"word": "calm down", "english": "Calm down, it’s not worth yelling about.", "thai": "ใจเย็นๆ มันไม่คุ้มที่จะตะโกน"}
{"word": "calm down", "english": "I can’t calm down when everything’s going wrong!", "thai": "ฉันใจเย็นไม่ได้เมื่อทุกอย่างผิดพลาด!"}
{"word": "calm down", "english": "She told him to calm down, but he didn’t listen.", "thai": "เธอบอกให้เขาใจเย็น แต่เขาไม่ฟัง"}
{"word": "calm down", "english": "Calm down, we’ll get through this.", "thai": "ใจเย็นๆ เราจะผ่านมันไปได้"}
{"word": "calm down", "english": "He needs to calm down before he hurts someone.", "thai": "เขาต้องใจเย็นก่อนที่จะทำร้ายใคร"}
{"word": "calm down", "english": "She took a hot bath to calm down.", "thai": "เธออาบน้ำร้อนเพื่อใจเย็นลง"}
{"word": "calm down", "english": "Calm down, you’re stressing everyone out.", "thai": "ใจเย็นๆ คุณกำลังทำให้ทุกคนเครียด"}
{"word": "calm down", "english": "I’m trying to calm down, but it’s tough.", "thai": "ฉันพยายามใจเย็น แต่มันยาก"}
{"word": "calm down", "english": "He was told to calm down by his friend.", "thai": "เพื่อนบอกให้เขาใจเย็น"}
{"word": "calm down", "english": "Calm down, let’s think this through.", "thai": "ใจเย็นๆ มาคิดเรื่องนี้ให้รอบคอบ"}
{"word": "calm down", "english": "She’s too frustrated to calm down now.", "thai": "เธอหงุดหงิดเกินไปที่จะใจเย็นตอนนี้"}
{"word": "calm down", "english": "Please calm down, you’re not helping.", "thai": "กรุณาใจเย็น คุณไม่ได้ช่วยอะไรเลย"}
{"word": "calm down", "english": "He tried to calm down by drinking tea.", "thai": "เขาพยายามใจเย็นโดยการดื่มชา"}
{"word": "calm down", "english": "Calm down, it’s just a little setback.", "thai": "ใจเย็นๆ มันแค่อุปสรรคเล็กๆ"}
{"word": "calm down", "english": "I told her to calm down, but she kept arguing.", "thai": "ฉันบอกให้เธอใจเย็น แต่เธอยังคงเถียง"}
{"word": "calm down", "english": "He needs to calm down before he says something stupid.", "thai": "เขาต้องใจเย็นก่อนจะพูดอะไรโง่ๆ"}
{"word": "calm down", "english": "Calm down, we’re all here to help.", "thai": "ใจเย็นๆ พวกเราทุกคนพร้อมช่วย"}
{"word": "calm down", "english": "She went for a run to calm down.", "thai": "เธอไปวิ่งเพื่อใจเย็นลง"}
{"word": "calm down", "english": "I can’t calm down when you’re being so loud!", "thai": "ฉันใจเย็นไม่ได้เมื่อคุณดังขนาดนี้!"}
{"word": "calm down", "english": "He told her to calm down, but she walked away.", "thai": "เขาบอกให้เธอใจเย็น แต่เธอเดินหนีไป"}
{"word": "calm down", "english": "Calm down, let’s not escalate this.", "thai": "ใจเย็นๆ อย่าทำให้เรื่องนี้บานปลาย"}
{"word": "calm down", "english": "She needs time alone to calm down.", "thai": "เธอต้องการเวลาอยู่คนเดียวเพื่อใจเย็นลง"}
{"word": "calm down", "english": "Please calm down, it’s going to be okay.", "thai": "กรุณาใจเย็น ทุกอย่างจะโอเค"}
{"word": "calm down", "english": "He tried to calm down by watching TV.", "thai": "เขาพยายามใจเย็นโดยการดูทีวี"}
{"word": "calm down", "english": "Calm down, you’re overthinking this.", "thai": "ใจเย็นๆ คุณคิดมากเกินไป"}
{"word": "calm down", "english": "I told him to calm down, but he was too upset.", "thai": "ฉันบอกให้เขาใจเย็น แต่เขาโกรธเกินไป"}
{"word": "calm down", "english": "She’s trying to calm down after the bad news.", "thai": "เธอกำลังพยายามใจเย็นหลังจากได้ข่าวร้าย"}
{"word": "calm down", "english": "Calm down, we can talk this through.", "thai": "ใจเย็นๆ เราคุยกันได้"}
{"word": "calm down", "english": "He needs to calm down before he makes a decision.", "thai": "เขาต้องใจเย็นก่อนตัดสินใจ"}
{"word": "calm down", "english": "Please calm down, you’re upsetting everyone.", "thai": "กรุณาใจเย็น คุณกำลังทำให้ทุกคนไม่สบายใจ"}
{"word": "calm down", "english": "She took a moment to calm down before responding.", "thai": "เธอใช้เวลาสักครู่เพื่อใจเย็นก่อนตอบ"}
{"word": "calm down", "english": "Calm down, it’s not as bad as it seems.", "thai": "ใจเย็นๆ มันไม่ได้แย่อย่างที่คิด"}
{"word": "back off", "english": "Hey, you need to back off, man!", "thai": "เฮ้ คุณต้องถอยไปหน่อยนะ!"}
{"word": "back off", "english": "I told him to back off before things got heated.", "thai": "ฉันบอกให้เขาถอยไปก่อนที่เรื่องจะร้อนขึ้น"}
{"word": "back off", "english": "Just back off and let me handle this.", "thai": "แค่ถอยไปแล้วให้ฉันจัดการเรื่องนี้"}
{"word": "back off", "english": "She yelled at the dog to back off from the food.", "thai": "เธอตะโกนให้สุนัขถอยห่างจากอาหาร"}
{"word": "back off", "english": "If you don't back off, we're going to have a problem.", "thai": "ถ้าคุณไม่ถอยไป เราจะมีปัญหากันนะ"}
{"word": "back off", "english": "Back off, I need some space right now.", "thai": "ถอยไป ฉันต้องการพื้นที่สักหน่อยตอนนี้"}
{"word": "back off", "english": "He was getting too close, so I said, 'Back off!'", "thai": "เขาเข้ามาใกล้เกินไป ฉันเลยบอกว่า 'ถอยไป!'"}
{"word": "back off", "english": "Why don't you back off and mind your own business?", "thai": "ทำไมคุณไม่ถอยไปแล้วสนใจเรื่องของตัวเองล่ะ?"}
{"word": "back off", "english": "The coach told the players to back off during practice.", "thai": "โค้ชบอกให้นักกีฬาถอยออกไปตอนซ้อม"}
{"word": "back off", "english": "Back off, this is a private conversation!", "thai": "ถอยไป นี่เป็นการสนทนาส่วนตัว!"}
{"word": "back off", "english": "I had to tell my boss to back off on the deadlines.", "thai": "ฉันต้องบอกเจ้านายให้ลดความกดดันเรื่องกำหนดเวลาลง"}
{"word": "back off", "english": "The crowd was told to back off by the police.", "thai": "ฝูงชนถูกตำรวจสั่งให้ถอยออกไป"}
{"word": "back off", "english": "You better back off before I lose my temper.", "thai": "คุณควรถอยไปก่อนที่ฉันจะโมเง่าย"}
{"word": "back off", "english": "She told her little brother to back off from her toys.", "thai": "เธอบอกน้องชายให้ถอยห่างจากของเล่นของเธอ"}
{"word": "back off", "english": "Back off, I'm not in the mood to argue.", "thai": "ถอยไป ฉันไม่อยากเถียงตอนนี้"}
{"word": "back off", "english": "He didn't back off even after I warned him.", "thai": "เขาไม่ถอยไปแม้ว่าฉันจะเตือนแล้ว"}
{"word": "back off", "english": "Just back off and let her make her own choices.", "thai": "แค่ถอยไปแล้วให้เธอตัดสินใจด้วยตัวเอง"}
{"word": "back off", "english": "The teacher told the kids to back off from the experiment.", "thai": "ครูบอกให้เด็กๆ ถอยห่างจากการทดลอง"}
{"word": "back off", "english": "I need you to back off and give me some time.", "thai": "ฉันต้องการให้คุณถอยไปและให้เวลาฉันบ้าง"}
{"word": "back off", "english": "Back off, you're making me uncomfortable.", "thai": "ถอยไป คุณทำให้ฉันรู้สึกไม่สบายใจ"}
{"word": "back off", "english": "The manager told the employee to back off on the complaints.", "thai": "ผู้จัดการบอกให้พนักงานลดการบ่นลง"}
{"word": "back off", "english": "If you back off now, we can avoid trouble.", "thai": "ถ้าคุณถอยไปตอนนี้ เราจะหลีกเลี่ยงปัญหาได้"}
{"word": "back off", "english": "She screamed at the stranger to back off.", "thai": "เธอตะโกนให้คนแปลกหน้าถอยไป"}
{"word": "back off", "english": "Back off, this is my personal space!", "thai": "ถอยไป นี่เป็นพื้นที่ส่วนตัวของฉัน!"}
{"word": "back off", "english": "He told the paparazzi to back off from his family.", "thai": "เขาบอกให้ปาปารัซซี่ถอยห่างจากครอบครัวเขา"}
{"word": "back off", "english": "Just back off, I can fix this myself.", "thai": "แค่ถอยไป ฉันแก้ไขเองได้"}
{"word": "back off", "english": "The referee told the players to back off after the whistle.", "thai": "ผู้ตัดสินบอกให้นักกีฬาถอยออกไปหลังเป่านกหวีด"}
{"word": "back off", "english": "Back off, you're too close to the edge!", "thai": "ถอยไป คุณอยู่ใกล้ขอบเกินไป!"}
{"word": "back off", "english": "I had to tell my friend to back off on the teasing.", "thai": "ฉันต้องบอกเพื่อนให้หยุดแซว"}
{"word": "back off", "english": "The security guard shouted, 'Back off, now!'", "thai": "ยามตะโกนว่า 'ถอยไป เดี๋ยวนี้!'"}
{"word": "back off", "english": "Back off, I’m trying to focus here.", "thai": "ถอยไป ฉันกำลังพยายามมีสมาธิ"}
{"word": "back off", "english": "She told her ex to back off and leave her alone.", "thai": "เธอบอกแฟนเก่าให้ถอยไปและปล่อยเธอไว้คนเดียว"}
{"word": "back off", "english": "The dog trainer told the puppy to back off from the treat.", "thai": "ครูฝึกสุนัขบอกลูกสุนัขให้ถอยห่างจากขนม"}
{"word": "back off", "english": "Back off, you’re crowding me!", "thai": "ถอยไป คุณกำลังรุมฉัน!"}
{"word": "back off", "english": "He warned the bully to back off or else.", "thai": "เขาเตือนคนพาลให้ถอยไปไม่งั้นจะเจอดี"}
{"word": "back off", "english": "The chef told the staff to back off from the kitchen.", "thai": "เชฟบอกให้พนักงานถอยห่างจากครัว"}
{"word": "back off", "english": "Just back off, I’m not interested.", "thai": "แค่ถอยไป ฉันไม่สนใจ"}
{"word": "back off", "english": "Back off, this isn’t your fight.", "thai": "ถอยไป นี่ไม่ใช่เรื่องของเธอ"}
{"word": "back off", "english": "I told my coworker to back off on the criticism.", "thai": "ฉันบอกเพื่อนร่วมงานให้ลดการวิจารณ์ลง"}
{"word": "back off", "english": "The driver yelled at the car behind to back off.", "thai": "คนขับตะโกนให้รถด้านหลังถอยห่าง"}
{"word": "back off", "english": "Back off, you’re scaring the kids!", "thai": "ถอยไป คุณกำลังทำให้เด็กๆ กลัว!"}
{"word": "back off", "english": "She told the salesperson to back off politely.", "thai": "เธอบอกพนักงานขายให้ถอยไปอย่างสุภาพ"}
{"word": "back off", "english": "Back off, I’m not ready to talk about it.", "thai": "ถอยไป ฉันยังไม่พร้อมคุยเรื่องนี้"}
{"word": "back off", "english": "The hiker told the bear to back off loudly.", "thai": "นักเดินป่าตะโกนให้หมีถอยไป"}
{"word": "back off", "english": "Just back off and let me breathe.", "thai": "แค่ถอยไปแล้วให้ฉันหายใจบ้าง"}
{"word": "back off", "english": "He told his opponent to back off during the debate.", "thai": "เขาบอกคู่แข่งให้ถอยไปในระหว่างการโต้วาที"}
{"word": "back off", "english": "Back off, you’re in my way!", "thai": "ถอยไป คุณขวางทางฉัน!"}
{"word": "back off", "english": "The parent told the kids to back off from the stove.", "thai": "พ่อแม่บอกให้เด็กๆ ถอยห่างจากเตา"}
{"word": "back off", "english": "I need you to back off on the pressure.", "thai": "ฉันต้องการให้คุณลดความกดดันลง"}
{"word": "back off", "english": "Back off, this is a sensitive topic.", "thai": "ถอยไป นี่เป็นหัวข้อที่ละเอียดอ่อน"}
{"word": "back off", "english": "The bartender told the drunk guy to back off.", "thai": "บาร์เทนเดอร์บอกให้คนเมาถอยไป"}
{"word": "back off", "english": "Just back off, I can do this alone.", "thai": "แค่ถอยไป ฉันทำคนเดียวได้"}
{"word": "back off", "english": "Back off, you’re too intense right now.", "thai": "ถอยไป คุณกำลังเข้มข้นเกินไป"}
{"word": "back off", "english": "She told her friend to back off on the advice.", "thai": "เธอบอกเพื่อนให้ลดคำแนะนำลง"}
{"word": "back off", "english": "The lifeguard shouted to back off from the deep end.", "thai": "ไลฟ์การ์ดตะโกนให้ถอยจากส่วนลึก"}
{"word": "back off", "english": "Back off, I’m handling it!", "thai": "ถอยไป ฉันกำลังจัดการอยู่!"}
{"word": "back off", "english": "He told the crowd to back off from the stage.", "thai": "เขาบอกฝูงชนให้ถอยห่างจากเวที"}
{"word": "back off", "english": "Just back off, I need to think.", "thai": "แค่ถอยไป ฉันต้องคิด"}
{"word": "back off", "english": "Back off, you’re making things worse!", "thai": "ถอยไป คุณกำลังทำให้แย่ลง!"}
{"word": "back off", "english": "The officer told the suspect to back off slowly.", "thai": "ตำรวจบอกให้ผู้ต้องสงสัยถอยไปช้าๆ"}
{"word": "back off", "english": "Back off, I’m not in the wrong here.", "thai": "ถอยไป ฉันไม่ได้ผิดในเรื่องนี้"}
{"word": "back off", "english": "She told her classmate to back off from her project.", "thai": "เธอบอกเพื่อนร่วมชั้นให้ถอยห่างจากโปรเจกต์ของเธอ"}
{"word": "back off", "english": "Just back off, I’ve got this under control.", "thai": "แค่ถอยไป ฉันควบคุมได้"}
{"word": "back off", "english": "Back off, you’re crossing a line!", "thai": "ถอยไป คุณกำลังล้ำเส้น!"}
{"word": "back off", "english": "The shop owner told the kids to back off from the display.", "thai": "เจ้าของร้านบอกให้เด็กๆ ถอยห่างจากของโชว์"}
{"word": "back off", "english": "I had to tell my neighbor to back off on the noise.", "thai": "ฉันต้องบอกเพื่อนบ้านให้ลดเสียงลง"}
{"word": "back off", "english": "Back off, you’re too pushy!", "thai": "ถอยไป คุณผลักดันเกินไป!"}
{"word": "back off", "english": "He told his teammate to back off during the game.", "thai": "เขาบอกเพื่อนร่วมทีมให้ถอยไปในระหว่างเกม"}
{"word": "back off", "english": "Just back off, I’m not changing my mind.", "thai": "แค่ถอยไป ฉันจะไม่เปลี่ยนใจ"}
{"word": "back off", "english": "Back off, this is my decision to make.", "thai": "ถอยไป นี่เป็นการตัดสินใจของฉัน"}
{"word": "back off", "english": "The guide told the group to back off from the cliff.", "thai": "ไกด์บอกให้กลุ่มถอยห่างจากหน้าผา"}
{"word": "back off", "english": "Back off, you’re stressing me out!", "thai": "ถอยไป คุณกำลังทำให้ฉันเครียด!"}
{"word": "back off", "english": "She told the reporter to back off with the questions.", "thai": "เธอบอกนักข่าวให้ลดคำถามลง"}
{"word": "back off", "english": "Just back off, I’m not your problem.", "thai": "แค่ถอยไป ฉันไม่ใช่ปัญหาของคุณ"}
{"word": "back off", "english": "Back off, I’m trying to work here!", "thai": "ถอยไป ฉันกำลังทำงานอยู่!"}
{"word": "back off", "english": "He told the vendor to back off on the hard sell.", "thai": "เขาบอกพ่อค้าให้ลดการขายแบบกดดัน"}
{"word": "back off", "english": "Back off, you’re not helping!", "thai": "ถอยไป คุณไม่ได้ช่วยอะไร!"}
{"word": "back off", "english": "The nurse told the visitors to back off from the patient.", "thai": "พยาบาลบอกให้ผู้มาเยี่ยมถอยห่างจากคนไข้"}
{"word": "back off", "english": "Just back off, I need to calm down.", "thai": "แค่ถอยไป ฉันต้องใจเย็นลง"}
{"word": "back off", "english": "Back off, you’re in my personal bubble!", "thai": "ถอยไป คุณอยู่ในพื้นที่ส่วนตัวของฉัน!"}
{"word": "back off", "english": "She told her cousin to back off from her phone.", "thai": "เธอบอกลูกพี่ลูกน้องให้ถอยห่างจากโทรศัพท์ของเธอ"}
{"word": "back off", "english": "Back off, I’m not sharing my food!", "thai": "ถอยไป ฉันไม่แบ่งอาหาร!"}
{"word": "back off", "english": "The director told the crew to back off from the set.", "thai": "ผู้กำกับบอกให้ทีมงานถอยห่างจากกองถ่าย"}
{"word": "back off", "english": "Just back off, I’m figuring this out.", "thai": "แค่ถอยไป ฉันกำลังหาทาง"}
{"word": "back off", "english": "Back off, you’re making me nervous!", "thai": "ถอยไป คุณทำให้ฉันประหม่า!"}
{"word": "back off", "english": "He told the fan to back off after the concert.", "thai": "เขาบอกแฟนคลับให้ถอยไปหลังคอนเสิร์ต"}
{"word": "back off", "english": "Back off, I’m not ready for this!", "thai": "ถอยไป ฉันยังไม่พร้อม!"}
{"word": "back off", "english": "The mom told the kids to back off from the hot oven.", "thai": "แม่บอกให้เด็กๆ ถอยห่างจากเตาร้อน"}
{"word": "back off", "english": "Just back off, I can handle the pressure.", "thai": "แค่ถอยไป ฉันรับมือกับความกดดันได้"}
{"word": "back off", "english": "Back off, you’re too close to my car!", "thai": "ถอยไป คุณอยู่ใกล้รถฉันเกินไป!"}
{"word": "back off", "english": "She told her friend to back off on the gossip.", "thai": "เธอบอกเพื่อนให้ลดการนินทา"}
{"word": "back off", "english": "Back off, I’m not in the mood!", "thai": "ถอยไป ฉันไม่อยู่ในอารมณ์!"}
{"word": "back off", "english": "The worker told the crowd to back off from the site.", "thai": "คนงานบอกให้ฝูงชนถอยห่างจากไซต์งาน"}
{"word": "back off", "english": "Just back off, I need to process this.", "thai": "แค่ถอยไป ฉันต้องจัดการกับเรื่องนี้"}
{"word": "back off", "english": "Back off, you’re not part of this!", "thai": "ถอยไป คุณไม่ได้เกี่ยวข้อง!"}
{"word": "back off", "english": "He told his rival to back off during the match.", "thai": "เขาบอกคู่แข่งให้ถอยไปในระหว่างการแข่งขัน"}
{"word": "back off", "english": "Back off, I’m trying to stay calm!", "thai": "ถอยไป ฉันกำลังพยายามใจเย็น!"}
{"word": "back off", "english": "The store clerk told the customer to back off from the counter.", "thai": "พนักงานร้านบอกให้ลูกค้าถอยห่างจากเคาน์เตอร์"}
{"word": "back off", "english": "Just back off, I’m not your enemy.", "thai": "แค่ถอยไป ฉันไม่ใช่ศัตรูของเธอ"}
{"word": "back up", "english": "Can you back up the car a little?", "thai": "ช่วยถอยรถกลับไปหน่อยได้ไหม?"}
{"word": "back up", "english": "I need to back up my files before the system crashes.", "thai": "ฉันต้องสำรองข้อมูลก่อนที่ระบบจะล่ม"}
{"word": "back up", "english": "He told the team to back up and give him space.", "thai": "เขาบอกให้ทีมถอยกลับไปและให้พื้นที่เขา"}
{"word": "back up", "english": "Make sure to back up your claims with evidence.", "thai": "อย่าลืมสนับสนุนคำกล่าวอ้างของคุณด้วยหลักฐาน"}
{"word": "back up", "english": "The truck started to back up into the loading dock.", "thai": "รถบรรทุกเริ่มถอยกลับเข้าไปในท่าโหลด"}
{"word": "back up", "english": "She asked me to back up her story to the boss.", "thai": "เธอขอให้ฉันสนับสนุนเรื่องราวของเธอกับเจ้านาย"}
{"word": "back up", "english": "Back up, you're standing too close!", "thai": "ถอยกลับไป คุณยืนใกล้เกินไป!"}
{"word": "back up", "english": "The system crashed because I forgot to back up the data.", "thai": "ระบบล่มเพราะฉันลืมสำรองข้อมูล"}
{"word": "back up", "english": "He tried to back up but hit the wall.", "thai": "เขาพยายามถอยกลับแต่ชนกำแพง"}
{"word": "back up", "english": "Can you back up what you just said?", "thai": "คุณช่วยยืนยันสิ่งที่คุณพูดเมื่อกี้ได้ไหม?"}
{"word": "back up", "english": "The crowd was told to back up from the stage.", "thai": "ฝูงชนถูกบอกให้ถอยกลับไปจากเวที"}
{"word": "back up", "english": "I’ll back up your decision if you explain it.", "thai": "ฉันจะสนับสนุนการตัดสินใจของคุณถ้าคุณอธิบาย"}
{"word": "back up", "english": "The car in front needs to back up a bit.", "thai": "รถคันหน้าต้องถอยกลับไปหน่อย"}
{"word": "back up", "english": "Always back up your work before shutting down.", "thai": "สำรองงานของคุณเสมอก่อนปิดเครื่อง"}
{"word": "back up", "english": "She told the kids to back up from the hot stove.", "thai": "เธอบอกให้เด็กๆ ถอยกลับไปจากเตาร้อน"}
{"word": "back up", "english": "Back up, you’re blocking the entrance!", "thai": "ถอยกลับไป คุณกำลังขวางทางเข้า!"}
{"word": "back up", "english": "He promised to back up his friend in the argument.", "thai": "เขาสัญญาจะสนับสนุนเพื่อนในการโต้แย้ง"}
{"word": "back up", "english": "The driver had to back up to let the bus pass.", "thai": "คนขับต้องถอยกลับไปเพื่อให้รถบัสผ่าน"}
{"word": "back up", "english": "I need you to back up and start over.", "thai": "ฉันต้องการให้คุณถอยกลับไปและเริ่มใหม่"}
{"word": "back up", "english": "The IT guy told me to back up my hard drive.", "thai": "เจ้าหน้าที่ไอทีบอกให้ฉันสำรองฮาร์ดไดรฟ์"}
{"word": "back up", "english": "Back up, you’re in my personal space!", "thai": "ถอยกลับไป คุณอยู่ในพื้นที่ส่วนตัวของฉัน!"}
{"word": "back up", "english": "She backed up her argument with solid facts.", "thai": "เธอสนับสนุนข้อโต้แย้งของเธอด้วยข้อเท็จจริงที่แน่นหนา"}
{"word": "back up", "english": "The police told the crowd to back up from the scene.", "thai": "ตำรวจบอกให้ฝูงชนถอยกลับไปจากที่เกิดเหตุ"}
{"word": "back up", "english": "Can you back up the trailer into the garage?", "thai": "ช่วยถอยรถพ่วงเข้าไปในโรงรถได้ไหม?"}
{"word": "back up", "english": "I forgot to back up my phone before resetting it.", "thai": "ฉันลืมสำรองข้อมูลโทรศัพท์ก่อนรีเซ็ต"}
{"word": "back up", "english": "He told his teammate to back up during the play.", "thai": "เขาบอกให้เพื่อนร่วมทีมถอยกลับไปในระหว่างการเล่น"}
{"word": "back up", "english": "Back up, you’re stepping on my foot!", "thai": "ถอยกลับไป คุณเหยียบเท้าฉัน!"}
{"word": "back up", "english": "She backed up her proposal with a detailed report.", "thai": "เธอสนับสนุนข้อเสนอของเธอด้วยรายงานละเอียด"}
{"word": "back up", "english": "The delivery truck had to back up to the store.", "thai": "รถส่งของต้องถอยกลับไปที่ร้าน"}
{"word": "back up", "english": "I’ll back up your version of the story.", "thai": "ฉันจะสนับสนุนเรื่องราวในแบบของคุณ"}
{"word": "back up", "english": "Back up, you’re too close to the edge!", "thai": "ถอยกลับไป คุณอยู่ใกล้ขอบเกินไป!"}
{"word": "back up", "english": "The manager told the staff to back up the inventory data.", "thai": "ผู้จัดการบอกให้พนักงานสำรองข้อมูลสินค้าคงคลัง"}
{"word": "back up", "english": "He tried to back up but got stuck in traffic.", "thai": "เขาพยายามถอยกลับแต่ติดอยู่ในรถติด"}
{"word": "back up", "english": "Can you back up your statement with proof?", "thai": "คุณช่วยยืนยันคำพูดของคุณด้วยหลักฐานได้ไหม?"}
{"word": "back up", "english": "The dog was told to back up from the food.", "thai": "สุนัขถูกบอกให้ถอยกลับไปจากอาหาร"}
{"word": "back up", "english": "Back up, I need to get through!", "thai": "ถอยกลับไป ฉันต้องผ่าน!"}
{"word": "back up", "english": "She backed up her friend’s alibi at the meeting.", "thai": "เธอสนับสนุนข้อแก้ตัวของเพื่อนในการประชุม"}
{"word": "back up", "english": "The car started to back up slowly.", "thai": "รถเริ่มถอยกลับไปช้าๆ"}
{"word": "back up", "english": "I need to back up my photos to the cloud.", "thai": "ฉันต้องสำรองรูปภาพไปยังคลาวด์"}
{"word": "back up", "english": "Back up, you’re crowding the counter!", "thai": "ถอยกลับไป คุณกำลังเบียดเคาน์เตอร์!"}
{"word": "back up", "english": "He backed up his theory with new research.", "thai": "เขาสนับสนุนทฤษฎีของเขาด้วยการวิจัยใหม่"}
{"word": "back up", "english": "The bus driver had to back up to avoid the pothole.", "thai": "คนขับรถบัสต้องถอยกลับไปเพื่อหลบหลุม"}
{"word": "back up", "english": "Can you back up and explain that again?", "thai": "ช่วยถอยกลับไปและอธิบายอีกครั้งได้ไหม?"}
{"word": "back up", "english": "The system needs to back up every night.", "thai": "ระบบต้องสำรองข้อมูลทุกคืน"}
{"word": "back up", "english": "Back up, you’re scaring the kids!", "thai": "ถอยกลับไป คุณกำลังทำให้เด็กๆ กลัว!"}
{"word": "back up", "english": "She backed up her partner during the presentation.", "thai": "เธอสนับสนุนคู่หูของเธอในระหว่างการนำเสนอ"}
{"word": "back up", "english": "The forklift driver was told to back up carefully.", "thai": "คนขับรถยกถูกบอกให้ถอยกลับไปอย่างระวัง"}
{"word": "back up", "english": "I’ll back up your plan if it makes sense.", "thai": "ฉันจะสนับสนุนแผนของคุณถ้ามันสมเหตุสมผล"}
{"word": "back up", "english": "Back up, you’re in the shot!", "thai": "ถอยกลับไป คุณอยู่ในช็อต!"}
{"word": "back up", "english": "He forgot to back up the project files.", "thai": "เขาลืมสำรองไฟล์โปรเจกต์"}
{"word": "back up", "english": "The teacher told the students to back up from the experiment.", "thai": "ครูบอกให้นักเรียนถอยกลับไปจากการทดลอง"}
{"word": "back up", "english": "Back up, I can’t see the board!", "thai": "ถอยกลับไป ฉันมองไม่เห็นกระดาน!"}
{"word": "back up", "english": "She backed up her opinion with strong arguments.", "thai": "เธอสนับสนุนความคิดเห็นของเธอด้วยข้อโต้แย้งที่หนักแน่น"}
{"word": "back up", "english": "The van had to back up to clear the road.", "thai": "รถตู้ต้องถอยกลับไปเพื่อเคลียร์ถนน"}
{"word": "back up", "english": "Can you back up your accusation with facts?", "thai": "คุณช่วยยืนยันข้อกล่าวหาของคุณด้วยข้อเท็จจริงได้ไหม?"}
{"word": "back up", "english": "Back up, you’re blocking the camera!", "thai": "ถอยกลับไป คุณกำลังบังกล้อง!"}
{"word": "back up", "english": "I need to back up my contacts before switching phones.", "thai": "ฉันต้องสำรองรายชื่อติดต่อก่อนเปลี่ยนโทรศัพท์"}
{"word": "back up", "english": "He told the group to back up from the cliff.", "thai": "เขาบอกให้กลุ่มถอยกลับไปจากหน้าผา"}
{"word": "back up", "english": "Back up, you’re making me nervous!", "thai": "ถอยกลับไป คุณทำให้ฉันประหม่า!"}
{"word": "back up", "english": "She backed up her colleague’s idea in the meeting.", "thai": "เธอสนับสนุนแนวคิดของเพื่อนร่วมงานในการประชุม"}
{"word": "back up", "english": "The driver had to back up to avoid the pedestrian.", "thai": "คนขับต้องถอยกลับไปเพื่อหลบคนเดินเท้า"}
{"word": "back up", "english": "Always back up your documents before editing.", "thai": "สำรองเอกสารของคุณเสมอก่อนแก้ไข"}
{"word": "back up", "english": "Back up, you’re too close to the fire!", "thai": "ถอยกลับไป คุณอยู่ใกล้ไฟเกินไป!"}
{"word": "back up", "english": "He backed up his friend’s version of events.", "thai": "เขาสนับสนุนเรื่องราวในแบบของเพื่อน"}
{"word": "back up", "english": "The tractor started to back up into the barn.", "thai": "รถแทรกเตอร์เริ่มถอยกลับเข้าไปในโรงนา"}
{"word": "back up", "english": "Can you back up and repeat that one more time?", "thai": "ช่วยถอยกลับไปและพูดซ้ำอีกครั้งได้ไหม?"}
{"word": "back up", "english": "The server needs to back up all transactions daily.", "thai": "เซิร์ฟเวอร์ต้องสำรองธุรกรรมทั้งหมดทุกวัน"}
{"word": "back up", "english": "Back up, you’re in my workspace!", "thai": "ถอยกลับไป คุณอยู่ในพื้นที่ทำงานของฉัน!"}
{"word": "back up", "english": "She backed up her theory with data from the study.", "thai": "เธอสนับสนุนทฤษฎีของเธอด้วยข้อมูลจากการศึกษา"}
{"word": "back up", "english": "The cyclist had to back up to avoid the dog.", "thai": "นักปั่นจักรยานต้องถอยกลับไปเพื่อหลบสุนัข"}
{"word": "back up", "english": "I’ll back up your request if you convince me.", "thai": "ฉันจะสนับสนุนคำขอของคุณถ้าคุณโน้มน้าวฉันได้"}
{"word": "back up", "english": "Back up, you’re standing on my bag!", "thai": "ถอยกลับไป คุณเหยียบกระเป๋าฉัน!"}
{"word": "back up", "english": "He forgot to back up the database before the update.", "thai": "เขาลืมสำรองฐานข้อมูลก่อนอัปเดต"}
{"word": "back up", "english": "The coach told the players to back up during drills.", "thai": "โค้ชบอกให้นักกีฬาถอยกลับไปในระหว่างการฝึก"}
{"word": "back up", "english": "Back up, you’re blocking the sunlight!", "thai": "ถอยกลับไป คุณกำลังบังแสงแดด!"}
{"word": "back up", "english": "She backed up her point with a real-life example.", "thai": "เธอสนับสนุนประเด็นของเธอด้วยตัวอย่างจากชีวิตจริง"}
{"word": "back up", "english": "The motorcycle had to back up to clear the path.", "thai": "มอเตอร์ไซค์ต้องถอยกลับไปเพื่อเคลียร์ทาง"}
{"word": "back up", "english": "Can you back up your argument with sources?", "thai": "คุณช่วยยืนยันข้อโต้แย้งของคุณด้วยแหล่งข้อมูลได้ไหม?"}
{"word": "back up", "english": "Back up, you’re too close to the painting!", "thai": "ถอยกลับไป คุณอยู่ใกล้ภาพวาดเกินไป!"}
{"word": "back up", "english": "I need to back up my emails before switching accounts.", "thai": "ฉันต้องสำรองอีเมลก่อนเปลี่ยนบัญชี"}
{"word": "back up", "english": "The guide told the hikers to back up from the ledge.", "thai": "ไกด์บอกให้นักเดินป่าถอยกลับไปจากขอบ"}
{"word": "back up", "english": "Back up, you’re making it hard to breathe!", "thai": "ถอยกลับไป คุณทำให้หายใจลำบาก!"}
{"word": "back up", "english": "He backed up his teammate during the discussion.", "thai": "เขาสนับสนุนเพื่อนร่วมทีมในระหว่างการสนทนา"}
{"word": "back up", "english": "The car had to back up to avoid the fallen branch.", "thai": "รถต้องถอยกลับไปเพื่อหลบกิ่งไม้ที่ตกลงมา"}
{"word": "back up", "english": "Always back up your code before testing.", "thai": "สำรองโค้ดของคุณเสมอก่อนทดสอบ"}
{"word": "back up", "english": "Back up, you’re in the way of the projector!", "thai": "ถอยกลับไป คุณขวางทางโปรเจคเตอร์!"}
{"word": "back up", "english": "She backed up her claim with a signed document.", "thai": "เธอสนับสนุนคำกล่าวอ้างของเธอด้วยเอกสารที่เซ็นแล้ว"}
{"word": "back up", "english": "The boat had to back up to dock properly.", "thai": "เรือต้องถอยกลับไปเพื่อจอดอย่างถูกต้อง"}
{"word": "back up", "english": "Can you back up and clarify your point?", "thai": "ช่วยถอยกลับไปและอธิบายประเด็นของคุณให้ชัดเจนได้ไหม?"}
{"word": "back up", "english": "The system automatically backs up every hour.", "thai": "ระบบสำรองข้อมูลอัตโนมัติทุกชั่วโมง"}
{"word": "back up", "english": "Back up, you’re crowding the doorway!", "thai": "ถอยกลับไป คุณกำลังเบียดประตู!"}
{"word": "back up", "english": "He backed up his partner’s strategy in the game.", "thai": "เขาสนับสนุนกลยุทธ์ของคู่หูในเกม"}
{"word": "back up", "english": "The driver had to back up to make room for the ambulance.", "thai": "คนขับต้องถอยกลับไปเพื่อให้ที่ว่างสำหรับรถพยาบาล"}
{"word": "back up", "english": "I forgot to back up my notes before the meeting.", "thai": "ฉันลืมสำรองบันทึกก่อนการประชุม"}
{"word": "back up", "english": "Back up, you’re standing on my phone!", "thai": "ถอยกลับไป คุณเหยียบโทรศัพท์ฉัน!"}
{"word": "back up", "english": "She backed up her story with a video.", "thai": "เธอสนับสนุนเรื่องราวของเธอด้วยวิดีโอ"}
{"word": "back up", "english": "The truck had to back up to unload the cargo.", "thai": "รถบรรทุกต้องถอยกลับไปเพื่อลงสินค้า"}
{"word": "back up", "english": "Can you back up your theory with examples?", "thai": "คุณช่วยยืนยันทฤษฎีของคุณด้วยตัวอย่างได้ไหม?"}
{"word": "back up", "english": "Back up, you’re too close to the stage!", "thai": "ถอยกลับไป คุณอยู่ใกล้เวทีเกินไป!"}
{"word": "back up", "english": "I need to back up my laptop before the repair.", "thai": "ฉันต้องสำรองข้อมูลแล็ปท็อปก่อนซ่อม"}
{"word": "carry on", "english": "Just carry on with your work, I'll handle this.", "thai": "แค่ทำต่อไป ฉันจะจัดการเรื่องนี้"}
{"word": "carry on", "english": "She told the kids to carry on playing quietly.", "thai": "เธอบอกให้เด็กๆ เล่นต่อไปเงียบๆ"}
{"word": "carry on", "english": "We need to carry on despite the challenges.", "thai": "เราต้องดำเนินต่อไปแม้จะมีอุปสรรค"}
{"word": "carry on", "english": "He carried on talking even after the bell rang.", "thai": "เขายังพูดต่อไปแม้ว่ากระดิ่งจะดังแล้ว"}
{"word": "carry on", "english": "Carry on, I’m listening to you!", "thai": "พูดต่อไป ฉันกำลังฟังอยู่นะ!"}
{"word": "carry on", "english": "The teacher told us to carry on with the assignment.", "thai": "ครูบอกให้เราทำงานมอบหมายต่อไป"}
{"word": "carry on", "english": "They carried on the tradition for years.", "thai": "พวกเขาดำเนินประเพณีต่อไปเป็นเวลาหลายปี"}
{"word": "carry on", "english": "I can’t believe you’re still carrying on about that!", "thai": "ฉันไม่เชื่อว่าคุณยังคงบ่นเรื่องนั้นต่อไป!"}
{"word": "carry on", "english": "Let’s carry on with the meeting as planned.", "thai": "มาดำเนินการประชุมต่อตามแผน"}
{"word": "carry on", "english": "She carried on working through the night.", "thai": "เธอทำงานต่อไปตลอดทั้งคืน"}
{"word": "carry on", "english": "Carry on, don’t let me interrupt you.", "thai": "ทำต่อไป อย่าให้ฉันขัดจังหวะ"}
{"word": "carry on", "english": "He told the team to carry on without him.", "thai": "เขาบอกให้ทีมดำเนินต่อไปโดยไม่มีเขา"}
{"word": "carry on", "english": "The show must carry on, no matter what!", "thai": "การแสดงต้องดำเนินต่อไป ไม่ว่าอะไรจะเกิดขึ้น!"}
{"word": "carry on", "english": "Why do you always carry on like that in public?", "thai": "ทำไมคุณถึงทำตัวแบบนั้นในที่สาธารณะตลอด?"}
{"word": "carry on", "english": "We’ll carry on with the project next week.", "thai": "เราจะดำเนินโปรเจกต์ต่อไปในสัปดาห์หน้า"}
{"word": "carry on", "english": "She carried on laughing despite the serious moment.", "thai": "เธอยังหัวเราะต่อไปทั้งที่เป็นช่วงเวลาจริงจัง"}
{"word": "carry on", "english": "Carry on with your story, I’m curious!", "thai": "เล่าต่อไป ฉันอยากรู้!"}
{"word": "carry on", "english": "The workers were told to carry on during the inspection.", "thai": "คนงานถูกบอกให้ทำงานต่อไปในระหว่างการตรวจสอบ"}
{"word": "carry on", "english": "He carried on as if nothing had happened.", "thai": "เขาดำเนินต่อไปราวกับไม่มีอะไรเกิดขึ้น"}
{"word": "carry on", "english": "Let’s carry on and finish this task today.", "thai": "มาทำต่อไปและจบงานนี้วันนี้"}
{"word": "carry on", "english": "She told him to carry on with his speech.", "thai": "เธอบอกให้เขาพูดต่อไป"}
{"word": "carry on", "english": "They carried on the family business with pride.", "thai": "พวกเขาดำเนินธุรกิจครอบครัวต่อไปด้วยความภูมิใจ"}
{"word": "carry on", "english": "Carry on, you’re doing great!", "thai": "ทำต่อไป คุณทำได้ดีมาก!"}
{"word": "carry on", "english": "The band carried on playing despite the rain.", "thai": "วงดนตรีเล่นต่อไปทั้งที่มีฝนตก"}
{"word": "carry on", "english": "I told her to carry on with her painting.", "thai": "ฉันบอกให้เธอวาดภาพต่อไป"}
{"word": "carry on", "english": "He was carrying on about his new car all day.", "thai": "เขาพูดถึงรถใหม่ของเขาทั้งวัน"}
{"word": "carry on", "english": "We need to carry on with the renovations.", "thai": "เราต้องดำเนินการปรับปรุงต่อไป"}
{"word": "carry on", "english": "She carried on reading despite the noise.", "thai": "เธออ่านต่อไปทั้งที่มีเสียงดัง"}
{"word": "carry on", "english": "Carry on, I didn’t mean to distract you.", "thai": "ทำต่อไป ฉันไม่ได้ตั้งใจทำให้คุณวอกแวก"}
{"word": "carry on", "english": "The coach told the players to carry on with practice.", "thai": "โค้ชบอกให้นักกีฬาฝึกซ้อมต่อไป"}
{"word": "carry on", "english": "They carried on the conversation late into the night.", "thai": "พวกเขาคุยต่อไปจนดึก"}
{"word": "carry on", "english": "Just carry on, I’ll catch up later.", "thai": "แค่ทำต่อไป ฉันจะตามมาทีหลัง"}
{"word": "carry on", "english": "She carried on singing even after forgetting the lyrics.", "thai": "เธอร้องเพลงต่อไปทั้งที่ลืมเนื้อร้อง"}
{"word": "carry on", "english": "We’ll carry on with the plan as discussed.", "thai": "เราจะดำเนินตามแผนที่คุยกันไว้"}
{"word": "carry on", "english": "He carried on complaining about the service.", "thai": "เขายังคงบ่นเรื่องการบริการต่อไป"}
{"word": "carry on", "english": "Carry on with your homework, I’ll check it later.", "thai": "ทำการบ้านต่อไป เดี๋ยวฉันจะตรวจทีหลัง"}
{"word": "carry on", "english": "The team carried on training despite the heat.", "thai": "ทีมฝึกซ้อมต่อไปทั้งที่อากาศร้อน"}
{"word": "carry on", "english": "She told me to carry on without waiting for her.", "thai": "เธอบอกให้ฉันทำต่อไปโดยไม่ต้องรอเธอ"}
{"word": "carry on", "english": "They carried on the event despite the low turnout.", "thai": "พวกเขาดำเนินงานต่อไปทั้งที่มีคนมาน้อย"}
{"word": "carry on", "english": "Carry on, don’t stop because of me!", "thai": "ทำต่อไป อย่าหยุดเพราะฉัน!"}
{"word": "carry on", "english": "He carried on with his speech despite the hecklers.", "thai": "เขาพูดต่อไปทั้งที่มีคนรบกวน"}
{"word": "carry on", "english": "Let’s carry on and wrap this up quickly.", "thai": "มาทำต่อไปและจบเรื่องนี้ให้เร็ว"}
{"word": "carry on", "english": "She carried on knitting during the meeting.", "thai": "เธอถักนิตติ้งต่อไปในระหว่างการประชุม"}
{"word": "carry on", "english": "The kids were told to carry on with their game.", "thai": "เด็กๆ ถูกบอกให้เล่นเกมต่อไป"}
{"word": "carry on", "english": "He carried on as if he didn’t hear the warning.", "thai": "เขาดำเนินต่อไปราวกับไม่ได้ยินคำเตือน"}
{"word": "carry on", "english": "Carry on with your presentation, I’m all ears.", "thai": "นำเสนอต่อไป ฉันตั้งใจฟังอยู่"}
{"word": "carry on", "english": "They carried on the charity work after her passing.", "thai": "พวกเขาดำเนินงานการกุศลต่อไปหลังจากเธอเสียชีวิต"}
{"word": "carry on", "english": "She was carrying on about her bad day at work.", "thai": "เธอบ่นต่อไปเกี่ยวกับวันที่แย่ในที่ทำงาน"}
{"word": "carry on", "english": "We need to carry on with the cleanup effort.", "thai": "เราต้องดำเนินการทำความสะอาดต่อไป"}
{"word": "carry on", "english": "He told the group to carry on without delay.", "thai": "เขาบอกให้กลุ่มดำเนินต่อไปโดยไม่ล่าช้า"}
{"word": "carry on", "english": "Carry on, you’re almost done!", "thai": "ทำต่อไป คุณใกล้เสร็จแล้ว!"}
{"word": "carry on", "english": "She carried on teaching despite feeling ill.", "thai": "เธอสอนต่อไปทั้งที่รู้สึกไม่สบาย"}
{"word": "carry on", "english": "The meeting will carry on after a short break.", "thai": "การประชุมจะดำเนินต่อไปหลังพักสั้นๆ"}
{"word": "carry on", "english": "He carried on joking even during the serious talk.", "thai": "เขายังคงพูดตลกต่อไปทั้งที่เป็นการคุยจริงจัง"}
{"word": "carry on", "english": "Let’s carry on with the rehearsal as scheduled.", "thai": "มาซ้อมต่อไปตามกำหนดการ"}
{"word": "carry on", "english": "She carried on with her workout despite the pain.", "thai": "เธออกกำลังกายต่อไปทั้งที่มีอาการปวด"}
{"word": "carry on", "english": "Carry on, I’ll join you in a minute.", "thai": "ทำต่อไป เดี๋ยวฉันจะตามไป"}
{"word": "carry on", "english": "They carried on the festival despite the storm.", "thai": "พวกเขาดำเนินเทศกาลต่อไปทั้งที่มีพายุ"}
{"word": "carry on", "english": "He was carrying on about his new phone all night.", "thai": "เขาพูดถึงโทรศัพท์ใหม่ของเขาทั้งคืน"}
{"word": "carry on", "english": "We’ll carry on with the discussion tomorrow.", "thai": "เราจะดำเนินการสนทนาต่อไปพรุ่งนี้"}
{"word": "carry on", "english": "She carried on painting the room alone.", "thai": "เธอทาสีห้องต่อไปคนเดียว"}
{"word": "carry on", "english": "Carry on with your chores, I’ll be back soon.", "thai": "ทำงานบ้านต่อไป เดี๋ยวฉันกลับมา"}
{"word": "carry on", "english": "The team carried on with the match in the rain.", "thai": "ทีมแข่งต่อไปในฝน"}
{"word": "carry on", "english": "He told her to carry on with her research.", "thai": "เขาบอกให้เธอดำเนินการวิจัยต่อไป"}
{"word": "carry on", "english": "They carried on the legacy of their founder.", "thai": "พวกเขาดำเนินมรดกของผู้ก่อตั้งต่อไป"}
{"word": "carry on", "english": "Carry on, don’t mind the noise!", "thai": "ทำต่อไป อย่าสนใจเสียง!"}
{"word": "carry on", "english": "She carried on writing her book despite distractions.", "thai": "เธอเขียนหนังสือต่อไปทั้งที่มีสิ่งรบกวน"}
{"word": "carry on", "english": "The event will carry on as planned.", "thai": "งานจะดำเนินต่อไปตามแผน"}
{"word": "carry on", "english": "He was carrying on about the bad referee call.", "thai": "เขาบ่นต่อไปเกี่ยวกับการตัดสินที่แย่"}
{"word": "carry on", "english": "We need to carry on with the repairs urgently.", "thai": "เราต้องดำเนินการซ่อมแซมอย่างเร่งด่วน"}
{"word": "carry on", "english": "She carried on dancing despite the music stopping.", "thai": "เธอเต้นต่อไปทั้งที่เพลงหยุด"}
{"word": "carry on", "english": "Carry on with your speech, I’m recording it.", "thai": "พูดต่อไป ฉันกำลังอัดวิดีโออยู่"}
{"word": "carry on", "english": "They carried on the protest peacefully.", "thai": "พวกเขาดำเนินการประท้วงอย่างสงบ"}
{"word": "carry on", "english": "He carried on with his routine after the news.", "thai": "เขาดำเนินกิจวัตรต่อไปหลังจากได้ยินข่าว"}
{"word": "carry on", "english": "Let’s carry on with the cooking, we’re almost done.", "thai": "มาทำอาหารต่อไป เราใกล้เสร็จแล้ว"}
{"word": "carry on", "english": "She carried on studying despite the power outage.", "thai": "เธอเรียนต่อไปทั้งที่ไฟดับ"}
{"word": "carry on", "english": "Carry on, you’re making good progress!", "thai": "ทำต่อไป คุณกำลังก้าวหน้าได้ดี!"}
{"word": "carry on", "english": "The crew carried on filming despite the delay.", "thai": "ทีมงานถ่ายทำต่อไปทั้งที่มีความล่าช้า"}
{"word": "carry on", "english": "He told the group to carry on with the hike.", "thai": "เขาบอกให้กลุ่มเดินป่าต่อไป"}
{"word": "carry on", "english": "They carried on the fundraiser after the setback.", "thai": "พวกเขาดำเนินการระดมทุนต่อไปหลังจากเจออุปสรรค"}
{"word": "carry on", "english": "She was carrying on about her vacation plans.", "thai": "เธอพูดถึงแผนวันหยุดของเธอต่อไป"}
{"word": "carry on", "english": "We’ll carry on with the event next month.", "thai": "เราจะดำเนินงานต่อไปในเดือนหน้า"}
{"word": "carry on", "english": "He carried on building the model despite the mess.", "thai": "เขาสร้างโมเดลต่อไปทั้งที่มีความรก"}
{"word": "carry on", "english": "Carry on with your workout, I’ll join you.", "thai": "ออกกำลังกายต่อไป เดี๋ยวฉันจะเข้าร่วม"}
{"word": "carry on", "english": "She carried on with her speech after the applause.", "thai": "เธอพูดต่อไปหลังจากเสียงปรบมือ"}
{"word": "carry on", "english": "The workers carried on despite the equipment failure.", "thai": "คนงานทำงานต่อไปทั้งที่อุปกรณ์ขัดข้อง"}
{"word": "carry on", "english": "Carry on, I’ll handle the phone call.", "thai": "ทำต่อไป เดี๋ยวฉันจัดการสายโทรศัพท์"}
{"word": "carry on", "english": "They carried on the ceremony in the rain.", "thai": "พวกเขาดำเนินพิธีต่อไปในฝน"}
{"word": "carry on", "english": "He was carrying on about the new game release.", "thai": "เขาพูดถึงเกมใหม่ที่ปล่อยออกมาต่อไป"}
{"word": "carry on", "english": "We need to carry on with the training program.", "thai": "เราต้องดำเนินโปรแกรมฝึกอบรมต่อไป"}
{"word": "carry on", "english": "She carried on gardening despite the heat.", "thai": "เธอทำสวนต่อไปทั้งที่อากาศร้อน"}
{"word": "carry on", "english": "Carry on with your story, it’s interesting!", "thai": "เล่าต่อไป เรื่องของคุณน่าสนใจ!"}
{"word": "carry on", "english": "The team carried on with the experiment.", "thai": "ทีมดำเนินการทดลองต่อไป"}
{"word": "carry on", "english": "He told her to carry on with her drawing.", "thai": "เขาบอกให้เธอวาดภาพต่อไป"}
{"word": "carry on", "english": "They carried on the discussion after the break.", "thai": "พวกเขาคุยต่อไปหลังจากพัก"}
{"word": "carry on", "english": "She carried on running despite the injury.", "thai": "เธอวิ่งต่อไปทั้งที่บาดเจ็บ"}
{"word": "carry on", "english": "Carry on, I’m just grabbing a drink.", "thai": "ทำต่อไป ฉันแค่ไปหยิบเครื่องดื่ม"}
{"word": "carry on", "english": "The band carried on performing after the glitch.", "thai": "วงดนตรีแสดงต่อไปหลังจากปัญหา"}
{"word": "carry on", "english": "He carried on with his chores as usual.", "thai": "เขาทำงานบ้านต่อไปตามปกติ"}
{"word": "carry on", "english": "We’ll carry on with the party despite the weather.", "thai": "เราจะจัดปาร์ตี้ต่อไปทั้งที่สภาพอากาศไม่ดี"}
{"word": "carry on", "english": "She was carrying on about her new job.", "thai": "เธอพูดถึงงานใหม่ของเธอต่อไป"}
{"word": "blow up", "english": "The bomb could blow up any second.", "thai": "ระเบิดอาจระเบิดได้ทุกวินาที"}
{"word": "blow up", "english": "I need to blow up these balloons for the party.", "thai": "ฉันต้องเป่าลูกโป่งเหล่านี้สำหรับงานปาร์ตี้"}
{"word": "blow up", "english": "Don't blow up at me just because you're stressed!", "thai": "อย่าโมโหใส่ฉันเพียงเพราะคุณเครียด!"}
{"word": "blow up", "english": "Her new song is about to blow up on the charts.", "thai": "เพลงใหม่ของเธอกำลังจะดังเปรี้ยงในชาร์ต"}
{"word": "blow up", "english": "The old factory might blow up if it's not maintained.", "thai": "โรงงานเก่าอาจระเบิดถ้าไม่ได้รับการบำรุงรักษา"}
{"word": "blow up", "english": "Can you blow up this air mattress for me?", "thai": "คุณช่วยเป่าที่นอนลมนี้ให้ฉันได้ไหม?"}
{"word": "blow up", "english": "He’s gonna blow up if he hears about this mess.", "thai": "เขาจะโมโหมากถ้าได้ยินเรื่องวุ่นวายนี้"}
{"word": "blow up", "english": "That movie is starting to blow up on social media.", "thai": "หนังเรื่องนั้นเริ่มดังในโซเชียลมีเดีย"}
{"word": "blow up", "english": "Careful, or that gas leak could blow up the house.", "thai": "ระวังนะ ไม่งั้นการรั่วของก๊าซอาจทำให้บ้านระเบิด"}
{"word": "blow up", "english": "I forgot to blow up the pool float for the kids.", "thai": "ฉันลืมเป่าห่วงยางสำหรับเด็กๆ"}
{"word": "blow up", "english": "She’s gonna blow up when she sees the bill.", "thai": "เธอจะโมโหเมื่อเห็นบิล"}
{"word": "blow up", "english": "His TikTok video could blow up overnight.", "thai": "วิดีโอ TikTok ของเขาอาจดังข้ามคืน"}
{"word": "blow up", "english": "The car might blow up if you keep ignoring the engine light.", "thai": "รถอาจระเบิดถ้าคุณยังคงเพิกเฉยต่อไฟเตือนเครื่องยนต์"}
{"word": "blow up", "english": "Let’s blow up some balloons for the baby shower.", "thai": "มาเป่าลูกโป่งสำหรับงานเลี้ยงต้อนรับเด็กกันเถอะ"}
{"word": "blow up", "english": "Don’t blow up over something so small!", "thai": "อย่าโมโหเพราะเรื่องเล็กน้อยแบบนี้!"}
{"word": "blow up", "english": "That new rapper is about to blow up big time.", "thai": "แรปเปอร์หน้าใหม่นั้นกำลังจะดังสุดๆ"}
{"word": "blow up", "english": "A spark could blow up the whole gas station.", "thai": "ประกายไฟอาจทำให้ปั๊มน้ำมันทั้งหมดระเบಿದ"}
{"word": "blow up", "english": "I need to blow up this inflatable raft for the trip.", "thai": "ฉันต้องเป่าแพยางนี้สำหรับการเดินทาง"}
{"word": "blow up", "english": "He’ll blow up if we’re late again.", "thai": "เขาจะโมโหถ้าเรามาสายอีก"}
{"word": "blow up", "english": "Her Instagram post is starting to blow up.", "thai": "โพสต์ Instagram ของเธอเริ่มดัง"}
{"word": "blow up", "english": "The warehouse could blow up with all those chemicals.", "thai": "โกดังอาจระเบิดด้วยสารเคมีทั้งหมดนั้น"}
{"word": "blow up", "english": "Can you help me blow up these pool toys?", "thai": "ช่วยฉันเป่าของเล่นสระน้ำเหล่านี้ได้ไหม?"}
{"word": "blow up", "english": "She’s gonna blow up if she finds out you lied.", "thai": "เธอจะโมโหถ้ารู้ว่าคุณโกหก"}
{"word": "blow up", "english": "That meme is about to blow up online.", "thai": "มีมนั้นกำลังจะดังในโลกออนไลน์"}
{"word": "blow up", "english": "One wrong move and the lab could blow up.", "thai": "แค่ก้าวพลาดครั้งเดียว ห้องทดลองอาจระเบิด"}
{"word": "blow up", "english": "I’m trying to blow up this inflatable chair.", "thai": "ฉันกำลังพยายามเป่าเก้าอี้ลมนี้"}
{"word": "blow up", "english": "Don’t blow up at the kids for making a mess.", "thai": "อย่าโมโหเด็กๆ ที่ทำเลอะเทอะ"}
{"word": "blow up", "english": "His new app is gonna blow up in the tech world.", "thai": "แอปใหม่ของเขาจะดังในวงการเทคโนโลยี"}
{"word": "blow up", "english": "The gas tank could blow up if it’s damaged.", "thai": "ถังแก๊สอาจระเบิดถ้ามันเสียหาย"}
{"word": "blow up", "english": "We need to blow up more balloons for the event.", "thai": "เราต้องเป่าลูกโป่งเพิ่มสำหรับงานนี้"}
{"word": "blow up", "english": "He’s gonna blow up when he sees the scratch on his car.", "thai": "เขาจะโมโหเมื่อเห็นรอยขีดข่วนบนรถของเขา"}
{"word": "blow up", "english": "Her YouTube channel is starting to blow up.", "thai": "ช่อง YouTube ของเธอเริ่มดัง"}
{"word": "blow up", "english": "That old boiler might blow up if we don’t fix it.", "thai": "หม้อต้มเก่านั้นอาจระเบิดถ้าเราไม่ซ่อม"}
{"word": "blow up", "english": "Can you blow up this inflatable unicorn for the pool?", "thai": "คุณช่วยเป่ายูนิคอร์นลมนี้สำหรับสระว่ายน้ำได้ไหม?"}
{"word": "blow up", "english": "Don’t blow up just because I forgot your coffee order!", "thai": "อย่าโมโหเพียงเพราะฉันลืมสั่งกาแฟของคุณ!"}
{"word": "blow up", "english": "That band is about to blow up after their new album.", "thai": "วงนั้นกำลังจะดังหลังจากอัลบั้มใหม่"}
{"word": "blow up", "english": "The fuel depot could blow up with one mistake.", "thai": "คลังเชื้อเพลิงอาจระเบิดถ้ามีข้อผิดพลาดเพียงครั้งเดียว"}
{"word": "blow up", "english": "I’ll blow up the airbed for our guests tonight.", "thai": "ฉันจะเป่าที่นอนลมสำหรับแขกคืนนี้"}
{"word": "blow up", "english": "She’s gonna blow up if we miss her birthday.", "thai": "เธอจะโมโหถ้าเราพลาดวันเกิดของเธอ"}
{"word": "blow up", "english": "His tweet might blow up by tomorrow morning.", "thai": "ทวีตของเขาอาจดังพรุ่งนี้เช้า"}
{"word": "blow up", "english": "The pipeline could blow up if it’s not repaired.", "thai": "ท่อส่งก๊าซอาจระเบิดถ้าไม่ได้รับการซ่อม"}
{"word": "blow up", "english": "Let’s blow up some beach balls for the picnic.", "thai": "มาเป่าลูกบอลชายหาดสำหรับปิกนิกกันเถอะ"}
{"word": "blow up", "english": "He’ll blow up if we change his plans last minute.", "thai": "เขาจะโมโหถ้าเราเปลี่ยนแผนของเขาในนาทีสุดท้าย"}
{"word": "blow up", "english": "Her fashion brand is about to blow up globally.", "thai": "แบรนด์แฟชั่นของเธอกำลังจะดังระดับโลก"}
{"word": "blow up", "english": "A single spark could blow up the fireworks stash.", "thai": "ประกายไฟเพียงนิดเดียวอาจทำให้กองดอกไม้ไฟระเบิด"}
{"word": "blow up", "english": "Can you blow up this inflatable kayak for me?", "thai": "คุณช่วยเป่าเรือคายัคลมนี้ให้ฉันได้ไหม?"}
{"word": "blow up", "english": "Don’t blow up over a simple misunderstanding.", "thai": "อย่าโมโหเพราะความเข้าใจผิดเล็กน้อย"}
{"word": "blow up", "english": "That viral video is gonna blow up on X.", "thai": "วิดีโอไวรัลนั้นจะดังใน X"}
{"word": "blow up", "english": "The chemical plant could blow up if safety fails.", "thai": "โรงงานเคมีอาจระเบิดถ้าการรักษาความปลอดภัยล้มเหลว"}
{"word": "blow up", "english": "I need to blow up this inflatable Santa for Christmas.", "thai": "ฉันต้องเป่าซานตาคลอสลมนี้สำหรับคริสต์มาส"}
{"word": "blow up", "english": "She’ll blow up if we forget her anniversary.", "thai": "เธอจะโมโหถ้าเราลืมวันครบรอบของเธอ"}
{"word": "blow up", "english": "His podcast is starting to blow up this month.", "thai": "พอดแคสต์ของเขาเริ่มดังในเดือนนี้"}
{"word": "blow up", "english": "The stove could blow up if you don’t fix the gas line.", "thai": "เตาอาจระเบิดถ้าคุณไม่ซ่อมท่อแก๊ส"}
{"word": "blow up", "english": "Let’s blow up some balloons for the graduation party.", "thai": "มาเป่าลูกโป่งสำหรับงานเลี้ยงจบการศึกษากันเถอะ"}
{"word": "blow up", "english": "He’s gonna blow up if we lose his keys again.", "thai": "เขาจะโมโหถ้าเราทำกุญแจเขาหายอีก"}
{"word": "blow up", "english": "Her art project is about to blow up on Pinterest.", "thai": "โปรเจกต์ศิลปะของเธอกำลังจะดังใน Pinterest"}
{"word": "blow up", "english": "That old mine could blow up if we’re not careful.", "thai": "เหมืองเก่านั้นอาจระเบิดถ้าเราไม่ระวัง"}
{"word": "blow up", "english": "Can you blow up this inflatable dinosaur for the kids?", "thai": "คุณช่วยเป่าไดโนเสาร์ลมนี้สำหรับเด็กๆ ได้ไหม?"}
{"word": "blow up", "english": "Don’t blow up at me for being five minutes late!", "thai": "อย่าโมโหฉันที่มาสายห้านาที!"}
{"word": "blow up", "english": "That new game is gonna blow up among streamers.", "thai": "เกมใหม่นั้นจะดังในหมู่สตรีมเมอร์"}
{"word": "blow up", "english": "The reactor could blow up if it overheats.", "thai": "เครื่องปฏิกรณ์อาจระเบิดถ้ามันร้อนเกินไป"}
{"word": "blow up", "english": "I’m gonna blow up this air pillow for camping.", "thai": "ฉันจะเป่าหมอนลมนี้สำหรับแคมปิ้ง"}
{"word": "blow up", "english": "She’ll blow up if we cancel the trip.", "thai": "เธอจะโมโหถ้าเรายกเลิกการเดินทาง"}
{"word": "blow up", "english": "His blog post is starting to blow up online.", "thai": "โพสต์บล็อกของเขาเริ่มดังในโลกออนไลน์"}
{"word": "blow up", "english": "The oil rig might blow up if safety protocols fail.", "thai": "แท่นขุดเจาะน้ำมันอาจระเบิดถ้าโปรโตคอลความปลอดภัยล้มเหลว"}
{"word": "blow up", "english": "Can we blow up some more balloons for the festival?", "thai": "เราจะเป่าลูกโป่งเพิ่มสำหรับงานเทศกาลได้ไหม?"}
{"word": "blow up", "english": "He’s gonna blow up if we mess up his project.", "thai": "เขาจะโมโหถ้าเราทำโปรเจกต์ของเขาเสีย"}
{"word": "blow up", "english": "Her cooking channel is about to blow up on YouTube.", "thai": "ช่องทำอาหารของเธอกำลังจะดังใน YouTube"}
{"word": "blow up", "english": "That propane tank could blow up in a fire.", "thai": "ถังโพรเพนนั้นอาจระเบิดในกองไฟ"}
{"word": "blow up", "english": "I need to blow up this inflatable boat for the lake.", "thai": "ฉันต้องเป่าเรือลมนี้สำหรับทะเลสาบ"}
{"word": "blow up", "english": "Don’t blow up over a spilled drink!", "thai": "อย่าโมโหเพราะเครื่องดื่มหก!"}
{"word": "blow up", "english": "That new show is gonna blow up on streaming platforms.", "thai": "รายการใหม่นั้นจะดังในแพลตฟอร์มสตรีมมิ่ง"}
{"word": "blow up", "english": "The ammunition depot could blow up if mishandled.", "thai": "คลังกระสุนอาจระเบิดถ้าจัดการผิดพลาด"}
{"word": "blow up", "english": "Let’s blow up some inflatable decorations for Halloween.", "thai": "มาเป่าตกแต่งลมสำหรับฮาโลวีนกันเถอะ"}
{"word": "blow up", "english": "She’ll blow up if we forget her presentation.", "thai": "เธอจะโมโหถ้าเราลืมงานนำเสนอของเธอ"}
{"word": "blow up", "english": "His dance video is about to blow up on Instagram.", "thai": "วิดีโอเต้นของเขากำลังจะดังใน Instagram"}
{"word": "blow up", "english": "The old dynamite could blow up if it’s unstable.", "thai": "ไดนาไมต์เก่าอาจระเบิดถ้ามันไม่เสถียร"}
{"word": "blow up", "english": "Can you blow up this inflatable globe for the classroom?", "thai": "คุณช่วยเป่าลูกโลกพองลมนี้สำหรับห้องเรียนได้ไหม?"}
{"word": "blow up", "english": "Don’t blow up just because I borrowed your shirt!", "thai": "อย่าโมโหเพียงเพราะฉันยืมเสื้อของคุณ!"}
{"word": "blow up", "english": "That startup is gonna blow up in the next year.", "thai": "สตาร์ทอัพนั้นจะดังในปีหน้า"}
{"word": "blow up", "english": "The gas canister might blow up if it’s punctured.", "thai": "กระป๋องแก๊สอาจระเบิดถ้ามันถูกเจาะ"}
{"word": "blow up", "english": "I’ll blow up the air mattress for the sleepover.", "thai": "ฉันจะเป่าที่นอนลมสำหรับงานค้างคืน"}
{"word": "blow up", "english": "He’s gonna blow up if we don’t finish the report.", "thai": "เขาจะโมโหถ้าเราไม่ทำรายงานให้เสร็จ"}
{"word": "blow up", "english": "Her fitness app is starting to blow up worldwide.", "thai": "แอปฟิตเนสของเธอเริ่มดังทั่วโลก"}
{"word": "blow up", "english": "The rocket could blow up during launch.", "thai": "จรวดอาจระเบิดระหว่างการปล่อย"}
{"word": "blow up", "english": "Can you blow up this inflatable slide for the kids?", "thai": "คุณช่วยเป่าสไลเดอร์ลมนี้สำหรับเด็กๆ ได้ไหม?"}
{"word": "blow up", "english": "Don’t blow up at me for forgetting one thing!", "thai": "อย่าโมโหฉันที่ลืมอะไรไปแค่เรื่องเดียว!"}
{"word": "blow up", "english": "That comedian’s special is about to blow up online.", "thai": "รายการพิเศษของนักแสดงตลกนั้นกำลังจะดังในโลกออนไลน์"}
{"word": "blow up", "english": "The fuel line could blow up if it’s not checked.", "thai": "ท่อน้ำมันเชื้อเพลิงอาจระเบิดถ้าไม่ได้รับการตรวจสอบ"}
{"word": "blow up", "english": "I need to blow up these floaties for the pool party.", "thai": "ฉันต้องเป่าห่วงยางเหล่านี้สำหรับงานปาร์ตี้สระว่ายน้ำ"}
{"word": "blow up", "english": "She’ll blow up if we don’t invite her to the event.", "thai": "เธอจะโมโหถ้าเราไม่เชิญเธอไปงาน"}
{"word": "blow up", "english": "His new single is gonna blow up on Spotify.", "thai": "ซิงเกิ้ลใหม่ของเขาจะดังใน Spotify"}
{"word": "blow up", "english": "The storage tank could blow up under pressure.", "thai": "ถังเก็บอาจระเบิดภายใต้ความกดดัน"}
{"word": "blow up", "english": "Let’s blow up some balloons for the wedding.", "thai": "มาเป่าลูกโป่งสำหรับงานแต่งงานกันเถอะ"}
{"word": "blow up", "english": "He’s gonna blow up if we touch his stuff.", "thai": "เขาจะโมโหถ้าเราแตะต้องของของเขา"}
{"word": "blow up", "english": "Her makeup tutorial is about to blow up on YouTube.", "thai": "วิดีโอสอนแต่งหน้าของเธอกำลังจะดังใน YouTube"}
{"word": "blow up", "english": "The old grenade might blow up if mishandled.", "thai": "ระเบิดมือเก่าอาจระเบิดถ้าจัดการผิดพลาด"}
{"word": "break down", "english": "My car might break down on this old road.", "thai": "รถของฉันอาจเสียบนถนนเก่านี้"}
{"word": "break down", "english": "Can you break down the math problem for me?", "thai": "คุณช่วยอธิบายโจทย์คณิตศาสตร์ให้ฉันเข้าใจได้ไหม?"}
{"word": "break down", "english": "She started to break down when she heard the news.", "thai": "เธอเริ่มร้องไห้เมื่อได้ยินข่าว"}
{"word": "break down", "english": "The old washing machine always seems to break down.", "thai": "เครื่องซักผ้าเก่ามักจะเสีย"}
{"word": "break down", "english": "Let’s break down the project into smaller tasks.", "thai": "มาแบ่งงานนี้ออกเป็นงานย่อยๆ กันเถอะ"}
{"word": "break down", "english": "He’s gonna break down if he keeps working like this.", "thai": "เขาจะทนไม่ไหวถ้ายังทำงานแบบนี้ต่อไป"}
{"word": "break down", "english": "The computer could break down if it overheats.", "thai": "คอมพิวเตอร์อาจเสียถ้ามันร้อนเกินไป"}
{"word": "break down", "english": "Can you break down the recipe step by step?", "thai": "คุณช่วยอธิบายสูตรอาหารทีละขั้นตอนได้ไหม?"}
{"word": "break down", "english": "She might break down under all this pressure.", "thai": "เธออาจทนความกดดันนี้ไม่ไหว"}
{"word": "break down", "english": "The elevator tends to break down every month.", "thai": "ลิฟต์มักจะเสียทุกเดือน"}
{"word": "break down", "english": "Let’s break down the costs of the trip.", "thai": "มาแยกค่าใช้จ่ายของการเดินทางกันเถอะ"}
{"word": "break down", "english": "He started to break down during the funeral.", "thai": "เขาเริ่มร้องไห้ในงานศพ"}
{"word": "break down", "english": "The old truck might break down halfway there.", "thai": "รถบรรทุกเก่าอาจเสียกลางทาง"}
{"word": "break down", "english": "Can you break down the contract terms for me?", "thai": "คุณช่วยอธิบายเงื่อนไขสัญญาให้ฉันได้ไหม?"}
{"word": "break down", "english": "She’s gonna break down if no one helps her.", "thai": "เธอจะทนไม่ไหวถ้าไม่มีใครช่วย"}
{"word": "break down", "english": "The printer always seems to break down when I need it.", "thai": "เครื่องพิมพ์มักจะเสียเมื่อฉันต้องการใช้"}
{"word": "break down", "english": "Let’s break down the plan into manageable parts.", "thai": "มาแบ่งแผนออกเป็นส่วนที่จัดการได้ง่ายกันเถอะ"}
{"word": "break down", "english": "He might break down after all this stress.", "thai": "เขาอาจทนความเครียดนี้ไม่ไหว"}
{"word": "break down", "english": "The air conditioner could break down in this heat.", "thai": "เครื่องปรับอากาศอาจเสียในอากาศร้อนนี้"}
{"word": "break down", "english": "Can you break down the science behind this?", "thai": "คุณช่วยอธิบายวิทยาศาสตร์เบื้องหลังนี้ได้ไหม?"}
{"word": "break down", "english": "She started to break down during the argument.", "thai": "เธอเริ่มร้องไห้ระหว่างการโต้เถียง"}
{"word": "break down", "english": "The old motorcycle might break down on long trips.", "thai": "มอเตอร์ไซค์เก่าอาจเสียในการเดินทางไกล"}
{"word": "break down", "english": "Let’s break down the budget for the event.", "thai": "มาแยกงบประมาณสำหรับงานนี้กันเถอะ"}
{"word": "break down", "english": "He’s gonna break down if he doesn’t rest.", "thai": "เขาจะทนไม่ไหวถ้าไม่พักผ่อน"}
{"word": "break down", "english": "The fridge could break down if it’s not maintained.", "thai": "ตู้เย็นอาจเสียถ้าไม่ได้รับการบำรุงรักษา"}
{"word": "break down", "english": "Can you break down the instructions for the game?", "thai": "คุณช่วยอธิบายวิธีเล่นเกมนี้ได้ไหม?"}
{"word": "break down", "english": "She might break down if she fails the exam.", "thai": "เธออาจทนไม่ไหวถ้าสอบตก"}
{"word": "break down", "english": "The bus tends to break down in bad weather.", "thai": "รถบัสมักจะเสียในสภาพอากาศเลวร้าย"}
{"word": "break down", "english": "Let’s break down the timeline for the project.", "thai": "มาแบ่งไทม์ไลน์ของโปรเจกต์กันเถอะ"}
{"word": "break down", "english": "He started to break down after losing his job.", "thai": "เขาเริ่มร้องไห้หลังจากเสียงาน"}
{"word": "break down", "english": "The generator might break down during the storm.", "thai": "เครื่องปั่นไฟอาจเสียระหว่างพายุ"}
{"word": "break down", "english": "Can you break down the plot of the movie?", "thai": "คุณช่วยเล่าเรื่องย่อของหนังได้ไหม?"}
{"word": "break down", "english": "She’s gonna break down if she keeps overworking.", "thai": "เธอจะทนไม่ไหวถ้ายังทำงานหนักเกินไป"}
{"word": "break down", "english": "The old laptop always seems to break down.", "thai": "แล็ปท็อปเก่ามักจะเสีย"}
{"word": "break down", "english": "Let’s break down the steps to fix this issue.", "thai": "มาแยกขั้นตอนเพื่อแก้ปัญหานี้กันเถอะ"}
{"word": "break down", "english": "He might break down under all this criticism.", "thai": "เขาอาจทนคำวิจารณ์นี้ไม่ไหว"}
{"word": "break down", "english": "The tractor could break down during harvest season.", "thai": "รถแทรกเตอร์อาจเสียในช่วงฤดูเก็บเกี่ยว"}
{"word": "break down", "english": "Can you break down the rules of the game?", "thai": "คุณช่วยอธิบายกฎของเกมได้ไหม?"}
{"word": "break down", "english": "She started to break down when her dog died.", "thai": "เธอเริ่มร้องไห้เมื่อสุนัขของเธอตาย"}
{"word": "break down", "english": "The vending machine tends to break down often.", "thai": "ตู้ขายของอัตโนมัติมักจะเสียบ่อย"}
{"word": "break down", "english": "Let’s break down the expenses for the trip.", "thai": "มาแยกค่าใช้จ่ายสำหรับการเดินทางกันเถอะ"}
{"word": "break down", "english": "He’s gonna break down if he doesn’t get help.", "thai": "เขาจะทนไม่ไหวถ้าไม่ได้รับความช่วยเหลือ"}
{"word": "break down", "english": "The heater might break down in the winter.", "thai": "เครื่องทำความร้อนอาจเสียในช่วงฤดูหนาว"}
{"word": "break down", "english": "Can you break down the data for the report?", "thai": "คุณช่วยวิเคราะห์ข้อมูลสำหรับรายงานได้ไหม?"}
{"word": "break down", "english": "She might break down if she misses the deadline.", "thai": "เธออาจทนไม่ไหวถ้าพลาดกำหนดเวลา"}
{"word": "break down", "english": "The old boat could break down in the middle of the lake.", "thai": "เรือเก่าอาจเสียกลางทะเลสาบ"}
{"word": "break down", "english": "Let’s break down the schedule for the week.", "thai": "มาแบ่งตารางเวลาสำหรับสัปดาห์นี้กันเถอะ"}
{"word": "break down", "english": "He started to break down after the breakup.", "thai": "เขาเริ่มร้องไห้หลังจากการเลิกรา"}
{"word": "break down", "english": "The dryer always seems to break down on laundry day.", "thai": "เครื่องอบผ้ามักจะเสียในวันซักผ้า"}
{"word": "break down", "english": "Can you break down the argument in simple terms?", "thai": "คุณช่วยอธิบายการโต้แย้งด้วยภาษาง่ายๆ ได้ไหม?"}
{"word": "break down", "english": "She’s gonna break down if she doesn’t take a break.", "thai": "เธอจะทนไม่ไหวถ้าไม่พัก"}
{"word": "break down", "english": "The old radio might break down any day now.", "thai": "วิทยุเก่าอาจเสียวันใดวันหนึ่ง"}
{"word": "break down", "english": "Let’s break down the goals for the quarter.", "thai": "มาแบ่งเป้าหมายสำหรับไตรมาสนี้กันเถอะ"}
{"word": "break down", "english": "He might break down if he fails the test.", "thai": "เขาอาจทนไม่ไหวถ้าสอบตก"}
{"word": "break down", "english": "The dishwasher could break down if it’s overloaded.", "thai": "เครื่องล้างจานอาจเสียถ้าใส่ของมากเกินไป"}
{"word": "break down", "english": "Can you break down the process for beginners?", "thai": "คุณช่วยอธิบายขั้นตอนสำหรับมือใหม่ได้ไหม?"}
{"word": "break down", "english": "She started to break down during the interview.", "thai": "เธอเริ่มร้องไห้ระหว่างการสัมภาษณ์"}
{"word": "break down", "english": "The old scooter might break down on steep hills.", "thai": "สกู๊ตเตอร์เก่าอาจเสียบนเนินชัน"}
{"word": "break down", "english": "Let’s break down the tasks for the team.", "thai": "มาแบ่งงานให้ทีมกันเถอะ"}
{"word": "break down", "english": "He’s gonna break down if he keeps bottling it up.", "thai": "เขาจะทนไม่ไหวถ้ายังเก็บความรู้สึกไว้"}
{"word": "break down", "english": "The coffee maker could break down if it’s not cleaned.", "thai": "เครื่องชงกาแฟอาจเสียถ้าไม่ทำความสะอาด"}
{"word": "break down", "english": "Can you break down the strategy for the campaign?", "thai": "คุณช่วยอธิบายกลยุทธ์สำหรับแคมเปญได้ไหม?"}
{"word": "break down", "english": "She might break down if she hears bad news.", "thai": "เธออาจทนไม่ไหวถ้าได้ยินข่าวร้าย"}
{"word": "break down", "english": "The old van tends to break down in the rain.", "thai": "รถตู้เก่ามักจะเสียในฝน"}
{"word": "break down", "english": "Let’s break down the ingredients for the dish.", "thai": "มาแยกส่วนผสมสำหรับอาหารจานนี้กันเถอะ"}
{"word": "break down", "english": "He started to break down when his team lost.", "thai": "เขาเริ่มร้องไห้เมื่อทีมของเขาแพ้"}
{"word": "break down", "english": "The microwave might break down if it’s old.", "thai": "ไมโครเวฟอาจเสียถ้ามันเก่า"}
{"word": "break down", "english": "Can you break down the code for me?", "thai": "คุณช่วยอธิบายโค้ดให้ฉันได้ไหม?"}
{"word": "break down", "english": "She’s gonna break down if she doesn’t get support.", "thai": "เธอจะทนไม่ไหวถ้าไม่ได้รับการสนับสนุน"}
{"word": "break down", "english": "The old clock could break down any moment.", "thai": "นาฬิกาเก่าอาจเสียเมื่อไหร่ก็ได้"}
{"word": "break down", "english": "Let’s break down the roles for the play.", "thai": "มาแบ่งบทบาทสำหรับการแสดงกันเถอะ"}
{"word": "break down", "english": "He might break down if he loses his dog.", "thai": "เขาอาจทนไม่ไหวถ้าสูญเสียสุนัขของเขา"}
{"word": "break down", "english": "The blender tends to break down with tough ingredients.", "thai": "เครื่องปั่นมักจะเสียเมื่อใช้กับวัตถุดิบแข็ง"}
{"word": "break down", "english": "Can you break down the history of the event?", "thai": "คุณช่วยเล่าประวัติของงานนี้ได้ไหม?"}
{"word": "break down", "english": "She started to break down after the rejection.", "thai": "เธอเริ่มร้องไห้หลังจากถูกปฏิเสธ"}
{"word": "break down", "english": "The old bike might break down on rough terrain.", "thai": "จักรยานเก่าอาจเสียบนพื้นที่ขรุขระ"}
{"word": "break down", "english": "Let’s break down the steps for the experiment.", "thai": "มาแยกขั้นตอนสำหรับการทดลองกันเถอะ"}
{"word": "break down", "english": "He’s gonna break down if he doesn’t talk about it.", "thai": "เขาจะทนไม่ไหวถ้าไม่พูดถึงมัน"}
{"word": "break down", "english": "The fan could break down if it’s not oiled.", "thai": "พัดลมอาจเสียถ้าไม่ใส่น้ำมัน"}
{"word": "break down", "english": "Can you break down the stats from the game?", "thai": "คุณช่วยวิเคราะห์สถิติจากเกมได้ไหม?"}
{"word": "break down", "english": "She might break down if she misses her flight.", "thai": "เธออาจทนไม่ไหวถ้าพลาดเที่ยวบิน"}
{"word": "break down", "english": "The old TV tends to break down during storms.", "thai": "ทีวีเก่ามักจะเสียระหว่างพายุ"}
{"word": "break down", "english": "Let’s break down the agenda for the meeting.", "thai": "มาแยกวาระการประชุมกันเถอะ"}
{"word": "break down", "english": "He started to break down when his mom got sick.", "thai": "เขาเริ่มร้องไห้เมื่อแม่ของเขาไม่สบาย"}
{"word": "break down", "english": "The projector might break down if it’s overused.", "thai": "โปรเจคเตอร์อาจเสียถ้าใช้มากเกินไป"}
{"word": "break down", "english": "Can you break down the poem’s meaning?", "thai": "คุณช่วยอธิบายความหมายของบทกวีได้ไหม?"}
{"word": "break down", "english": "She’s gonna break down if she keeps pushing herself.", "thai": "เธอจะทนไม่ไหวถ้ายังฝืนตัวเอง"}
{"word": "break down", "english": "The old mower could break down in thick grass.", "thai": "เครื่องตัดหญ้าเก่าอาจเสียในหญ้าที่ยาว"}
{"word": "break down", "english": "Let’s break down the problem into smaller parts.", "thai": "มาแบ่งปัญหาออกเป็นส่วนย่อยๆ กันเถอะ"}
{"word": "break down", "english": "He might break down if he doesn’t get a break.", "thai": "เขาอาจทนไม่ไหวถ้าไม่หยุดพัก"}
{"word": "break down", "english": "The toaster might break down if it’s not cleaned.", "thai": "เครื่องปิ้งขนมปังอาจเสียถ้าไม่ทำความสะอาด"}
{"word": "break down", "english": "Can you break down the reasons for the decision?", "thai": "คุณช่วยอธิบายเหตุผลของการตัดสินใจได้ไหม?"}
{"word": "break down", "english": "She started to break down during the speech.", "thai": "เธอเริ่มร้องไห้ระหว่างการกล่าวสุนทรพจน์"}
{"word": "break down", "english": "The old car might break down on the highway.", "thai": "รถเก่าอาจเสียบนทางหลวง"}
{"word": "break down", "english": "Let’s break down the chores for the week.", "thai": "มาแบ่งงานบ้านสำหรับสัปดาห์นี้กันเถอะ"}
{"word": "break down", "english": "He’s gonna break down if he keeps ignoring his health.", "thai": "เขาจะทนไม่ไหวถ้ายังละเลยสุขภาพ"}
{"word": "break down", "english": "The old printer could break down during a big job.", "thai": "เครื่องพิมพ์เก่าอาจเสียระหว่างงานใหญ่"}
{"word": "break down", "english": "Can you break down the concept for the kids?", "thai": "คุณช่วยอธิบายแนวคิดให้เด็กๆ เข้าใจได้ไหม?"}
{"word": "break down", "english": "She might break down if she doesn’t get rest.", "thai": "เธออาจทนไม่ไหวถ้าไม่พักผ่อน"}
{"word": "break down", "english": "The old furnace might break down this winter.", "thai": "เตาเผาเก่าอาจเสียในฤดูหนาวนี้"}
{"word": "break up", "english": "I think we should break up before things get worse.", "thai": "ฉันคิดว่าเราควรเลิกกันก่อนที่มันจะแย่ลง"}
{"word": "break up", "english": "Did you hear? They decided to break up last night.", "thai": "ได้ยินมั้ย? พวกเขาเพิ่งตัดสินใจเลิกกันเมื่อคืน"}
{"word": "break up", "english": "It’s hard to break up when you still love someone.", "thai": "มันยากที่จะเลิกกันเมื่อยังรักใครสักคน"}
{"word": "break up", "english": "She’s not ready to break up with him yet.", "thai": "เธอยังไม่พร้อมที่จะเลิกกับเขา"}
{"word": "break up", "english": "Why do people always break up over silly things?", "thai": "ทำไมคนถึงเลิกกันเพราะเรื่องเล็กๆ น้อยๆ ล่ะ?"}
{"word": "break up", "english": "They might break up if they keep fighting like this.", "thai": "พวกเขาอาจจะเลิกกันถ้ายังทะเลาะกันแบบนี้"}
{"word": "break up", "english": "I’m scared to break up because I don’t want to be alone.", "thai": "ฉันกลัวที่จะเลิกกันเพราะไม่อยากอยู่คนเดียว"}
{"word": "break up", "english": "He’s trying to break up with her over text.", "thai": "เขากำลังพยายามเลิกกับเธอผ่านข้อความ"}
{"word": "break up", "english": "Let’s not break up over something this small.", "thai": "อย่าเลิกกันแค่เพราะเรื่องเล็กๆ แบบนี้นะ"}
{"word": "break up", "english": "It’s tough to watch your best friend break up.", "thai": "มันยากที่จะเห็นเพื่อนสนิทเลิกกับแฟน"}
{"word": "break up", "english": "They didn’t break up; they’re just taking a break.", "thai": "พวกเขาไม่ได้เลิกกัน แค่ขอพักความสัมพันธ์"}
{"word": "break up", "english": "I can’t believe they’d break up after ten years.", "thai": "ไม่เชื่อว่าพวกเขาจะเลิกกันหลังจากสิบปี"}
{"word": "break up", "english": "She wants to break up but doesn’t know how.", "thai": "เธออยากเลิกแต่ไม่รู้จะทำยังไง"}
{"word": "break up", "english": "He said he’ll never break up with her.", "thai": "เขาบอกว่าเขาจะไม่มีวันเลิกกับเธอ"}
{"word": "break up", "english": "They break up and get back together every month.", "thai": "พวกเขาเลิกแล้วก็กลับมาคบกันทุกเดือน"}
{"word": "break up", "english": "It’s easier to break up when you’re not in love.", "thai": "มันง่ายกว่าที่จะเลิกกันเมื่อไม่ได้รัก"}
{"word": "break up", "english": "I heard they’re about to break up soon.", "thai": "ได้ยินมาว่าพวกเขาจะเลิกกันเร็วๆ นี้"}
{"word": "break up", "english": "Don’t break up with him just because of rumors.", "thai": "อย่าเลิกกับเขาแค่เพราะข่าวลือ"}
{"word": "break up", "english": "The crowd started to break up after the concert.", "thai": "ฝูงชนเริ่มแยกย้ายหลังคอนเสิร์ตจบ"}
{"word": "break up", "english": "We need to break up this fight before someone gets hurt.", "thai": "เราต้องยุติการต่อสู้ก่อนที่ใครจะเจ็บ"}
{"word": "break up", "english": "The party didn’t break up until midnight.", "thai": "งานปาร์ตี้ไม่แยกย้ายจนถึงเที่ยงคืน"}
{"word": "break up", "english": "The clouds will break up by noon, I bet.", "thai": "เมฆคงจะสลายไปตอนเที่ยง ฉันว่า"}
{"word": "break up", "english": "Their band decided to break up last week.", "thai": "วงดนตรีของพวกเขาตัดสินใจยุบวงเมื่อสัปดาห์ที่แล้ว"}
{"word": "break up", "english": "Let’s break up the monotony with a game.", "thai": "มาทำลายความจำเจด้วยการเล่นเกมกันเถอะ"}
{"word": "break up", "english": "The ice will break up when spring comes.", "thai": "น้ำแข็งจะละลายเมื่อฤดูใบไม้ผลิมา"}
{"word": "break up", "english": "They had to break up the meeting early.", "thai": "พวกเขาต้องยุติการประชุมก่อนกำหนด"}
{"word": "break up", "english": "I don’t want to break up our friendship over this.", "thai": "ฉันไม่อยากทำลายมิตรภาพของเราเพราะเรื่องนี้"}
{"word": "break up", "english": "The signal’s bad; our call might break up.", "thai": "สัญญาณไม่ดี สายอาจจะขาดได้"}
{"word": "break up", "english": "She laughed so hard she couldn’t break up the story.", "thai": "เธอหัวเราะหนักจนเล่าเรื่องต่อไม่ได้"}
{"word": "break up", "english": "We should break up the tasks to finish faster.", "thai": "เราควรแบ่งงานเพื่อให้เสร็จเร็วขึ้น"}
{"word": "break up", "english": "Their relationship didn’t break up; it just faded.", "thai": "ความสัมพันธ์ของพวกเขาไม่ได้เลิก แค่ค่อยๆ จางลง"}
{"word": "break up", "english": "I’m not ready to break up with my girlfriend.", "thai": "ฉันยังไม่พร้อมที่จะเลิกกับแฟน"}
{"word": "break up", "english": "They always break up over the same argument.", "thai": "พวกเขามักจะเลิกกันเพราะเรื่องเดิมๆ"}
{"word": "break up", "english": "It’s sad to see them break up like this.", "thai": "มันน่าเศร้าที่เห็นพวกเขาเลิกกันแบบนี้"}
{"word": "break up", "english": "He didn’t want to break up, but she insisted.", "thai": "เขาไม่อยากเลิก แต่เธอยืนกราน"}
{"word": "break up", "english": "They’re trying to break up amicably this time.", "thai": "พวกเขาพยายามเลิกกันแบบเป็นมิตรครั้งนี้"}
{"word": "break up", "english": "Why did you guys break up last summer?", "thai": "ทำไมพวกคุณถึงเลิกกันเมื่อซัมเมอร์ที่แล้ว?"}
{"word": "break up", "english": "I can’t break up with him; he’s too sweet.", "thai": "ฉันเลิกกับเขาไม่ได้ เขาน่ารักเกินไป"}
{"word": "break up", "english": "The team might break up if they keep losing.", "thai": "ทีมอาจจะแตกถ้ายังแพ้ต่อไป"}
{"word": "break up", "english": "Let’s break up the work into smaller parts.", "thai": "มาแบ่งงานออกเป็นส่วนย่อยๆ กันเถอะ"}
{"word": "break up", "english": "Their marriage is about to break up, I heard.", "thai": "ได้ยินมาว่าการแต่งงานของพวกเขากำลังจะพัง"}
{"word": "break up", "english": "The fog should break up by morning.", "thai": "หมอกน่าจะสลายไปตอนเช้า"}
{"word": "break up", "english": "I don’t know how to break up with her gently.", "thai": "ฉันไม่รู้จะเลิกกับเธออย่างนุ่มนวลยังไง"}
{"word": "break up", "english": "They didn’t break up; they’re just on a break.", "thai": "พวกเขาไม่ได้เลิก แค่พักความสัมพันธ์"}
{"word": "break up", "english": "The kids need to break up that argument now.", "thai": "เด็กๆ ต้องหยุดการโต้เถียงนั้นเดี๋ยวนี้"}
{"word": "break up", "english": "Their voices break up over the bad connection.", "thai": "เสียงของพวกเขาขาดๆ หายๆ เพราะสัญญาณไม่ดี"}
{"word": "break up", "english": "I’m afraid they’ll break up before the wedding.", "thai": "ฉันกลัวว่าพวกเขาจะเลิกกันก่อนงานแต่ง"}
{"word": "break up", "english": "The old car might break up on this road.", "thai": "รถเก่าคันนี้อาจจะพังระหว่างทาง"}
{"word": "break up", "english": "We need to break up this boring routine.", "thai": "เราต้องทำลายกิจวัตรที่น่าเบื่อนี้"}
{"word": "break up", "english": "They didn’t want to break up the family.", "thai": "พวกเขาไม่อยากทำลายครอบครัว"}
{"word": "break up", "english": "The protesters refused to break up quietly.", "thai": "ผู้ประท้วงปฏิเสธที่จะแยกย้ายอย่างเงียบๆ"}
{"word": "break up", "english": "I’m not sure if they’ll break up or not.", "thai": "ฉันไม่แน่ใจว่าพวกเขาจะเลิกกันหรือเปล่า"}
{"word": "break up", "english": "Let’s break up the project into phases.", "thai": "มาแบ่งโปรเจกต์ออกเป็นระยะๆ กัน"}
{"word": "break up", "english": "Their friendship might break up over this.", "thai": "มิตรภาพของพวกเขาอาจจะแตกหักเพราะเรื่องนี้"}
{"word": "break up", "english": "The ice is starting to break up on the lake.", "thai": "น้ำแข็งเริ่มละลายบนทะเลสาบ"}
{"word": "break up", "english": "I don’t want to break up with you.", "thai": "ฉันไม่อยากเลิกกับคุณ"}
{"word": "break up", "english": "They always break up during the holidays.", "thai": "พวกเขามักจะเลิกกันช่วงวันหยุด"}
{"word": "break up", "english": "The meeting had to break up due to time.", "thai": "การประชุมต้องยุติเพราะหมดเวลา"}
{"word": "break up", "english": "Their band is rumored to break up soon.", "thai": "มีข่าวลือว่าวงของพวกเขาจะยุบเร็วๆ นี้"}
{"word": "break up", "english": "She’s heartbroken since they decided to break up.", "thai": "เธอใจสลายตั้งแต่พวกเขาตัดสินใจเลิกกัน"}
{"word": "break up", "english": "The clouds didn’t break up until evening.", "thai": "เมฆไม่สลายไปจนถึงเย็น"}
{"word": "break up", "english": "They need to break up that clique at school.", "thai": "พวกเขาต้องยุติกลุ่มนั้นที่โรงเรียน"}
{"word": "break up", "english": "I can’t believe you want to break up now.", "thai": "ไม่เชื่อว่าคุณอยากเลิกกันตอนนี้"}
{"word": "break up", "english": "The traffic jam should break up soon.", "thai": "รถติดน่าจะคลายตัวเร็วๆ นี้"}
{"word": "break up", "english": "They’re not going to break up over money.", "thai": "พวกเขาจะไม่เลิกกันเพราะเรื่องเงิน"}
{"word": "break up", "english": "The show didn’t break up until late.", "thai": "การแสดงไม่จบจนดึก"}
{"word": "break up", "english": "We should break up the chores evenly.", "thai": "เราควรแบ่งงานบ้านให้เท่ากัน"}
{"word": "break up", "english": "Their partnership might break up over this deal.", "thai": "หุ้นส่วนของพวกเขาอาจแตกหักเพราะดีลนี้"}
{"word": "break up", "english": "I’m trying to break up with him kindly.", "thai": "ฉันพยายามเลิกกับเขาแบบสุภาพ"}
{"word": "break up", "english": "The storm clouds will break up by afternoon.", "thai": "เมฆพายุจะสลายไปตอนบ่าย"}
{"word": "break up", "english": "They didn’t break up; they just drifted apart.", "thai": "พวกเขาไม่ได้เลิก แค่ค่อยๆ ห่างกัน"}
{"word": "break up", "english": "Let’s break up the silence with some music.", "thai": "มาทำลายความเงียบด้วยเพลงกันเถอะ"}
{"word": "break up", "english": "The couple decided to break up quietly.", "thai": "คู่รักตัดสินใจเลิกกันอย่างเงียบๆ"}
{"word": "break up", "english": "I don’t know why they’d break up now.", "thai": "ฉันไม่รู้ว่าทำไมพวกเขาถึงเลิกกันตอนนี้"}
{"word": "break up", "english": "The group started to break up after the speech.", "thai": "กลุ่มเริ่มแยกย้ายหลังการพูด"}
{"word": "break up", "english": "We can’t let this disagreement break up our team.", "thai": "เราไม่ปล่อยให้ความขัดแย้งนี้ทำลายทีม"}
{"word": "break up", "english": "The old ship might break up in the storm.", "thai": "เรือเก่าอาจแตกสลายในพายุ"}
{"word": "break up", "english": "They’re afraid to break up because of the kids.", "thai": "พวกเขากลัวที่จะเลิกกันเพราะลูกๆ"}
{"word": "break up", "english": "The call keeps trying to break up.", "thai": "สายโทรศัพท์ขาดๆ หายๆ"}
{"word": "break up", "english": "I think it’s time we break up for good.", "thai": "ฉันคิดว่าได้เวลาที่เราจะเลิกกันถาวร"}
{"word": "break up", "english": "The class didn’t break up until the bell rang.", "thai": "ชั้นเรียนไม่แยกย้ายจนกว่ากระดิ่งจะดัง"}
{"word": "break up", "english": "They might break up over long-distance issues.", "thai": "พวกเขาอาจเลิกกันเพราะปัญหาความสัมพันธ์ทางไกล"}
{"word": "break up", "english": "The ice will break up when it gets warmer.", "thai": "น้ำแข็งจะละลายเมื่ออากาศอุ่นขึ้น"}
{"word": "break up", "english": "She’s planning to break up with him tomorrow.", "thai": "เธอวางแผนจะเลิกกับเขาพรุ่งนี้"}
{"word": "break up", "english": "The meeting had to break up due to an emergency.", "thai": "การประชุมต้องยุติเพราะเหตุฉุกเฉิน"}
{"word": "break up", "english": "They didn’t break up; they just needed space.", "thai": "พวกเขาไม่ได้เลิก แค่ต้องการพื้นที่"}
{"word": "break up", "english": "Let’s break up the day with a quick walk.", "thai": "มาทำลายวันนี้ด้วยการเดินเล่นสั้นๆ"}
{"word": "break up", "english": "Their band might break up after this tour.", "thai": "วงของพวกเขาอาจยุบหลังทัวร์นี้"}
{"word": "break up", "english": "I don’t want to break up over a misunderstanding.", "thai": "ฉันไม่อยากเลิกกันเพราะความเข้าใจผิด"}
{"word": "break up", "english": "The crowd began to break up after the announcement.", "thai": "ฝูงชนเริ่มแยกย้ายหลังการประกาศ"}
{"word": "break up", "english": "They’re trying not to break up before the holidays.", "thai": "พวกเขาพยายามไม่เลิกกันก่อนวันหยุด"}
{"word": "break up", "english": "The old bridge might break up in the flood.", "thai": "สะพานเก่าอาจพังในน้ำท่วม"}
{"word": "break up", "english": "We need to break up this tension with a joke.", "thai": "เราต้องคลายความตึงเครียดด้วยมุกตลก"}
{"word": "break up", "english": "They didn’t break up; they’re still friends.", "thai": "พวกเขาไม่ได้เลิก ยังเป็นเพื่อนกัน"}
{"word": "break up", "english": "The signal might break up in this storm.", "thai": "สัญญาณอาจขาดๆ หายๆ ในพายุนี้"}
{"word": "break up", "english": "I’m not sure how to break up with her.", "thai": "ฉันไม่แน่ใจว่าจะเลิกกับเธอยังไง"}
{"word": "break up", "english": "The team didn’t break up despite the loss.", "thai": "ทีมไม่ได้แตกแยกแม้จะแพ้"}
{"word": "break up", "english": "Let’s break up the workload to make it easier.", "thai": "มาแบ่งงานเพื่อให้ง่ายขึ้น"}
{"word": "break up", "english": "They decided to break up after a long talk.", "thai": "พวกเขาตัดสินใจเลิกกันหลังคุยกันยาว"}
{"word": "bring up", "english": "Why did you bring up that old argument again?", "thai": "ทำไมคุณถึงหยิบยกเรื่องทะเลาะเก่ามาพูดอีก?"}
{"word": "bring up", "english": "She always tries to bring up her kids in conversations.", "thai": "เธอมักจะพูดถึงลูกๆ ของเธอในการสนทนา"}
{"word": "bring up", "english": "I didn’t want to bring up the issue at the meeting.", "thai": "ฉันไม่อยากหยิบยกประเด็นนั้นในที่ประชุม"}
{"word": "bring up", "english": "They’re doing their best to bring up their son well.", "thai": "พวกเขาพยายามเลี้ยงลูกชายให้ดีที่สุด"}
{"word": "bring up", "english": "Can we not bring up politics at dinner?", "thai": "อย่าหยิบยกเรื่องการเมืองตอนกินข้าวได้มั้ย?"}
{"word": "bring up", "english": "He didn’t bring up the topic of moving again.", "thai": "เขาไม่ได้พูดถึงเรื่องย้ายบ้านอีก"}
{"word": "bring up", "english": "It’s hard to bring up kids in this economy.", "thai": "มันยากที่จะเลี้ยงลูกในเศรษฐกิจแบบนี้"}
{"word": "bring up", "english": "Don’t bring up her ex; it makes her upset.", "thai": "อย่าพูดถึงแฟนเก่าของเธอ มันทำให้เธอเสียใจ"}
{"word": "bring up", "english": "I’ll bring up the idea during our next call.", "thai": "ฉันจะหยิบยกไอเดียนั้นในสายครั้งหน้า"}
{"word": "bring up", "english": "Who brought up the plan to go camping?", "thai": "ใครเป็นคนเสนอแผนไปแคมป์ปิ้ง?"}
{"word": "bring up", "english": "She was brought up in a small town.", "thai": "เธอเติบโตในเมืองเล็กๆ"}
{"word": "bring up", "english": "Let’s bring up the schedule at the meeting.", "thai": "มาพูดถึงตารางในที่ประชุมกันเถอะ"}
{"word": "bring up", "english": "He always brings up his old college stories.", "thai": "เขามักจะพูดถึงเรื่องเก่าๆ สมัยเรียนมหาลัย"}
{"word": "bring up", "english": "They brought up their kids to be kind.", "thai": "พวกเขาเลี้ยงลูกให้เป็นคนใจดี"}
{"word": "bring up", "english": "I hate when you bring up my mistakes.", "thai": "ฉันเกลียดที่คุณหยิบยกความผิดพลาดของฉันมาพูด"}
{"word": "bring up", "english": "The teacher brought up an interesting point.", "thai": "ครูหยิบยกประเด็นที่น่าสนใจ"}
{"word": "bring up", "english": "Don’t bring up the budget cuts now.", "thai": "อย่าพูดถึงการตัดงบประมาณตอนนี้"}
{"word": "bring up", "english": "She was brought up to respect her elders.", "thai": "เธอถูกเลี้ยงมาให้เคารพผู้ใหญ่"}
{"word": "bring up", "english": "I’ll bring up your suggestion with the team.", "thai": "ฉันจะเสนอคำแนะนำของคุณกับทีม"}
{"word": "bring up", "english": "Why do you always bring up the past?", "thai": "ทำไมคุณถึงชอบพูดถึงอดีต?"}
{"word": "call back", "english": "Can you call back later?", "thai": "คุณโทรกลับมาได้ไหม?"}
{"word": "call back", "english": "I’ll call back in an hour.", "thai": "ฉันจะโทรกลับมาภายในหนึ่งชั่วโมง"}
{"word": "call back", "english": "She didn’t call back yesterday.", "thai": "เมื่อวานเธอไม่ได้โทรกลับมา"}
{"word": "call back", "english": "Please call back after 5 PM.", "thai": "กรุณาโทรกลับมาหลังห้าโมงเย็น"}
{"word": "call back", "english": "He promised to call back soon.", "thai": "เขาสัญญาว่าจะโทรกลับมาเร็วๆ นี้"}
{"word": "call back", "english": "Why didn’t you call back?", "thai": "ทำไมคุณไม่โทรกลับมา?"}
{"word": "call back", "english": "I need to call back my boss.", "thai": "ฉันต้องโทรกลับไปหาเจ้านาย"}
{"word": "call back", "english": "They’ll call back tomorrow morning.", "thai": "พวกเขาจะโทรกลับมาพรุ่งนี้เช้า"}
{"word": "call back", "english": "Can I call back in ten minutes?", "thai": "ฉันโทรกลับมาในสิบนาทีได้ไหม?"}
{"word": "call back", "english": "She asked me to call back later.", "thai": "เธอบอกให้ฉันโทรกลับมาทีหลัง"}
{"word": "call back", "english": "I forgot to call back yesterday.", "thai": "ฉันลืมโทรกลับมาเมื่อวาน"}
{"word": "call back", "english": "He’s too busy to call back now.", "thai": "เขายุ่งเกินกว่าจะโทรกลับมาตอนนี้"}
{"word": "call back", "english": "Let me call back after lunch.", "thai": "ให้ฉันโทรกลับมาหลังอาหารกลางวัน"}
{"word": "call back", "english": "Did they call back yet?", "thai": "พวกเขาโทรกลับมาหรือยัง?"}
{"word": "call back", "english": "I’ll call back when I’m free.", "thai": "ฉันจะโทรกลับมาเมื่อว่าง"}
{"word": "call back", "english": "She never seems to call back.", "thai": "เธอเหมือนจะไม่เคยโทรกลับมาเลย"}
{"word": "call back", "english": "Can you call back this evening?", "thai": "คุณโทรกลับมาเย็นนี้ได้ไหม?"}
{"word": "call back", "english": "I tried to call back, but no answer.", "thai": "ฉันพยายามโทรกลับ แต่ไม่มีคนรับ"}
{"word": "call back", "english": "He said he’d call back soon.", "thai": "เขาบอกว่าเขาจะโทรกลับมาเร็วๆ นี้"}
{"word": "call back", "english": "Please call back before noon.", "thai": "กรุณาโทรกลับมาก่อนเที่ยง"}
{"word": "call back", "english": "I’ll call back after the meeting.", "thai": "ฉันจะโทรกลับมาหลังการประชุม"}
{"word": "call back", "english": "They didn’t call back last week.", "thai": "พวกเขาไม่ได้โทรกลับมาสัปดาห์ที่แล้ว"}
{"word": "call back", "english": "Can you call back tomorrow?", "thai": "คุณโทรกลับมาพรุ่งนี้ได้ไหม?"}
{"word": "call back", "english": "I need to call back my doctor.", "thai": "ฉันต้องโทรกลับไปหาหมอ"}
{"word": "call back", "english": "She’ll call back in a bit.", "thai": "เธอจะโทรกลับมาในอีกสักครู่"}
{"word": "call back", "english": "Why don’t they ever call back?", "thai": "ทำไมพวกเขาไม่เคยโทรกลับมาเลย?"}
{"word": "call back", "english": "I’ll call back after I check.", "thai": "ฉันจะโทรกลับมาหลังจากตรวจสอบ"}
{"word": "call back", "english": "He forgot to call back again.", "thai": "เขาลืมโทรกลับมาอีกแล้ว"}
{"word": "call back", "english": "Can you call back in five minutes?", "thai": "คุณโทรกลับมาในห้านาทีได้ไหม?"}
{"word": "call back", "english": "I’ll call back when I’m home.", "thai": "ฉันจะโทรกลับมาเมื่อถึงบ้าน"}
{"word": "call back", "english": "She asked him to call back later.", "thai": "เธอบอกให้เขาโทรกลับมาทีหลัง"}
{"word": "call back", "english": "They promised to call back soon.", "thai": "พวกเขาสัญญาว่าจะโทรกลับมาเร็วๆ นี้"}
{"word": "call back", "english": "I’ll call back after dinner.", "thai": "ฉันจะโทรกลับมาหลังอาหารเย็น"}
{"word": "call back", "english": "Did he call back this morning?", "thai": "เขาโทรกลับมาเช้านี้หรือเปล่า?"}
{"word": "call back", "english": "Please call back as soon as possible.", "thai": "กรุณาโทรกลับมาโดยเร็วที่สุด"}
{"word": "call back", "english": "I’ll call back in a few minutes.", "thai": "ฉันจะโทรกลับมาในอีกไม่กี่นาที"}
{"word": "call back", "english": "She didn’t call back last night.", "thai": "เมื่อคืนเธอไม่ได้โทรกลับมา"}
{"word": "call back", "english": "Can you call back after work?", "thai": "คุณโทรกลับมาหลังเลิกงานได้ไหม?"}
{"word": "call back", "english": "I need to call back my friend.", "thai": "ฉันต้องโทรกลับไปหาเพื่อน"}
{"word": "call back", "english": "He’ll call back in the morning.", "thai": "เขาจะโทรกลับมาในตอนเช้า"}
{"word": "call back", "english": "Why hasn’t she called back yet?", "thai": "ทำไมเธอยังไม่โทรกลับมา?"}
{"word": "call back", "english": "I’ll call back after I eat.", "thai": "ฉันจะโทรกลับมาหลังกินข้าว"}
{"word": "call back", "english": "They said they’d call back later.", "thai": "พวกเขาบอกว่าจะโทรกลับมาทีหลัง"}
{"word": "call back", "english": "Can you call back around 3 PM?", "thai": "คุณโทรกลับมาประมาณบ่ายสามได้ไหม?"}
{"word": "call back", "english": "I forgot to call back my mom.", "thai": "ฉันลืมโทรกลับไปหาแม่"}
{"word": "call back", "english": "She’ll call back when she’s free.", "thai": "เธอจะโทรกลับมาเมื่อว่าง"}
{"word": "call back", "english": "He didn’t call back after the call.", "thai": "เขาไม่ได้โทรกลับมาหลังจากการโทร"}
{"word": "call back", "english": "Please call back before 8 PM.", "thai": "กรุณาโทรกลับมาก่อนสองทุ่ม"}
{"word": "call back", "english": "I’ll call back once I’m done.", "thai": "ฉันจะโทรกลับมาเมื่อเสร็จ"}
{"word": "call back", "english": "Did you call back the client?", "thai": "คุณโทรกลับไปหาลูกค้าหรือยัง?"}
{"word": "call back", "english": "She needs to call back soon.", "thai": "เธอต้องโทรกลับมาเร็วๆ นี้"}
{"word": "call back", "english": "I’ll call back after I check my schedule.", "thai": "ฉันจะโทรกลับมาหลังจากตรวจตาราง"}
{"word": "call back", "english": "He asked me to call back tomorrow.", "thai": "เขาบอกให้ฉันโทรกลับมาพรุ่งนี้"}
{"word": "call back", "english": "Can you call back in the afternoon?", "thai": "คุณโทรกลับมาช่วงบ่ายได้ไหม?"}
{"word": "call back", "english": "I’ll call back when I’m ready.", "thai": "ฉันจะโทรกลับมาเมื่อพร้อม"}
{"word": "call back", "english": "She forgot to call back again.", "thai": "เธอลืมโทรกลับมาอีกแล้ว"}
{"word": "call back", "english": "They’ll call back after the weekend.", "thai": "พวกเขาจะโทรกลับมาหลังสุดสัปดาห์"}
{"word": "call back", "english": "Please call back when you’re free.", "thai": "กรุณาโทรกลับมาเมื่อคุณว่าง"}
{"word": "call back", "english": "I need to call back the office.", "thai": "ฉันต้องโทรกลับไปที่ออฟฟิศ"}
{"word": "call back", "english": "He’ll call back in a few hours.", "thai": "เขาจะโทรกลับมาในอีกไม่กี่ชั่วโมง"}
{"word": "call back", "english": "Why didn’t he call back yet?", "thai": "ทำไมเขาไม่โทรกลับมา?"}
{"word": "call back", "english": "I’ll call back after my appointment.", "thai": "ฉันจะโทรกลับมาหลังนัดหมาย"}
{"word": "call back", "english": "She said to call back later.", "thai": "เธอบอกให้โทรกลับมาทีหลัง"}
{"word": "call back", "english": "Can you call back next week?", "thai": "คุณโทรกลับมาสัปดาห์หน้าได้ไหม?"}
{"word": "call back", "english": "I forgot to call back my sister.", "thai": "ฉันลืมโทรกลับไปหาน้องสาว"}
{"word": "call back", "english": "They didn’t call back after the meeting.", "thai": "พวกเขาไม่ได้โทรกลับมาหลังการประชุม"}
{"word": "call back", "english": "I’ll call back when I get home.", "thai": "ฉันจะโทรกลับมาเมื่อถึงบ้าน"}
{"word": "call back", "english": "Please call back in the morning.", "thai": "กรุณาโทรกลับมาในตอนเช้า"}
{"word": "call back", "english": "He needs to call back urgently.", "thai": "เขาต้องโทรกลับมาด่วน"}
{"word": "call back", "english": "I’ll call back after I finish work.", "thai": "ฉันจะโทรกลับมาหลังเลิกงาน"}
{"word": "call back", "english": "She’ll call back in a couple of hours.", "thai": "เธอจะโทรกลับมาในอีกสองสามชั่วโมง"}
{"word": "call back", "english": "Did they call back about the issue?", "thai": "พวกเขาโทรกลับมาเรื่องปัญหานั้นหรือยัง?"}
{"word": "call back", "english": "Can you call back after 7 PM?", "thai": "คุณโทรกลับมาหลังหนึ่งทุ่มได้ไหม?"}
{"word": "call back", "english": "I need to call back my teacher.", "thai": "ฉันต้องโทรกลับไปหาครู"}
{"word": "call back", "english": "He didn’t call back after lunch.", "thai": "เขาไม่ได้โทรกลับมาหลังอาหารกลางวัน"}
{"word": "call back", "english": "I’ll call back when I’m done here.", "thai": "ฉันจะโทรกลับมาเมื่อเสร็จที่นี่"}
{"word": "call back", "english": "She asked to call back tomorrow.", "thai": "เธอบอกให้โทรกลับมาพรุ่งนี้"}
{"word": "call back", "english": "Please call back before the deadline.", "thai": "กรุณาโทรกลับมาก่อนกำหนด"}
{"word": "call back", "english": "I’ll call back after I talk to him.", "thai": "ฉันจะโทรกลับมาหลังจากคุยกับเขา"}
{"word": "call back", "english": "They forgot to call back yesterday.", "thai": "พวกเขาลืมโทรกลับมาเมื่อวาน"}
{"word": "call back", "english": "Can you call back in an hour?", "thai": "คุณโทรกลับมาในหนึ่งชั่วโมงได้ไหม?"}
{"word": "call back", "english": "I need to call back my lawyer.", "thai": "ฉันต้องโทรกลับไปหาทนาย"}
{"word": "call back", "english": "She’ll call back after her shift.", "thai": "เธอจะโทรกลับมาหลังกะงาน"}
{"word": "call back", "english": "Why don’t you call back later?", "thai": "ทำไมคุณไม่โทรกลับมาทีหลัง?"}
{"word": "call back", "english": "I’ll call back once I know more.", "thai": "ฉันจะโทรกลับมาเมื่อรู้มากกว่านี้"}
{"word": "call back", "english": "He said to call back in the evening.", "thai": "เขาบอกให้โทรกลับมาในตอนเย็น"}
{"word": "call back", "english": "Please call back after the holiday.", "thai": "กรุณาโทรกลับมาหลังวันหยุด"}
{"word": "call back", "english": "I forgot to call back my cousin.", "thai": "ฉันลืมโทรกลับไปหาลูกพี่ลูกน้อง"}
{"word": "call back", "english": "They’ll call back when they’re ready.", "thai": "พวกเขาจะโทรกลับมาเมื่อพร้อม"}
{"word": "call back", "english": "Can you call back before dinner?", "thai": "คุณโทรกลับมาก่อนอาหารเย็นได้ไหม?"}
{"word": "call back", "english": "I’ll call back after my class.", "thai": "ฉันจะโทรกลับมาหลังเรียน"}
{"word": "call back", "english": "She didn’t call back this afternoon.", "thai": "บ่ายนี้เธอไม่ได้โทรกลับมา"}
{"word": "call back", "english": "He needs to call back by tonight.", "thai": "เขาต้องโทรกลับมาก่อนคืนนี้"}
{"word": "call back", "english": "I’ll call back when I’m back in town.", "thai": "ฉันจะโทรกลับมาเมื่อกลับมาในเมือง"}
{"word": "call back", "english": "Please call back when you get this.", "thai": "กรุณาโทรกลับมาเมื่อได้รับข้อความนี้"}
{"word": "call back", "english": "I need to call back the store.", "thai": "ฉันต้องโทรกลับไปที่ร้าน"}
{"word": "call back", "english": "She’ll call back after her meeting.", "thai": "เธอจะโทรกลับมาหลังการประชุม"}
{"word": "call back", "english": "Can you call back after 9 PM?", "thai": "คุณโทรกลับมาหลังสามทุ่มได้ไหม?"}
{"word": "call off", "english": "We had to call off the meeting.", "thai": "เราต้องยกเลิกการประชุม"}
{"word": "call off", "english": "Can you call off the party?", "thai": "คุณยกเลิกงานปาร์ตี้ได้ไหม?"}
{"word": "call off", "english": "They decided to call off the wedding.", "thai": "พวกเขาตัดสินใจยกเลิกงานแต่งงาน"}
{"word": "call off", "english": "I’ll call off the trip tomorrow.", "thai": "ฉันจะยกเลิกการเดินทางพรุ่งนี้"}
{"word": "call off", "english": "She called off her engagement.", "thai": "เธอยกเลิกการหมั้น"}
{"word": "call off", "english": "Why did they call off the game?", "thai": "ทำไมพวกเขายกเลิกเกม?"}
{"word": "call off", "english": "He called off the deal last night.", "thai": "เมื่อคืนเขายกเลิกข้อตกลง"}
{"word": "call off", "english": "Let’s call off the event due to rain.", "thai": "มา�ยกเลิกงานเพราะฝนตกกันเถอะ"}
{"word": "call off", "english": "They had to call off the concert.", "thai": "พวกเขาต้องยกเลิกคอนเสิร์ต"}
{"word": "call off", "english": "Can we call off the plan now?", "thai": "เรายกเลิกแผนตอนนี้ได้ไหม?"}
{"word": "call off", "english": "She didn’t want to call off the search.", "thai": "เธอไม่อยากยกเลิกการค้นหา"}
{"word": "call off", "english": "He called off his vacation plans.", "thai": "เขายกเลิกแผนวันหยุด"}
{"word": "call off", "english": "Why don’t we call off the dinner?", "thai": "ทำไมเราไม่ยกเลิกอาหารเย็นล่ะ?"}
{"word": "call off", "english": "They called off the strike yesterday.", "thai": "เมื่อวานพวกเขายกเลิกการนัดหยุดงาน"}
{"word": "call off", "english": "I need to call off my appointment.", "thai": "ฉันต้องยกเลิกนัดหมาย"}
{"word": "call off", "english": "She called off the project last week.", "thai": "สัปดาห์ที่แล้วเธอยกเลิกโปรเจกต์"}
{"word": "call off", "english": "Can you call off the order?", "thai": "คุณยกเลิกคำสั่งซื้อได้ไหม?"}
{"word": "call off", "english": "He decided to call off the bet.", "thai": "เขาตัดสินใจยกเลิกการเดิมพัน"}
{"word": "call off", "english": "They called off the negotiations.", "thai": "พวกเขายกเลิกการเจรจา"}
{"word": "call off", "english": "Let’s call off the hike tomorrow.", "thai": "มา�ยกเลิกการเดินป่าพรุ่งนี้เถอะ"}
{"word": "call off", "english": "She had to call off her speech.", "thai": "เธอต้องยกเลิกการพูด"}
{"word": "call off", "english": "Why did he call off the trade?", "thai": "ทำไมเขายกเลิกการค้าขาย?"}
{"word": "call off", "english": "I’ll call off the reservation tonight.", "thai": "คืนนี้ฉันจะยกเลิกการจอง"}
{"word": "call off", "english": "They called off the protest today.", "thai": "วันนี้พวกเขายกเลิกการประท้วง"}
{"word": "call off", "english": "Can we call off the class?", "thai": "เรายกเลิกชั้นเรียนได้ไหม?"}
{"word": "call off", "english": "He called off his retirement plans.", "thai": "เขายกเลิกแผนเกษียณ"}
{"word": "call off", "english": "She didn’t call off the event.", "thai": "เธอไม่ได้ยกเลิกงาน"}
{"word": "call off", "english": "Let’s call off the barbecue.", "thai": "มา�ยกเลิกงานบาร์บีคิวกันเถอะ"}
{"word": "call off", "english": "They had to call off the festival.", "thai": "พวกเขาต้องยกเลิกเทศกาล"}
{"word": "call off", "english": "Why call off the rehearsal?", "thai": "ทำไมต้องยกเลิกการซ้อม?"}
{"word": "call off", "english": "I’ll call off the delivery tomorrow.", "thai": "พรุ่งนี้ฉันจะยกเลิกการจัดส่ง"}
{"word": "call off", "english": "She called off her performance.", "thai": "เธอยกเลิกการแสดง"}
{"word": "call off", "english": "Can you call off the dogs?", "thai": "คุณเรียกสุนัขกลับได้ไหม?"}
{"word": "call off", "english": "He called off the attack plan.", "thai": "เขายกเลิกแผนโจมตี"}
{"word": "call off", "english": "They decided to call off the merger.", "thai": "พวกเขาตัดสินใจยกเลิกการควบรวม"}
{"word": "call off", "english": "Let’s call off the picnic.", "thai": "มา�ยกเลิกปิกนิกกันเถอะ"}
{"word": "call off", "english": "She had to call off her trip.", "thai": "เธอต้องยกเลิกการเดินทาง"}
{"word": "call off", "english": "Why did they call off the show?", "thai": "ทำไมพวกเขายกเลิกการแสดง?"}
{"word": "call off", "english": "I’ll call off the order tonight.", "thai": "คืนนี้ฉันจะยกเลิกคำสั่งซื้อ"}
{"word": "call off", "english": "He called off the experiment.", "thai": "เขายกเลิกการทดลอง"}
{"word": "call off", "english": "Can we call off the outing?", "thai": "เรายกเลิกการออกนอกสถานที่ได้ไหม?"}
{"word": "call off", "english": "They called off the search yesterday.", "thai": "เมื่อวานพวกเขายกเลิกการค้นหา"}
{"word": "call off", "english": "She didn’t want to call off the deal.", "thai": "เธอไม่อยากยกเลิกข้อตกลง"}
{"word": "call off", "english": "Let’s call off the celebration.", "thai": "มา�ยกเลิกงานฉลองกันเถอะ"}
{"word": "call off", "english": "He called off his campaign.", "thai": "เขายกเลิกแคมเปญ"}
{"word": "call off", "english": "Why call off the tournament?", "thai": "ทำไมต้องยกเลิกการแข่งขัน?"}
{"word": "call off", "english": "I need to call off my flight.", "thai": "ฉันต้องยกเลิกเที่ยวบิน"}
{"word": "call off", "english": "They called off the rally today.", "thai": "วันนี้พวกเขายกเลิกการชุมนุม"}
{"word": "call off", "english": "Can you call off the inspection?", "thai": "คุณยกเลิกการตรวจสอบได้ไหม?"}
{"word": "call off", "english": "She called off her speech class.", "thai": "เธอยกเลิกชั้นเรียนการพูด"}
{"word": "call off", "english": "He had to call off the launch.", "thai": "เขาต้องยกเลิกการเปิดตัว"}
{"word": "call off", "english": "Let’s call off the gathering.", "thai": "มา�ยกเลิกการรวมตัวกันเถอะ"}
{"word": "call off", "english": "They didn’t call off the event.", "thai": "พวกเขาไม่ได้ยกเลิกงาน"}
{"word": "call off", "english": "Why did she call off the date?", "thai": "ทำไมเธอยกเลิกเดต?"}
{"word": "call off", "english": "I’ll call off the meeting tomorrow.", "thai": "พรุ่งนี้ฉันจะยกเลิกการประชุม"}
{"word": "call off", "english": "He called off his retirement party.", "thai": "เขายกเลิกงานเลี้ยงเกษียณ"}
{"word": "call off", "english": "Can we call off the training?", "thai": "เรายกเลิกการฝึกอบรมได้ไหม?"}
{"word": "call off", "english": "She called off her interview.", "thai": "เธอยกเลิกการสัมภาษณ์"}
{"word": "call off", "english": "They had to call off the parade.", "thai": "พวกเขาต้องยกเลิกขบวนพาเหรด"}
{"word": "call off", "english": "Let’s call off the road trip.", "thai": "มา�ยกเลิกการเดินทางโดยรถกันเถอะ"}
{"word": "call off", "english": "He didn’t call off the plan.", "thai": "เขาไม่ได้ยกเลิกแผน"}
{"word": "call off", "english": "Why call off the fundraiser?", "thai": "ทำไมต้องยกเลิกงานระดมทุน?"}
{"word": "call off", "english": "I’ll call off the appointment later.", "thai": "ฉันจะยกเลิกนัดหมายทีหลัง"}
{"word": "call off", "english": "She called off her book launch.", "thai": "เธอยกเลิกการเปิดตัวหนังสือ"}
{"word": "call off", "english": "Can you call off the delivery?", "thai": "คุณยกเลิกการจัดส่งได้ไหม?"}
{"word": "call off", "english": "They called off the auction today.", "thai": "วันนี้พวกเขายกเลิกการประมูล"}
{"word": "call off", "english": "He had to call off his speech.", "thai": "เขาต้องยกเลิกการพูด"}
{"word": "call off", "english": "Let’s call off the family reunion.", "thai": "มา�ยกเลิกการรวมตัวครอบครัวกันเถอะ"}
{"word": "call off", "english": "She didn’t call off the wedding.", "thai": "เธอไม่ได้ยกเลิกงานแต่งงาน"}
{"word": "call off", "english": "Why did they call off the match?", "thai": "ทำไมพวกเขายกเลิกการแข่งขัน?"}
{"word": "call off", "english": "I’ll call off the dinner plans.", "thai": "ฉันจะยกเลิกแผนอาหารเย็น"}
{"word": "call off", "english": "He called off his business trip.", "thai": "เขายกเลิกการเดินทางเพื่อธุรกิจ"}
{"word": "call off", "english": "Can we call off the workshop?", "thai": "เรายกเลิกเวิร์กช็อปได้ไหม?"}
{"word": "call off", "english": "She called off her charity event.", "thai": "เธอยกเลิกงานการกุศล"}
{"word": "call off", "english": "They had to call off the tour.", "thai": "พวกเขาต้องยกเลิกทัวร์"}
{"word": "call off", "english": "Let’s call off the movie night.", "thai": "มา�ยกเลิกคืนดูหนังกันเถอะ"}
{"word": "call off", "english": "He didn’t call off the contract.", "thai": "เขาไม่ได้ยกเลิกสัญญา"}
{"word": "call off", "english": "Why call off the ceremony?", "thai": "ทำไมต้องยกเลิกพิธี?"}
{"word": "call off", "english": "I’ll call off the reservation today.", "thai": "วันนี้ฉันจะยกเลิกการจอง"}
{"word": "call off", "english": "She called off her art exhibit.", "thai": "เธอยกเลิกนิทรรศการศิลปะ"}
{"word": "call off", "english": "Can you call off the repair?", "thai": "คุณยกเลิกการซ่อมได้ไหม?"}
{"word": "call off", "english": "They called off the conference.", "thai": "พวกเขายกเลิกการประชุมสัมมนา"}
{"word": "call off", "english": "He had to call off his plans.", "thai": "เขาต้องยกเลิกแผนของเขา"}
{"word": "call off", "english": "Let’s call off the camping trip.", "thai": "มา�ยกเลิกการไปแคมป์กันเถอะ"}
{"word": "call off", "english": "She didn’t call off the meeting.", "thai": "เธอไม่ได้ยกเลิกการประชุม"}
{"word": "call off", "english": "Why did he call off the event?", "thai": "ทำไมเขายกเลิกงาน?"}
{"word": "call off", "english": "I’ll call off the party tonight.", "thai": "คืนนี้ฉันจะยกเลิกปาร์ตี้"}
{"word": "call off", "english": "He called off his vacation.", "thai": "เขายกเลิกวันหยุด"}
{"word": "call off", "english": "Can we call off the test?", "thai": "เรายกเลิกการสอบได้ไหม?"}
{"word": "call off", "english": "She called off her presentation.", "thai": "เธอยกเลิกการนำเสนอ"}
{"word": "call off", "english": "They had to call off the show.", "thai": "พวกเขาต้องยกเลิกการแสดง"}
{"word": "call off", "english": "Let’s call off the lunch date.", "thai": "มา�ยกเลิกนัดกินข้าวเที่ยงกันเถอะ"}
{"word": "call off", "english": "He didn’t call off the deal.", "thai": "เขาไม่ได้ยกเลิกข้อตกลง"}
{"word": "call off", "english": "Why call off the training session?", "thai": "ทำไมต้องยกเลิกเซสชันฝึกอบรม?"}
{"word": "call off", "english": "I’ll call off the appointment tomorrow.", "thai": "พรุ่งนี้ฉันจะยกเลิกนัดหมาย"}
{"word": "call off", "english": "She called off her dance recital.", "thai": "เธอยกเลิกการแสดงเต้นรำ"}
{"word": "call off", "english": "Can you call off the service?", "thai": "คุณยกเลิกการบริการได้ไหม?"}
{"word": "call off", "english": "They called off the game tonight.", "thai": "คืนนี้พวกเขายกเลิกเกม"}
