{"word": "catch up", "english": "I need to catch up on my homework this weekend.", "thai": "ฉันต้องตามงานการบ้านให้ทันในสุดสัปดาห์นี้"}
{"word": "catch up", "english": "Let's grab coffee to catch up soon.", "thai": "ไปดื่มกาแฟกันเพื่อคุยอัปเดตเร็วๆ นี้"}
{"word": "catch up", "english": "I’m trying to catch up with the latest news.", "thai": "ฉันกำลังพยายามตามข่าวล่าสุดให้ทัน"}
{"word": "catch up", "english": "We should catch up over dinner sometime.", "thai": "เราควรเจอกันเพื่อคุยอัปเดตขณะกินข้าวเย็นสักครั้ง"}
{"word": "catch up", "english": "I’m behind and need to catch up at work.", "thai": "ฉันตามหลังและต้องตามงานที่ทำงานให้ทัน"}
{"word": "catch up", "english": "Can we catch up on the phone later?", "thai": "เราคุยโทรศัพท์อัปเดตกันทีหลังได้ไหม"}
{"word": "catch up", "english": "I want to catch up on some sleep tonight.", "thai": "ฉันอยากนอนให้ทันคืนนี้"}
{"word": "catch up", "english": "Let’s meet to catch up on old times.", "thai": "มาเจอกันเพื่อคุยเรื่องเก่าๆ กันเถอะ"}
{"word": "catch up", "english": "I’m trying to catch up with my emails.", "thai": "ฉันกำลังพยายามเคลียร์อีเมลให้ทัน"}
{"word": "catch up", "english": "We need to catch up before you leave town.", "thai": "เราต้องเจอกันคุยอัปเดตก่อนที่คุณจะออกจากเมือง"}
{"word": "catch up", "english": "I’ll catch up with you after the meeting.", "thai": "ฉันจะตามไปคุยกับคุณหลังประชุม"}
{"word": "catch up", "english": "She’s trying to catch up in math class.", "thai": "เธอกำลังพยายามตามให้ทันในวิชาคณิตศาสตร์"}
{"word": "catch up", "english": "I need to catch up on that TV series.", "thai": "ฉันต้องตามดูซีรีส์นั้นให้ทัน"}
{"word": "catch up", "english": "Let’s catch up at the party tonight.", "thai": "มาคุยอัปเดตกันที่งานปาร์ตี้คืนนี้"}
{"word": "catch up", "english": "I’m too tired to catch up on chores today.", "thai": "ฉันเหนื่อยเกินกว่าจะเคลียร์งานบ้านให้ทันวันนี้"}
{"word": "catch up", "english": "Can you catch up with the group later?", "thai": "คุณตามกลุ่มไปทีหลังได้ไหม"}
{"word": "catch up", "english": "I’ll catch up on reading during the flight.", "thai": "ฉันจะตามอ่านหนังสือระหว่างบิน"}
{"word": "catch up", "english": "We haven’t had time to catch up lately.", "thai": "เราไม่มีเวลาคุยอัปเดตกันเลยช่วงนี้"}
{"word": "catch up", "english": "I need to catch up with my old friends.", "thai": "ฉันต้องเจอเพื่อนเก่าเพื่อคุยอัปเดต"}
{"word": "catch up", "english": "He’s working hard to catch up in school.", "thai": "เขากำลังทำงานหนักเพื่อตามให้ทันในโรงเรียน"}
{"word": "catch up", "english": "Let’s catch up over a drink this week.", "thai": "มาคุยอัปเดตกันสักแก้วสัปดาห์นี้"}
{"word": "catch up", "english": "I’m trying to catch up on my blog posts.", "thai": "ฉันกำลังพยายามตามเขียนโพสต์บล็อกให้ทัน"}
{"word": "catch up", "english": "I’ll catch up with you at the event.", "thai": "ฉันจะตามไปเจอคุณที่งาน"}
{"word": "catch up", "english": "She needs to catch up on her training.", "thai": "เธอต้องตามการฝึกอบรมให้ทัน"}
{"word": "catch up", "english": "We’ll catch up after the game.", "thai": "เราจะคุยอัปเดตกันหลังจบเกม"}
{"word": "catch up", "english": "I’m behind and need to catch up on bills.", "thai": "ฉันตามหลังและต้องเคลียร์บิลให้ทัน"}
{"word": "catch up", "english": "Can we catch up at the café tomorrow?", "thai": "เราคุยอัปเดตกันที่ร้านกาแฟพรุ่งนี้ได้ไหม"}
{"word": "catch up", "english": "I want to catch up with the new trends.", "thai": "ฉันอยากตามเทรนด์ใหม่ๆ ให้ทัน"}
{"word": "catch up", "english": "Let’s catch up during lunch break.", "thai": "มาคุยอัปเดตกันตอนพักกลางวัน"}
{"word": "catch up", "english": "I need to catch up on my workout routine.", "thai": "ฉันต้องตามตารางออกกำลังกายให้ทัน"}
{"word": "catch up", "english": "I’ll catch up with you at the park.", "thai": "ฉันจะตามไปเจอคุณที่สวนสาธารณะ"}
{"word": "catch up", "english": "She’s trying to catch up with her studies.", "thai": "เธอกำลังพยายามตามการเรียนให้ทัน"}
{"word": "catch up", "english": "We should catch up before the holidays.", "thai": "เราควรคุยอัปเดตกันก่อนวันหยุด"}
{"word": "catch up", "english": "I’m hoping to catch up on some rest.", "thai": "ฉันหวังว่าจะได้พักผ่อนให้ทัน"}
{"word": "catch up", "english": "Can you catch up with us at the mall?", "thai": "คุณตามมาเจอเราที่ห้างได้ไหม"}
{"word": "catch up", "english": "I need to catch up with my project deadlines.", "thai": "ฉันต้องตามเดดไลน์โปรเจกต์ให้ทัน"}
{"word": "catch up", "english": "Let’s catch up at the reunion next month.", "thai": "มาคุยอัปเดตกันที่งานรวมรุ่นเดือนหน้า"}
{"word": "catch up", "english": "I’m trying to catch up on social media.", "thai": "ฉันกำลังพยายามตามโซเชียลมีเดียให้ทัน"}
{"word": "catch up", "english": "We’ll catch up after the concert.", "thai": "เราจะคุยอัปเดตกันหลังคอนเสิร์ต"}
{"word": "catch up", "english": "I need to catch up with my family news.", "thai": "ฉันต้องตามข่าวครอบครัวให้ทัน"}
{"word": "catch up", "english": "Let’s catch up over brunch this Sunday.", "thai": "มาคุยอัปเดตกันตอนบรันช์วันอาทิตย์นี้"}
{"word": "catch up", "english": "I’m behind and need to catch up on taxes.", "thai": "ฉันตามหลังและต้องเคลียร์ภาษีให้ทัน"}
{"word": "catch up", "english": "Can we catch up via video call tonight?", "thai": "เราคุยอัปเดตผ่านวิดีโอคอลคืนนี้ได้ไหม"}
{"word": "catch up", "english": "I want to catch up with the latest movies.", "thai": "ฉันอยากตามดูหนังใหม่ล่าสุดให้ทัน"}
{"word": "catch up", "english": "Let’s catch up at the bar later.", "thai": "มาคุยอัปเดตกันที่บาร์ทีหลัง"}
{"word": "catch up", "english": "I need to catch up on my coding skills.", "thai": "ฉันต้องตามทักษะการเขียนโค้ดให้ทัน"}
{"word": "catch up", "english": "I’ll catch up with you after class.", "thai": "ฉันจะตามไปเจอคุณหลังเลิกเรียน"}
{"word": "catch up", "english": "She’s trying to catch up with her peers.", "thai": "เธอกำลังพยายามตามเพื่อนๆ ให้ทัน"}
{"word": "catch up", "english": "We should catch up before the new year.", "thai": "เราควรคุยอัปเดตกันก่อนปีใหม่"}
{"word": "catch up", "english": "I’m hoping to catch up on my journal.", "thai": "ฉันหวังว่าจะตามเขียนสมุดบันทึกให้ทัน"}
{"word": "catch up", "english": "Can you catch up with us at the beach?", "thai": "คุณตามมาเจอเราที่ชายหาดได้ไหม"}
{"word": "catch up", "english": "I need to catch up with my mentor soon.", "thai": "ฉันต้องเจอที่ปรึกษาเพื่อคุยอัปเดตเร็วๆ นี้"}
{"word": "catch up", "english": "Let’s catch up at the festival tomorrow.", "thai": "มาคุยอัปเดตกันที่งานเทศกาลพรุ่งนี้"}
{"word": "catch up", "english": "I’m trying to catch up on my podcast list.", "thai": "ฉันกำลังพยายามตามฟังพอดแคสต์ให้ทัน"}
{"word": "catch up", "english": "We’ll catch up after the workshop.", "thai": "เราจะคุยอัปเดตกันหลังเวิร์กช็อป"}
{"word": "catch up", "english": "I need to catch up with my team’s progress.", "thai": "ฉันต้องตามความคืบหน้าของทีมให้ทัน"}
{"word": "catch up", "english": "Let’s catch up over a hike this weekend.", "thai": "มาคุยอัปเดตกันตอนไปเดินป่าสุดสัปดาห์นี้"}
{"word": "catch up", "english": "I’m behind and need to catch up on laundry.", "thai": "ฉันตามหลังและต้องซักผ้าให้ทัน"}
{"word": "catch up", "english": "Can we catch up at the library later?", "thai": "เราคุยอัปเดตกันที่ห้องสมุดทีหลังได้ไหม"}
{"word": "catch up", "english": "I want to catch up with industry updates.", "thai": "ฉันอยากตามอัปเดตวงการให้ทัน"}
{"word": "catch up", "english": "Let’s catch up during the conference break.", "thai": "มาคุยอัปเดตกันตอนพักประชุม"}
{"word": "catch up", "english": "I need to catch up on my language lessons.", "thai": "ฉันต้องตามบทเรียนภาษาให้ทัน"}
{"word": "catch up", "english": "I’ll catch up with you at the gym.", "thai": "ฉันจะตามไปเจอคุณที่ยิม"}
{"word": "catch up", "english": "She’s trying to catch up with her siblings.", "thai": "เธอกำลังพยายามตามพี่น้องของเธอให้ทัน"}
{"word": "catch up", "english": "We should catch up before the semester ends.", "thai": "เราควรคุยอัปเดตกันก่อนจบภาคเรียน"}
{"word": "catch up", "english": "I’m hoping to catch up on my meditation.", "thai": "ฉันหวังว่าจะตามฝึกสมาธิให้ทัน"}
{"word": "catch up", "english": "Can you catch up with us at the restaurant?", "thai": "คุณตามมาเจอเราที่ร้านอาหารได้ไหม"}
{"word": "catch up", "english": "I need to catch up with my boss tomorrow.", "thai": "ฉันต้องเจอเจ้านายเพื่อคุยอัปเดตพรุ่งนี้"}
{"word": "catch up", "english": "Let’s catch up at the book club meeting.", "thai": "มาคุยอัปเดตกันที่การประชุมชมรมหนังสือ"}
{"word": "catch up", "english": "I’m trying to catch up on my art projects.", "thai": "ฉันกำลังพยายามตามงานศิลปะให้ทัน"}
{"word": "catch up", "english": "We’ll catch up after the movie.", "thai": "เราจะคุยอัปเดตกันหลังดูหนัง"}
{"word": "catch up", "english": "I need to catch up with my cousin’s life.", "thai": "ฉันต้องตามเรื่องชีวิตของลูกพี่ลูกน้องให้ทัน"}
{"word": "catch up", "english": "Let’s catch up over ice cream tonight.", "thai": "มาคุยอัปเดตกันตอนกินไอศกรีมคืนนี้"}
{"word": "catch up", "english": "I’m behind and need to catch up on errands.", "thai": "ฉันตามหลังและต้องเคลียร์ธุระให้ทัน"}
{"word": "catch up", "english": "Can we catch up at the farmers’ market?", "thai": "เราคุยอัปเดตกันที่ตลาดเกษตรกรได้ไหม"}
{"word": "catch up", "english": "I want to catch up with the latest tech.", "thai": "ฉันอยากตามเทคโนโลยีล่าสุดให้ทัน"}
{"word": "catch up", "english": "Let’s catch up during the road trip.", "thai": "มาคุยอัปเดตกันตอนไปโรดทริป"}
{"word": "catch up", "english": "I need to catch up on my guitar practice.", "thai": "ฉันต้องตามฝึกกีตาร์ให้ทัน"}
{"word": "catch up", "english": "I’ll catch up with you at the coffee shop.", "thai": "ฉันจะตามไปเจอคุณที่ร้านกาแฟ"}
{"word": "catch up", "english": "She’s trying to catch up with her teammates.", "thai": "เธอกำลังพยายามตามเพื่อนร่วมทีมให้ทัน"}
{"word": "catch up", "english": "We should catch up before the wedding.", "thai": "เราควรคุยอัปเดตกันก่อนงานแต่ง"}
{"word": "catch up", "english": "I’m hoping to catch up on my knitting.", "thai": "ฉันหวังว่าจะตามงานถักนิตติ้งให้ทัน"}
{"word": "catch up", "english": "Can you catch up with us at the museum?", "thai": "คุณตามมาเจอเราที่พิพิธภัณฑ์ได้ไหม"}
{"word": "catch up", "english": "I need to catch up with my client updates.", "thai": "ฉันต้องตามอัปเดตลูกค้าให้ทัน"}
{"word": "catch up", "english": "Let’s catch up at the holiday party.", "thai": "มาคุยอัปเดตกันที่งานปาร์ตี้วันหยุด"}
{"word": "catch up", "english": "I’m trying to catch up on my yoga classes.", "thai": "ฉันกำลังพยายามตามคลาสโยคะให้ทัน"}
{"word": "catch up", "english": "We’ll catch up after the play.", "thai": "เราจะคุยอัปเดตกันหลังละครจบ"}
{"word": "catch up", "english": "I need to catch up with my neighbor’s news.", "thai": "ฉันต้องตามข่าวของเพื่อนบ้านให้ทัน"}
{"word": "catch up", "english": "Let’s catch up over a picnic this weekend.", "thai": "มาคุยอัปเดตกันตอนปิกนิกสุดสัปดาห์นี้"}
{"word": "catch up", "english": "I’m behind and need to catch up on emails.", "thai": "ฉันตามหลังและต้องเคลียร์อีเมลให้ทัน"}
{"word": "catch up", "english": "Can we catch up at the community center?", "thai": "เราคุยอัปเดตกันที่ศูนย์ชุมชนได้ไหม"}
{"word": "catch up", "english": "I want to catch up with the latest books.", "thai": "ฉันอยากตามอ่านหนังสือใหม่ล่าสุดให้ทัน"}
{"word": "catch up", "english": "Let’s catch up during the game night.", "thai": "มาคุยอัปเดตกันตอนคืนเล่นเกม"}
{"word": "catch up", "english": "I need to catch up on my cooking skills.", "thai": "ฉันต้องตามทักษะการทำอาหารให้ทัน"}
{"word": "catch up", "english": "I’ll catch up with you at the festival.", "thai": "ฉันจะตามไปเจอคุณที่งานเทศกาล"}
{"word": "catch up", "english": "She’s trying to catch up with her classmates.", "thai": "เธอกำลังพยายามตามเพื่อนร่วมชั้นให้ทัน"}
{"word": "catch up", "english": "We should catch up before the trip.", "thai": "เราควรคุยอัปเดตกันก่อนทริป"}
{"word": "catch up", "english": "I’m hoping to catch up on my photography.", "thai": "ฉันหวังว่าจะตามงานถ่ายภาพให้ทัน"}
{"word": "catch up", "english": "Can you catch up with us at the arcade?", "thai": "คุณตามมาเจอเราที่ตู้เกมได้ไหม"}
{"word": "come across", "english": "I’ve never come across such a strange book.", "thai": "ฉันไม่เคยเจอหนังสือแปลกๆ แบบนี้มาก่อน"}
{"word": "come across", "english": "She came across an old photo in the attic.", "thai": "เธอเจอรูปถ่ายเก่าในห้องใต้หลังคา"}
{"word": "come across", "english": "Have you come across any good restaurants lately?", "thai": "คุณเจอร้านอาหารดีๆ บ้างไหมช่วงนี้"}
{"word": "come across", "english": "He comes across as very confident in meetings.", "thai": "เขาดูมั่นใจมากในการประชุม"}
{"word": "come across", "english": "I came across a great deal online yesterday.", "thai": "เมื่อวานฉันเจอดีลดีๆ ทางออนไลน์"}
{"word": "come across", "english": "She’s come across some rare coins collecting.", "thai": "เธอเจอเหรียญหายากบางเหรียญตอนสะสม"}
{"word": "come across", "english": "You might come across some issues with that app.", "thai": "คุณอาจเจอปัญหาบางอย่างกับแอปนั้น"}
{"word": "come across", "english": "I came across your name in the article.", "thai": "ฉันเจอชื่อคุณในบทความ"}
{"word": "come across", "english": "He came across a hidden trail while hiking.", "thai": "เขาเจอเส้นทางลับขณะเดินป่า"}
{"word": "come across", "english": "Have you come across her new blog yet?", "thai": "คุณเจอบล็อกใหม่ของเธอหรือยัง"}
{"word": "come across", "english": "She comes across as a bit shy at first.", "thai": "เธอดูขี้อายนิดหน่อยตอนแรก"}
{"word": "come across", "english": "I came across an old friend at the mall.", "thai": "ฉันเจอเพื่อนเก่าที่ห้าง"}
{"word": "come across", "english": "You’ll come across some weird bugs in that code.", "thai": "คุณจะเจอบั๊กแปลกๆ ในโค้ดนั้น"}
{"word": "come across", "english": "He’s come across some useful tips for gardening.", "thai": "เขาเจอเคล็ดลับดีๆ สำหรับการทำสวน"}
{"word": "come across", "english": "I came across a cool podcast yesterday.", "thai": "เมื่อวานฉันเจอพอดแคสต์เจ๋งๆ"}
{"word": "come across", "english": "She came across as very professional in the interview.", "thai": "เธอดูเป็นมืออาชีพมากในการสัมภาษณ์"}
{"word": "come across", "english": "Have you come across any new music lately?", "thai": "คุณเจอดนตรีใหม่ๆ บ้างไหมช่วงนี้"}
{"word": "come across", "english": "I came across a rare book at the library.", "thai": "ฉันเจอหนังสือหายากที่ห้องสมุด"}
{"word": "come across", "english": "He comes across as really friendly online.", "thai": "เขาดูเป็นมิตรมากทางออนไลน์"}
{"word": "come across", "english": "I’ve come across some odd reviews of that movie.", "thai": "ฉันเจอรีวิวแปลกๆ ของหนังเรื่องนั้น"}
{"word": "come across", "english": "She came across a stray cat in the park.", "thai": "เธอเจอแมวจรในสวนสาธารณะ"}
{"word": "come across", "english": "You might come across him at the conference.", "thai": "คุณอาจเจอเขาที่งานประชุม"}
{"word": "come across", "english": "I came across a great recipe online.", "thai": "ฉันเจอสูตรอาหารดีๆ ทางออนไลน์"}
{"word": "come across", "english": "He comes across as a bit arrogant sometimes.", "thai": "บางครั้งเขาดูหยิ่งนิดหน่อย"}
{"word": "come across", "english": "Have you come across that new coffee shop?", "thai": "คุณเจอร้านกาแฟใหม่นั้นหรือยัง"}
{"word": "come across", "english": "I came across an interesting article today.", "thai": "วันนี้ฉันเจอบทความน่าสนใจ"}
{"word": "come across", "english": "She came across some old letters in a box.", "thai": "เธอเจอจดหมายเก่าในกล่อง"}
{"word": "come across", "english": "He’s come across a lot of challenges at work.", "thai": "เขาเจอความท้าทายมากมายที่ทำงาน"}
{"word": "come across", "english": "I came across a funny video on social media.", "thai": "ฉันเจอวิดีโอตลกๆ ในโซเชียลมีเดีย"}
{"word": "come across", "english": "She comes across as very kind in person.", "thai": "เธอดูใจดีมากเมื่อเจอตัว"}
{"word": "come across", "english": "You might come across some deals at the sale.", "thai": "คุณอาจเจอดีลดีๆ ที่งานเซล"}
{"word": "come across", "english": "I came across a weird bug in the system.", "thai": "ฉันเจอบั๊กแปลกๆ ในระบบ"}
{"word": "come across", "english": "He came across an old map in the archives.", "thai": "เขาเจอแผนที่เก่าในหอจดหมายเหตุ"}
{"word": "come across", "english": "Have you come across her latest post?", "thai": "คุณเจอโพสต์ล่าสุดของเธอหรือยัง"}
{"word": "come across", "english": "She comes across as very intelligent in class.", "thai": "เธอดูฉลาดมากในชั้นเรียน"}
{"word": "come across", "english": "I came across a great hiking trail nearby.", "thai": "ฉันเจอเส้นทางเดินป่าดีๆ ใกล้ๆ"}
{"word": "come across", "english": "He’s come across some tough opponents in chess.", "thai": "เขาเจอคู่ต่อสู้เก่งๆ ในหมากรุก"}
{"word": "come across", "english": "I came across a cool gadget at the store.", "thai": "ฉันเจอแกดเจ็ตเจ๋งๆ ที่ร้าน"}
{"word": "come across", "english": "She came across as nervous during the speech.", "thai": "เธอดูประหม่าในระหว่างการพูด"}
{"word": "come across", "english": "Have you come across any good books lately?", "thai": "คุณเจอหนังสือดีๆ บ้างไหมช่วงนี้"}
{"word": "come across", "english": "I came across an old record in the shop.", "thai": "ฉันเจอแผ่นเสียงเก่าที่ร้าน"}
{"word": "come across", "english": "He comes across as very serious at work.", "thai": "เขาดูจริงจังมากที่ทำงาน"}
{"word": "come across", "english": "I’ve come across some strange comments online.", "thai": "ฉันเจอคอมเมนต์แปลกๆ ทางออนไลน์"}
{"word": "come across", "english": "She came across a lost dog on her walk.", "thai": "เธอเจอหมาหลงทางขณะเดินเล่น"}
{"word": "come across", "english": "You might come across her at the party.", "thai": "คุณอาจเจอเธอที่งานปาร์ตี้"}
{"word": "come across", "english": "I came across a useful app for studying.", "thai": "ฉันเจอแอปที่เป็นประโยชน์สำหรับการเรียน"}
{"word": "come across", "english": "He comes across as very charming in person.", "thai": "เขาดูมีเสน่ห์มากเมื่อเจอตัว"}
{"word": "come across", "english": "Have you come across that new bakery?", "thai": "คุณเจอร้านเบเกอรี่ใหม่นั้นหรือยัง"}
{"word": "come across", "english": "I came across a great quote in a book.", "thai": "ฉันเจอคำคมดีๆ ในหนังสือ"}
{"word": "come across", "english": "She came across some old jewelry at home.", "thai": "เธอเจอเครื่องประดับเก่าที่บ้าน"}
{"word": "come across", "english": "He’s come across some tricky puzzles lately.", "thai": "เขาเจอปริศนาที่ยากๆ ช่วงนี้"}
{"word": "come across", "english": "I came across a funny meme online.", "thai": "ฉันเจอมุกตลกๆ ทางออนไลน์"}
{"word": "come across", "english": "She comes across as very organized at work.", "thai": "เธอดูเป็นระเบียบมากที่ทำงาน"}
{"word": "come across", "english": "You might come across some traffic on the way.", "thai": "คุณอาจเจอรถติดระหว่างทาง"}
{"word": "come across", "english": "I came across a new café downtown.", "thai": "ฉันเจอร้านกาแฟใหม่ในตัวเมือง"}
{"word": "come across", "english": "He came across an old diary in the basement.", "thai": "เขาเจอสมุดบันทึกเก่าในชั้นใต้ดิน"}
{"word": "come across", "english": "Have you come across his latest video?", "thai": "คุณเจอวิดีโอล่าสุดของเขาหรือยัง"}
{"word": "come across", "english": "She comes across as very creative in her work.", "thai": "เธอดูมีความคิดสร้างสรรค์มากในงาน"}
{"word": "come across", "english": "I came across a great deal at the market.", "thai": "ฉันเจอดีลดีๆ ที่ตลาด"}
{"word": "come across", "english": "He’s come across some rare stamps collecting.", "thai": "เขาเจอแสตมป์หายากตอนสะสม"}
{"word": "come across", "english": "I came across a weird glitch in the game.", "thai": "ฉันเจอกลิตช์แปลกๆ ในเกม"}
{"word": "come across", "english": "She came across as very polite in the email.", "thai": "เธอดูสุภาพมากในอีเมล"}
{"word": "come across", "english": "Have you come across any new apps lately?", "thai": "คุณเจอแอปใหม่ๆ บ้างไหมช่วงนี้"}
{"word": "come across", "english": "I came across an old painting at the flea market.", "thai": "ฉันเจอภาพวาดเก่าที่ตลาดนัด"}
{"word": "come across", "english": "He comes across as very reliable in projects.", "thai": "เขาดูไว้ใจได้มากในโปรเจกต์"}
{"word": "come across", "english": "I’ve come across some odd theories online.", "thai": "ฉันเจอทฤษฎีแปลกๆ ทางออนไลน์"}
{"word": "come across", "english": "She came across a lost wallet on the street.", "thai": "เธอเจอกระเป๋าเงินหล่นบนถนน"}
{"word": "come across", "english": "You might come across him at the gym.", "thai": "คุณอาจเจอเขาที่ยิม"}
{"word": "come across", "english": "I came across a helpful tutorial online.", "thai": "ฉันเจอบทเรียนที่เป็นประโยชน์ทางออนไลน์"}
{"word": "come across", "english": "He comes across as very humble in person.", "thai": "เขาดูถ่อมตัวมากเมื่อเจอตัว"}
{"word": "come across", "english": "Have you come across that new store?", "thai": "คุณเจอร้านใหม่นั้นหรือยัง"}
{"word": "come across", "english": "I came across a great blog post today.", "thai": "วันนี้ฉันเจอโพสต์บล็อกดีๆ"}
{"word": "come across", "english": "She came across some old clothes in storage.", "thai": "เธอเจอเสื้อผ้าเก่าในที่เก็บของ"}
{"word": "come across", "english": "He’s come across some tough questions in class.", "thai": "เขาเจอคำถามยากๆ ในชั้นเรียน"}
{"word": "come across", "english": "I came across a cool event in town.", "thai": "ฉันเจองานเจ๋งๆ ในเมือง"}
{"word": "come across", "english": "She comes across as very energetic in meetings.", "thai": "เธอดูกระตือรือร้นมากในการประชุม"}
{"word": "come across", "english": "You might come across some bugs in the software.", "thai": "คุณอาจเจอบั๊กในซอฟต์แวร์"}
{"word": "come across", "english": "I came across a new band online.", "thai": "ฉันเจอวงดนตรีใหม่ทางออนไลน์"}
{"word": "come across", "english": "He came across an old toy in the garage.", "thai": "เขาเจอของเล่นเก่าในโรงรถ"}
{"word": "come across", "english": "Have you come across her new podcast?", "thai": "คุณเจอพอดแคสต์ใหม่ของเธอหรือยัง"}
{"word": "come across", "english": "She comes across as very confident in debates.", "thai": "เธอดูมั่นใจมากในการโต้วาที"}
{"word": "come across", "english": "I came across a great deal on flights.", "thai": "ฉันเจอดีลดีๆ สำหรับตั๋วเครื่องบิน"}
{"word": "come across", "english": "He’s come across some rare books at auctions.", "thai": "เขาเจอหนังสือหายากในการประมูล"}
{"word": "come across", "english": "I came across a funny story online.", "thai": "ฉันเจอเรื่องตลกๆ ทางออนไลน์"}
{"word": "come across", "english": "She came across as very sincere in her speech.", "thai": "เธอดูจริงใจมากในคำพูดของเธอ"}
{"word": "come across", "english": "Have you come across any good deals lately?", "thai": "คุณเจอดีลดีๆ บ้างไหมช่วงนี้"}
{"word": "come across", "english": "I came across an old postcard in a drawer.", "thai": "ฉันเจอโปสต์การ์ดเก่าในลิ้นชัก"}
{"word": "come across", "english": "He comes across as very approachable at work.", "thai": "เขาดูเข้าถึงง่ายมากที่ทำงาน"}
{"word": "come across", "english": "I’ve come across some weird facts online.", "thai": "ฉันเจอข้อเท็จจริงแปลกๆ ทางออนไลน์"}
{"word": "come across", "english": "She came across a stray kitten in the alley.", "thai": "เธอเจอลูกแมวหลงทางในตรอก"}
{"word": "come across", "english": "You might come across her at the festival.", "thai": "คุณอาจเจอเธอที่งานเทศกาล"}
{"word": "come across", "english": "I came across a useful tool for coding.", "thai": "ฉันเจอเครื่องมือที่เป็นประโยชน์สำหรับการเขียนโค้ด"}
{"word": "come across", "english": "He comes across as very witty in conversations.", "thai": "เขาดูมีไหวพริบมากในการสนทนา"}
{"word": "come across", "english": "Have you come across that new art gallery?", "thai": "คุณเจอแกลเลอรี่ศิลปะใหม่นั้นหรือยัง"}
{"word": "come across", "english": "I came across a great tip for cooking.", "thai": "ฉันเจอเคล็ดลับดีๆ สำหรับการทำอาหาร"}
{"word": "come across", "english": "She came across some old photos online.", "thai": "เธอเจอรูปถ่ายเก่าทางออนไลน์"}
{"word": "come across", "english": "He’s come across some tough clients at work.", "thai": "เขาเจอลูกค้ายากๆ ที่ทำงาน"}
{"word": "come across", "english": "I came across a cool app for fitness.", "thai": "ฉันเจอแอปเจ๋งๆ สำหรับฟิตเนส"}
{"word": "come across", "english": "She comes across as very thoughtful in emails.", "thai": "เธอดูมีน้ำใจมากในอีเมล"}
{"word": "come across", "english": "You might come across some errors in the report.", "thai": "คุณอาจเจอข้อผิดพลาดในรายงาน"}
{"word": "cut back", "english": "I need to cut back on my coffee intake.", "thai": "ฉันต้องลดการดื่มกาแฟลง"}
{"word": "cut back", "english": "We should cut back on expenses this month.", "thai": "เราควรลดค่าใช้จ่ายลงในเดือนนี้"}
{"word": "cut back", "english": "She’s trying to cut back on sugar.", "thai": "เธอกำลังพยายามลดน้ำตาล"}
{"word": "cut back", "english": "The company had to cut back on staff.", "thai": "บริษัทต้องลดพนักงานลง"}
{"word": "cut back", "english": "I’m going to cut back on screen time.", "thai": "ฉันจะลดเวลาการใช้หน้าจอลง"}
{"word": "cut back", "english": "He decided to cut back on drinking.", "thai": "เขาตัดสินใจลดการดื่มเหล้า"}
{"word": "cut back", "english": "We need to cut back on plastic use.", "thai": "เราต้องลดการใช้พลาสติก"}
{"word": "cut back", "english": "They’re cutting back on production costs.", "thai": "พวกเขากำลังลดต้นทุนการผลิต"}
{"word": "cut back", "english": "I should cut back on late-night snacking.", "thai": "ฉันควรลดการกินขนมตอนดึก"}
{"word": "cut back", "english": "The city plans to cut back on water usage.", "thai": "เมืองวางแผนลดการใช้น้ำ"}
{"word": "cut back", "english": "She’s cutting back on her work hours.", "thai": "เธอกำลังลดชั่วโมงทำงาน"}
{"word": "cut back", "english": "Let’s cut back on eating out this week.", "thai": "มาลดการกินข้าวนอกบ้านสัปดาห์นี้กัน"}
{"word": "cut back", "english": "He’s trying to cut back on social media.", "thai": "เขากำลังพยายามลดการใช้โซเชียลมีเดีย"}
{"word": "cut back", "english": "We need to cut back on energy consumption.", "thai": "เราต้องลดการใช้พลังงาน"}
{"word": "cut back", "english": "I’m cutting back on my gym sessions.", "thai": "ฉันกำลังลดการไปยิม"}
{"word": "cut back", "english": "The school had to cut back on programs.", "thai": "โรงเรียนต้องลดโปรแกรมลง"}
{"word": "cut back", "english": "She wants to cut back on fast food.", "thai": "เธออยากลดการกินอาหารฟาสต์ฟู้ด"}
{"word": "cut back", "english": "They’re cutting back on travel expenses.", "thai": "พวกเขากำลังลดค่าใช้จ่ายในการเดินทาง"}
{"word": "cut back", "english": "I need to cut back on online shopping.", "thai": "ฉันต้องลดการช้อปปิ้งออนไลน์"}
{"word": "cut back", "english": "He’s cutting back on his gaming time.", "thai": "เขากำลังลดเวลาเล่นเกม"}
{"word": "cut back", "english": "We should cut back on paper waste.", "thai": "เราควรลดการใช้กระดาษที่สูญเปล่า"}
{"word": "cut back", "english": "The team had to cut back on meetings.", "thai": "ทีมต้องลดการประชุมลง"}
{"word": "cut back", "english": "I’m trying to cut back on soda.", "thai": "ฉันกำลังพยายามลดการดื่มน้ำอัดลม"}
{"word": "cut back", "english": "They need to cut back on overtime hours.", "thai": "พวกเขาต้องลดชั่วโมงทำงานล่วงเวลา"}
{"word": "cut back", "english": "She’s cutting back on her spending.", "thai": "เธอกำลังลดการใช้จ่าย"}
{"word": "cut back", "english": "Let’s cut back on junk food this month.", "thai": "มาลดการกินอาหารขยะเดือนนี้กัน"}
{"word": "cut back", "english": "He wants to cut back on his commute.", "thai": "เขาอยากลดเวลาเดินทางไปทำงาน"}
{"word": "cut back", "english": "The store is cutting back on inventory.", "thai": "ร้านกำลังลดสต็อกสินค้า"}
{"word": "cut back", "english": "I should cut back on my phone usage.", "thai": "ฉันควรลดการใช้โทรศัพท์"}
{"word": "cut back", "english": "They’re cutting back on marketing costs.", "thai": "พวกเขากำลังลดค่าใช้จ่ายด้านการตลาด"}
{"word": "cut back", "english": "I’m going to cut back on desserts.", "thai": "ฉันจะลดการกินของหวาน"}
{"word": "cut back", "english": "She’s trying to cut back on caffeine.", "thai": "เธอกำลังพยายามลดคาเฟอีน"}
{"word": "cut back", "english": "We need to cut back on electricity use.", "thai": "เราต้องลดการใช้ไฟฟ้า"}
{"word": "cut back", "english": "He’s cutting back on his weekly expenses.", "thai": "เขากำลังลดค่าใช้จ่ายรายสัปดาห์"}
{"word": "cut back", "english": "The project team had to cut back on scope.", "thai": "ทีมโปรเจกต์ต้องลดขอบเขตงาน"}
{"word": "cut back", "english": "I want to cut back on processed foods.", "thai": "ฉันอยากลดการกินอาหารแปรรูป"}
{"word": "cut back", "english": "They’re cutting back on office supplies.", "thai": "พวกเขากำลังลดการใช้อุปกรณ์สำนักงาน"}
{"word": "cut back", "english": "She needs to cut back on her workload.", "thai": "เธอต้องลดปริมาณงานลง"}
{"word": "cut back", "english": "Let’s cut back on takeout this week.", "thai": "มาลดการสั่งอาหารเดลิเวอรี่สัปดาห์นี้กัน"}
{"word": "cut back", "english": "He’s trying to cut back on alcohol.", "thai": "เขากำลังพยายามลดการดื่มแอลกอฮอล์"}
{"word": "cut back", "english": "We should cut back on gas usage.", "thai": "เราควรลดการใช้แก๊ส"}
{"word": "cut back", "english": "I’m cutting back on my streaming subscriptions.", "thai": "ฉันกำลังลดการสมัครสมาชิกสตรีมมิ่ง"}
{"word": "cut back", "english": "The company is cutting back on bonuses.", "thai": "บริษัทกำลังลดโบนัส"}
{"word": "cut back", "english": "She’s cutting back on her social events.", "thai": "เธอกำลังลดการเข้างานสังคม"}
{"word": "cut back", "english": "I need to cut back on my credit card use.", "thai": "ฉันต้องลดการใช้บัตรเครดิต"}
{"word": "cut back", "english": "They’re trying to cut back on food waste.", "thai": "พวกเขากำลังพยายามลดการทิ้งอาหาร"}
{"word": "cut back", "english": "He wants to cut back on his study hours.", "thai": "เขาอยากลดชั่วโมงเรียน"}
{"word": "cut back", "english": "We should cut back on our travel plans.", "thai": "เราควรลดแผนการเดินทาง"}
{"word": "cut back", "english": "I’m cutting back on my weekend outings.", "thai": "ฉันกำลังลดการออกไปเที่ยวสุดสัปดาห์"}
{"word": "cut back", "english": "The team needs to cut back on delays.", "thai": "ทีมต้องลดความล่าช้า"}
{"word": "cut back", "english": "She’s cutting back on her shopping trips.", "thai": "เธอกำลังลดการไปช้อปปิ้ง"}
{"word": "cut back", "english": "I want to cut back on my soda habit.", "thai": "ฉันอยากลดนิสัยการดื่มโซดา"}
{"word": "cut back", "english": "They’re cutting back on factory output.", "thai": "พวกเขากำลังลดผลผลิตของโรงงาน"}
{"word": "cut back", "english": "He’s trying to cut back on his spending.", "thai": "เขากำลังพยายามลดการใช้จ่าย"}
{"word": "cut back", "english": "We need to cut back on our budget.", "thai": "เราต้องลดงบประมาณลง"}
{"word": "cut back", "english": "I’m cutting back on my late nights.", "thai": "ฉันกำลังลดการนอนดึก"}
{"word": "cut back", "english": "She wants to cut back on her commute time.", "thai": "เธออยากลดเวลาเดินทางไปทำงาน"}
{"word": "cut back", "english": "The store had to cut back on hours.", "thai": "ร้านต้องลดชั่วโมงเปิดทำการ"}
{"word": "cut back", "english": "I should cut back on my candy intake.", "thai": "ฉันควรลดการกินลูกอม"}
{"word": "cut back", "english": "They’re cutting back on advertising costs.", "thai": "พวกเขากำลังลดค่าใช้จ่ายด้านโฆษณา"}
{"word": "cut back", "english": "He’s cutting back on his workout intensity.", "thai": "เขากำลังลดความหนักในการออกกำลังกาย"}
{"word": "cut back", "english": "We need to cut back on paper towels.", "thai": "เราต้องลดการใช้กระดาษทิชชู่"}
{"word": "cut back", "english": "She’s trying to cut back on her emails.", "thai": "เธอกำลังพยายามลดการส่งอีเมล"}
{"word": "cut back", "english": "I’m cutting back on my gaming sessions.", "thai": "ฉันกำลังลดการเล่นเกม"}
{"word": "cut back", "english": "The company is cutting back on travel.", "thai": "บริษัทกำลังลดการเดินทาง"}
{"word": "cut back", "english": "I want to cut back on my fast food runs.", "thai": "ฉันอยากลดการไปกินฟาสต์ฟู้ด"}
{"word": "cut back", "english": "They’re cutting back on event planning.", "thai": "พวกเขากำลังลดการวางแผนงานอีเวนต์"}
{"word": "cut back", "english": "She needs to cut back on her stress.", "thai": "เธอต้องลดความเครียดลง"}
{"word": "cut back", "english": "Let’s cut back on our grocery budget.", "thai": "มาลดงบซื้อของชำกัน"}
{"word": "cut back", "english": "He’s trying to cut back on his screen time.", "thai": "เขากำลังพยายามลดเวลาใช้หน้าจอ"}
{"word": "cut back", "english": "We should cut back on our water bill.", "thai": "เราควรลดค่าน้ำ"}
{"word": "cut back", "english": "I’m cutting back on my coffee shop visits.", "thai": "ฉันกำลังลดการไปร้านกาแฟ"}
{"word": "cut back", "english": "The team had to cut back on resources.", "thai": "ทีมต้องลดการใช้ทรัพยากร"}
{"word": "cut back", "english": "She’s cutting back on her volunteer hours.", "thai": "เธอกำลังลดชั่วโมงงานอาสา"}
{"word": "cut back", "english": "I need to cut back on my sugar intake.", "thai": "ฉันต้องลดการกินน้ำตาล"}
{"word": "cut back", "english": "They’re cutting back on packaging materials.", "thai": "พวกเขากำลังลดวัสดุบรรจุภัณฑ์"}
{"word": "cut back", "english": "He wants to cut back on his phone bill.", "thai": "เขาอยากลดค่าโทรศัพท์"}
{"word": "cut back", "english": "We should cut back on our dining budget.", "thai": "เราควรลดงบการกินข้าวนอกบ้าน"}
{"word": "cut back", "english": "I’m cutting back on my social media posts.", "thai": "ฉันกำลังลดการโพสต์ในโซเชียลมีเดีย"}
{"word": "cut back", "english": "The school is cutting back on field trips.", "thai": "โรงเรียนกำลังลดการไปทัศนศึกษา"}
{"word": "cut back", "english": "She’s trying to cut back on her naps.", "thai": "เธอกำลังพยายามลดการงีบหลับ"}
{"word": "cut back", "english": "I need to cut back on my TV watching.", "thai": "ฉันต้องลดการดูทีวี"}
{"word": "cut back", "english": "They’re cutting back on office space.", "thai": "พวกเขากำลังลดพื้นที่สำนักงาน"}
{"word": "cut back", "english": "He’s cutting back on his daily commute.", "thai": "เขากำลังลดการเดินทางประจำวัน"}
{"word": "cut back", "english": "We should cut back on our subscriptions.", "thai": "เราควรลดการสมัครสมาชิก"}
{"word": "cut back", "english": "I’m cutting back on my junk food habit.", "thai": "ฉันกำลังลดนิสัยกินอาหารขยะ"}
{"word": "cut back", "english": "She wants to cut back on her meetings.", "thai": "เธออยากลดการประชุม"}
{"word": "cut back", "english": "The company had to cut back on benefits.", "thai": "บริษัทต้องลดสวัสดิการ"}
{"word": "cut back", "english": "I need to cut back on my energy drinks.", "thai": "ฉันต้องลดการดื่มเครื่องดื่มชูกำลัง"}
{"word": "cut back", "english": "They’re cutting back on training sessions.", "thai": "พวกเขากำลังลดการฝึกอบรม"}
{"word": "cut back", "english": "He’s trying to cut back on his expenses.", "thai": "เขากำลังพยายามลดค่าใช้จ่าย"}
{"word": "cut back", "english": "We should cut back on our car usage.", "thai": "เราควรลดการใช้รถยนต์"}
{"word": "cut back", "english": "I’m cutting back on my late-night gaming.", "thai": "ฉันกำลังลดการเล่นเกมตอนดึก"}
{"word": "cut back", "english": "She’s cutting back on her coffee runs.", "thai": "เธอกำลังลดการไปซื้อกาแฟ"}
{"word": "cut back", "english": "I want to cut back on my snack budget.", "thai": "ฉันอยากลดงบซื้อขนม"}
{"word": "cut back", "english": "They’re cutting back on team outings.", "thai": "พวกเขากำลังลดการออกไปเที่ยวของทีม"}
{"word": "cut back", "english": "He needs to cut back on his work stress.", "thai": "เขาต้องลดความเครียดจากงาน"}
{"word": "cut back", "english": "Let’s cut back on our internet usage.", "thai": "มาลดการใช้อินเทอร์เน็ตกัน"}
{"word": "cut back", "english": "I’m trying to cut back on my desserts.", "thai": "ฉันกำลังพยายามลดการกินของหวาน"}
{"word": "cut back", "english": "The store is cutting back on plastic bags.", "thai": "ร้านกำลังลดการใช้ถุงพลาสติก"}
{"word": "eat out", "english": "Let’s eat out at that new Italian place tonight.", "thai": "ไปกินข้าวนอกบ้านที่ร้านอิตาเลียนใหม่คืนนี้กันเถอะ"}
{"word": "eat out", "english": "I don’t feel like cooking, so let’s eat out.", "thai": "ฉันไม่อยากทำอาหาร ไปกินข้าวนอกบ้านกันดีกว่า"}
{"word": "eat out", "english": "We usually eat out on weekends.", "thai": "เรามักจะกินข้าวนอกบ้านในวันหยุดสุดสัปดาห์"}
{"word": "eat out", "english": "She loves to eat out at sushi restaurants.", "thai": "เธอชอบกินข้าวนอกบ้านที่ร้านซูชิ"}
{"word": "eat out", "english": "I’m too tired to cook, let’s eat out instead.", "thai": "ฉันเหนื่อยเกินกว่าจะทำอาหาร ไปกินข้าวนอกบ้านแทนดีกว่า"}
{"word": "eat out", "english": "Do you want to eat out or order takeout?", "thai": "อยากกินข้าวนอกบ้านหรือสั่งอาหารกลับบ้านดี"}
{"word": "eat out", "english": "We should eat out to celebrate your promotion.", "thai": "เราควรไปกินข้าวนอกบ้านเพื่อฉลองการเลื่อนตำแหน่งของคุณ"}
{"word": "eat out", "english": "He prefers to eat out at local diners.", "thai": "เขาชอบกินข้าวนอกบ้านที่ร้านอาหารท้องถิ่น"}
{"word": "eat out", "english": "Let’s eat out at the food truck festival.", "thai": "ไปกินข้าวนอกบ้านที่งานเทศกาลรถขายอาหารกัน"}
{"word": "eat out", "english": "I haven’t had time to eat out lately.", "thai": "ช่วงนี้ฉันไม่มีเวลากินข้าวนอกบ้านเลย"}
{"word": "eat out", "english": "They eat out at fancy restaurants once a month.", "thai": "พวกเขาไปกินข้าวนอกบ้านที่ร้านอาหารหรูเดือนละครั้ง"}
{"word": "eat out", "english": "We can eat out after the movie tonight.", "thai": "เราสามารถไปกินข้าวนอกบ้านหลังดูหนังคืนนี้"}
{"word": "eat out", "english": "She wants to eat out with her friends this weekend.", "thai": "เธออยากไปกินข้าวนอกบ้านกับเพื่อนๆ สุดสัปดาห์นี้"}
{"word": "eat out", "english": "I’m craving pizza, let’s eat out tonight.", "thai": "ฉันอยากกินพิซซ่า ไปกินข้าวนอกบ้านคืนนี้กัน"}
{"word": "eat out", "english": "He suggested we eat out at the new café.", "thai": "เขาแนะนำให้เราไปกินข้าวนอกบ้านที่ร้านกาแฟใหม่"}
{"word": "eat out", "english": "We don’t eat out often because of the budget.", "thai": "เราไม่ค่อยกินข้าวนอกบ้านเพราะเรื่องงบประมาณ"}
{"word": "eat out", "english": "Let’s eat out to try some Thai food.", "thai": "ไปกินข้าวนอกบ้านเพื่อลองอาหารไทยกัน"}
{"word": "eat out", "english": "I love to eat out at seafood restaurants.", "thai": "ฉันชอบกินข้าวนอกบ้านที่ร้านอาหารทะเล"}
{"word": "eat out", "english": "They’re planning to eat out for their anniversary.", "thai": "พวกเขาวางแผนไปกินข้าวนอกบ้านในวันครบรอบ"}
{"word": "eat out", "english": "We should eat out at that vegan place soon.", "thai": "เราควรไปกินข้าวนอกบ้านที่ร้านอาหารมังสวิรัติเร็วๆ นี้"}
{"word": "eat out", "english": "I’m too busy to cook, so I eat out a lot.", "thai": "ฉันยุ่งเกินกว่าจะทำอาหาร เลยไปกินข้าวนอกบ้านบ่อยๆ"}
{"word": "eat out", "english": "Let’s eat out at the burger joint downtown.", "thai": "ไปกินข้าวนอกบ้านที่ร้านเบอร์เกอร์ในตัวเมืองกัน"}
{"word": "eat out", "english": "She doesn’t like to eat out alone.", "thai": "เธอไม่ชอบกินข้าวนอกบ้านคนเดียว"}
{"word": "eat out", "english": "We can eat out after the game tonight.", "thai": "เราสามารถไปกินข้าวนอกบ้านหลังจบเกมคืนนี้"}
{"word": "eat out", "english": "He wants to eat out at a steakhouse this Friday.", "thai": "เขาอยากไปกินข้าวนอกบ้านที่ร้านสเต๊กในวันศุกร์นี้"}
{"word": "eat out", "english": "I’m trying to eat out less to save money.", "thai": "ฉันพยายามกินข้าวนอกบ้านน้อยลงเพื่อประหยัดเงิน"}
{"word": "eat out", "english": "Let’s eat out at the new taco place.", "thai": "ไปกินข้าวนอกบ้านที่ร้านทาโก้ใหม่กัน"}
{"word": "eat out", "english": "They love to eat out at ethnic restaurants.", "thai": "พวกเขาชอบกินข้าวนอกบ้านที่ร้านอาหารชาติพันธุ์"}
{"word": "eat out", "english": "We should eat out to celebrate your birthday.", "thai": "เราควรไปกินข้าวนอกบ้านเพื่อฉลองวันเกิดคุณ"}
{"word": "eat out", "english": "I don’t eat out much because I love cooking.", "thai": "ฉันไม่ค่อยกินข้าวนอกบ้านเพราะฉันชอบทำอาหาร"}
{"word": "eat out", "english": "Let’s eat out at that diner on Main Street.", "thai": "ไปกินข้าวนอกบ้านที่ร้านอาหารบนถนนเมนกัน"}
{"word": "eat out", "english": "She’s excited to eat out with her family.", "thai": "เธอตื่นเต้นที่จะไปกินข้าวนอกบ้านกับครอบครัว"}
{"word": "eat out", "english": "We can eat out after the concert tomorrow.", "thai": "เราสามารถไปกินข้าวนอกบ้านหลังคอนเสิร์ตพรุ่งนี้"}
{"word": "eat out", "english": "He likes to eat out at barbecue joints.", "thai": "เขาชอบกินข้าวนอกบ้านที่ร้านบาร์บีคิว"}
{"word": "eat out", "english": "Let’s eat out at the new ramen shop.", "thai": "ไปกินข้าวนอกบ้านที่ร้านราเมนใหม่กัน"}
{"word": "eat out", "english": "I eat out a lot when I’m traveling.", "thai": "ฉันกินข้าวนอกบ้านบ่อยๆ ตอนเดินทาง"}
{"word": "eat out", "english": "They’re planning to eat out this weekend.", "thai": "พวกเขาวางแผนไปกินข้าวนอกบ้านสุดสัปดาห์นี้"}
{"word": "eat out", "english": "We should eat out to try some Indian food.", "thai": "เราควรไปกินข้าวนอกบ้านเพื่อลองอาหารอินเดีย"}
{"word": "eat out", "english": "She doesn’t eat out often because of allergies.", "thai": "เธอไม่ค่อยกินข้าวนอกบ้านเพราะแพ้อาหาร"}
{"word": "eat out", "english": "Let’s eat out at that rooftop restaurant.", "thai": "ไปกินข้าวนอกบ้านที่ร้านอาหารบนดาดฟ้ากัน"}
{"word": "eat out", "english": "I’m craving sushi, so let’s eat out.", "thai": "ฉันอยากกินซูชิ ไปกินข้าวนอกบ้านกัน"}
{"word": "eat out", "english": "He wants to eat out with his coworkers tonight.", "thai": "เขาอยากไปกินข้าวนอกบ้านกับเพื่อนร่วมงานคืนนี้"}
{"word": "eat out", "english": "We can eat out after the meeting tomorrow.", "thai": "เราสามารถไปกินข้าวนอกบ้านหลังประชุมพรุ่งนี้"}
{"word": "eat out", "english": "She loves to eat out at Mexican restaurants.", "thai": "เธอชอบกินข้าวนอกบ้านที่ร้านอาหารเม็กซิกัน"}
{"word": "eat out", "english": "Let’s eat out at the new pizza place.", "thai": "ไปกินข้าวนอกบ้านที่ร้านพิซซ่าใหม่กัน"}
{"word": "eat out", "english": "I don’t want to cook, let’s eat out.", "thai": "ฉันไม่อยากทำอาหาร ไปกินข้าวนอกบ้านกัน"}
{"word": "eat out", "english": "They eat out every Friday night.", "thai": "พวกเขาไปกินข้าวนอกบ้านทุกคืนวันศุกร์"}
{"word": "eat out", "english": "We should eat out to celebrate the holidays.", "thai": "เราควรไปกินข้าวนอกบ้านเพื่อฉลองวันหยุด"}
{"word": "eat out", "english": "He prefers to eat out at casual places.", "thai": "เขาชอบกินข้าวนอกบ้านที่ร้านแบบสบายๆ"}
{"word": "eat out", "english": "Let’s eat out at that seafood place downtown.", "thai": "ไปกินข้าวนอกบ้านที่ร้านอาหารทะเลในตัวเมืองกัน"}
{"word": "eat out", "english": "She’s trying to eat out less to save money.", "thai": "เธอพยายามกินข้าวนอกบ้านน้อยลงเพื่อประหยัดเงิน"}
{"word": "eat out", "english": "We can eat out after the play tonight.", "thai": "เราสามารถไปกินข้าวนอกบ้านหลังละครคืนนี้"}
{"word": "eat out", "english": "I love to eat out at new restaurants.", "thai": "ฉันชอบกินข้าวนอกบ้านที่ร้านอาหารใหม่ๆ"}
{"word": "eat out", "english": "They’re planning to eat out for Valentine’s Day.", "thai": "พวกเขาวางแผนไปกินข้าวนอกบ้านในวันวาเลนไทน์"}
{"word": "eat out", "english": "Let’s eat out at that French bistro.", "thai": "ไปกินข้าวนอกบ้านที่ร้านอาหารฝรั่งเศสกัน"}
{"word": "eat out", "english": "I eat out a lot when I’m on vacation.", "thai": "ฉันกินข้าวนอกบ้านบ่อยๆ ตอนไปเที่ยว"}
{"word": "eat out", "english": "She wants to eat out with her sister tonight.", "thai": "เธออยากไปกินข้าวนอกบ้านกับพี่สาวคืนนี้"}
{"word": "eat out", "english": "We should eat out to try some Korean BBQ.", "thai": "เราควรไปกินข้าวนอกบ้านเพื่อลองบาร์บีคิวเกาหลี"}
{"word": "eat out", "english": "He doesn’t eat out much because he’s a chef.", "thai": "เขาไม่ค่อยกินข้าวนอกบ้านเพราะเขาเป็นเชฟ"}
{"word": "eat out", "english": "Let’s eat out at the new burger spot.", "thai": "ไปกินข้าวนอกบ้านที่ร้านเบอร์เกอร์ใหม่กัน"}
{"word": "eat out", "english": "I’m too tired, so let’s eat out tonight.", "thai": "ฉันเหนื่อยเกินไป ไปกินข้าวนอกบ้านคืนนี้กัน"}
{"word": "eat out", "english": "They love to eat out at food markets.", "thai": "พวกเขาชอบกินข้าวนอกบ้านที่ตลาดอาหาร"}
{"word": "eat out", "english": "We can eat out after the festival tomorrow.", "thai": "เราสามารถไปกินข้าวนอกบ้านหลังงานเทศกาลพรุ่งนี้"}
{"word": "eat out", "english": "She wants to eat out at a vegan café.", "thai": "เธออยากไปกินข้าวนอกบ้านที่ร้านกาแฟมังสวิรัติ"}
{"word": "eat out", "english": "Let’s eat out to celebrate your new job.", "thai": "ไปกินข้าวนอกบ้านเพื่อฉลองงานใหม่ของคุณกัน"}
{"word": "eat out", "english": "I don’t eat out often because I’m on a diet.", "thai": "ฉันไม่ค่อยกินข้าวนอกบ้านเพราะฉันกำลังลดน้ำหนัก"}
{"word": "eat out", "english": "He likes to eat out at Italian restaurants.", "thai": "เขาชอบกินข้าวนอกบ้านที่ร้านอาหารอิตาเลียน"}
{"word": "eat out", "english": "Let’s eat out at that sushi bar tonight.", "thai": "ไปกินข้าวนอกบ้านที่ร้านซูชิบาร์คืนนี้กัน"}
{"word": "eat out", "english": "We should eat out to try some new flavors.", "thai": "เราควรไปกินข้าวนอกบ้านเพื่อลองรสชาติใหม่ๆ"}
{"word": "eat out", "english": "She’s excited to eat out with her coworkers.", "thai": "เธอตื่นเต้นที่จะไปกินข้าวนอกบ้านกับเพื่อนร่วมงาน"}
{"word": "eat out", "english": "I eat out a lot when I’m stressed.", "thai": "ฉันกินข้าวนอกบ้านบ่อยๆ ตอนเครียด"}
{"word": "eat out", "english": "Let’s eat out at the new Chinese restaurant.", "thai": "ไปกินข้าวนอกบ้านที่ร้านอาหารจีนใหม่กัน"}
{"word": "eat out", "english": "They’re planning to eat out for New Year’s Eve.", "thai": "พวกเขาวางแผนไปกินข้าวนอกบ้านในวันส่งท้ายปีเก่า"}
{"word": "eat out", "english": "We can eat out after the hike tomorrow.", "thai": "เราสามารถไปกินข้าวนอกบ้านหลังเดินป่าพรุ่งนี้"}
{"word": "eat out", "english": "He wants to eat out at a sports bar.", "thai": "เขาอยากไปกินข้าวนอกบ้านที่ร้านสปอร์ตบาร์"}
{"word": "eat out", "english": "Let’s eat out at that rooftop café.", "thai": "ไปกินข้าวนอกบ้านที่ร้านกาแฟบนดาดฟ้ากัน"}
{"word": "eat out", "english": "I’m trying to eat out less this month.", "thai": "ฉันพยายามกินข้าวนอกบ้านน้อยลงในเดือนนี้"}
{"word": "eat out", "english": "She loves to eat out at dessert shops.", "thai": "เธอชอบกินข้าวนอกบ้านที่ร้านของหวาน"}
{"word": "eat out", "english": "We should eat out to try some tapas.", "thai": "เราควรไปกินข้าวนอกบ้านเพื่อลองอาหารทาปาส"}
{"word": "eat out", "english": "He doesn’t eat out much because of work.", "thai": "เขาไม่ค่อยกินข้าวนอกบ้านเพราะงาน"}
{"word": "eat out", "english": "Let’s eat out at the new deli downtown.", "thai": "ไปกินข้าวนอกบ้านที่ร้านเดลี่ใหม่ในตัวเมืองกัน"}
{"word": "eat out", "english": "I eat out a lot with my friends.", "thai": "ฉันกินข้าวนอกบ้านบ่อยๆ กับเพื่อนๆ"}
{"word": "eat out", "english": "They’re planning to eat out for Christmas.", "thai": "พวกเขาวางแผนไปกินข้าวนอกบ้านในวันคริสต์มาส"}
{"word": "eat out", "english": "We can eat out after the party tonight.", "thai": "เราสามารถไปกินข้าวนอกบ้านหลังปาร์ตี้คืนนี้"}
{"word": "eat out", "english": "She wants to eat out at a pizzeria.", "thai": "เธออยากไปกินข้าวนอกบ้านที่ร้านพิซซ่า"}
{"word": "eat out", "english": "Let’s eat out to celebrate the new year.", "thai": "ไปกินข้าวนอกบ้านเพื่อฉลองปีใหม่กัน"}
{"word": "eat out", "english": "I don’t eat out much because I’m saving up.", "thai": "ฉันไม่ค่อยกินข้าวนอกบ้านเพราะกำลังเก็บเงิน"}
{"word": "eat out", "english": "He likes to eat out at food trucks.", "thai": "เขาชอบกินข้าวนอกบ้านที่รถขายอาหาร"}
{"word": "eat out", "english": "Let’s eat out at that ramen place tonight.", "thai": "ไปกินข้าวนอกบ้านที่ร้านราเมนคืนนี้กัน"}
{"word": "eat out", "english": "We should eat out to try some dim sum.", "thai": "เราควรไปกินข้าวนอกบ้านเพื่อลองติ่มซำ"}
{"word": "eat out", "english": "She’s excited to eat out with her parents.", "thai": "เธอตื่นเต้นที่จะไปกินข้าวนอกบ้านกับพ่อแม่"}
{"word": "eat out", "english": "I eat out a lot when I’m with family.", "thai": "ฉันกินข้าวนอกบ้านบ่อยๆ ตอนอยู่กับครอบครัว"}
{"word": "eat out", "english": "Let’s eat out at the new barbecue spot.", "thai": "ไปกินข้าวนอกบ้านที่ร้านบาร์บีคิวใหม่กัน"}
{"word": "eat out", "english": "They love to eat out at street food stalls.", "thai": "พวกเขาชอบกินข้าวนอกบ้านที่ร้านอาหารข้างถนน"}
{"word": "eat out", "english": "We can eat out after the museum visit.", "thai": "เราสามารถไปกินข้าวนอกบ้านหลังไปพิพิธภัณฑ์"}
{"word": "eat out", "english": "He wants to eat out at a fancy restaurant.", "thai": "เขาอยากไปกินข้าวนอกบ้านที่ร้านอาหารหรู"}
{"word": "eat out", "english": "Let’s eat out to try some local cuisine.", "thai": "ไปกินข้าวนอกบ้านเพื่อลองอาหารท้องถิ่นกัน"}
{"word": "eat out", "english": "I’m trying to eat out less to cook more.", "thai": "ฉันพยายามกินข้าวนอกบ้านน้อยลงเพื่อทำอาหารมากขึ้น"}
{"word": "eat out", "english": "She loves to eat out at brunch spots.", "thai": "เธอชอบกินข้าวนอกบ้านที่ร้านอาหารเช้า"}
{"word": "eat out", "english": "We should eat out to celebrate your graduation.", "thai": "เราควรไปกินข้าวนอกบ้านเพื่อฉลองการจบการศึกษาของคุณ"}
{"word": "get along", "english": "We get along really well with our neighbors.", "thai": "เราเข้ากันได้ดีมากกับเพื่อนบ้าน"}
{"word": "get along", "english": "I hope you two can get along at the party.", "thai": "ฉันหวังว่าพวกคุณสองคนจะเข้ากันได้ในงานปาร์ตี้"}
{"word": "get along", "english": "She gets along with everyone at work.", "thai": "เธอเข้ากับทุกคนที่ทำงานได้ดี"}
{"word": "get along", "english": "How do you get along with your new boss?", "thai": "คุณเข้ากับเจ้านายใหม่ได้ดีแค่ไหน"}
{"word": "get along", "english": "They don’t always get along, but they try.", "thai": "พวกเขาไม่ได้เข้ากันได้เสมอ แต่ก็พยายาม"}
{"word": "get along", "english": "I get along fine without a car.", "thai": "ฉันอยู่ได้ดีโดยไม่ต้องมีรถยนต์"}
{"word": "get along", "english": "He gets along great with his teammates.", "thai": "เขาเข้ากันได้ดีมากกับเพื่อนร่วมทีม"}
{"word": "get along", "english": "We’re trying to get along with less money.", "thai": "เรากำลังพยายามใช้ชีวิตด้วยเงินน้อยลง"}
{"word": "get along", "english": "Do you get along with your siblings?", "thai": "คุณเข้ากับพี่น้องได้ดีไหม"}
{"word": "get along", "english": "She gets along well with her classmates.", "thai": "เธอเข้ากันได้ดีกับเพื่อนร่วมชั้น"}
{"word": "get along", "english": "I think we’ll get along just fine.", "thai": "ฉันคิดว่าเราจะเข้ากันได้ดี"}
{"word": "get along", "english": "He’s easy to get along with at school.", "thai": "เขาเป็นคนที่เข้ากันได้ง่ายในโรงเรียน"}
{"word": "get along", "english": "They get along like best friends.", "thai": "พวกเขาเข้ากันได้เหมือนเพื่อนสนิท"}
{"word": "get along", "english": "I’m not sure how I’ll get along without Wi-Fi.", "thai": "ฉันไม่แน่ใจว่าจะอยู่ได้ยังไงถ้าไม่มีไวไฟ"}
{"word": "get along", "english": "She gets along with her in-laws perfectly.", "thai": "เธอเข้ากันได้ดีมากกับครอบครัวของสามี"}
{"word": "get along", "english": "We get along better now than before.", "thai": "เราเข้ากันได้ดีขึ้นกว่าก่อน"}
{"word": "get along", "english": "How does he get along with his coworkers?", "thai": "เขาเข้ากับเพื่อนร่วมงานได้ดีแค่ไหน"}
{"word": "get along", "english": "I can get along with most people.", "thai": "ฉันสามารถเข้ากับคนส่วนใหญ่ได้"}
{"word": "get along", "english": "They don’t get along very well these days.", "thai": "ช่วงนี้พวกเขาไม่ได้เข้ากันได้ดีนัก"}
{"word": "get along", "english": "She’s trying to get along on a tight budget.", "thai": "เธอกำลังพยายามใช้ชีวิตด้วยงบจำกัด"}
{"word": "get along", "english": "We get along great during family gatherings.", "thai": "เราเข้ากันได้ดีมากในงานรวมญาติ"}
{"word": "get along", "english": "He gets along with his new roommate.", "thai": "เขาเข้ากันได้ดีกับเพื่อนร่วมห้องคนใหม่"}
{"word": "get along", "english": "I’m learning to get along without my phone.", "thai": "ฉันกำลังเรียนรู้ที่จะอยู่โดยไม่มีโทรศัพท์"}
{"word": "get along", "english": "Do you get along with your team at work?", "thai": "คุณเข้ากับทีมที่ทำงานได้ดีไหม"}
{"word": "get along", "english": "She gets along well with her cousins.", "thai": "เธอเข้ากันได้ดีกับลูกพี่ลูกน้อง"}
{"word": "get along", "english": "They get along like they’ve known each other forever.", "thai": "พวกเขาเข้ากันได้เหมือนรู้จักกันมานาน"}
{"word": "get along", "english": "I can get along fine with just a backpack.", "thai": "ฉันอยู่ได้ดีด้วยแค่กระเป๋าเป้ใบเดียว"}
{"word": "get along", "english": "He doesn’t get along with his sister.", "thai": "เขาไม่เข้ากับน้องสาวของเขา"}
{"word": "get along", "english": "We’re trying to get along with fewer resources.", "thai": "เรากำลังพยายามใช้ชีวิตด้วยทรัพยากรที่น้อยลง"}
{"word": "get along", "english": "She gets along great with her teachers.", "thai": "เธอเข้ากันได้ดีมากกับครู"}
{"word": "get along", "english": "How do you get along with your new neighbors?", "thai": "คุณเข้ากับเพื่อนบ้านใหม่ได้ดีแค่ไหน"}
{"word": "get along", "english": "I get along with my boss pretty well.", "thai": "ฉันเข้ากับเจ้านายได้ค่อนข้างดี"}
{"word": "get along", "english": "They get along well despite their differences.", "thai": "พวกเขาเข้ากันได้ดีแม้จะมีความแตกต่าง"}
{"word": "get along", "english": "I’m figuring out how to get along on my own.", "thai": "ฉันกำลังหาวิธีใช้ชีวิตด้วยตัวเอง"}
{"word": "get along", "english": "She gets along with her study group.", "thai": "เธอเข้ากันได้ดีกับกลุ่มเรียน"}
{"word": "get along", "english": "We don’t always get along, but we manage.", "thai": "เราไม่ได้เข้ากันได้เสมอ แต่ก็จัดการได้"}
{"word": "get along", "english": "He gets along with everyone in the club.", "thai": "เขาเข้ากับทุกคนในชมรมได้ดี"}
{"word": "get along", "english": "I can get along without fancy gadgets.", "thai": "ฉันอยู่ได้โดยไม่มีอุปกรณ์หรูๆ"}
{"word": "get along", "english": "They get along better after talking it out.", "thai": "พวกเขาเข้ากันได้ดีขึ้นหลังจากคุยกัน"}
{"word": "get along", "english": "She’s trying to get along with her new team.", "thai": "เธอกำลังพยายามเข้ากับทีมใหม่"}
{"word": "get along", "english": "How do you get along with your classmates?", "thai": "คุณเข้ากับเพื่อนร่วมชั้นได้ดีแค่ไหน"}
{"word": "get along", "english": "I get along fine with my coworkers.", "thai": "ฉันเข้ากับเพื่อนร่วมงานได้ดี"}
{"word": "get along", "english": "They get along like siblings.", "thai": "พวกเขาเข้ากันได้เหมือนพี่น้อง"}
{"word": "get along", "english": "I’m learning to get along with less sleep.", "thai": "ฉันกำลังเรียนรู้ที่จะอยู่ด้วยการนอนน้อยลง"}
{"word": "get along", "english": "She gets along well with her roommates.", "thai": "เธอเข้ากันได้ดีกับเพื่อนร่วมห้อง"}
{"word": "get along", "english": "We get along great at family dinners.", "thai": "เราเข้ากันได้ดีมากในงานเลี้ยงครอบครัว"}
{"word": "get along", "english": "He doesn’t get along with his new manager.", "thai": "เขาไม่เข้ากับผู้จัดการคนใหม่"}
{"word": "get along", "english": "I can get along without social media.", "thai": "ฉันอยู่ได้โดยไม่มีโซเชียลมีเดีย"}
{"word": "get along", "english": "They get along well despite their arguments.", "thai": "พวกเขาเข้ากันได้ดีแม้จะมีการถกเถียง"}
{"word": "get along", "english": "She’s trying to get along on a small income.", "thai": "เธอกำลังพยายามใช้ชีวิตด้วยรายได้น้อย"}
{"word": "get along", "english": "We get along better now that we’ve moved.", "thai": "เราเข้ากันได้ดีขึ้นตั้งแต่ย้ายมา"}
{"word": "get along", "english": "How does he get along with his friends?", "thai": "เขาเข้ากับเพื่อนๆ ได้ดีแค่ไหน"}
{"word": "get along", "english": "I get along with my team at school.", "thai": "ฉันเข้ากับทีมที่โรงเรียนได้ดี"}
{"word": "get along", "english": "They don’t get along as well as they used to.", "thai": "พวกเขาไม่ได้เข้ากันได้ดีเหมือนแต่ก่อน"}
{"word": "get along", "english": "She gets along great with her colleagues.", "thai": "เธอเข้ากันได้ดีมากกับเพื่อนร่วมงาน"}
{"word": "get along", "english": "I’m trying to get along with less stuff.", "thai": "ฉันกำลังพยายามใช้ชีวิตด้วยของน้อยลง"}
{"word": "get along", "english": "He gets along with his cousins just fine.", "thai": "เขาเข้ากับลูกพี่ลูกน้องได้ดี"}
{"word": "get along", "english": "We get along well during group projects.", "thai": "เราเข้ากันได้ดีในโปรเจกต์กลุ่ม"}
{"word": "get along", "english": "I can get along without a big salary.", "thai": "ฉันอยู่ได้โดยไม่ต้องมีเงินเดือนสูง"}
{"word": "get along", "english": "She doesn’t get along with her neighbor.", "thai": "เธอไม่เข้ากับเพื่อนบ้าน"}
{"word": "get along", "english": "They get along like old friends.", "thai": "พวกเขาเข้ากันได้เหมือนเพื่อนเก่า"}
{"word": "get along", "english": "I’m learning to get along in a new city.", "thai": "ฉันกำลังเรียนรู้ที่จะใช้ชีวิตในเมืองใหม่"}
{"word": "get along", "english": "He gets along well with his classmates.", "thai": "เขาเข้ากันได้ดีกับเพื่อนร่วมชั้น"}
{"word": "get along", "english": "We get along better after resolving our issues.", "thai": "เราเข้ากันได้ดีขึ้นหลังจากแก้ปัญหา"}
{"word": "get along", "english": "How do you get along with your roommates?", "thai": "คุณเข้ากับเพื่อนร่วมห้องได้ดีแค่ไหน"}
{"word": "get along", "english": "She gets along with her new coworkers.", "thai": "เธอเข้ากันได้ดีกับเพื่อนร่วมงานใหม่"}
{"word": "get along", "english": "I can get along fine without a TV.", "thai": "ฉันอยู่ได้ดีโดยไม่มีทีวี"}
{"word": "get along", "english": "They get along great at family reunions.", "thai": "พวกเขาเข้ากันได้ดีมากในงานรวมญาติ"}
{"word": "get along", "english": "He’s trying to get along with his new schedule.", "thai": "เขากำลังพยายามปรับตัวกับตารางใหม่"}
{"word": "get along", "english": "We don’t get along as well as we hoped.", "thai": "เราไม่ได้เข้ากันได้ดีอย่างที่หวัง"}
{"word": "get along", "english": "She gets along with her study partners.", "thai": "เธอเข้ากันได้ดีกับเพื่อนเรียน"}
{"word": "get along", "english": "I get along well with my new team.", "thai": "ฉันเข้ากันได้ดีกับทีมใหม่"}
{"word": "get along", "english": "They get along like they’re family.", "thai": "พวกเขาเข้ากันได้เหมือนเป็นครอบครัว"}
{"word": "get along", "english": "I’m figuring out how to get along without help.", "thai": "ฉันกำลังหาวิธีใช้ชีวิตโดยไม่ต้องพึ่งพาคนอื่น"}
{"word": "get along", "english": "He gets along with his boss just fine.", "thai": "เขาเข้ากับเจ้านายได้ดี"}
{"word": "get along", "english": "We get along great during road trips.", "thai": "เราเข้ากันได้ดีมากตอนไปโรดทริป"}
{"word": "get along", "english": "She doesn’t get along with her new teacher.", "thai": "เธอไม่เข้ากับครูคนใหม่"}
{"word": "get along", "english": "I can get along with minimal supplies.", "thai": "ฉันอยู่ได้ด้วยของใช้ขั้นต่ำ"}
{"word": "get along", "english": "They get along well despite their rivalry.", "thai": "พวกเขาเข้ากันได้ดีแม้จะมีการแข่งขัน"}
{"word": "get along", "english": "I’m trying to get along on a small budget.", "thai": "ฉันกำลังพยายามใช้ชีวิตด้วยงบจำกัด"}
{"word": "get along", "english": "She gets along great with her friends.", "thai": "เธอเข้ากันได้ดีมากกับเพื่อนๆ"}
{"word": "get along", "english": "How do you get along with your colleagues?", "thai": "คุณเข้ากับเพื่อนร่วมงานได้ดีแค่ไหน"}
{"word": "get along", "english": "We get along better after spending time together.", "thai": "เราเข้ากันได้ดีขึ้นหลังจากใช้เวลาด้วยกัน"}
{"word": "get along", "english": "He gets along with his new classmates.", "thai": "เขาเข้ากันได้ดีกับเพื่อนร่วมชั้นใหม่"}
{"word": "get along", "english": "I can get along without my old job.", "thai": "ฉันอยู่ได้โดยไม่มีงานเก่า"}
{"word": "get along", "english": "They get along like a house on fire.", "thai": "พวกเขาเข้ากันได้ดีมากเหมือนติดไฟ"}
{"word": "get along", "english": "She’s learning to get along in a new school.", "thai": "เธอกำลังเรียนรู้ที่จะปรับตัวในโรงเรียนใหม่"}
{"word": "get along", "english": "We get along well during team meetings.", "thai": "เราเข้ากันได้ดีในที่ประชุมทีม"}
{"word": "get along", "english": "He doesn’t get along with his new coach.", "thai": "เขาไม่เข้ากับโค้ชคนใหม่"}
{"word": "get along", "english": "I’m trying to get along with less stress.", "thai": "ฉันกำลังพยายามใช้ชีวิตด้วยความเครียดน้อยลง"}
{"word": "get along", "english": "She gets along with her new neighbors.", "thai": "เธอเข้ากันได้ดีกับเพื่อนบ้านใหม่"}
{"word": "get along", "english": "They get along great at social events.", "thai": "พวกเขาเข้ากันได้ดีมากในงานสังคม"}
{"word": "get along", "english": "I can get along fine with basic tools.", "thai": "ฉันอยู่ได้ดีด้วยเครื่องมือพื้นฐาน"}
{"word": "get along", "english": "How do you get along with your in-laws?", "thai": "คุณเข้ากับครอบครัวของคู่สมรสได้ดีแค่ไหน"}
{"word": "get along", "english": "We get along better after clearing the air.", "thai": "เราเข้ากันได้ดีขึ้นหลังจากเคลียร์ใจ"}
{"word": "get along", "english": "He gets along well with his study group.", "thai": "เขาเข้ากันได้ดีกับกลุ่มเรียน"}
{"word": "get along", "english": "I’m learning to get along without a schedule.", "thai": "ฉันกำลังเรียนรู้ที่จะอยู่โดยไม่มีตาราง"}
{"word": "get along", "english": "They get along like old pals.", "thai": "พวกเขาเข้ากันได้เหมือนเพื่อนเก่า"}
{"word": "get along", "english": "She gets along great with her new boss.", "thai": "เธอเข้ากันได้ดีมากกับเจ้านายใหม่"}
{"word": "get along", "english": "We get along well during vacations.", "thai": "เราเข้ากันได้ดีตอนไปเที่ยว"}
{"word": "get along", "english": "I can get along with just a few friends.", "thai": "ฉันอยู่ได้ด้วยเพื่อนแค่ไม่กี่คน"}
{"word": "check in", "english": "I need to check in at the hotel before 3 PM.", "thai": "ฉันต้องเช็คอินที่โรงแรมก่อนบ่ายสามโมง"}
{"word": "check in", "english": "Can you check in online for your flight?", "thai": "คุณสามารถเช็คอินออนไลน์สำหรับเที่ยวบินของคุณได้ไหม"}
{"word": "check in", "english": "She forgot to check in with her boss about the project.", "thai": "เธอลืมเช็คอินกับเจ้านายของเธอเกี่ยวกับโปรเจกต์"}
{"word": "check in", "english": "We should check in at the airport two hours early.", "thai": "เราควรเช็คอินที่สนามบินล่วงหน้าสองชั่วโมง"}
{"word": "check in", "english": "He always checks in with his parents every Sunday.", "thai": "เขาเช็คอินกับพ่อแม่ทุกวันอาทิตย์"}
{"word": "check in", "english": "The app lets you check in for your appointment.", "thai": "แอปนี้ให้คุณเช็คอินสำหรับการนัดหมาย"}
{"word": "check in", "english": "They need to check in their luggage before boarding.", "thai": "พวกเขาต้องเช็คอินกระเป๋าเดินทางก่อนขึ้นเครื่อง"}
{"word": "check in", "english": "I’ll check in with you later about the plans.", "thai": "ฉันจะเช็คอินกับคุณทีหลังเกี่ยวกับแผน"}
{"word": "check in", "english": "The guests can check in at the front desk.", "thai": "แขกสามารถเช็คอินที่เคาน์เตอร์ต้อนรับ"}
{"word": "check in", "english": "Did you check in for the conference yet?", "thai": "คุณเช็คอินสำหรับงานประชุมแล้วหรือยัง"}
{"word": "check in", "english": "She checks in on her elderly neighbor daily.", "thai": "เธอเช็คอินกับเพื่อนบ้านสูงวัยทุกวัน"}
{"word": "check in", "english": "You can check in using the self-service kiosk.", "thai": "คุณสามารถเช็คอินโดยใช้ตู้บริการตนเอง"}
{"word": "check in", "english": "He didn’t check in until after midnight.", "thai": "เขาไม่ได้เช็คอินจนถึงหลังเที่ยงคืน"}
{"word": "check in", "english": "Let’s check in with the team before the meeting.", "thai": "มาเช็คอินกับทีมก่อนการประชุมกัน"}
{"word": "check in", "english": "The system requires you to check in every hour.", "thai": "ระบบกำหนดให้คุณเช็คอินทุกชั่วโมง"}
{"word": "check in", "english": "I forgot to check in for my return flight.", "thai": "ฉันลืมเช็คอินสำหรับเที่ยวบินขากลับ"}
{"word": "check in", "english": "They’ll check in at the resort this evening.", "thai": "พวกเขาจะเช็คอินที่รีสอร์ทเย็นนี้"}
{"word": "check in", "english": "Can you check in on the kids tonight?", "thai": "คุณช่วยเช็คอินดูเด็กๆ คืนนี้ได้ไหม"}
{"word": "check in", "english": "The airline allows you to check in 24 hours in advance.", "thai": "สายการบินอนุญาตให้คุณเช็คอินล่วงหน้า 24 ชั่วโมง"}
{"word": "check in", "english": "He needs to check in with his doctor regularly.", "thai": "เขาต้องเช็คอินกับหมอเป็นประจำ"}
{"word": "check in", "english": "We’ll check in at the Airbnb around noon.", "thai": "เราจะเช็คอินที่แอร์บีเอ็นบีประมาณเที่ยง"}
{"word": "check in", "english": "She checks in on her social media every morning.", "thai": "เธอเช็คอินบนโซเชียลมีเดียทุกเช้า"}
{"word": "check in", "english": "You must check in before entering the event.", "thai": "คุณต้องเช็คอินก่อนเข้าชมงาน"}
{"word": "check in", "english": "I’ll check in with the manager about your request.", "thai": "ฉันจะเช็คอินกับผู้จัดการเกี่ยวกับคำขอของคุณ"}
{"word": "check in", "english": "The hospital requires patients to check in at reception.", "thai": "โรงพยาบาลกำหนดให้ผู้ป่วยเช็คอินที่แผนกต้อนรับ"}
{"word": "check in", "english": "He checked in at the gym before his workout.", "thai": "เขาเช็คอินที่ยิมก่อนออกกำลังกาย"}
{"word": "check in", "english": "Can we check in early for our cruise?", "thai": "เราสามารถเช็คอินล่วงหน้าสำหรับการล่องเรือได้ไหม"}
{"word": "check in", "english": "She needs to check in with her therapist weekly.", "thai": "เธอต้องเช็คอินกับนักบำบัดทุกสัปดาห์"}
{"word": "check in", "english": "They forgot to check in their bags at the counter.", "thai": "พวกเขาลืมเช็คอินกระเป๋าที่เคาน์เตอร์"}
{"word": "check in", "english": "I’ll check in on the progress of the report tomorrow.", "thai": "ฉันจะเช็คอินดูความคืบหน้าของรายงานพรุ่งนี้"}
{"word": "check in", "english": "The event staff asked us to check in at the entrance.", "thai": "เจ้าหน้าที่งานขอให้เราเช็คอินที่ทางเข้า"}
{"word": "check in", "english": "You can check in for the webinar online.", "thai": "คุณสามารถเช็คอินสำหรับเว็บบินาร์ออนไลน์ได้"}
{"word": "check in", "english": "He checks in with his mentor every month.", "thai": "เขาเช็คอินกับที่ปรึกษาทุกเดือน"}
{"word": "check in", "english": "We need to check in before the restaurant opens.", "thai": "เราต้องเช็คอินก่อนร้านอาหารเปิด"}
{"word": "check in", "english": "The app reminds you to check in at the venue.", "thai": "แอปเตือนให้คุณเช็คอินที่สถานที่"}
{"word": "check in", "english": "She checked in at the spa for her appointment.", "thai": "เธอเช็คอินที่สปาสำหรับการนัดหมาย"}
{"word": "check in", "english": "Can you check in with the client about the deadline?", "thai": "คุณช่วยเช็คอินกับลูกค้าเกี่ยวกับกำหนดเวลาได้ไหม"}
{"word": "check in", "english": "They’ll check in at the hostel this afternoon.", "thai": "พวกเขาจะเช็คอินที่โฮสเทลบ่ายนี้"}
{"word": "check in", "english": "I need to check in for my train ticket online.", "thai": "ฉันต้องเช็คอินสำหรับตั๋วรถไฟออนไลน์"}
{"word": "check in", "english": "He checks in on his team’s progress daily.", "thai": "เขาเช็คอินดูความคืบหน้าของทีมทุกวัน"}
{"word": "check in", "english": "The hotel lets you check in using your phone.", "thai": "โรงแรมให้คุณเช็คอินโดยใช้โทรศัพท์"}
{"word": "check in", "english": "She forgot to check in for her yoga class.", "thai": "เธอลืมเช็คอินสำหรับคลาสโยคะ"}
{"word": "check in", "english": "We’ll check in with the organizers before the event.", "thai": "เราจะเช็คอินกับผู้จัดงานก่อนงานเริ่ม"}
{"word": "check in", "english": "You need to check in at the gate before boarding.", "thai": "คุณต้องเช็คอินที่ประตูก่อนขึ้นเครื่อง"}
{"word": "check in", "english": "He checked in on his friend after the storm.", "thai": "เขาเช็คอินดูเพื่อนหลังพายุ"}
{"word": "check in", "english": "The system lets you check in automatically.", "thai": "ระบบให้คุณเช็คอินโดยอัตโนมัติ"}
{"word": "check in", "english": "I’ll check in with my supervisor about the schedule.", "thai": "ฉันจะเช็คอินกับหัวหน้างานเกี่ยวกับตาราง"}
{"word": "check in", "english": "They checked in at the campsite last night.", "thai": "พวกเขาเช็คอินที่แคมป์เมื่อคืน"}
{"word": "check in", "english": "Can you check in on the project status?", "thai": "คุณช่วยเช็คอินดูสถานะโปรเจกต์ได้ไหม"}
{"word": "check in", "english": "The airline requires you to check in at the counter.", "thai": "สายการบินกำหนดให้คุณเช็คอินที่เคาน์เตอร์"}
{"word": "check in", "english": "She checks in with her coach before every game.", "thai": "เธอเช็คอินกับโค้ชก่อนทุกเกม"}
{"word": "check in", "english": "We need to check in at the convention center.", "thai": "เราต้องเช็คอินที่ศูนย์ประชุม"}
{"word": "check in", "english": "He forgot to check in for his online course.", "thai": "เขาลืมเช็คอินสำหรับคอร์สออนไลน์"}
{"word": "check in", "english": "You can check in with your ID at the entrance.", "thai": "คุณสามารถเช็คอินด้วยบัตรประจำตัวที่ทางเข้า"}
{"word": "check in", "english": "They’ll check in at the vacation home tomorrow.", "thai": "พวกเขาจะเช็คอินที่บ้านพักตากอากาศพรุ่งนี้"}
{"word": "check in", "english": "I’ll check in on the repairs this afternoon.", "thai": "ฉันจะเช็คอินดูการซ่อมแซมบ่ายนี้"}
{"word": "check in", "english": "The app allows you to check in for events.", "thai": "แอปอนุญาตให้คุณเช็คอินสำหรับงานต่างๆ"}
{"word": "check in", "english": "She needs to check in with her professor about the assignment.", "thai": "เธอต้องเช็คอินกับอาจารย์เกี่ยวกับงานที่มอบหมาย"}
{"word": "check in", "english": "We checked in at the bed and breakfast yesterday.", "thai": "เราเช็คอินที่เบดแอนด์เบรคฟาสต์เมื่อวาน"}
{"word": "check in", "english": "Can you check in with the supplier about the order?", "thai": "คุณช่วยเช็คอินกับซัพพลายเออร์เกี่ยวกับคำสั่งซื้อได้ไหม"}
{"word": "check in", "english": "The clinic asks patients to check in 15 minutes early.", "thai": "คลินิกขอให้ผู้ป่วยเช็คอินล่วงหน้า 15 นาที"}
{"word": "check in", "english": "He checks in at the library before studying.", "thai": "เขาเช็คอินที่ห้องสมุดก่อนเรียน"}
{"word": "check in", "english": "We’ll check in for the tour at the meeting point.", "thai": "เราจะเช็คอินสำหรับทัวร์ที่จุดนัดพบ"}
{"word": "check in", "english": "She checked in on her cat while she was away.", "thai": "เธอเช็คอินดูแมวของเธอขณะที่เธอไม่อยู่"}
{"word": "check in", "english": "You need to check in with security before entering.", "thai": "คุณต้องเช็คอินกับเจ้าหน้าที่รักษาความปลอดภัยก่อนเข้า"}
{"word": "check in", "english": "They checked in at the lodge this morning.", "thai": "พวกเขาเช็คอินที่ลอดจ์เช้านี้"}
{"word": "check in", "english": "I’ll check in with the coordinator about the event.", "thai": "ฉันจะเช็คอินกับผู้ประสานงานเกี่ยวกับงาน"}
{"word": "check in", "english": "The app lets you check in for your reservation.", "thai": "แอปให้คุณเช็คอินสำหรับการจอง"}
{"word": "check in", "english": "He needs to check in at the office every morning.", "thai": "เขาต้องเช็คอินที่สำนักงานทุกเช้า"}
{"word": "check in", "english": "We forgot to check in for the concert online.", "thai": "เราลืมเช็คอินสำหรับคอนเสิร์ตออนไลน์"}
{"word": "check in", "english": "She checks in with her family every weekend.", "thai": "เธอเช็คอินกับครอบครัวทุกสุดสัปดาห์"}
{"word": "check in", "english": "You can check in at the ticket counter.", "thai": "คุณสามารถเช็คอินที่เคาน์เตอร์ตั๋ว"}
{"word": "check in", "english": "They’ll check in at the guest house tonight.", "thai": "พวกเขาจะเช็คอินที่เกสต์เฮาส์คืนนี้"}
{"word": "check in", "english": "I need to check in on the delivery status.", "thai": "ฉันต้องเช็คอินดูสถานะการจัดส่ง"}
{"word": "check in", "english": "The system requires users to check in daily.", "thai": "ระบบกำหนดให้ผู้ใช้เช็คอินทุกวัน"}
{"word": "check in", "english": "She checked in for her flight using her phone.", "thai": "เธอเช็คอินสำหรับเที่ยวบินโดยใช้โทรศัพท์"}
{"word": "check in", "english": "We’ll check in with the guide before the hike.", "thai": "เราจะเช็คอินกับไกด์ก่อนเดินป่า"}
{"word": "check in", "english": "He forgot to check in at the volunteer center.", "thai": "เขาลืมเช็คอินที่ศูนย์อาสาสมัคร"}
{"word": "check in", "english": "You need to check in at the registration desk.", "thai": "คุณต้องเช็คอินที่โต๊ะลงทะเบียน"}
{"word": "check in", "english": "They checked in at the motel last evening.", "thai": "พวกเขาเช็คอินที่โมเทลเมื่อวานเย็น"}
{"word": "check in", "english": "I’ll check in with the technician about the issue.", "thai": "ฉันจะเช็คอินกับช่างเทคนิคเกี่ยวกับปัญหา"}
{"word": "check in", "english": "The app requires you to check in at the location.", "thai": "แอปกำหนดให้คุณเช็คอินที่สถานที่"}
{"word": "check in", "english": "She checks in with her advisor every semester.", "thai": "เธอเช็คอินกับที่ปรึกษาทุกเทอม"}
{"word": "check in", "english": "We need to check in at the festival entrance.", "thai": "เราต้องเช็คอินที่ทางเข้าสู่เทศกาล"}
{"word": "check in", "english": "He checked in on his colleague after the meeting.", "thai": "เขาเช็คอินดูเพื่อนร่วมงานหลังการประชุม"}
{"word": "check in", "english": "You can check in for the workshop online.", "thai": "คุณสามารถเช็คอินสำหรับเวิร์คช็อปออนไลน์ได้"}
{"word": "check in", "english": "They’ll check in at the cabin this weekend.", "thai": "พวกเขาจะเช็คอินที่กระท่อมสุดสัปดาห์นี้"}
{"word": "check in", "english": "I forgot to check in for my doctor’s appointment.", "thai": "ฉันลืมเช็คอินสำหรับการนัดหมายกับหมอ"}
{"word": "check in", "english": "She checks in at the coffee shop every morning.", "thai": "เธอเช็คอินที่ร้านกาแฟทุกเช้า"}
{"word": "check in", "english": "We’ll check in with the vendor about the shipment.", "thai": "เราจะเช็คอินกับผู้ขายเกี่ยวกับการจัดส่ง"}
{"word": "check in", "english": "The hotel requires guests to check in by 6 PM.", "thai": "โรงแรมกำหนดให้แขกเช็คอินภายในหกโมงเย็น"}
{"word": "check in", "english": "He needs to check in with his parole officer.", "thai": "เขาต้องเช็คอินกับเจ้าหน้าที่คุมประพฤติ"}
{"word": "check in", "english": "You can check in at the lounge before the flight.", "thai": "คุณสามารถเช็คอินที่เลานจ์ก่อนเที่ยวบิน"}
{"word": "check in", "english": "They checked in for the seminar this morning.", "thai": "พวกเขาเช็คอินสำหรับสัมมนาเช้านี้"}
{"word": "check in", "english": "I’ll check in on the kids before bedtime.", "thai": "ฉันจะเช็คอินดูเด็กๆ ก่อนนอน"}
{"word": "check in", "english": "The app lets you check in for your gym session.", "thai": "แอปให้คุณเช็คอินสำหรับเซสชันยิม"}
{"word": "check in", "english": "She forgot to check in at the training session.", "thai": "เธอลืมเช็คอินที่เซสชันฝึกอบรม"}
{"word": "check in", "english": "We need to check in with the event planner.", "thai": "เราต้องเช็คอินกับผู้วางแผนงาน"}
{"word": "check in", "english": "He checks in at the community center weekly.", "thai": "เขาเช็คอินที่ศูนย์ชุมชนทุกสัปดาห์"}
{"word": "come over", "english": "Why don’t you come over to my place tonight?", "thai": "ทำไมคุณไม่มาที่บ้านฉันคืนนี้ล่ะ"}
{"word": "come over", "english": "Can you come over and help me with this project?", "thai": "คุณมาช่วยฉันกับโปรเจกต์นี้ได้ไหม"}
{"word": "come over", "english": "She asked her friends to come over for dinner.", "thai": "เธอชวนเพื่อนๆ มาทานข้าวเย็นที่บ้าน"}
{"word": "come over", "english": "I’ll come over to your office this afternoon.", "thai": "ฉันจะมาที่สำนักงานของคุณบ่ายนี้"}
{"word": "come over", "english": "He said he’d come over after work.", "thai": "เขาบอกว่าเขาจะมาหลังเลิกงาน"}
{"word": "come over", "english": "Come over here and check out this view!", "thai": "มาที่นี่แล้วดูวิวนี้สิ!"}
{"word": "come over", "english": "They invited us to come over for a barbecue.", "thai": "พวกเขาชวนเราไปปิ้งย่างที่บ้าน"}
{"word": "come over", "english": "Can you come over to fix my computer?", "thai": "คุณมาซ่อมคอมพิวเตอร์ให้ฉันได้ไหม"}
{"word": "come over", "english": "She’ll come over to babysit the kids tomorrow.", "thai": "เธอจะมาเลี้ยงเด็กๆ พรุ่งนี้"}
{"word": "come over", "english": "I told him to come over when he’s free.", "thai": "ฉันบอกเขาให้มาหาเมื่อเขาว่าง"}
{"word": "come over", "english": "Why don’t we come over to your place for movie night?", "thai": "ทำไมเราไม่ไปดูหนังที่บ้านคุณล่ะ"}
{"word": "come over", "english": "He needs to come over and sign these papers.", "thai": "เขาต้องมาเซ็นเอกสารเหล่านี้"}
{"word": "come over", "english": "Come over to the park with us this weekend!", "thai": "มาที่สวนสาธารณะกับเราสุดสัปดาห์นี้สิ!"}
{"word": "come over", "english": "She comes over every Sunday for brunch.", "thai": "เธอมาทานอาหารเช้าสายทุกวันอาทิตย์"}
{"word": "come over", "english": "Can you come over and water my plants while I’m away?", "thai": "คุณมารดน้ำต้นไม้ให้ฉันตอนที่ฉันไม่อยู่ได้ไหม"}
{"word": "come over", "english": "I’ll come over to your house after the game.", "thai": "ฉันจะไปบ้านคุณหลังจบเกม"}
{"word": "come over", "english": "They asked me to come over for a game night.", "thai": "พวกเขาชวนฉันไปเล่นเกมคืนนี้"}
{"word": "come over", "english": "Come over and try this new recipe I made!", "thai": "มาลองสูตรอาหารใหม่ที่ฉันทำสิ!"}
{"word": "come over", "english": "He’ll come over to discuss the project tomorrow.", "thai": "เขาจะมาคุยเรื่องโปรเจกต์พรุ่งนี้"}
{"word": "come over", "english": "Why don’t you come over and meet my new puppy?", "thai": "ทำไมคุณไม่มาพบลูกสุนัขตัวใหม่ของฉันล่ะ"}
{"word": "come over", "english": "She came over to borrow some tools.", "thai": "เธอมาขอยืมเครื่องมือ"}
{"word": "come over", "english": "Can you come over to help move this furniture?", "thai": "คุณมาช่วยย้ายเฟอร์นิเจอร์นี้ได้ไหม"}
{"word": "come over", "english": "I’ll come over with some snacks for the party.", "thai": "ฉันจะนำของว่างมาให้ปาร์ตี้"}
{"word": "come over", "english": "They come over every weekend to hang out.", "thai": "พวกเขามาเที่ยวที่บ้านทุกสุดสัปดาห์"}
{"word": "come over", "english": "Come over to my place for a coffee.", "thai": "มาดื่มกาแฟที่บ้านฉันสิ"}
{"word": "come over", "english": "He asked if I could come over to study together.", "thai": "เขาถามว่าฉันจะมาเรียนด้วยกันได้ไหม"}
{"word": "come over", "english": "She’ll come over to pick up her package.", "thai": "เธอจะมารับพัสดุของเธอ"}
{"word": "come over", "english": "Can you come over and look at my car?", "thai": "คุณมาดูรถของฉันได้ไหม"}
{"word": "come over", "english": "I told them to come over for a quick chat.", "thai": "ฉันบอกให้พวกเขามาคุยกันสักพัก"}
{"word": "come over", "english": "Come over to the beach with us tomorrow!", "thai": "ไปชายหาดกับเราพรุ่งนี้สิ!"}
{"word": "come over", "english": "He comes over to play video games every Friday.", "thai": "เขาแวะมาเล่นวิดีโอเกมทุกวันศุกร์"}
{"word": "come over", "english": "She asked me to come over and help with her homework.", "thai": "เธอขอให้ฉันมาช่วยทำการบ้าน"}
{"word": "come over", "english": "I’ll come over to your apartment later tonight.", "thai": "ฉันจะไปที่อพาร์ตเมนต์ของคุณคืนนี้"}
{"word": "come over", "english": "They invited us to come over for a potluck.", "thai": "พวกเขาชวนเราไปกินข้าวแบบทุกคนนำอาหารมา"}
{"word": "come over", "english": "Can you come over to watch the kids for an hour?", "thai": "คุณมาดูแลเด็กๆ สักชั่วโมงได้ไหม"}
{"word": "come over", "english": "Come over and join us for the game!", "thai": "มาร่วมดูเกมกับเราสิ!"}
{"word": "come over", "english": "She’ll come over to drop off the documents.", "thai": "เธอจะมาเพื่อส่งเอกสาร"}
{"word": "come over", "english": "I asked him to come over and fix the sink.", "thai": "ฉันขอให้เขามาซ่อมอ่างล้างจาน"}
{"word": "come over", "english": "Why don’t you come over for a board game night?", "thai": "ทำไมไม่มาคืนเล่นบอร์ดเกมล่ะ"}
{"word": "come over", "english": "He’ll come over to check the wiring tomorrow.", "thai": "เขาจะมาดูสายไฟพรุ่งนี้"}
{"word": "come over", "english": "Come over here and see what I found!", "thai": "มาที่นี่แล้วดูว่าฉันเจออะไร!"}
{"word": "come over", "english": "They come over to our house every holiday.", "thai": "พวกเขามาที่บ้านเราทุกวันหยุด"}
{"word": "come over", "english": "Can you come over to help with the decorations?", "thai": "คุณมาช่วยตกแต่งได้ไหม"}
{"word": "come over", "english": "I’ll come over with some pizza tonight.", "thai": "ฉันจะนำพิซซ่ามาคืนนี้"}
{"word": "come over", "english": "She came over to show me her new phone.", "thai": "เธอมาโชว์โทรศัพท์ใหม่ให้ฉัน"}
{"word": "come over", "english": "Come over to the cafe and meet us!", "thai": "มาที่ร้านกาแฟแล้วเจอกันสิ!"}
{"word": "come over", "english": "He asked if I could come over to talk about the plan.", "thai": "เขาถามว่าฉันจะมาคุยเรื่องแผนได้ไหม"}
{"word": "come over", "english": "They’ll come over for a sleepover this weekend.", "thai": "พวกเขาจะมานอนค้างสุดสัปดาห์นี้"}
{"word": "come over", "english": "Can you come over and help me paint the room?", "thai": "คุณมาช่วยฉันทาสีห้องได้ไหม"}
{"word": "come over", "english": "I told her to come over for a quick visit.", "thai": "ฉันบอกให้เธอมาเยี่ยมสักพัก"}
{"word": "come over", "english": "Come over to the gym and work out with us!", "thai": "มาที่ยิมแล้วออกกำลังกายกับเราสิ!"}
{"word": "come over", "english": "She comes over to borrow books every week.", "thai": "เธอมาขอยืมหนังสือทุกสัปดาห์"}
{"word": "come over", "english": "I’ll come over to your place after dinner.", "thai": "ฉันจะไปบ้านคุณหลังอาหารเย็น"}
{"word": "come over", "english": "They invited me to come over for a pool party.", "thai": "พวกเขาชวนฉันไปปาร์ตี้ริมสระ"}
{"word": "come over", "english": "Can you come over to help with the garden?", "thai": "คุณมาช่วยทำสวนได้ไหม"}
{"word": "come over", "english": "Come over and try my new coffee maker!", "thai": "มาลองเครื่องชงกาแฟใหม่ของฉันสิ!"}
{"word": "come over", "english": "He’ll come over to fix the leaky faucet.", "thai": "เขาจะมาซ่อมก๊อกน้ำที่รั่ว"}
{"word": "come over", "english": "She asked us to come over for a study session.", "thai": "เธอชวนเราไปติวหนังสือ"}
{"word": "come over", "english": "I’ll come over to your shop this morning.", "thai": "ฉันจะไปที่ร้านของคุณเช้านี้"}
{"word": "come over", "english": "They come over to watch movies every Friday.", "thai": "พวกเขามาดูหนังทุกวันศุกร์"}
{"word": "come over", "english": "Come over to my place for some dessert!", "thai": "มาที่บ้านฉันกินของหวานกัน!"}
{"word": "come over", "english": "Can you come over and check my homework?", "thai": "_youมาดูการบ้านของฉันได้ไหม"}
{"word": "come over", "english": "She’ll come over to help with the party setup.", "thai": "เธอจะมาช่วยจัดงานปาร์ตี้"}
{"word": "come over", "english": "I told him to come over and see the new TV.", "thai": "ฉันบอกให้เขามาดูทีวีใหม่"}
{"word": "come over", "english": "Come over to the lake for a picnic!", "thai": "มาปิกนิกที่ทะเลสาบสิ!"}
{"word": "come over", "english": "He comes over to play chess every evening.", "thai": "เขามาเล่นหมากรุกทุกเย็น"}
{"word": "come over", "english": "Can you come over to help with my essay?", "thai": "คุณมาช่วยฉันเขียนเรียงความได้ไหม"}
{"word": "come over", "english": "I’ll come over with some drinks for the gathering.", "thai": "ฉันจะนำเครื่องดื่มมาให้งานรวมตัว"}
{"word": "come over", "english": "They asked us to come over for a holiday party.", "thai": "พวกเขาชวนเราไปงานปาร์ตี้วันหยุด"}
{"word": "come over", "english": "Come over and meet my new neighbor!", "thai": "มาพบเพื่อนบ้านใหม่ของฉันสิ!"}
{"word": "come over", "english": "She came over to drop off some cookies.", "thai": "เธอมาเพื่อส่งคุกกี้"}
{"word": "come over", "english": "Can you come over to help with the kids’ homework?", "thai": "คุณมาช่วยการบ้านของเด็กๆ ได้ไหม"}
{"word": "come over", "english": "I’ll come over to your house for the meeting.", "thai": "ฉันจะไปบ้านคุณเพื่อประชุม"}
{"word": "come over", "english": "They come over to our place for game nights.", "thai": "พวกเขามาที่บ้านเราเพื่อคืนเล่นเกม"}
{"word": "come over", "english": "Come over to the rooftop for the party!", "thai": "มาที่ดาดฟ้าเพื่อปาร์ตี้สิ!"}
{"word": "come over", "english": "He asked me to come over and see his new car.", "thai": "เขาขอให้ฉันมาดูรถใหม่ของเขา"}
{"word": "come over", "english": "She’ll come over to help with the cooking.", "thai": "เธอจะมาช่วยทำอาหาร"}
{"word": "come over", "english": "Can you come over to fix the Wi-Fi?", "thai": "คุณมาซ่อมไวไฟได้ไหม"}
{"word": "come over", "english": "I told them to come over for a quick coffee.", "thai": "ฉันบอกให้พวกเขามาดื่มกาแฟสักหน่อย"}
{"word": "come over", "english": "Come over to the mall and shop with us!", "thai": "มาช้อปปิ้งที่ห้างกับเราสิ!"}
{"word": "come over", "english": "He comes over to help with the yard work.", "thai": "เขามาช่วยงานในสวน"}
{"word": "come over", "english": "She asked us to come over for a book club meeting.", "thai": "เธอชวนเราไปประชุมชมรมหนังสือ"}
{"word": "come over", "english": "I’ll come over to your place with the notes.", "thai": "ฉันจะไปบ้านคุณพร้อมกับโน๊ต"}
{"word": "come over", "english": "They invited me to come over for a karaoke night.", "thai": "พวกเขาชวนฉันไปคืนคาราโอเกะ"}
{"word": "come over", "english": "Can you come over and help with the presentation?", "thai": "คุณมาช่วยเรื่องการนำเสนอได้ไหม"}
{"word": "come over", "english": "Come over to my house for the barbecue!", "thai": "มาปิ้งย่างที่บ้านฉันสิ!"}
{"word": "come over", "english": "She comes over to walk the dog every afternoon.", "thai": "เธอมาพาสุนัขไปเดินเล่นทุกบ่าย"}
{"word": "come over", "english": "I’ll come over to your office to discuss the deal.", "thai": "ฉันจะไปที่สำนักงานคุณเพื่อคุยเรื่องข้อตกลง"}
{"word": "come over", "english": "They come over to play cards every Saturday.", "thai": "พวกเขามาเล่นไพ่ทุกวันเสาร์"}
{"word": "come over", "english": "Come over and check out my new guitar!", "thai": "มาดูกีตาร์ใหม่ของฉันสิ!"}
{"word": "come over", "english": "He asked if I could come over to help with taxes.", "thai": "เขาถามว่าฉันจะมาช่วยเรื่องภาษีได้ไหม"}
{"word": "come over", "english": "She’ll come over to pick up her jacket.", "thai": "เธอจะมารับแจ็คเก็ตของเธอ"}
{"word": "come over", "english": "Can you come over to help with the party planning?", "thai": "คุณมาช่วยวางแผนงานปาร์ตี้ได้ไหม"}
{"word": "come over", "english": "I told her to come over for a chat tomorrow.", "thai": "ฉันบอกให้เธอมาคุยกันพรุ่งนี้"}
{"word": "come over", "english": "Come over to the pool and swim with us!", "thai": "มาว่ายน้ำที่สระกับเราสิ!"}
{"word": "come over", "english": "He comes over to fix things around the house.", "thai": "เขามาซ่อมของในบ้าน"}
{"word": "come over", "english": "She asked me to come over for a baking session.", "thai": "เธอชวนฉันไปอบขนมด้วยกัน"}
{"word": "come over", "english": "I’ll come over with some board games tonight.", "thai": "ฉันจะนำบอร์ดเกมมาคืนนี้"}
{"word": "come over", "english": "They invited us to come over for a family dinner.", "thai": "พวกเขาชวนเราไปกินข้าวเย็นกับครอบครัว"}
{"word": "cut off", "english": "The call got cut off in the middle of our conversation.", "thai": "สายโทรศัพท์ถูกตัดขณะที่เรากำลังคุยกัน"}
{"word": "cut off", "english": "They cut off the water supply for repairs.", "thai": "พวกเขาตัดน้ำเพื่อซ่อมแซม"}
{"word": "cut off", "english": "I was cut off by a truck on the highway.", "thai": "ฉันถูกตัดหน้าด้วยรถบรรทุกบนทางหลวง"}
{"word": "cut off", "english": "She cut off her hair for a new look.", "thai": "เธอตัดผมสั้นเพื่อลุคใหม่"}
{"word": "cut off", "english": "The teacher cut off the discussion to start the lesson.", "thai": "ครูตัดบทสนทนาเพื่อเริ่มบทเรียน"}
{"word": "cut off", "english": "He cut off all contact with his old friends.", "thai": "เขาตัดขาดการติดต่อกับเพื่อนเก่าทั้งหมด"}
{"word": "cut off", "english": "The power was cut off during the storm.", "thai": "ไฟถูกตัดขณะเกิดพายุ"}
{"word": "cut off", "english": "I accidentally cut off the tip of my finger.", "thai": "ฉันเผลอตัดปลายนิ้วตัวเอง"}
{"word": "cut off", "english": "They cut off the dead branches from the tree.", "thai": "พวกเขาตัดกิ่งไม้ที่ตายแล้วออกจากต้นไม้"}
{"word": "cut off", "english": "She felt cut off from her family after moving abroad.", "thai": "เธอรู้สึกถูกตัดขาดจากครอบครัวหลังย้ายไปต่างประเทศ"}
{"word": "cut off", "english": "The bartender cut him off after too many drinks.", "thai": "บาร์เทนเดอร์ตัดเขาออกหลังจากดื่มมากเกินไป"}
{"word": "cut off", "english": "The road was cut off due to heavy flooding.", "thai": "ถนนถูกตัดขาดเพราะน้ำท่วมหนัก"}
{"word": "cut off", "english": "I cut off the tags from my new clothes.", "thai": "ฉันตัดป้ายออกจากเสื้อผ้าใหม่"}
{"word": "cut off", "english": "He was cut off mid-sentence by the interruption.", "thai": "เขาถูกตัดบทกลางประโยคโดยการขัดจังหวะ"}
{"word": "cut off", "english": "They cut off funding for the community project.", "thai": "พวกเขาตัดงบประมาณสำหรับโครงการชุมชน"}
{"word": "cut off", "english": "My internet got cut off because I forgot to pay the bill.", "thai": "อินเทอร์เน็ตของฉันถูกตัดเพราะลืมจ่ายบิล"}
{"word": "cut off", "english": "She cut off the crusts from her sandwich.", "thai": "เธอตัดขอบแซนด์วิชออก"}
{"word": "cut off", "english": "The city cut off access to the park for maintenance.", "thai": "เมืองตัดขาดการเข้าถึงสวนสาธารณะเพื่อบำรุงรักษา"}
{"word": "cut off", "english": "He cut off his subscription to the magazine.", "thai": "เขายกเลิกการสมัครนิตยสาร"}
{"word": "cut off", "english": "I was cut off in traffic and nearly crashed.", "thai": "ฉันถูกตัดหน้าในจราจรและเกือบชน"}
{"word": "cut off", "english": "They cut off the old fabric to make a new dress.", "thai": "พวกเขาตัดผ้าเก่าออกเพื่อทำชุดใหม่"}
{"word": "cut off", "english": "The meeting was cut off by a fire alarm.", "thai": "การประชุมถูกตัดขาดโดยสัญญาณเตือนไฟไหม้"}
{"word": "cut off", "english": "She cut off her toxic relationship for good.", "thai": "เธอตัดขาดความสัมพันธ์ที่เป็นพิษอย่างถาวร"}
{"word": "cut off", "english": "The phone line was cut off during the construction.", "thai": "สายโทรศัพท์ถูกตัดขณะก่อสร้าง"}
{"word": "cut off", "english": "He cut off the excess fat from the meat.", "thai": "เขาตัดไขมันส่วนเกินออกจากเนื้อ"}
{"word": "cut off", "english": "The island was cut off from the mainland by the storm.", "thai": "เกาะถูกตัดขาดจากแผ่นดินใหญ่โดยพายุ"}
{"word": "cut off", "english": "I cut off the conversation to answer the door.", "thai": "ฉันตัดบทสนทนาเพื่อไปเปิดประตู"}
{"word": "cut off", "english": "They cut off the damaged part of the rope.", "thai": "พวกเขาตัดส่วนที่เสียหายของเชือกออก"}
{"word": "cut off", "english": "Her speech was cut off by loud applause.", "thai": "คำปราศรัยของเธอถูกตัดโดยเสียงปรบมือดัง"}
{"word": "cut off", "english": "The company cut off bonuses this year.", "thai": "บริษัทตัดโบนัสในปีนี้"}
{"word": "cut off", "english": "I cut off the frayed ends of the shoelaces.", "thai": "ฉันตัดปลายเชือกรองเท้าที่หลุดลุ่ย"}
{"word": "cut off", "english": "He felt cut off from society after losing his job.", "thai": "เขารู้สึกถูกตัดขาดจากสังคมหลังจากตกงาน"}
{"word": "cut off", "english": "The radio signal was cut off by the mountains.", "thai": "สัญญาณวิทยุถูกตัดขาดโดยภูเขา"}
{"word": "cut off", "english": "She cut off the moldy part of the bread.", "thai": "เธอตัดส่วนที่ขึ้นราของขนมปังออก"}
{"word": "cut off", "english": "The debate was cut off by the moderator.", "thai": "การโต้วาทีถูกตัดโดยผู้ดำเนินรายการ"}
{"word": "cut off", "english": "They cut off the old vines to help the plant grow.", "thai": "พวกเขาตัดเถาเก่าออกเพื่อช่วยให้พืชเติบโต"}
{"word": "cut off", "english": "My subscription was cut off due to non-payment.", "thai": "การสมัครของฉันถูกตัดเพราะไม่จ่ายเงิน"}
{"word": "cut off", "english": "He cut off the call to avoid an argument.", "thai": "เขาตัดสายเพื่อหลีกเลี่ยงการโต้เถียง"}
{"word": "cut off", "english": "The town was cut off by the heavy snow.", "thai": "เมืองถูกตัดขาดโดยหิมะหนัก"}
{"word": "cut off", "english": "I cut off the loose threads from my shirt.", "thai": "ฉันตัดด้ายหลุดออกจากเสื้อ"}
{"word": "cut off", "english": "She was cut off by her friend during the story.", "thai": "เธอถูกเพื่อนตัดบทขณะเล่าเรื่อง"}
{"word": "cut off", "english": "They cut off the electricity to fix the lines.", "thai": "พวกเขาตัดไฟเพื่อซ่อมสาย"}
{"word": "cut off", "english": "He cut off his old habits to start fresh.", "thai": "เขาตัดขาดนิสัยเก่าเพื่อเริ่มใหม่"}
{"word": "cut off", "english": "The signal was cut off during the live broadcast.", "thai": "สัญญาณถูกตัดขณะถ่ายทอดสด"}
{"word": "cut off", "english": "I cut off the top of the pineapple before slicing.", "thai": "ฉันตัดส่วนหัวของสับปะรดก่อนหั่น"}
{"word": "cut off", "english": "The village was cut off after the bridge collapsed.", "thai": "หมู่บ้านถูกตัดขาดหลังจากสะพานพัง"}
{"word": "cut off", "english": "She cut off her ex from all social media.", "thai": "เธอตัดขาดแฟนเก่าจากโซเชียลมีเดียทั้งหมด"}
{"word": "cut off", "english": "The presentation was cut off by a technical issue.", "thai": "การนำเสนอถูกตัดโดยปัญหาทางเทคนิค"}
{"word": "cut off", "english": "He cut off the extra fabric from the curtains.", "thai": "เขาตัดผ้าส่วนเกินจากผ้าม่าน"}
{"word": "cut off", "english": "They cut off the music when the event ended.", "thai": "พวกเขาตัดเพลงเมื่องานจบ"}
{"word": "cut off", "english": "I was cut off by a cyclist while driving.", "thai": "ฉันถูกตัดหน้าโดยนักปั่นจักรยานขณะขับรถ"}
{"word": "cut off", "english": "She cut off her subscription to the streaming service.", "thai": "เธอยกเลิกการสมัครบริการสตรีมมิ่ง"}
{"word": "cut off", "english": "The interview was cut off due to time constraints.", "thai": "การสัมภาษณ์ถูกตัดเพราะข้อจำกัดด้านเวลา"}
{"word": "cut off", "english": "He cut off the damaged part of the cable.", "thai": "เขาตัดส่วนที่เสียหายของสายเคเบิล"}
{"word": "cut off", "english": "The area was cut off by the landslide.", "thai": "พื้นที่ถูกตัดขาดโดยดินถล่ม"}
{"word": "cut off", "english": "I cut off the burned edges of the toast.", "thai": "ฉันตัดขอบที่ไหม้ของขนมปังออก"}
{"word": "cut off", "english": "She felt cut off from her team while working remotely.", "thai": "เธอรู้สึกถูกตัดขาดจากทีมขณะทำงานจากระยะไกล"}
{"word": "cut off", "english": "They cut off the old carpet to install new flooring.", "thai": "พวกเขาตัดพรมเก่าออกเพื่อติดตั้งพื้นใหม่"}
{"word": "cut off", "english": "The call was cut off due to a weak signal.", "thai": "สายถูกตัดเพราะสัญญาณอ่อน"}
{"word": "cut off", "english": "He cut off his ties with the organization.", "thai": "เขาตัดขาดความสัมพันธ์กับองค์กร"}
{"word": "cut off", "english": "The chef cut off the stems of the mushrooms.", "thai": "พ่อครัวตัดก้านเห็ดออก"}
{"word": "cut off", "english": "The game was cut off by a sudden rainstorm.", "thai": "เกมถูกตัดขาดโดยพายุฝนกะทันหัน"}
{"word": "cut off", "english": "She cut off the conversation to catch her flight.", "thai": "เธอตัดบทสนทนาเพื่อไปขึ้นเครื่องบิน"}
{"word": "cut off", "english": "They cut off the rusted part of the pipe.", "thai": "พวกเขาตัดส่วนที่เป็นสนิมของท่อออก"}
{"word": "cut off", "english": "He was cut off by the host during the debate.", "thai": "เขาถูกตัดบทโดยพิธีกรขณะโต้วาที"}
{"word": "cut off", "english": "The company cut off support for the old software.", "thai": "บริษัทตัดการสนับสนุนซอฟต์แวร์เก่า"}
{"word": "cut off", "english": "I cut off the excess dough from the pie crust.", "thai": "ฉันตัดแป้งส่วนเกินจากขอบพาย"}
{"word": "cut off", "english": "The village was cut off by the fallen trees.", "thai": "หมู่บ้านถูกตัดขาดโดยต้นไม้ที่ล้ม"}
{"word": "cut off", "english": "She cut off her old phone number after moving.", "thai": "เธอตัดเลขโทรศัพท์เก่าหลังย้าย"}
{"word": "cut off", "english": "The broadcast was cut off by technical difficulties.", "thai": "การออกอากาศถูกตัดโดยปัญหาทางเทคนิค"}
{"word": "cut off", "english": "He cut off the torn part of the paper.", "thai": "เขาตัดส่วนที่ขาดของกระดาษออก"}
{"word": "cut off", "english": "They cut off the gas supply for safety reasons.", "thai": "พวกเขาตัดก๊าซเพื่อความปลอดภัย"}
{"word": "cut off", "english": "I was cut off by a pedestrian while biking.", "thai": "ฉันถูกตัดหน้าโดยคนเดินเท้าขณะปั่นจักรยาน"}
{"word": "cut off", "english": "She cut off her membership at the gym.", "thai": "เธอยกเลิกสมาชิกยิม"}
{"word": "cut off", "english": "The speech was cut off by a power outage.", "thai": "คำปราศรัยถูกตัดโดยไฟดับ"}
{"word": "cut off", "english": "He cut off the wilted leaves from the plant.", "thai": "เขาตัดใบที่เหี่ยวออกจากต้นไม้"}
{"word": "cut off", "english": "The town was cut off by the broken bridge.", "thai": "เมืองถูกตัดขาดโดยสะพานที่พัง"}
{"word": "cut off", "english": "I cut off the extra string from the guitar.", "thai": "ฉันตัดสายส่วนเกินจากกีตาร์"}
{"word": "cut off", "english": "She was cut off by her boss during the meeting.", "thai": "เธอถูกเจ้านายตัดบทในที่ประชุม"}
{"word": "cut off", "english": "They cut off the old siding from the house.", "thai": "พวกเขาตัดผนังเก่าออกจากบ้าน"}
{"word": "cut off", "english": "The Wi-Fi was cut off during the maintenance.", "thai": "ไวไฟถูกตัดขณะบำรุงรักษา"}
{"word": "cut off", "english": "He cut off his involvement in the project.", "thai": "เขาตัดขาดการมีส่วนร่วมในโปรเจกต์"}
{"word": "cut off", "english": "I cut off the spoiled part of the fruit.", "thai": "ฉันตัดส่วนที่เสียของผลไม้ออก"}
{"word": "cut off", "english": "The event was cut off by an emergency alert.", "thai": "งานถูกตัดโดยการแจ้งเตือนฉุกเฉิน"}
{"word": "cut off", "english": "She cut off her old email account.", "thai": "เธอตัดบัญชีอีเมลเก่าทิ้ง"}
{"word": "cut off", "english": "The road was cut off by construction barriers.", "thai": "ถนนถูกตัดขาดโดยสิ่งกีดขวางการก่อสร้าง"}
{"word": "cut off", "english": "He cut off the conversation to take a call.", "thai": "เขาตัดบทสนทนาเพื่อรับโทรศัพท์"}
{"word": "cut off", "english": "They cut off the dried paint from the brush.", "thai": "พวกเขาตัดสีแห้งออกจากแปรง"}
{"word": "cut off", "english": "I was cut off by a loud noise during my speech.", "thai": "ฉันถูกตัดบทโดยเสียงดังขณะพูด"}
{"word": "cut off", "english": "She cut off her cable TV subscription.", "thai": "เธอยกเลิกการสมัครเคเบิลทีวี"}
{"word": "cut off", "english": "The village was cut off by the river overflow.", "thai": "หมู่บ้านถูกตัดขาดโดยน้ำล้นแม่น้ำ"}
{"word": "cut off", "english": "He cut off the rough edges of the wood.", "thai": "เขาตัดขอบหยาบของไม้"}
{"word": "cut off", "english": "The call was cut off by a dropped signal.", "thai": "สายถูกตัดโดยสัญญาณหลุด"}
{"word": "cut off", "english": "They cut off the old tiles from the floor.", "thai": "พวกเขาตัดกระเบื้องเก่าออกจากพื้น"}
{"word": "cut off", "english": "She felt cut off from her friends after the move.", "thai": "เธอรู้สึกถูกตัดขาดจากเพื่อนหลังย้าย"}
{"word": "cut off", "english": "The lecture was cut off by a fire drill.", "thai": "การบรรยายถูกตัดโดยการฝึกซ้อมดับเพลิง"}
{"word": "cut off", "english": "I cut off the extra ribbon from the gift.", "thai": "ฉันตัดริบบิ้นส่วนเกินจากของขวัญ"}
{"word": "cut off", "english": "He cut off his ties with the old company.", "thai": "เขาตัดขาดความสัมพันธ์กับบริษัทเก่า"}
{"word": "cut off", "english": "The internet was cut off during the outage.", "thai": "อินเทอร์เน็ตถูกตัดขณะไฟดับ"}
{"word": "cut off", "english": "She cut off the damaged part of the fabric.", "thai": "เธอตัดส่วนที่เสียหายของผ้าออก"}
{"word": "cut off", "english": "The discussion was cut off by the bell.", "thai": "การสนทนาถูกตัดโดยเสียงระฆัง"}
{"word": "cut off", "english": "They cut off the old paint from the walls.", "thai": "พวกเขาตัดสีเก่าออกจากผนัง"}
{"word": "fill in", "english": "Can you fill in the form with your details?", "thai": "คุณกรอกแบบฟอร์มด้วยข้อมูลของคุณได้ไหม"}
{"word": "fill in", "english": "I need someone to fill in for me at work tomorrow.", "thai": "ฉันต้องการคนมาแทนฉันที่ทำงานพรุ่งนี้"}
{"word": "fill in", "english": "She forgot to fill in the blanks on the test.", "thai": "เธอลืมกรอกช่องว่างในข้อสอบ"}
{"word": "fill in", "english": "He asked me to fill in the details of the meeting.", "thai": "เขาขอให้ฉันเติมรายละเอียดของการประชุม"}
{"word": "fill in", "english": "I’ll fill in the gaps in your schedule.", "thai": "ฉันจะเติมช่องว่างในตารางเวลาของคุณ"}
{"word": "fill in", "english": "Can you fill in for the coach during practice?", "thai": "คุณมาแทนโค้ชตอนซ้อมได้ไหม"}
{"word": "fill in", "english": "She needs to fill in her application by tonight.", "thai": "เธอต้องกรอกใบสมัครภายในคืนนี้"}
{"word": "fill in", "english": "He filled in the crossword puzzle quickly.", "thai": "เขาเติมปริศนาอักษรไขว้ได้เร็วมาก"}
{"word": "fill in", "english": "I’ll fill you in on what happened at the party.", "thai": "ฉันจะเล่าให้ฟังว่าเกิดอะไรขึ้นที่งานปาร์ตี้"}
{"word": "fill in", "english": "They asked her to fill in for the receptionist.", "thai": "พวกเขาขอให้เธอมาแทนพนักงานต้อนรับ"}
{"word": "fill in", "english": "Please fill in your name and address here.", "thai": "กรุณากรอกชื่อและที่อยู่ของคุณที่นี่"}
{"word": "fill in", "english": "He was asked to fill in the survey after the event.", "thai": "เขาถูกขอให้กรอกแบบสำรวจหลังงาน"}
{"word": "fill in", "english": "Can you fill in the missing parts of the story?", "thai": "คุณเติมส่วนที่ขาดหายของเรื่องราวได้ไหม"}
{"word": "fill in", "english": "She filled in for her colleague during the presentation.", "thai": "เธอมาแทนเพื่อนร่วมงานตอนนำเสนอ"}
{"word": "fill in", "english": "I need to fill in the calendar with my appointments.", "thai": "ฉันต้องกรอกปฏิทินด้วยนัดหมายของฉัน"}
{"word": "fill in", "english": "He filled in the application form incorrectly.", "thai": "เขากรอกแบบฟอร์มใบสมัครผิด"}
{"word": "fill in", "english": "Can you fill me in on the project updates?", "thai": "คุณอัปเดตฉันเกี่ยวกับโปรเจกต์ได้ไหม"}
{"word": "fill in", "english": "She filled in the chart with the latest data.", "thai": "เธอกรอกข้อมูลล่าสุดลงในแผนภูมิ"}
{"word": "fill in", "english": "They need someone to fill in for the drummer tonight.", "thai": "พวกเขาต้องการคนมาแทนมือกลองคืนนี้"}
{"word": "fill in", "english": "I forgot to fill in the date on the document.", "thai": "ฉันลืมกรอกวันที่ในเอกสาร"}
{"word": "fill in", "english": "He’ll fill in the team on the new strategy.", "thai": "เขาจะอัปเดตทีมเกี่ยวกับกลยุทธ์ใหม่"}
{"word": "fill in", "english": "Can you fill in the blanks in this worksheet?", "thai": "คุณกรอกช่องว่างในใบงานนี้ได้ไหม"}
{"word": "fill in", "english": "She filled in for the teacher during the class.", "thai": "เธอมาแทนครูในชั้นเรียน"}
{"word": "fill in", "english": "I need to fill in my tax return by next week.", "thai": "ฉันต้องกรอกแบบแสดงรายการภาษีภายในสัปดาห์หน้า"}
{"word": "fill in", "english": "He filled in the hole in the wall with plaster.", "thai": "เขาอุดรูในผนังด้วยปูน"}
{"word": "fill in", "english": "Can you fill me in on what I missed at the meeting?", "thai": "คุณเล่าให้ฉันฟังว่าฉันพลาดอะไรในที่ประชุมได้ไหม"}
{"word": "fill in", "english": "She filled in the questionnaire before the interview.", "thai": "เธอกรอกแบบสอบถามก่อนสัมภาษณ์"}
{"word": "fill in", "english": "They asked him to fill in for the manager today.", "thai": "พวกเขาขอให้เขาแทนผู้จัดการวันนี้"}
{"word": "fill in", "english": "I’ll fill in the registration form online.", "thai": "ฉันจะกรอกแบบฟอร์มลงทะเบียนออนไลน์"}
{"word": "fill in", "english": "He filled in the outline with more details.", "thai": "เขาเติมรายละเอียดเพิ่มในโครงร่าง"}
{"word": "fill in", "english": "Can you fill in for me at the event tonight?", "thai": "คุณมาแทนฉันในงานคืนนี้ได้ไหม"}
{"word": "fill in", "english": "She needs to fill in her contact information.", "thai": "เธอต้องกรอกข้อมูลการติดต่อของเธอ"}
{"word": "fill in", "english": "I filled in the gaps in the report yesterday.", "thai": "ฉันเติมช่องว่างในรายงานเมื่อวาน"}
{"word": "fill in", "english": "He’s going to fill in for the host on the show.", "thai": "เขาจะมาแทนพิธีกรในรายการ"}
{"word": "fill in", "english": "Can you fill in the schedule with the new dates?", "thai": "คุณกรอกตารางด้วยวันที่ใหม่ได้ไหม"}
{"word": "fill in", "english": "She filled in the answers on the quiz sheet.", "thai": "เธอกรอกคำตอบในใบควิซ"}
{"word": "fill in", "english": "I’ll fill you in on the gossip later.", "thai": "ฉันจะเล่าข่าวซุบซิบให้ฟังทีหลัง"}
{"word": "fill in", "english": "They need someone to fill in for the cashier.", "thai": "พวกเขาต้องการคนมาแทนแคชเชียร์"}
{"word": "fill in", "english": "He forgot to fill in the emergency contact section.", "thai": "เขาลืมกรอกส่วนข้อมูลติดต่อฉุกเฉิน"}
{"word": "fill in", "english": "Can you fill in the details of the contract?", "thai": "คุณเติมรายละเอียดของสัญญาได้ไหม"}
{"word": "fill in", "english": "She filled in for her boss at the conference.", "thai": "เธอมาแทนเจ้านายในงานประชุม"}
{"word": "fill in", "english": "I need to fill in the order form for the supplies.", "thai": "ฉันต้องกรอกแบบฟอร์มสั่งซื้ออุปกรณ์"}
{"word": "fill in", "english": "He filled in the map with the new routes.", "thai": "เขาเติมเส้นทางใหม่ลงในแผนที่"}
{"word": "fill in", "english": "Can you fill me in on the team’s progress?", "thai": "คุณอัปเดตฉันเกี่ยวกับความคืบหน้าของทีมได้ไหม"}
{"word": "fill in", "english": "She filled in the journal with her daily thoughts.", "thai": "เธอกรอกสมุดบันทึกด้วยความคิดประจำวัน"}
{"word": "fill in", "english": "They asked him to fill in for the lead actor.", "thai": "พวกเขาขอให้เขาแทนนักแสดงนำ"}
{"word": "fill in", "english": "I’ll fill in the missing information tomorrow.", "thai": "ฉันจะเติมข้อมูลที่ขาดหายพรุ่งนี้"}
{"word": "fill in", "english": "She needs to fill in the feedback form after the session.", "thai": "เธอต้องกรอกแบบฟอร์มความคิดเห็นหลังเซสชัน"}
{"word": "fill in", "english": "He filled in for the bartender during the rush.", "thai": "เขามาแทนบาร์เทนเดอร์ตอนคนเยอะ"}
{"word": "fill in", "english": "Can you fill in the blanks in this document?", "thai": "คุณกรอกช่องว่างในเอกสารนี้ได้ไหม"}
{"word": "fill in", "english": "I filled in the survey about customer service.", "thai": "ฉันกรอกแบบสำรวจเกี่ยวกับการบริการลูกค้า"}
{"word": "fill in", "english": "She’ll fill in for the secretary this week.", "thai": "เธอจะมาแทนเลขานุการสัปดาห์นี้"}
{"word": "fill in", "english": "He needs to fill in his profile on the website.", "thai": "เขาต้องกรอกโปรไฟล์บนเว็บไซต์"}
{"word": "fill in", "english": "I’ll fill you in on the plan before we start.", "thai": "ฉันจะเล่าแผนให้ฟังก่อนเริ่ม"}
{"word": "fill in", "english": "They filled in the potholes on the road.", "thai": "พวกเขาอุดหลุมบนถนน"}
{"word": "fill in", "english": "Can you fill in for the speaker at the event?", "thai": "คุณมาแทนวิทยากรในงานได้ไหม"}
{"word": "fill in", "english": "She filled in the logbook with the day’s activities.", "thai": "เธอกรอกสมุดบันทึกด้วยกิจกรรมประจำวัน"}
{"word": "fill in", "english": "I forgot to fill in the time on the timesheet.", "thai": "ฉันลืมกรอกเวลาในใบลงเวล"}
{"word": "fill in", "english": "He’ll fill in the team on the new guidelines.", "thai": "เขาจะอัปเดตทีมเกี่ยวกับแนวทางใหม่"}
{"word": "fill in", "english": "Can you fill in the missing numbers in this table?", "thai": "คุณเติมตัวเลขที่ขาดในตารางนี้ได้ไหม"}
{"word": "fill in", "english": "She filled in for her friend at the volunteer event.", "thai": "เธอมาแทนเพื่อนในงานอาสาสมัคร"}
{"word": "fill in", "english": "I need to fill in the expense report by Friday.", "thai": "ฉันต้องกรอกรายงานค่าใช้จ่ายภายในวันศุกร์"}
{"word": "fill in", "english": "He filled in the diagram with the correct labels.", "thai": "เขาเติมป้ายกำกับที่ถูกต้องในแผนภาพ"}
{"word": "fill in", "english": "Can you fill me in on the client’s feedback?", "thai": "คุณเล่าความคิดเห็นของลูกค้าให้ฉันฟังได้ไหม"}
{"word": "fill in", "english": "She filled in the registration card at the hotel.", "thai": "เธอกรอกบัตรลงทะเบียนที่โรงแรม"}
{"word": "fill in", "english": "They need someone to fill in for the chef tonight.", "thai": "พวกเขาต้องการคนมาแทนเชฟคืนนี้"}
{"word": "fill in", "english": "I’ll fill in the blanks on this contract.", "thai": "ฉันจะกรอกช่องว่างในสัญญานี้"}
{"word": "fill in", "english": "He filled in for the DJ at the party.", "thai": "เขามาแทนดีเจในงานปาร์ตี้"}
{"word": "fill in", "english": "Can you fill in the order details for me?", "thai": "คุณกรอกรายละเอียดคำสั่งซื้อให้ฉันได้ไหม"}
{"word": "fill in", "english": "She filled in the notebook with her sketches.", "thai": "เธอกรอกสมุดด้วยภาพร่างของเธอ"}
{"word": "fill in", "english": "I need to fill in the application for the scholarship.", "thai": "ฉันต้องกรอกใบสมัครทุนการศึกษา"}
{"word": "fill in", "english": "He’ll fill in for the supervisor during the shift.", "thai": "เขาจะมาแทนหัวหน้างานในกะนี้"}
{"word": "fill in", "english": "Can you fill in the timeline with the events?", "thai": "คุณเติมเหตุการณ์ลงในไทม์ไลน์ได้ไหม"}
{"word": "fill in", "english": "She filled in the form with her preferences.", "thai": "เธอกรอกแบบฟอร์มด้วยความชอบของเธอ"}
{"word": "fill in", "english": "I’ll fill you in on the changes to the plan.", "thai": "ฉันจะเล่าการเปลี่ยนแปลงของแผนให้ฟัง"}
{"word": "fill in", "english": "They filled in the cracks in the sidewalk.", "thai": "พวกเขาอุดรอยแตกในทางเท้า"}
{"word": "fill in", "english": "Can you fill in for the organizer at the workshop?", "thai": "คุณมาแทนผู้จัดงานในเวิร์คช็อปได้ไหม"}
{"word": "fill in", "english": "She filled in the spreadsheet with sales data.", "thai": "เธอกรอกข้อมูลการขายลงในสเปรดชีต"}
{"word": "fill in", "english": "I forgot to fill in the signature line.", "thai": "ฉันลืมกรอกช่องลายเซ็น"}
{"word": "fill in", "english": "He’ll fill in the team on the budget cuts.", "thai": "เขาจะอัปเดตทีมเกี่ยวกับการตัดงบประมาณ"}
{"word": "fill in", "english": "Can you fill in the blanks in this quiz?", "thai": "คุณกรอกช่องว่างในควิซนี้ได้ไหม"}
{"word": "fill in", "english": "She filled in for her neighbor at the book club.", "thai": "เธอมาแทนเพื่อนบ้านในชมรมหนังสือ"}
{"word": "fill in", "english": "I need to fill in the guest list for the party.", "thai": "ฉันต้องกรอกรายชื่อแขกสำหรับงานปาร์ตี้"}
{"word": "fill in", "english": "He filled in the outline for the presentation.", "thai": "เขาเติมโครงร่างสำหรับการนำเสนอ"}
{"word": "fill in", "english": "Can you fill me in on the new policies?", "thai": "คุณอัปเดตฉันเกี่ยวกับนโยบายใหม่ได้ไหม"}
{"word": "fill in", "english": "She filled in the evaluation form after the course.", "thai": "เธอกรอกแบบฟอร์มประเมินหลังคอร์ส"}
{"word": "fill in", "english": "They need someone to fill in for the guide tomorrow.", "thai": "พวกเขาต้องการคนมาแทนไกด์พรุ่งนี้"}
{"word": "fill in", "english": "I’ll fill in the missing sections of the report.", "thai": "ฉันจะเติมส่วนที่ขาดหายในรายงาน"}
{"word": "fill in", "english": "He filled in for the announcer at the game.", "thai": "เขามาแทนผู้ประกาศในเกม"}
{"word": "fill in", "english": "Can you fill in the details of the itinerary?", "thai": "คุณเติมรายละเอียดของกำหนดการเดินทางได้ไหม"}
{"word": "fill in", "english": "She filled in the diary with her travel experiences.", "thai": "เธอกรอกสมุดบันทึกด้วยประสบการณ์การเดินทาง"}
{"word": "fill in", "english": "I need to fill in the online registration form.", "thai": "ฉันต้องกรอกแบบฟอร์มลงทะเบียนออนไลน์"}
{"word": "fill in", "english": "He’ll fill in for the instructor during the class.", "thai": "เขาจะมาแทนผู้สอนในชั้นเรียน"}
{"word": "fill in", "english": "Can you fill in the blanks in this puzzle?", "thai": "คุณกรอกช่องว่างในปริศนานี้ได้ไหม"}
{"word": "fill in", "english": "She filled in the gaps in the conversation.", "thai": "เธอเติมช่องว่างในการสนทนา"}
{"word": "fill in", "english": "I’ll fill you in on the event details later.", "thai": "ฉันจะเล่ารายละเอียดงานให้ฟังทีหลัง"}
{"word": "fill in", "english": "They filled in the trench after the repairs.", "thai": "พวกเขาอุดคูน้ำหลังการซ่อมแซม"}
{"word": "fill in", "english": "Can you fill in for the volunteer coordinator?", "thai": "คุณมาแทนผู้ประสานงานอาสาสมัครได้ไหม"}
{"word": "fill in", "english": "She filled in the application with her qualifications.", "thai": "เธอกรอกใบสมัครด้วยคุณสมบัติของเธอ"}
{"word": "fill in", "english": "I forgot to fill in the payment section.", "thai": "ฉันลืมกรอกส่วนการชำระเงิน"}
{"word": "fill in", "english": "He’ll fill in the team on the schedule changes.", "thai": "เขาจะอัปเดตทีมเกี่ยวกับการเปลี่ยนแปลงตาราง"}
{"word": "check out", "english": "Hey, check out this new app I found!", "thai": "เฮ้ ลองดูแอปใหม่ที่ฉันเจอนี่สิ!"}
{"word": "check out", "english": "You should check out that new coffee shop downtown.", "thai": "คุณควรไปดูร้านกาแฟใหม่ในตัวเมืองนะ"}
{"word": "check out", "english": "Can you check out my essay before I submit it?", "thai": "ช่วยดูเรียงความของฉันก่อนส่งหน่อยได้ไหม?"}
{"word": "check out", "english": "Let's check out the new movie this weekend.", "thai": "ไปดูหนังใหม่กันสุดสัปดาห์นี้ดีกว่า"}
{"word": "check out", "english": "I need to check out of the hotel by noon.", "thai": "ฉันต้องเช็คเอาท์จากโรงแรมก่อนเที่ยง"}
{"word": "check out", "english": "Check out how fast this car can go!", "thai": "ดูสิว่ารถคันนี้วิ่งเร็วแค่ไหน!"}
{"word": "check out", "english": "Did you check out the score from last night's game?", "thai": "คุณดูผลคะแนนจากเกมเมื่อคืนหรือยัง?"}
{"word": "check out", "english": "Come on, check out this cool gadget!", "thai": "มาเร็ว ดูอุปกรณ์เจ๋งๆ นี่สิ!"}
{"word": "check out", "english": "I want to check out that new restaurant tonight.", "thai": "ฉันอยากไปดูร้านอาหารใหม่คืนนี้"}
{"word": "check out", "english": "Check out the view from this rooftop!", "thai": "ดูวิวจากบนดาดฟ้านี่สิ!"}
{"word": "check out", "english": "Can you check out what's making that noise?", "thai": "ช่วยดูหน่อยว่าเสียงนั้นมาจากอะไร?"}
{"word": "check out", "english": "We should check out the museum's new exhibit.", "thai": "เราควรไปดูนิทรรศการใหม่ของพิพิธภัณฑ์"}
{"word": "check out", "english": "Hey, check out my new haircut!", "thai": "เฮ้ ดูทรงผมใหม่ของฉันสิ!"}
{"word": "check out", "english": "I'll check out the prices online before we buy.", "thai": "ฉันจะดูราคาออนไลน์ก่อนที่เราจะซื้อ"}
{"word": "check out", "english": "Check out this amazing sunset!", "thai": "ดูพระอาทิตย์ตกดินสุดยอดนี่สิ!"}
{"word": "check out", "english": "You need to check out this hilarious video.", "thai": "คุณต้องดูวิดีโอตลกๆ นี่"}
{"word": "check out", "english": "Let's check out what's on TV tonight.", "thai": "มาดูกันว่าคืนนี้มีอะไรในทีวีบ้าง"}
{"word": "check out", "english": "I heard you can check out books online now.", "thai": "ฉันได้ยินว่าตอนนี้สามารถยืมหนังสือออนไลน์ได้"}
{"word": "check out", "english": "Check out how crowded the mall is today!", "thai": "ดูสิว่าห้างแออัดแค่ไหนวันนี้!"}
{"word": "check out", "english": "We need to check out before 11 AM.", "thai": "เราต้องเช็คเอาท์ก่อน 11 โมงเช้า"}
{"word": "check out", "english": "Check out this new song I found on Spotify!", "thai": "ลองฟังเพลงใหม่ที่ฉันเจอบน Spotify สิ!"}
{"word": "check out", "english": "You should check out her Instagram page.", "thai": "คุณควรไปดูหน้า Instagram ของเธอ"}
{"word": "check out", "english": "Can you check out my code for errors?", "thai": "ช่วยดูโค้ดของฉันว่ามีข้อผิดพลาดไหม?"}
{"word": "check out", "english": "Let's check out the farmers' market this Saturday.", "thai": "ไปดูตลาดนัดเกษตรกรวันเสาร์นี้กันเถอะ"}
{"word": "check out", "english": "Check out how clear the water is here!", "thai": "ดูสิว่าน้ำที่นี่ใสแค่ไหน!"}
{"word": "check out", "english": "I need to check out some books from the library.", "thai": "ฉันต้องยืมหนังสือจากห้องสมุด"}
{"word": "check out", "english": "Hey, check out this funny meme!", "thai": "เฮ้ ดูมีมตลกนี่สิ!"}
{"word": "check out", "english": "We should check out that hiking trail soon.", "thai": "เราควรไปดูเส้นทางเดินป่านั้นเร็วๆ นี้"}
{"word": "check out", "english": "Check out the deals at the store today!", "thai": "ดูโปรโมชั่นที่ร้านวันนี้สิ!"}
{"word": "check out", "english": "Can you check out my math homework?", "thai": "ช่วยดูการบ้านคณิตของฉันหน่อยได้ไหม?"}
{"word": "check out", "english": "Let's check out the new arcade in town.", "thai": "ไปดูตู้เกมใหม่ในเมืองกันเถอะ"}
{"word": "check out", "english": "Check out how big this dog is!", "thai": "ดูสิว่าหมาดตัวนี้ใหญ่แค่ไหน!"}
{"word": "check out", "english": "I want to check out that new clothing store.", "thai": "ฉันอยากไปดูร้านเสื้อผ้าใหม่นั้น"}
{"word": "check out", "english": "You should check out this podcast I love.", "thai": "คุณควรฟังพอดแคสต์ที่ฉันชอบนี่"}
{"word": "check out", "english": "Check out the stars tonight, they're amazing!", "thai": "ดูดาวคืนนี้สิ มันสุดยอดมาก!"}
{"word": "check out", "english": "We need to check out of this Airbnb by 10.", "thai": "เราต้องเช็คเอาท์จาก Airbnb นี้ก่อน 10 โมง"}
{"word": "check out", "english": "Hey, check out my new skateboard!", "thai": "เฮ้ ดูสเก็ตบอร์ดใหม่ของฉันสิ!"}
{"word": "check out", "english": "Can you check out the menu before we order?", "thai": "ช่วยดูเมนูก่อนที่เราจะสั่งได้ไหม?"}
{"word": "check out", "english": "Let's check out the festival this weekend.", "thai": "ไปดูงานเทศกาลสุดสัปดาห์นี้กันเถอะ"}
{"word": "check out", "english": "Check out this crazy dance move!", "thai": "ดูท่าเต้นสุดเจ๋งนี่สิ!"}
{"word": "check out", "english": "I need to check out the details of the plan.", "thai": "ฉันต้องดูรายละเอียดของแผน"}
{"word": "check out", "english": "You should check out that new gym nearby.", "thai": "คุณควรไปดูยิมใหม่แถวนี้"}
{"word": "check out", "english": "Check out how cool this jacket looks!", "thai": "ดูสิว่าแจ็คเก็ตนี้เท่แค่ไหน!"}
{"word": "check out", "english": "Let's check out what's playing at the theater.", "thai": "ไปดูกันว่ามีอะไรฉายที่โรงหนังบ้าง"}
{"word": "check out", "english": "Can you check out my application for typos?", "thai": "ช่วยดูใบสมัครของฉันว่ามีข้อผิดพลาดไหม?"}
{"word": "check out", "english": "Check out the new paint job on my car!", "thai": "ดูสีใหม่ของรถฉันสิ!"}
{"word": "check out", "english": "We should check out that art gallery soon.", "thai": "เราควรไปดูแกลเลอรีศิลปะนั้นเร็วๆ นี้"}
{"word": "check out", "english": "Hey, check out this awesome recipe!", "thai": "เฮ้ ดูสูตรอาหารเจ๋งๆ นี่สิ!"}
{"word": "check out", "english": "I need to check out before the store closes.", "thai": "ฉันต้องเช็คเอาท์ก่อนร้านปิด"}
{"word": "check out", "english": "Check out how fast I finished the puzzle!", "thai": "ดูสิว่าฉันทำปริศนาเสร็จเร็วแค่ไหน!"}
{"word": "check out", "english": "You should check out this hiking app.", "thai": "คุณควรดูแอปเดินป่านี้"}
{"word": "check out", "english": "Let's check out the beach this afternoon.", "thai": "ไปดูชายหาดบ่ายนี้กันเถอะ"}
{"word": "check out", "english": "Check out this weird bug I found!", "thai": "ดูแมลงแปลกๆ ที่ฉันเจอนี่สิ!"}
{"word": "check out", "english": "Can you check out my presentation slides?", "thai": "ช่วยดูสไลด์นำเสนอของฉันหน่อยได้ไหม?"}
{"word": "check out", "english": "We need to check out the concert schedule.", "thai": "เราต้องดูตารางคอนเสิร์ต"}
{"word": "check out", "english": "Hey, check out my new phone case!", "thai": "เฮ้ ดูเคสโทรศัพท์ใหม่ของฉันสิ!"}
{"word": "check out", "english": "Let's check out that new bar tonight.", "thai": "ไปดูบาร์ใหม่คืนนี้กันเถอะ"}
{"word": "check out", "english": "Check out how blue the sky is today!", "thai": "ดูสิว่าท้องฟ้าสีฟ้าแค่ไหนวันนี้!"}
{"word": "check out", "english": "I want to check out the new bookstore.", "thai": "ฉันอยากไปดูร้านหนังสือใหม่"}
{"word": "check out", "english": "You should check out this comedy show.", "thai": "คุณควรดูรายการตลกนี่"}
{"word": "check out", "english": "Can you check out the car for any issues?", "thai": "ช่วยดูรถว่ามีปัญหาอะไรไหม?"}
{"word": "check out", "english": "Check out this awesome skateboard trick!", "thai": "ดูท่าสเก็ตบอร์ดเจ๋งๆ นี่สิ!"}
{"word": "check out", "english": "Let's check out the zoo this weekend.", "thai": "ไปดูสวนสัตว์สุดสัปดาห์นี้กันเถอะ"}
{"word": "check out", "english": "I need to check out some new headphones.", "thai": "ฉันต้องดูหูฟังใหม่"}
{"word": "check out", "english": "Check out how tall this building is!", "thai": "ดูสิว่าตึกนี้สูงแค่ไหน!"}
{"word": "check out", "english": "You should check out that new TV series.", "thai": "คุณควรดูซีรีส์ทีวีใหม่นั้น"}
{"word": "check out", "english": "Let's check out the park this evening.", "thai": "ไปดูสวนสาธารณะเย็นนี้กันเถอะ"}
{"word": "check out", "english": "Can you check out my resume for me?", "thai": "ช่วยดูเรซูเม่ของฉันหน่อยได้ไหม?"}
{"word": "check out", "english": "Check out this crazy storm coming in!", "thai": "ดูพายุสุดเจ๋งที่กำลังมานี่สิ!"}
{"word": "check out", "english": "We should check out that new bakery.", "thai": "เราควรไปดูร้านเบเกอรี่ใหม่"}
{"word": "check out", "english": "Hey, check out my new sneakers!", "thai": "เฮ้ ดูรองเท้าผ้าใบใหม่ของฉันสิ!"}
{"word": "check out", "english": "I need to check out the flight details.", "thai": "ฉันต้องดูรายละเอียดเที่ยวบิน"}
{"word": "check out", "english": "Check out how many likes this post got!", "thai": "ดูสิว่าโพสต์นี้ได้ไลค์เยอะแค่ไหน!"}
{"word": "check out", "english": "You should check out this cooking channel.", "thai": "คุณควรดูช่องทำอาหารนี้"}
{"word": "check out", "english": "Let's check out the carnival tonight.", "thai": "ไปดูงานคาร์นิวัลคืนนี้กันเถอะ"}
{"word": "check out", "english": "Can you check out the map for directions?", "thai": "ช่วยดูแผนที่เพื่อหาเส้นทางหน่อยได้ไหม?"}
{"word": "check out", "english": "Check out this awesome drone footage!", "thai": "ดูวิดีโอจากโดรนสุดเจ๋งนี่สิ!"}
{"word": "check out", "english": "We need to check out the event details.", "thai": "เราต้องดูรายละเอียดของงาน"}
{"word": "check out", "english": "Hey, check out my new guitar!", "thai": "เฮ้ ดูกีตาร์ใหม่ของฉันสิ!"}
{"word": "check out", "english": "Let's check out that new ice cream shop.", "thai": "ไปดูร้านไอศกรีมใหม่กันเถอะ"}
{"word": "check out", "english": "Check out how fast I ran today!", "thai": "ดูสิว่าฉันวิ่งเร็วแค่ไหนวันนี้!"}
{"word": "check out", "english": "You should check out this travel blog.", "thai": "คุณควรดูบล็อกท่องเที่ยวนี่"}
{"word": "check out", "english": "Can you check out my drawing?", "thai": "ช่วยดูภาพวาดของฉันหน่อยได้ไหม?"}
{"word": "check out", "english": "Check out the new decorations in the office!", "thai": "ดูการตกแต่งใหม่ในออฟฟิศสิ!"}
{"word": "check out", "english": "We should check out that comedy club.", "thai": "เราควรไปดูคลับตลกนั้น"}
{"word": "check out", "english": "Hey, check out this cool magic trick!", "thai": "เฮ้ ดูกลเม็ดมายากลเจ๋งๆ นี่สิ!"}
{"word": "check out", "english": "I need to check out the warranty details.", "thai": "ฉันต้องดูรายละเอียดการรับประกัน"}
{"word": "check out", "english": "Check out how bright the moon is tonight!", "thai": "ดูสิว่าคืนนี้พระจันทร์สว่างแค่ไหน!"}
{"word": "check out", "english": "You should check out this fitness app.", "thai": "คุณควรดูแอปฟิตเนสนี่"}
{"word": "check out", "english": "Let's check out the aquarium this weekend.", "thai": "ไปดูพิพิธภัณฑ์สัตว์น้ำสุดสัปดาห์นี้กันเถอะ"}
{"word": "check out", "english": "Can you check out my email draft?", "thai": "ช่วยดูร่างอีเมลของฉันหน่อยได้ไหม?"}
{"word": "check out", "english": "Check out this awesome street art!", "thai": "ดูศิลปะบนถนนสุดเจ๋งนี่สิ!"}
{"word": "check out", "english": "We need to check out the new menu items.", "thai": "เราต้องดูรายการเมนูใหม่"}
{"word": "check out", "english": "Hey, check out my new watch!", "thai": "เฮ้ ดูนาฬิกาใหม่ของฉันสิ!"}
{"word": "check out", "english": "Let's check out the botanical garden.", "thai": "ไปดูสวนพฤกษศาสตร์กันเถอะ"}
{"word": "check out", "english": "Check out how much snow fell last night!", "thai": "ดูสิว่าหิมะตกเยอะแค่ไหนเมื่อคืน!"}
{"word": "check out", "english": "You should check out this new game.", "thai": "คุณควรดูเกมใหม่นี้"}
{"word": "check out", "english": "Can you check out the schedule for me?", "thai": "ช่วยดูตารางให้ฉันหน่อยได้ไหม?"}
{"word": "check out", "english": "Check out this cool science experiment!", "thai": "ดูการทดลองวิทยาศาสตร์เจ๋งๆ นี่สิ!"}
{"word": "come up", "english": "Hey, did anything interesting come up at the meeting?", "thai": "เฮ้ มีอะไรน่าสนใจเกิดขึ้นในที่ประชุมบ้างไหม?"}
{"word": "come up", "english": "I’ll let you know if any issues come up.", "thai": "ฉันจะบอกคุณถ้ามีปัญหาอะไรเกิดขึ้น"}
{"word": "come up", "english": "Why don’t you come up to my place this weekend?", "thai": "ทำไมไม่ขึ้นมาที่บ้านฉันสุดสัปดาห์นี้ล่ะ?"}
{"word": "come up", "english": "The topic of climate change came up in class today.", "thai": "หัวข้อเรื่องการเปลี่ยนแปลงสภาพภูมิอากาศถูกหยิบยกขึ้นมาในชั้นเรียนวันนี้"}
{"word": "come up", "english": "Something urgent has come up, so I can’t make it.", "thai": "มีเรื่องด่วนเกิดขึ้น ฉันเลยไปไม่ได้"}
{"word": "come up", "english": "Did any good ideas come up during the brainstorm?", "thai": "มีไอเดียดีๆ อะไรเกิดขึ้นระหว่างการระดมสมองบ้างไหม?"}
{"word": "come up", "english": "The sun will come up around 6 AM tomorrow.", "thai": "พระอาทิตย์จะขึ้นประมาณหกโมงเช้าพรุ่งนี้"}
{"word": "come up", "english": "Come up with a plan before we start the project.", "thai": "คิดแผนให้ได้ก่อนที่เราจะเริ่มโปรเจกต์"}
{"word": "come up", "english": "Her name always comes up in these discussions.", "thai": "ชื่อของเธอมักจะถูกพูดถึงในบทสนทนาเหล่านี้"}
{"word": "come up", "english": "I hope a solution comes up soon.", "thai": "ฉันหวังว่าจะมีวิธีแก้ปัญหาเกิดขึ้นเร็วๆ นี้"}
{"word": "come up", "english": "Hey, come up here and check out the view!", "thai": "เฮ้ ขึ้นมาที่นี่แล้วดูวิวสิ!"}
{"word": "come up", "english": "The issue of funding came up again.", "thai": "ประเด็นเรื่องเงินทุนถูกพูดถึงอีกครั้ง"}
{"word": "come up", "english": "We need to come up with a better strategy.", "thai": "เราต้องคิดกลยุทธ์ที่ดีกว่านี้"}
{"word": "come up", "english": "Nothing new has come up since we last talked.", "thai": "ไม่มีอะไรใหม่เกิดขึ้นตั้งแต่เราคุยกันครั้งล่าสุด"}
{"word": "come up", "english": "The question of ethics came up during the debate.", "thai": "คำถามเรื่องจริยธรรมถูกหยิบยกขึ้นมาระหว่างการโต้วาที"}
{"word": "come up", "english": "Can you come up to the office later?", "thai": "คุณขึ้นมาที่ออฟฟิศได้ไหม?"}
{"word": "come up", "english": "A great opportunity just came up at work.", "thai": "มีโอกาสดีๆ เกิดขึ้นที่ทำงาน"}
{"word": "come up", "english": "I didn’t expect that topic to come up.", "thai": "ฉันไม่คาดคิดว่าหัวข้อนั้นจะถูกพูดถึง"}
{"word": "come up", "english": "Let’s see what ideas come up in the next meeting.", "thai": "มาดูกันว่าไอเดียอะไรจะเกิดขึ้นในการประชุมครั้งหน้า"}
{"word": "come up", "english": "The deadline is coming up fast!", "thai": "กำหนดเวลาใกล้เข้ามาแล้ว!"}
{"word": "come up", "english": "Come up with a creative slogan for the campaign.", "thai": "คิดคำขวัญที่สร้างสรรค์สำหรับแคมเปญ"}
{"word": "come up", "english": "His name came up in the investigation.", "thai": "ชื่อของเขาถูกพูดถึงในการสืบสวน"}
{"word": "come up", "english": "Something always comes up when I plan a trip.", "thai": "มีอะไรเกิดขึ้นเสมอเมื่อฉันวางแผนเดินทาง"}
{"word": "come up", "english": "The moon is starting to come up now.", "thai": "พระจันทร์เริ่มขึ้นแล้วตอนนี้"}
{"word": "come up", "english": "Can you come up with a quick fix for this?", "thai": "คุณช่วยคิดวิธีแก้ปัญหานี้แบบเร็วๆ ได้ไหม?"}
{"word": "come up", "english": "The issue of safety came up at the town hall.", "thai": "ประเด็นเรื่องความปลอดภัยถูกหยิบยกในที่ประชุม"}
{"word": "come up", "english": "Hey, come up to the rooftop for the party!", "thai": "เฮ้ ขึ้นมาบนดาดฟ้าสำหรับปาร์ตี้สิ!"}
{"word": "come up", "english": "A new problem has come up with the software.", "thai": "มีปัญหาใหม่เกิดขึ้นกับซอฟต์แวร์"}
{"word": "come up", "english": "We need to come up with a budget plan.", "thai": "เราต้องคิดแผนงบประมาณ"}
{"word": "come up", "english": "Her birthday is coming up next week.", "thai": "วันเกิดของเธอใกล้เข้ามาแล้วสัปดาห์หน้า"}
{"word": "come up", "english": "The topic of taxes came up on the news.", "thai": "หัวข้อเรื่องภาษีถูกพูดถึงในข่าว"}
{"word": "come up", "english": "I’ll come up to your place after work.", "thai": "ฉันจะขึ้นไปที่บ้านคุณหลังเลิกงาน"}
{"word": "come up", "english": "A cool event is coming up this weekend.", "thai": "มีงานเจ๋งๆ เกิดขึ้นสุดสัปดาห์นี้"}
{"word": "come up", "english": "Did anything come up while I was gone?", "thai": "มีอะไรเกิดขึ้นบ้างไหมตอนที่ฉันไม่อยู่?"}
{"word": "come up", "english": "We need to come up with a name for the team.", "thai": "เราต้องคิดชื่อให้ทีม"}
{"word": "come up", "english": "The issue of privacy came up in the interview.", "thai": "ประเด็นเรื่องความเป็นส่วนตัวถูกหยิบยกในการสัมภาษณ์"}
{"word": "come up", "english": "Come up with a good excuse for being late.", "thai": "คิดข้อแก้ตัวดีๆ สำหรับการมาสาย"}
{"word": "come up", "english": "The festival is coming up in two weeks.", "thai": "งานเทศกาลใกล้เข้ามาในอีกสองสัปดาห์"}
{"word": "come up", "english": "Something unexpected came up at home.", "thai": "มีอะไรไม่คาดคิดเกิดขึ้นที่บ้าน"}
{"word": "come up", "english": "Her idea came up during the discussion.", "thai": "ไอเดียของเธอถูกพูดถึงระหว่างการสนทนา"}
{"word": "come up", "english": "Can you come up to the front of the class?", "thai": "คุณขึ้นมาหน้าชั้นเรียนได้ไหม?"}
{"word": "come up", "english": "A new job opportunity just came up.", "thai": "มีโอกาสงานใหม่เกิดขึ้น"}
{"word": "come up", "english": "The topic of education came up at dinner.", "thai": "หัวข้อเรื่องการศึกษาถูกหยิบยกตอนกินข้าวเย็น"}
{"word": "come up", "english": "We need to come up with a marketing plan.", "thai": "เราต้องคิดแผนการตลาด"}
{"word": "come up", "english": "The exam is coming up next month.", "thai": "การสอบใกล้เข้ามาเดือนหน้า"}
{"word": "come up", "english": "Did any questions come up during the presentation?", "thai": "มีคำถามอะไรเกิดขึ้นระหว่างการนำเสนอบ้างไหม?"}
{"word": "come up", "english": "Come up to my office when you’re free.", "thai": "ขึ้นมาที่ออฟฟิศฉันเมื่อคุณว่าง"}
{"word": "come up", "english": "A new issue has come up with the project.", "thai": "มีปัญหาใหม่เกิดขึ้นกับโปรเจกต์"}
{"word": "come up", "english": "The idea of a road trip came up last night.", "thai": "ไอเดียเรื่องทริปถนนถูกพูดถึงเมื่อคืน"}
{"word": "come up", "english": "We need to come up with a gift idea.", "thai": "เราต้องคิดไอเดียของขวัญ"}
{"word": "come up", "english": "The concert is coming up this Friday.", "thai": "คอนเสิร์ตใกล้เข้ามาวันศุกร์นี้"}
{"word": "come up", "english": "Something came up, so I’ll be late.", "thai": "มีบางอย่างเกิดขึ้น ฉันเลยจะมาสาย"}
{"word": "come up", "english": "Her name came up in the group chat.", "thai": "ชื่อของเธอถูกพูดถึงในแชทกลุ่ม"}
{"word": "come up", "english": "Can you come up with a better design?", "thai": "คุณช่วยคิดการออกแบบที่ดีกว่านี้ได้ไหม?"}
{"word": "come up", "english": "The issue of security came up at the meeting.", "thai": "ประเด็นเรื่องความปลอดภัยถูกหยิบยกในที่ประชุม"}
{"word": "come up", "english": "Come up to the stage for your award!", "thai": "ขึ้นมาบนเวทีเพื่อรับรางวัลของคุณ!"}
{"word": "come up", "english": "A new challenge has come up at work.", "thai": "มีความท้าทายใหม่เกิดขึ้นที่ทำงาน"}
{"word": "come up", "english": "The topic of health came up on the podcast.", "thai": "หัวข้อเรื่องสุขภาพถูกพูดถึงในพอดแคสต์"}
{"word": "come up", "english": "We need to come up with a new slogan.", "thai": "เราต้องคิดคำขวัญใหม่"}
{"word": "come up", "english": "The holiday is coming up next week.", "thai": "วันหยุดใกล้เข้ามาสัปดาห์หน้า"}
{"word": "come up", "english": "Did anything come up during the call?", "thai": "มีอะไรเกิดขึ้นระหว่างการโทรบ้างไหม?"}
{"word": "come up", "english": "Come up with a fun game for the party.", "thai": "คิดเกมสนุกๆ สำหรับปาร์ตี้"}
{"word": "come up", "english": "The issue of traffic came up in the news.", "thai": "ประเด็นเรื่องการจราจรถูกพูดถึงในข่าว"}
{"word": "come up", "english": "Hey, come up to my room and hang out!", "thai": "เฮ้ ขึ้นมาที่ห้องฉันแล้วมาแฮงค์เอาท์กัน!"}
{"word": "come up", "english": "A problem came up with the shipment.", "thai": "มีปัญหาเกิดขึ้นกับการขนส่ง"}
{"word": "come up", "english": "The idea of a picnic came up yesterday.", "thai": "ไอเดียเรื่องปิกนิกถูกพูดถึงเมื่อวาน"}
{"word": "come up", "english": "We need to come up with a backup plan.", "thai": "เราต้องคิดแผนสำรอง"}
{"word": "come up", "english": "The deadline is coming up tomorrow!", "thai": "กำหนดเวลาใกล้เข้ามาพรุ่งนี้!"}
{"word": "come up", "english": "Her suggestion came up during the meeting.", "thai": "ข้อเสนอของเธอถูกพูดถึงระหว่างการประชุม"}
{"word": "come up", "english": "Can you come up with a new recipe?", "thai": "คุณช่วยคิดสูตรอาหารใหม่ได้ไหม?"}
{"word": "come up", "english": "The topic of sustainability came up today.", "thai": "หัวข้อเรื่องความยั่งยืนถูกหยิบยกวันนี้"}
{"word": "come up", "english": "Come up to the front desk for assistance.", "thai": "ขึ้นมาที่เคาน์เตอร์เพื่อขอความช่วยเหลือ"}
{"word": "come up", "english": "A new idea came up during lunch.", "thai": "มีไอเดียใหม่เกิดขึ้นระหว่างมื้อเที่ยง"}
{"word": "come up", "english": "The event is coming up this Saturday.", "thai": "งานนี้ใกล้เข้ามาวันเสาร์นี้"}
{"word": "come up", "english": "Something came up, so I have to cancel.", "thai": "มีบางอย่างเกิดขึ้น ฉันเลยต้องยกเลิก"}
{"word": "come up", "english": "His name came up in the conversation.", "thai": "ชื่อของเขาถูกพูดถึงในการสนทนา"}
{"word": "come up", "english": "Can you come up with a title for the project?", "thai": "คุณช่วยคิดชื่อให้โปรเจกต์ได้ไหม?"}
{"word": "come up", "english": "The issue of cost came up in the budget meeting.", "thai": "ประเด็นเรื่องค่าใช้จ่ายถูกหยิบยกในที่ประชุมงบประมาณ"}
{"word": "come up", "english": "Come up to the balcony for some fresh air!", "thai": "ขึ้นมาที่ระเบียงเพื่อสูดอากาศบริสุทธิ์!"}
{"word": "come up", "english": "A new opportunity has come up at school.", "thai": "มีโอกาสใหม่เกิดขึ้นที่โรงเรียน"}
{"word": "come up", "english": "The topic of technology came up on the show.", "thai": "หัวข้อเรื่องเทคโนโลยีถูกพูดถึงในรายการ"}
{"word": "come up", "english": "We need to come up with a schedule.", "thai": "เราต้องคิดตารางเวลา"}
{"word": "come up", "english": "The party is coming up this weekend.", "thai": "ปาร์ตี้ใกล้เข้ามาสุดสัปดาห์นี้"}
{"word": "come up", "english": "Did anything come up during the audit?", "thai": "มีอะไรเกิดขึ้นระหว่างการตรวจสอบบ้างไหม?"}
{"word": "come up", "english": "Come up with a fun activity for the kids.", "thai": "คิดกิจกรรมสนุกๆ สำหรับเด็กๆ"}
{"word": "come up", "english": "The issue of equality came up in the discussion.", "thai": "ประเด็นเรื่องความเท่าเทียมถูกหยิบยกในการสนทนา"}
{"word": "come up", "english": "Hey, come up to the attic and see this!", "thai": "เฮ้ ขึ้นมาที่ห้องใต้หลังคาแล้วดูนี่สิ!"}
{"word": "come up", "english": "A new conflict has come up in the team.", "thai": "มีความขัดแย้งใหม่เกิดขึ้นในทีม"}
{"word": "come up", "english": "The idea of volunteering came up last week.", "thai": "ไอเดียเรื่องการเป็นอาสาสมัครถูกพูดถึงเมื่อสัปดาห์ที่แล้ว"}
{"word": "come up", "english": "We need to come up with a solution fast.", "thai": "เราต้องคิดวิธีแก้ปัญหาให้เร็ว"}
{"word": "come up", "english": "The meeting is coming up in an hour.", "thai": "การประชุมใกล้เข้ามาในอีกหนึ่งชั่วโมง"}
{"word": "come up", "english": "Her comment came up during the review.", "thai": "ความคิดเห็นของเธอถูกพูดถึงระหว่างการทบทวน"}
{"word": "come up", "english": "Can you come up with a new logo?", "thai": "คุณช่วยคิดโลโก้ใหม่ได้ไหม?"}
{"word": "come up", "english": "The topic of travel came up at lunch.", "thai": "หัวข้อเรื่องการท่องเที่ยวถูกหยิบยกตอนมื้อเที่ยง"}
{"word": "come up", "english": "Come up to the deck for the sunset!", "thai": "ขึ้นมาที่ดาดฟ้าเพื่อดูพระอาทิตย์ตก!"}
{"word": "come up", "english": "A new issue has come up with the contract.", "thai": "มีปัญหาใหม่เกิดขึ้นกับสัญญา"}
{"word": "come up", "english": "The idea of a book club came up yesterday.", "thai": "ไอเดียเรื่องชมรมหนังสือถูกพูดถึงเมื่อวาน"}
{"word": "come up", "english": "We need to come up with a new approach.", "thai": "เราต้องคิดวิธีการใหม่"}
{"word": "come up", "english": "The test is coming up next Tuesday.", "thai": "การสอบใกล้เข้ามาวันอังคารหน้า"}
{"word": "drop by", "english": "Hey, why don’t you drop by my place later?", "thai": "เฮ้ ทำไมไม่แวะมาที่บ้านฉันทีหลังล่ะ?"}
{"word": "drop by", "english": "I’ll drop by the store to grab some milk.", "thai": "ฉันจะแวะไปที่ร้านเพื่อซื้อนม"}
{"word": "drop by", "english": "Can you drop by the office this afternoon?", "thai": "คุณแวะมาที่ออฟฟิศบ่ายนี้ได้ไหม?"}
{"word": "drop by", "english": "She said she might drop by the party tonight.", "thai": "เธอบอกว่าเธออาจจะแวะมาที่งานปาร์ตี้คืนนี้"}
{"word": "drop by", "english": "I’ll drop by your house after work.", "thai": "ฉันจะแวะไปที่บ้านคุณหลังเลิกงาน"}
{"word": "drop by", "english": "Why don’t we drop by the new café downtown?", "thai": "ทำไมเราไม่แวะไปที่คาเฟ่ใหม่ในตัวเมืองล่ะ?"}
{"word": "drop by", "english": "He dropped by yesterday to say hi.", "thai": "เขาแวะมาทักทายเมื่อวานนี้"}
{"word": "drop by", "english": "Feel free to drop by anytime you’re around.", "thai": "แวะมาได้ทุกเมื่อที่คุณอยู่แถวนี้"}
{"word": "drop by", "english": "I need to drop by the post office later.", "thai": "ฉันต้องแวะไปที่ไปรษณีย์ทีหลัง"}
{"word": "drop by", "english": "Let’s drop by the bakery for some pastries.", "thai": "ไปแวะที่ร้านเบเกอรี่เพื่อซื้อขนมอบกันเถอะ"}
{"word": "drop by", "english": "She dropped by the library to return a book.", "thai": "เธอแวะไปที่ห้องสมุดเพื่อคืนหนังสือ"}
{"word": "drop by", "english": "You should drop by the art gallery this weekend.", "thai": "คุณควรแวะไปที่แกลเลอรี่ศิลปะสุดสัปดาห์นี้"}
{"word": "drop by", "english": "I’ll drop by your place to pick up the keys.", "thai": "ฉันจะแวะไปที่บ้านคุณเพื่อรับกุญแจ"}
{"word": "drop by", "english": "He said he’d drop by after his meeting.", "thai": "เขาบอกว่าเขาจะแวะมาหลังจากการประชุม"}
{"word": "drop by", "english": "Let’s drop by the farmers’ market on Saturday.", "thai": "ไปแวะที่ตลาดนัดเกษตรกรวันเสาร์กันเถอะ"}
{"word": "drop by", "english": "I dropped by the gym to check it out.", "thai": "ฉันแวะไปที่ยิมเพื่อดูรอบๆ"}
{"word": "drop by", "english": "Can you drop by my desk to discuss the project?", "thai": "คุณแวะมาที่โต๊ะฉันเพื่อคุยเรื่องโปรเจกต์ได้ไหม?"}
{"word": "drop by", "english": "She dropped by to drop off some cookies.", "thai": "เธอแวะมาเพื่อส่งคุกกี้"}
{"word": "drop by", "english": "I’ll drop by the coffee shop on my way home.", "thai": "ฉันจะแวะไปที่ร้านกาแฟระหว่างทางกลับบ้าน"}
{"word": "drop by", "english": "Why don’t you drop by for dinner tonight?", "thai": "ทำไมไม่แวะมากินข้าวเย็นคืนนี้ล่ะ?"}
{"word": "drop by", "english": "He dropped by the store to get some snacks.", "thai": "เขาแวะไปที่ร้านเพื่อซื้อของว่าง"}
{"word": "drop by", "english": "I might drop by the bookstore later.", "thai": "ฉันอาจจะแวะไปที่ร้านหนังสือทีหลัง"}
{"word": "drop by", "english": "Let’s drop by the park after lunch.", "thai": "ไปแวะที่สวนสาธารณะหลังมื้อเที่ยงกันเถอะ"}
{"word": "drop by", "english": "She dropped by my office to chat.", "thai": "เธอแวะมาที่ออฟฟิศฉันเพื่อคุย"}
{"word": "drop by", "english": "I’ll drop by the dry cleaners this evening.", "thai": "ฉันจะแวะไปที่ร้านซักแห้งเย็นนี้"}
{"word": "drop by", "english": "You should drop by the new restaurant nearby.", "thai": "คุณควรแวะไปที่ร้านอาหารใหม่แถวนี้"}
{"word": "drop by", "english": "He dropped by to borrow a book.", "thai": "เขาแวะมาเพื่อยืมหนังสือ"}
{"word": "drop by", "english": "Can we drop by the mall on our way back?", "thai": "เราแวะไปที่ห้างระหว่างทางกลับได้ไหม?"}
{"word": "drop by", "english": "I dropped by her place, but she wasn’t home.", "thai": "ฉันแวะไปที่บ้านเธอ แต่เธอไม่อยู่"}
{"word": "drop by", "english": "Let’s drop by the bar for a quick drink.", "thai": "ไปแวะที่บาร์เพื่อดื่มอะไรเร็วๆ กันเถอะ"}
{"word": "drop by", "english": "I’ll drop by the pharmacy to pick up my prescription.", "thai": "ฉันจะแวะไปที่ร้านขายยาเพื่อรับยาตามใบสั่ง"}
{"word": "drop by", "english": "She said she’d drop by the event later.", "thai": "เธอบอกว่าเธอจะแวะไปที่งานทีหลัง"}
{"word": "drop by", "english": "Why don’t you drop by my apartment tomorrow?", "thai": "ทำไมไม่แวะมาที่อพาร์ตเมนต์ของฉันพรุ่งนี้ล่ะ?"}
{"word": "drop by", "english": "I dropped by the hardware store for some tools.", "thai": "ฉันแวะไปที่ร้านเครื่องมือเพื่อซื้อเครื่องมือ"}
{"word": "drop by", "english": "Can you drop by the meeting for a few minutes?", "thai": "คุณแวะมาที่การประชุมสักสองสามนาทีได้ไหม?"}
{"word": "drop by", "english": "He dropped by to give me a birthday card.", "thai": "เขาแวะมาเพื่อให้การ์ดวันเกิดฉัน"}
{"word": "drop by", "english": "I’ll drop by the pet store to get some food.", "thai": "ฉันจะแวะไปที่ร้านสัตว์เลี้ยงเพื่อซื้ออาหาร"}
{"word": "drop by", "english": "Let’s drop by the arcade this afternoon.", "thai": "ไปแวะที่ตู้เกมบ่ายนี้กันเถอะ"}
{"word": "drop by", "english": "She dropped by to say goodbye before moving.", "thai": "เธอแวะมาบอกลาก่อนย้าย"}
{"word": "drop by", "english": "I might drop by the museum after work.", "thai": "ฉันอาจจะแวะไปที่พิพิธภัณฑ์หลังเลิกงาน"}
{"word": "drop by", "english": "Why don’t we drop by the ice cream shop?", "thai": "ทำไมเราไม่แวะไปที่ร้านไอศกรีมล่ะ?"}
{"word": "drop by", "english": "He dropped by my place with some pizza.", "thai": "เขาแวะมาที่บ้านฉันพร้อมพิซซ่า"}
{"word": "drop by", "english": "I’ll drop by the bank to deposit some cash.", "thai": "ฉันจะแวะไปที่ธนาคารเพื่อฝากเงินสด"}
{"word": "drop by", "english": "Can you drop by my house to drop off the notes?", "thai": "คุณแวะมาที่บ้านฉันเพื่อส่งโน้ตได้ไหม?"}
{"word": "drop by", "english": "She dropped by the office to pick up her laptop.", "thai": "เธอแวะไปที่ออฟฟิศเพื่อรับแล็ปท็อป"}
{"word": "drop by", "english": "Let’s drop by the flower shop for some roses.", "thai": "ไปแวะที่ร้านดอกไม้เพื่อซื้อกุหลาบกันเถอะ"}
{"word": "drop by", "english": "I dropped by the café, but it was closed.", "thai": "ฉันแวะไปที่คาเฟ่ แต่ร้านปิด"}
{"word": "drop by", "english": "You should drop by the new gym in town.", "thai": "คุณควรแวะไปที่ยิมใหม่ในเมือง"}
{"word": "drop by", "english": "He dropped by to check on me yesterday.", "thai": "เขาแวะมาเยี่ยมฉันเมื่อวาน"}
{"word": "drop by", "english": "I’ll drop by the grocery store after school.", "thai": "ฉันจะแวะไปที่ร้านขายของชำหลังเลิกเรียน"}
{"word": "drop by", "english": "Why don’t you drop by for coffee tomorrow?", "thai": "ทำไมไม่แวะมากินกาแฟพรุ่งนี้ล่ะ?"}
{"word": "drop by", "english": "She dropped by to show me her new phone.", "thai": "เธอแวะมาเพื่อโชว์โทรศัพท์ใหม่ของเธอ"}
{"word": "drop by", "english": "Let’s drop by the record store this weekend.", "thai": "ไปแวะที่ร้านแผ่นเสียงสุดสัปดาห์นี้กันเถอะ"}
{"word": "drop by", "english": "I dropped by the bar to meet some friends.", "thai": "ฉันแวะไปที่บาร์เพื่อเจอเพื่อนๆ"}
{"word": "drop by", "english": "Can you drop by the library to pick up a book?", "thai": "คุณแวะไปที่ห้องสมุดเพื่อรับหนังสือได้ไหม?"}
{"word": "drop by", "english": "He dropped by with some homemade cookies.", "thai": "เขาแวะมาพร้อมคุกกี้ทำเอง"}
{"word": "drop by", "english": "I’ll drop by the mechanic to check on my car.", "thai": "ฉันจะแวะไปที่ช่างเพื่อดูรถของฉัน"}
{"word": "drop by", "english": "Why don’t we drop by the beach this evening?", "thai": "ทำไมเราไม่แวะไปที่ชายหาดเย็นนี้ล่ะ?"}
{"word": "drop by", "english": "She dropped by to invite me to her party.", "thai": "เธอแวะมาเพื่อชวนฉันไปงานปาร์ตี้ของเธอ"}
{"word": "drop by", "english": "I’ll drop by the tailor to pick up my suit.", "thai": "ฉันจะแวะไปที่ช่างตัดเสื้อเพื่อรับชุดสูท"}
{"word": "drop by", "english": "Let’s drop by the antique shop tomorrow.", "thai": "ไปแวะที่ร้านของเก่าสะสมพรุ่งนี้กันเถอะ"}
{"word": "drop by", "english": "He dropped by the office to sign some papers.", "thai": "เขาแวะไปที่ออฟฟิศเพื่อเซ็นเอกสาร"}
{"word": "drop by", "english": "I might drop by the concert tonight.", "thai": "ฉันอาจจะแวะไปที่คอนเสิร์ตคืนนี้"}
{"word": "drop by", "english": "Can you drop by my place to help with setup?", "thai": "คุณแวะมาที่บ้านฉันเพื่อช่วยจัดเตรียมได้ไหม?"}
{"word": "drop by", "english": "She dropped by to share some good news.", "thai": "เธอแวะมาเพื่อแชร์ข่าวดี"}
{"word": "drop by", "english": "I’ll drop by the hardware store for some paint.", "thai": "ฉันจะแวะไปที่ร้านเครื่องมือเพื่อซื้อสี"}
{"word": "drop by", "english": "Why don’t you drop by for a quick chat?", "thai": "ทำไมไม่แวะมาคุยกันสักพักล่ะ?"}
{"word": "drop by", "english": "He dropped by the park to walk his dog.", "thai": "เขาแวะไปที่สวนสาธารณะเพื่อพาสุนัขไปเดินเล่น"}
{"word": "drop by", "english": "Let’s drop by the pizza place for lunch.", "thai": "ไปแวะที่ร้านพิซซ่าสำหรับมื้อเที่ยงกันเถอะ"}
{"word": "drop by", "english": "I dropped by her house, but no one was there.", "thai": "ฉันแวะไปที่บ้านเธอ แต่ไม่มีใครอยู่"}
{"word": "drop by", "english": "You should drop by the new bookstore.", "thai": "คุณควรแวะไปที่ร้านหนังสือใหม่"}
{"word": "drop by", "english": "I’ll drop by the vet to check on my cat.", "thai": "ฉันจะแวะไปที่สัตวแพทย์เพื่อดูแมวของฉัน"}
{"word": "drop by", "english": "She dropped by to drop off some documents.", "thai": "เธอแวะมาเพื่อส่งเอกสาร"}
{"word": "drop by", "english": "Let’s drop by the craft store for supplies.", "thai": "ไปแวะที่ร้านงานฝีมือเพื่อซื้อของกันเถอะ"}
{"word": "drop by", "english": "He dropped by to give me a ride.", "thai": "เขาแวะมาเพื่อให้ฉันนั่งรถไปด้วย"}
{"word": "drop by", "english": "I’ll drop by the mall to buy a gift.", "thai": "ฉันจะแวะไปที่ห้างเพื่อซื้อของขวัญ"}
{"word": "drop by", "english": "Why don’t you drop by the barbecue this weekend?", "thai": "ทำไมไม่แวะมาที่งานบาร์บีคิวสุดสัปดาห์นี้ล่ะ?"}
{"word": "drop by", "english": "She dropped by to check out my new apartment.", "thai": "เธอแวะมาเพื่อดูอพาร์ตเมนต์ใหม่ของฉัน"}
{"word": "drop by", "english": "I might drop by the festival this evening.", "thai": "ฉันอาจจะแวะไปที่งานเทศกาลเย็นนี้"}
{"word": "drop by", "english": "Can you drop by the classroom to drop off the books?", "thai": "คุณแวะไปที่ห้องเรียนเพื่อส่งหนังสือได้ไหม?"}
{"word": "drop by", "english": "He dropped by with some coffee this morning.", "thai": "เขาแวะมาพร้อมกาแฟเช้านี้"}
{"word": "drop by", "english": "I’ll drop by the gas station to fill up.", "thai": "ฉันจะแวะไปที่ปั๊มน้ำมันเพื่อเติมน้ำมัน"}
{"word": "drop by", "english": "Let’s drop by the thrift store for some deals.", "thai": "ไปแวะที่ร้านมือสองเพื่อหาของดีๆ กันเถอะ"}
{"word": "drop by", "english": "She dropped by to borrow my jacket.", "thai": "เธอแวะมาเพื่อยืมแจ็คเก็ตของฉัน"}
{"word": "drop by", "english": "I’ll drop by the electronics store later.", "thai": "ฉันจะแวะไปที่ร้านเครื่องใช้ไฟฟ้าทีหลัง"}
{"word": "drop by", "english": "Why don’t we drop by the zoo this weekend?", "thai": "ทำไมเราไม่แวะไปที่สวนสัตว์สุดสัปดาห์นี้ล่ะ?"}
{"word": "drop by", "english": "He dropped by to talk about the project.", "thai": "เขาแวะมาเพื่อคุยเรื่องโปรเจกต์"}
{"word": "drop by", "english": "I dropped by the bakery for some bread.", "thai": "ฉันแวะไปที่ร้านเบเกอรี่เพื่อซื้อขนมปัง"}
{"word": "drop by", "english": "Can you drop by my place to water the plants?", "thai": "คุณแวะมาที่บ้านฉันเพื่อรดน้ำต้นไม้ได้ไหม?"}
{"word": "drop by", "english": "She dropped by to show me her new car.", "thai": "เธอแวะมาเพื่อโชว์รถใหม่ของเธอ"}
{"word": "drop by", "english": "Let’s drop by the art fair this afternoon.", "thai": "ไปแวะที่งานศิลปะบ่ายนี้กันเถอะ"}
{"word": "drop by", "english": "I’ll drop by the shoe store to try some sneakers.", "thai": "ฉันจะแวะไปที่ร้านรองเท้าเพื่อลองรองเท้าผ้าใบ"}
{"word": "drop by", "english": "He dropped by to help with my homework.", "thai": "เขาแวะมาเพื่อช่วยทำการบ้านของฉัน"}
{"word": "drop by", "english": "I might drop by the community center later.", "thai": "ฉันอาจจะแวะไปที่ศูนย์ชุมชนทีหลัง"}
{"word": "drop by", "english": "Why don’t you drop by for a game night?", "thai": "ทำไมไม่แวะมาเพื่อเล่นเกมคืนนี้ล่ะ?"}
{"word": "drop by", "english": "She dropped by to give me a gift.", "thai": "เธอแวะมาเพื่อให้ของขวัญฉัน"}
{"word": "drop by", "english": "I’ll drop by the farmer’s stand for some fruit.", "thai": "ฉันจะแวะไปที่แผงเกษตรกรเพื่อซื้อผลไม้"}
{"word": "drop by", "english": "Let’s drop by the music store for some vinyls.", "thai": "ไปแวะที่ร้านเพลงเพื่อซื้อแผ่นเสียงกันเถอะ"}
{"word": "drop by", "english": "He dropped by to drop off his resume.", "thai": "เขาแวะมาเพื่อส่งเรซูเม่"}
{"word": "drop by", "english": "I dropped by the office, but it was empty.", "thai": "ฉันแวะไปที่ออฟฟิศ แต่ไม่มีคนอยู่"}
{"word": "find out", "english": "I need to find out what time the movie starts.", "thai": "ฉันต้องหาว่าหนังเริ่มกี่โมง"}
{"word": "find out", "english": "Did you find out who won the game?", "thai": "คุณรู้หรือยังว่าใครชนะเกม?"}
{"word": "find out", "english": "Let’s find out what’s on the menu tonight.", "thai": "มาดูกันว่าคืนนี้มีอะไรในเมนูบ้าง"}
{"word": "find out", "english": "She found out about the surprise party.", "thai": "เธอรู้เรื่องงานปาร์ตี้เซอร์ไพรส์แล้ว"}
{"word": "find out", "english": "I just found out that the concert is sold out.", "thai": "ฉันเพิ่งรู้ว่าคอนเสิร์ตขายบัตรหมดแล้ว"}
{"word": "find out", "english": "Can you find out where the meeting is?", "thai": "คุณช่วยหาว่าการประชุมอยู่ที่ไหนได้ไหม?"}
{"word": "find out", "english": "He found out his flight was canceled.", "thai": "เขารู้ว่าเที่ยวบินของเขาถูกยกเลิก"}
{"word": "find out", "english": "We should find out if the store is still open.", "thai": "เราควรดูว่าร้านยังเปิดอยู่หรือไม่"}
{"word": "find out", "english": "I want to find out more about this new app.", "thai": "ฉันอยากรู้เพิ่มเติมเกี่ยวกับแอปใหม่นี้"}
{"word": "find out", "english": "They found out the truth about the rumor.", "thai": "พวกเขารู้ความจริงเกี่ยวกับข่าวลือ"}
{"word": "find out", "english": "Let’s find out what time the train leaves.", "thai": "มาดูกันว่ารถไฟออกกี่โมง"}
{"word": "find out", "english": "She found out her application was accepted.", "thai": "เธอรู้ว่าใบสมัครของเธอได้รับการยอมรับ"}
{"word": "find out", "english": "I need to find out why my package is delayed.", "thai": "ฉันต้องหาว่าทำไมพัสดุของฉันล่าช้า"}
{"word": "find out", "english": "Did you find out how much the tickets cost?", "thai": "คุณรู้หรือยังว่าตั๋วราคาเท่าไหร่?"}
{"word": "find out", "english": "He’s trying to find out who broke the window.", "thai": "เขากำลังหาว่าใครทำหน้าต่างแตก"}
{"word": "find out", "english": "I just found out they’re closing the café.", "thai": "ฉันเพิ่งรู้ว่าพวกเขาจะปิดคาเฟ่"}
{"word": "find out", "english": "Can you find out if the event is free?", "thai": "คุณช่วยดูว่างานนี้ฟรีหรือไม่?"}
{"word": "find out", "english": "We found out the meeting was rescheduled.", "thai": "เรารู้ว่าการประชุมถูกเลื่อน"}
{"word": "find out", "english": "I want to find out what happened last night.", "thai": "ฉันอยากรู้ว่าเมื่อคืนเกิดอะไรขึ้น"}
{"word": "find out", "english": "She found out her friend was moving away.", "thai": "เธอรู้ว่าเพื่อนของเธอกำลังจะย้ายไป"}
{"word": "find out", "english": "Let’s find out where the party is happening.", "thai": "มาดูกันว่างานปาร์ตี้จัดที่ไหน"}
{"word": "find out", "english": "He found out he got the job!", "thai": "เขารู้ว่าเขาได้งานแล้ว!"}
{"word": "find out", "english": "I need to find out the address of the restaurant.", "thai": "ฉันต้องหาที่อยู่ของร้านอาหาร"}
{"word": "find out", "english": "Did you find out what caused the delay?", "thai": "คุณรู้หรือยังว่าอะไรทำให้ล่าช้า?"}
{"word": "find out", "english": "She’s trying to find out who sent the gift.", "thai": "เธอกำลังหาว่าใครส่งของขวัญมา"}
{"word": "find out", "english": "I just found out the store has a sale.", "thai": "ฉันเพิ่งรู้ว่าร้านกำลังลดราคา"}
{"word": "find out", "english": "Can you find out if they allow pets?", "thai": "คุณช่วยดูว่าพวกเขาให้เอาสัตว์เลี้ยงเข้าได้ไหม?"}
{"word": "find out", "english": "We found out the event was canceled.", "thai": "เรารู้ว่างานถูกยกเลิก"}
{"word": "find out", "english": "I want to find out how to join the club.", "thai": "ฉันอยากรู้วิธีเข้าร่วมชมรม"}
{"word": "find out", "english": "He found out his car needs repairs.", "thai": "เขารู้ว่ารถของเขาต้องซ่อม"}
{"word": "find out", "english": "Let’s find out what’s playing at the theater.", "thai": "มาดูกันว่ามีอะไรฉายที่โรงหนัง"}
{"word": "find out", "english": "She found out about the new policy at work.", "thai": "เธอรู้เกี่ยวกับนโยบายใหม่ที่ทำงาน"}
{"word": "find out", "english": "I need to find out if the flight is on time.", "thai": "ฉันต้องหาว่าเที่ยวบินตรงเวลาหรือไม่"}
{"word": "find out", "english": "Did you find out who’s hosting the party?", "thai": "คุณรู้หรือยังว่าใครเป็นเจ้าภาพงานปาร์ตี้?"}
{"word": "find out", "english": "He’s trying to find out where she went.", "thai": "เขากำลังหาว่าเธอไปไหน"}
{"word": "find out", "english": "I just found out they’re opening a new gym.", "thai": "ฉันเพิ่งรู้ว่าพวกเขากำลังเปิดยิมใหม่"}
{"word": "find out", "english": "Can you find out the hours for the museum?", "thai": "คุณช่วยดูเวลาเปิดของพิพิธภัณฑ์ได้ไหม?"}
{"word": "find out", "english": "We found out the project was approved.", "thai": "เรารู้ว่าโปรเจกต์ได้รับการอนุมัติ"}
{"word": "find out", "english": "I want to find out what’s in this recipe.", "thai": "ฉันอยากรู้ว่ามีอะไรในสูตรนี้"}
{"word": "find out", "english": "She found out her test results yesterday.", "thai": "เธอรู้ผลสอบของเธอเมื่อวาน"}
{"word": "find out", "english": "Let’s find out if the park is open today.", "thai": "มาดูกันว่าสวนสาธารณะเปิดวันนี้หรือไม่"}
{"word": "find out", "english": "He found out his phone was stolen.", "thai": "เขารู้ว่าโทรศัพท์ของเขาถูกขโมย"}
{"word": "find out", "english": "I need to find out how to fix this error.", "thai": "ฉันต้องหาวิธีแก้ไขข้อผิดพลาดนี้"}
{"word": "find out", "english": "Did you find out what time the bus leaves?", "thai": "คุณรู้หรือยังว่ารถบัสออกกี่โมง?"}
{"word": "find out", "english": "She’s trying to find out who leaked the news.", "thai": "เธอกำลังหาว่าใครปล่อยข่าว"}
{"word": "find out", "english": "I just found out the café is closing early.", "thai": "ฉันเพิ่งรู้ว่าร้านกาแฟปิดเร็ว"}
{"word": "find out", "english": "Can you find out if the class is full?", "thai": "คุณช่วยดูว่าคลาสเต็มหรือยัง?"}
{"word": "find out", "english": "We found out the deadline was extended.", "thai": "เรารู้ว่ากำหนดเวลาถูกขยาย"}
{"word": "find out", "english": "I want to find out more about this course.", "thai": "ฉันอยากรู้เพิ่มเติมเกี่ยวกับคอร์สนี้"}
{"word": "find out", "english": "He found out his order was shipped.", "thai": "เขารู้ว่าคำสั่งซื้อของเขาถูกจัดส่งแล้ว"}
{"word": "find out", "english": "Let’s find out what’s causing the noise.", "thai": "มาดูกันว่าอะไรทำให้เกิดเสียง"}
{"word": "find out", "english": "She found out about the sale too late.", "thai": "เธอรู้เรื่องการลดราคาช้าเกินไป"}
{"word": "find out", "english": "I need to find out where my keys are.", "thai": "ฉันต้องหาว่ากุญแจของฉันอยู่ไหน"}
{"word": "find out", "english": "Did you find out who’s performing tonight?", "thai": "คุณรู้หรือยังว่าใครแสดงคืนนี้?"}
{"word": "find out", "english": "He’s trying to find out why the app crashed.", "thai": "เขากำลังหาว่าทำไมแอปขัดข้อง"}
{"word": "find out", "english": "I just found out they’re hiring!", "thai": "ฉันเพิ่งรู้ว่าพวกเขากำลังรับสมัครงาน!"}
{"word": "find out", "english": "Can you find out if the restaurant is open?", "thai": "คุณช่วยดูว่าร้านอาหารเปิดหรือไม่?"}
{"word": "find out", "english": "We found out the event starts at 7 PM.", "thai": "เรารู้ว่างานเริ่มตอนหนึ่งทุ่ม"}
{"word": "find out", "english": "I want to find out how to get a refund.", "thai": "ฉันอยากรู้วิธีขอเงินคืน"}
{"word": "find out", "english": "She found out her cousin is visiting.", "thai": "เธอรู้ว่าลูกพี่ลูกน้องของเธอกำลังมาเยี่ยม"}
{"word": "find out", "english": "Let’s find out what’s on sale today.", "thai": "มาดูกันว่าวันนี้มีอะไรลดราคา"}
{"word": "find out", "english": "He found out the meeting was online.", "thai": "เขารู้ว่าการประชุมเป็นแบบออนไลน์"}
{"word": "find out", "english": "I need to find out the rules of the game.", "thai": "ฉันต้องหาว่ากฎของเกมคืออะไร"}
{"word": "find out", "english": "Did you find out where the keys are?", "thai": "คุณรู้หรือยังว่ากุญแจอยู่ไหน?"}
{"word": "find out", "english": "She’s trying to find out who called her.", "thai": "เธอกำลังหาว่าใครโทรหาเธอ"}
{"word": "find out", "english": "I just found out the store moved locations.", "thai": "ฉันเพิ่งรู้ว่าร้านย้ายที่ตั้ง"}
{"word": "find out", "english": "Can you find out if the tickets are available?", "thai": "คุณช่วยดูว่าตั๋วยังมีอยู่ไหม?"}
{"word": "find out", "english": "We found out the project is behind schedule.", "thai": "เรารู้ว่าโปรเจกต์ล่าช้า"}
{"word": "find out", "english": "I want to find out what’s in the package.", "thai": "ฉันอยากรู้ว่ามีอะไรในกล่อง"}
{"word": "find out", "english": "He found out his team won the award.", "thai": "เขารู้ว่าทีมของเขาได้รางวัล"}
{"word": "find out", "english": "Let’s find out if the museum is free today.", "thai": "มาดูกันว่าพิพิธภัณฑ์ฟรีวันนี้หรือไม่"}
{"word": "find out", "english": "She found out about the new rules.", "thai": "เธอรู้เกี่ยวกับกฎใหม่"}
{"word": "find out", "english": "I need to find out the password for this account.", "thai": "ฉันต้องหาคำรหัสสำหรับบัญชีนี้"}
{"word": "find out", "english": "Did you find out what time the flight lands?", "thai": "คุณรู้หรือยังว่าเครื่องบินลงกี่โมง?"}
{"word": "find out", "english": "He’s trying to find out who took his laptop.", "thai": "เขากำลังหาว่าใครเอาแล็ปท็อปของเขาไป"}
{"word": "find out", "english": "I just found out the party was postponed.", "thai": "ฉันเพิ่งรู้ว่างานปาร์ตี้ถูกเลื่อน"}
{"word": "find out", "english": "Can you find out if they deliver?", "thai": "คุณช่วยดูว่าพวกเขามีบริการส่งหรือไม่?"}
{"word": "find out", "english": "We found out the concert is outdoors.", "thai": "เรารู้ว่าคอนเสิร์ตจัดกลางแจ้ง"}
{"word": "find out", "english": "I want to find out more about this book.", "thai": "ฉันอยากรู้เพิ่มเติมเกี่ยวกับหนังสือเล่มนี้"}
{"word": "find out", "english": "She found out her package was lost.", "thai": "เธอรู้ว่าพัสดุของเธอหาย"}
{"word": "find out", "english": "Let’s find out what’s wrong with the car.", "thai": "มาดูกันว่ารถมีอะไรผิดปกติ"}
{"word": "find out", "english": "He found out he passed the exam!", "thai": "เขารู้ว่าเขาผ่านสอบแล้ว!"}
{"word": "find out", "english": "I need to find out the score of the game.", "thai": "ฉันต้องหาคะแนนของเกม"}
{"word": "find out", "english": "Did you find out who’s coming to the party?", "thai": "คุณรู้หรือยังว่าใครจะมางานปาร์ตี้?"}
{"word": "find out", "english": "She’s trying to find out where he parked.", "thai": "เธอกำลังหาว่าเขาจอดรถที่ไหน"}
{"word": "find out", "english": "I just found out they’re building a new mall.", "thai": "ฉันเพิ่งรู้ว่าพวกเขากำลังสร้างห้างใหม่"}
{"word": "find out", "english": "Can you find out the price of this phone?", "thai": "คุณช่วยดูราคาของโทรศัพท์นี้ได้ไหม?"}
{"word": "find out", "english": "We found out the show starts at 8 PM.", "thai": "เรารู้ว่ารายการเริ่มตอนสองทุ่ม"}
{"word": "find out", "english": "I want to find out how to apply for this job.", "thai": "ฉันอยากรู้วิธีสมัครงานนี้"}
{"word": "find out", "english": "He found out his bike was stolen.", "thai": "เขารู้ว่าจักรยานของเขาถูกขโมย"}
{"word": "find out", "english": "Let’s find out if the beach is crowded.", "thai": "มาดูกันว่าชายหาดแออัดหรือไม่"}
{"word": "find out", "english": "She found out about the secret meeting.", "thai": "เธอรู้เกี่ยวกับการประชุมลับ"}
{"word": "find out", "english": "I need to find out the location of the event.", "thai": "ฉันต้องหาสถานที่จัดงาน"}
{"word": "find out", "english": "Did you find out what’s for dinner?", "thai": "คุณรู้หรือยังว่ามื้อเย็นกินอะไร?"}
{"word": "find out", "english": "He’s trying to find out why the power’s out.", "thai": "เขากำลังหาว่าทำไมไฟดับ"}
{"word": "find out", "english": "I just found out the store is out of stock.", "thai": "ฉันเพิ่งรู้ว่าร้านหมดสต็อก"}
{"word": "find out", "english": "Can you find out if the library is open?", "thai": "คุณช่วยดูว่าห้องสมุดเปิดหรือไม่?"}
{"word": "find out", "english": "We found out the game was rescheduled.", "thai": "เรารู้ว่าเกมถูกเลื่อน"}
{"word": "find out", "english": "I want to find out who designed this website.", "thai": "ฉันอยากรู้ว่าใครออกแบบเว็บไซต์นี้"}
{"word": "clean up", "english": "I need to clean up the kitchen before dinner.", "thai": "ฉันต้องทำความสะอาดครัวก่อนอาหารเย็น"}
{"word": "clean up", "english": "Can you help me clean up this mess?", "thai": "คุณช่วยฉันทำความสะอาดความยุ่งเหยิงนี้ได้ไหม"}
{"word": "clean up", "english": "Let’s clean up the garage this weekend.", "thai": "มาทำความสะอาดโรงรถสุดสัปดาห์นี้กันเถอะ"}
{"word": "clean up", "english": "The kids need to clean up their toys now.", "thai": "เด็กๆ ต้องเก็บของเล่นให้เรียบร้อยตอนนี้"}
{"word": "clean up", "english": "We should clean up the park after the picnic.", "thai": "เราควรทำความสะอาดสวนสาธารณะหลังปิกนิก"}
{"word": "clean up", "english": "I’ll clean up my room if you stop nagging.", "thai": "ฉันจะทำความสะอาดห้องถ้าคุณหยุดบ่น"}
{"word": "clean up", "english": "They’re trying to clean up the city’s streets.", "thai": "พวกเขากำลังพยายามทำความสะอาดถนนในเมือง"}
{"word": "clean up", "english": "You need to clean up your act, dude.", "thai": "คุณต้องปรับปรุงพฤติกรรมนะเพื่อน"}
{"word": "clean up", "english": "Let’s clean up the spill before it stains.", "thai": "มาทำความสะอาดรอยหกเลอะก่อนมันจะเปื้อน"}
{"word": "clean up", "english": "I’m too tired to clean up tonight.", "thai": "ฉันเหนื่อยเกินไปที่จะทำความสะอาดคืนนี้"}
{"word": "clean up", "english": "The volunteers will clean up the beach tomorrow.", "thai": "อาสาสมัครจะทำความสะอาดชายหาดพรุ่งนี้"}
{"word": "clean up", "english": "Can you clean up the table after we eat?", "thai": "คุณเก็บโต๊ะหลังเรากินข้าวได้ไหม"}
{"word": "clean up", "english": "We need to clean up this project before the deadline.", "thai": "เราต้องจัดการโปรเจกต์นี้ให้เรียบร้อยก่อนกำหนด"}
{"word": "clean up", "english": "He’s trying to clean up his reputation.", "thai": "เขากำลังพยายามฟื้นฟูชื่อเสียงของเขา"}
{"word": "clean up", "english": "Let’s clean up the backyard for the party.", "thai": "มาทำความสะอาดสวนหลังบ้านสำหรับงานปาร์ตี้กัน"}
{"word": "clean up", "english": "I’ll clean up the dog’s mess outside.", "thai": "ฉันจะทำความสะอาดคราบของหมานอกบ้าน"}
{"word": "clean up", "english": "They cleaned up the old house before moving in.", "thai": "พวกเขาทำความสะอาดบ้านเก่าก่อนย้ายเข้า"}
{"word": "clean up", "english": "We need to clean up our finances this year.", "thai": "เราต้องจัดระเบียบการเงินของเราในปีนี้"}
{"word": "clean up", "english": "Can you clean up the paint splatters on the floor?", "thai": "คุณทำความสะอาดรอยสีที่กระเด็นบนพื้นได้ไหม"}
{"word": "clean up", "english": "The team needs to clean up their defense.", "thai": "ทีมต้องปรับปรุงการป้องกันของพวกเขา"}
{"word": "clean up", "english": "I’ll clean up the dishes if you cook.", "thai": "ฉันจะล้างจานถ้าคุณทำอาหาร"}
{"word": "clean up", "english": "Let’s clean up the campsite before we leave.", "thai": "มาทำความสะอาดที่ตั้งแคมป์ก่อนเราจะไป"}
{"word": "clean up", "english": "She’s trying to clean up her diet.", "thai": "เธอกำลังพยายามปรับปรุงการกินของเธอ"}
{"word": "clean up", "english": "We need to clean up this code before release.", "thai": "เราต้องจัดระเบียบโค้ดนี้ก่อนปล่อย"}
{"word": "clean up", "english": "The city hired workers to clean up the graffiti.", "thai": "เมืองจ้างคนงานมาทำความสะอาดรอยกราฟฟิตี้"}
{"word": "clean up", "english": "I need to clean up my desk at work.", "thai": "ฉันต้องทำความสะอาดโต๊ะทำงาน"}
{"word": "clean up", "english": "Let’s clean up the living room for guests.", "thai": "มาทำความสะอาดห้องนั่งเล่นสำหรับแขกกัน"}
{"word": "clean up", "english": "He cleaned up his language after the warning.", "thai": "เขาเริ่มใช้คำพูดสุภาพหลังถูกเตือน"}
{"word": "clean up", "english": "We should clean up the attic this spring.", "thai": "เราควรทำความสะอาดห้องใต้หลังคาฤดูใบไม้ผลินี้"}
{"word": "clean up", "english": "Can you clean up the crumbs on the counter?", "thai": "คุณทำความสะอาดเศษอาหารบนเคาน์เตอร์ได้ไหม"}
{"word": "clean up", "english": "They’re working to clean up the polluted river.", "thai": "พวกเขากำลังทำงานเพื่อทำความสะอาดแม่น้ำที่ปนเปื้อน"}
{"word": "clean up", "english": "I’ll clean up the car before the road trip.", "thai": "ฉันจะทำความสะอาดรถก่อนไปเที่ยว"}
{"word": "clean up", "english": "The company needs to clean up its image.", "thai": "บริษัทต้องปรับปรุงภาพลักษณ์"}
{"word": "clean up", "english": "Let’s clean up the classroom after the project.", "thai": "มาทำความสะอาดห้องเรียนหลังทำโปรเจกต์กัน"}
{"word": "clean up", "english": "I need to clean up my inbox this week.", "thai": "ฉันต้องจัดระเบียบอินบ็อกซ์สัปดาห์นี้"}
{"word": "clean up", "english": "Can you clean up the mud you tracked in?", "thai": "คุณทำความสะอาดโคลนที่คุณเหยียบเข้ามาได้ไหม"}
{"word": "clean up", "english": "We cleaned up the shed last weekend.", "thai": "เราทำความสะอาดโรงเก็บของสุดสัปดาห์ที่แล้ว"}
{"word": "clean up", "english": "She needs to clean up her study habits.", "thai": "เธอต้องปรับปรุงนิสัยการเรียน"}
{"word": "clean up", "english": "Let’s clean up the porch before it rains.", "thai": "มาทำความสะอาดระเบียงก่อนฝนจะตก"}
{"word": "clean up", "english": "They’re trying to clean up corruption in the system.", "thai": "พวกเขากำลังพยายามกำจัดคอร์รัปชันในระบบ"}
{"word": "clean up", "english": "I’ll clean up the bathroom this afternoon.", "thai": "ฉันจะทำความสะอาดห้องน้ำบ่ายนี้"}
{"word": "clean up", "english": "Can you clean up the glitter from the craft project?", "thai": "คุณทำความสะอาดกากเพชรจากงานประดิษฐ์ได้ไหม"}
{"word": "clean up", "english": "We need to clean up the yard after the storm.", "thai": "เราต้องทำความสะอาดสวนหลังพายุ"}
{"word": "clean up", "english": "He cleaned up his credit score over time.", "thai": "เขาแก้ไขคะแนนเครดิตของเขาเมื่อเวลาผ่านไป"}
{"word": "clean up", "english": "Let’s clean up the basement for storage.", "thai": "มาทำความสะอาดชั้นใต้ดินเพื่อเก็บของ"}
{"word": "clean up", "english": "I need to clean up my social media profile.", "thai": "ฉันต้องจัดระเบียบโปรไฟล์โซเชียลมีเดีย"}
{"word": "clean up", "english": "Can you clean up the spilled juice?", "thai": "คุณทำความสะอาดน้ำผลไม้ที่หกได้ไหม"}
{"word": "clean up", "english": "The team cleaned up their strategy for the game.", "thai": "ทีมปรับปรุงกลยุทธ์สำหรับเกม"}
{"word": "clean up", "english": "Let’s clean up the picnic area before dark.", "thai": "มาทำความสะอาดพื้นที่ปิกนิกก่อนมืด"}
{"word": "clean up", "english": "I’ll clean up the cat litter later.", "thai": "ฉันจะทำความสะอาดทรายแมวทีหลัง"}
{"word": "clean up", "english": "We need to clean up the workshop after this.", "thai": "เราต้องทำความสะอาดโรงงานหลังจากนี้"}
{"word": "clean up", "english": "She’s working to clean up her bad habits.", "thai": "เธอกำลังพยายามกำจัดนิสัยไม่ดี"}
{"word": "clean up", "english": "Can you clean up the leaves in the driveway?", "thai": "คุณทำความสะอาดใบไม้ที่ทางรถได้ไหม"}
{"word": "clean up", "english": "They cleaned up the neighborhood after the festival.", "thai": "พวกเขาทำความสะอาดย่านนั้นหลังงานเทศกาล"}
{"word": "clean up", "english": "I need to clean up my schedule for next week.", "thai": "ฉันต้องจัดระเบียบตารางเวลาสัปดาห์หน้า"}
{"word": "clean up", "english": "Let’s clean up the art supplies after class.", "thai": "มาทำความสะอาดอุปกรณ์ศิลปะหลังเรียน"}
{"word": "clean up", "english": "He’s trying to clean up his messy divorce.", "thai": "เขากำลังพยายามจัดการการหย่าร้างที่ยุ่งเหยิง"}
{"word": "clean up", "english": "Can you clean up the dog hair on the couch?", "thai": "คุณทำความสะอาดขนหมาบนโซฟาได้ไหม"}
{"word": "clean up", "english": "We should clean up the hiking trail this month.", "thai": "เราควรทำความสะอาดเส้นทางเดินป่าเดือนนี้"}
{"word": "clean up", "english": "I’ll clean up the patio for the barbecue.", "thai": "ฉันจะทำความสะอาดลานบ้านสำหรับงานบาร์บีคิว"}
{"word": "clean up", "english": "They need to clean up their customer service.", "thai": "พวกเขาต้องปรับปรุงการบริการลูกค้า"}
{"word": "clean up", "english": "Let’s clean up the storage room today.", "thai": "มาทำความสะอาดห้องเก็บของวันนี้กัน"}
{"word": "clean up", "english": "I need to clean up my notes before the exam.", "thai": "ฉันต้องจัดระเบียบโน้ตก่อนสอบ"}
{"word": "clean up", "english": "Can you clean up the marker stains on the board?", "thai": "คุณทำความสะอาดรอยปากกาบนกระดานได้ไหม"}
{"word": "clean up", "english": "We cleaned up the community center last night.", "thai": "เราทำความสะอาดศูนย์ชุมชนเมื่อคืน"}
{"word": "clean up", "english": "She cleaned up her workspace for better focus.", "thai": "เธอทำความสะอาดพื้นที่ทำงานเพื่อสมาธิที่ดีขึ้น"}
{"word": "clean up", "english": "Let’s clean up the garden before winter.", "thai": "มาทำความสะอาดสวนก่อนหน้าหนาว"}
{"word": "clean up", "english": "I’ll clean up the spilled coffee on the rug.", "thai": "ฉันจะทำความสะอาดกาแฟที่หกบนพรม"}
{"word": "clean up", "english": "They’re working to clean up the oil spill.", "thai": "พวกเขากำลังทำงานเพื่อทำความสะอาดคราบน้ำมัน"}
{"word": "clean up", "english": "Can you clean up the confetti after the party?", "thai": "คุณทำความสะอาดเศษกระดาษหลังปาร์ตี้ได้ไหม"}
{"word": "clean up", "english": "We need to clean up the files on the server.", "thai": "เราต้องจัดระเบียบไฟล์บนเซิร์ฟเวอร์"}
{"word": "clean up", "english": "He cleaned up his old habits after therapy.", "thai": "เขาเลิกนิสัยเก่าหลังจากบำบัด"}
{"word": "clean up", "english": "Let’s clean up the playground for the kids.", "thai": "มาทำความสะอาดสนามเด็กเล่นเพื่อเด็กๆ"}
{"word": "clean up", "english": "I’ll clean up the guest room before they arrive.", "thai": "ฉันจะทำความสะอาดห้องพักแขกก่อนพวกเขามา"}
{"word": "clean up", "english": "Can you clean up the grease in the garage?", "thai": "คุณทำความสะอาดคราบน้ำมันในโรงรถได้ไหม"}
{"word": "clean up", "english": "We need to clean up the budget for next quarter.", "thai": "เราต้องจัดระเบียบงบประมาณสำหรับไตรมาสหน้า"}
{"word": "clean up", "english": "They cleaned up the festival grounds yesterday.", "thai": "พวกเขาทำความสะอาดพื้นที่งานเทศกาลเมื่อวาน"}
{"word": "clean up", "english": "I need to clean up my closet this month.", "thai": "ฉันต้องจัดระเบียบตู้เสื้อผ้าเดือนนี้"}
{"word": "clean up", "english": "Let’s clean up the conference room after the meeting.", "thai": "มาทำความสะอาดห้องประชุมหลังการประชุม"}
{"word": "clean up", "english": "She’s trying to clean up her online presence.", "thai": "เธอกำลังพยายามจัดระเบียบการปรากฏตัวออนไลน์"}
{"word": "clean up", "english": "Can you clean up the dirt on the porch?", "thai": "คุณทำความสะอาดคราบสกปรกที่ระเบียงได้ไหม"}
{"word": "clean up", "english": "We cleaned up the old files in the office.", "thai": "เราจัดระเบียบไฟล์เก่าในสำนักงาน"}
{"word": "clean up", "english": "He needs to clean up his communication style.", "thai": "เขาต้องปรับปรุงสไตล์การสื่อสาร"}
{"word": "clean up", "english": "Let’s clean up the sidewalk after the parade.", "thai": "มาทำความสะอาดทางเท้าหลังขบวนพาเหรด"}
{"word": "clean up", "english": "I’ll clean up the pantry before restocking.", "thai": "ฉันจะทำความสะอาดตู้กับข้าวก่อนเติมของ"}
{"word": "clean up", "english": "Can you clean up the chalk on the driveway?", "thai": "คุณทำความสะอาดรอยชอล์กที่ทางรถได้ไหม"}
{"word": "clean up", "english": "We need to clean up the database errors.", "thai": "เราต้องแก้ไขข้อผิดพลาดในฐานข้อมูล"}
{"word": "clean up", "english": "They cleaned up the park after the concert.", "thai": "พวกเขาทำความสะอาดสวนหลังคอนเสิร์ต"}
{"word": "clean up", "english": "I need to clean up my handwriting for the test.", "thai": "ฉันต้องปรับปรุงลายมือสำหรับการสอบ"}
{"word": "clean up", "english": "Let’s clean up the shed for new tools.", "thai": "มาทำความสะอาดโรงเก็บของเพื่อเครื่องมือใหม่"}
{"word": "clean up", "english": "She cleaned up her diet for better health.", "thai": "เธอปรับปรุงการกินเพื่อสุขภาพที่ดีขึ้น"}
{"word": "clean up", "english": "Can you clean up the spilled flour in the kitchen?", "thai": "คุณทำความสะอาดแป้งที่หกในครัวได้ไหม"}
{"word": "clean up", "english": "We should clean up the trail after hiking.", "thai": "เราควรทำความสะอาดเส้นทางหลังเดินป่า"}
{"word": "clean up", "english": "He’s trying to clean up his public image.", "thai": "เขากำลังพยายามปรับปรุงภาพลักษณ์สาธารณะ"}
{"word": "clean up", "english": "Let’s clean up the gym after practice.", "thai": "มาทำความสะอาดยิมหลังซ้อม"}
{"word": "clean up", "english": "I’ll clean up the porch for the event.", "thai": "ฉันจะทำความสะอาดระเบียงสำหรับงาน"}
{"word": "clean up", "english": "Can you clean up the sand from the beach trip?", "thai": "คุณทำความสะอาดทรายจากทริปชายหาดได้ไหม"}
{"word": "clean up", "english": "We need to clean up the contract terms.", "thai": "เราต้องจัดระเบียบเงื่อนไขสัญญา"}
{"word": "clean up", "english": "They cleaned up the lot before building.", "thai": "พวกเขาทำความสะอาดที่ดินก่อนสร้าง"}
{"word": "clean up", "english": "I need to clean up my laptop’s desktop.", "thai": "ฉันต้องจัดระเบียบหน้าเดสก์ท็อปของแล็ปท็อป"}
{"word": "count on", "english": "You can count on me to be there.", "thai": "คุณวางใจได้ว่าฉันจะอยู่ที่นั่น"}
{"word": "count on", "english": "I count on her for good advice.", "thai": "ฉันพึ่งพาเธอเพื่อคำแนะนำที่ดี"}
{"word": "count on", "english": "We can count on John to finish the project.", "thai": "เราวางใจได้ว่า จอห์น จะทำโปรเจกต์ให้เสร็จ"}
{"word": "count on", "english": "Don’t count on getting a raise this year.", "thai": "อย่าคาดหวังว่าจะได้ขึ้นเงินเดือนปีนี้"}
{"word": "count on", "english": "I count on my morning coffee to start the day.", "thai": "ฉันพึ่งพากาแฟตอนเช้าเพื่อเริ่มวัน"}
{"word": "count on", "english": "You can count on the team to deliver.", "thai": "คุณวางใจได้ว่าทีมจะส่งมอบงาน"}
{"word": "count on", "english": "She counts on her friends for support.", "thai": "เธอพึ่งพาเพื่อนเพื่อการสนับสนุน"}
{"word": "count on", "english": "I’m counting on you to keep this secret.", "thai": "ฉันวางใจให้คุณเก็บความลับนี้"}
{"word": "count on", "english": "We can’t count on the weather being good.", "thai": "เราไม่สามารถคาดหวังว่าอากาศจะดี"}
{"word": "count on", "english": "He counts on his dog for companionship.", "thai": "เขาพึ่งพาสุนัขของเขาเพื่อความเป็นเพื่อน"}
{"word": "count on", "english": "You can count on Sarah to plan the party.", "thai": "คุณวางใจได้ว่า ซาร่าห์ จะวางแผนงานปาร์ตี้"}
{"word": "count on", "english": "I count on my alarm to wake me up.", "thai": "ฉันพึ่งพานาฬิกาปลุกเพื่อปลุกฉัน"}
{"word": "count on", "english": "They’re counting on us to show up early.", "thai": "พวกเขาวางใจว่าเราจะไปถึงแต่เช้า"}
{"word": "count on", "english": "Don’t count on him to apologize.", "thai": "อย่าคาดหวังว่าเขาจะขอโทษ"}
{"word": "count on", "english": "We count on this software for our work.", "thai": "เราพึ่งพาซอฟต์แวร์นี้ในการทำงาน"}
{"word": "count on", "english": "You can count on my vote in the meeting.", "thai": "คุณวางใจได้ว่าฉันจะโหวตให้ในการประชุม"}
{"word": "count on", "english": "I count on my family during tough times.", "thai": "ฉันพึ่งพาครอบครัวในช่วงเวลาที่ยากลำบาก"}
{"word": "count on", "english": "She’s counting on a promotion this quarter.", "thai": "เธอกำลังคาดหวังว่าจะได้เลื่อนตำแหน่งไตรมาสนี้"}
{"word": "count on", "english": "You can’t count on public transport here.", "thai": "คุณไม่สามารถพึ่งพาการขนส่งสาธารณะที่นี่ได้"}
{"word": "count on", "english": "He counts on his coach for guidance.", "thai": "เขาพึ่งพาโค้ชเพื่อคำแนะนำ"}
{"word": "count on", "english": "I’m counting on you to fix this mess.", "thai": "ฉันวางใจให้คุณแก้ไขความยุ่งเหยิงนี้"}
{"word": "count on", "english": "We can count on her to bring snacks.", "thai": "เราวางใจได้ว่าเธอจะนำของว่างมา"}
{"word": "count on", "english": "Don’t count on me for math help.", "thai": "อย่าคาดหวังว่าฉันจะช่วยเรื่องคณิตศาสตร์"}
{"word": "count on", "english": "They count on volunteers for the event.", "thai": "พวกเขาพึ่งพาอาสาสมัครสำหรับงานนี้"}
{"word": "count on", "english": "You can count on Tom to be late.", "thai": "คุณวางใจได้ว่า ทอม จะมาสาย"}
{"word": "count on", "english": "I count on my phone for directions.", "thai": "ฉันพึ่งพาโทรศัพท์เพื่อนำทาง"}
{"word": "count on", "english": "She’s counting on her savings for the trip.", "thai": "เธอกำลังพึ่งพาเงินออมสำหรับการเดินทาง"}
{"word": "count on", "english": "We can’t count on his promises anymore.", "thai": "เราไม่สามารถวางใจคำสัญญาของเขาได้อีก"}
{"word": "count on", "english": "He counts on his team to back him up.", "thai": "เขาพึ่งพาทีมเพื่อสนับสนุนเขา"}
{"word": "count on", "english": "You can count on me to drive you home.", "thai": "คุณวางใจได้ว่าฉันจะขับรถไปส่งคุณที่บ้าน"}
{"word": "count on", "english": "I’m counting on a quiet weekend.", "thai": "ฉันคาดหวังว่าจะได้สุดสัปดาห์ที่เงียบสงบ"}
{"word": "count on", "english": "They count on donations to keep running.", "thai": "พวกเขาพึ่งพาการบริจาคเพื่อดำเนินต่อไป"}
{"word": "count on", "english": "Don’t count on her to change her mind.", "thai": "อย่าคาดหวังว่าเธอจะเปลี่ยนใจ"}
{"word": "count on", "english": "We can count on Mike for a good laugh.", "thai": "เราวางใจได้ว่า ไมค์ จะทำให้หัวเราะ"}
{"word": "count on", "english": "I count on my routine to stay focused.", "thai": "ฉันพึ่งพากิจวัตรเพื่อรักษาความ сосредоточиться"}
{"word": "count on", "english": "You can count on Lisa to organize everything.", "thai": "คุณวางใจได้ว่า ลิซ่า จะจัดการทุกอย่าง"}
{"word": "count on", "english": "She counts on her mentor for career advice.", "thai": "เธอพึ่งพาที่ปรึกษาเพื่อคำแนะนำด้านอาชีพ"}
{"word": "count on", "english": "I’m counting on you to bring the cake.", "thai": "ฉันวางใจให้คุณนำเค้กมา"}
{"word": "count on", "english": "We can’t count on the bus being on time.", "thai": "เราไม่สามารถวางใจว่ารถบัสจะมาตรงเวลา"}
{"word": "count on", "english": "He counts on his parents for financial help.", "thai": "เขาพึ่งพาพ่อแม่เพื่อความช่วยเหลือทางการเงิน"}
{"word": "count on", "english": "You can count on us to finish early.", "thai": "คุณวางใจได้ว่าเราจะเสร็จก่อนเวลา"}
{"word": "count on", "english": "I count on my journal to clear my thoughts.", "thai": "ฉันพึ่งพาสมุดบันทึกเพื่อจัดระเบียบความคิด"}
{"word": "count on", "english": "They’re counting on a big turnout tonight.", "thai": "พวกเขาคาดหวังว่าจะมีคนมามากคืนนี้"}
{"word": "count on", "english": "Don’t count on me to sing karaoke.", "thai": "อย่าคาดหวังว่าฉันจะร้องคาราโอเกะ"}
{"word": "count on", "english": "We count on this app for communication.", "thai": "เราพึ่งพาแอปนี้เพื่อการสื่อสาร"}
{"word": "count on", "english": "You can count on him to tell the truth.", "thai": "คุณวางใจได้ว่าเขาจะพูดความจริง"}
{"word": "count on", "english": "I’m counting on a sunny day tomorrow.", "thai": "ฉันคาดหวังว่าพรุ่งนี้จะเป็นวันที่แดดออก"}
{"word": "count on", "english": "She counts on her yoga class to relax.", "thai": "เธอพึ่งพาคลาสโยคะเพื่อผ่อนคลาย"}
{"word": "count on", "english": "We can count on Jane for great ideas.", "thai": "เราวางใจได้ว่า เจน จะมีไอเดียดีๆ"}
{"word": "count on", "english": "Don’t count on the store being open late.", "thai": "อย่าคาดหวังว่าร้านจะเปิดถึงดึก"}
{"word": "count on", "english": "He counts on his brother for backup.", "thai": "เขาพึ่งพาน้องชายเพื่อสนับสนุน"}
{"word": "count on", "english": "You can count on me to proofread it.", "thai": "คุณวางใจได้ว่าฉันจะตรวจทานให้"}
{"word": "count on", "english": "I count on my playlist to stay motivated.", "thai": "ฉันพึ่งพาเพลย์ลิสต์เพื่อรักษาแรงจูงใจ"}
{"word": "count on", "english": "They’re counting on a bonus this year.", "thai": "พวกเขาคาดหวังว่าจะได้โบนัสปีนี้"}
{"word": "count on", "english": "We can’t count on his help anymore.", "thai": "เราไม่สามารถวางใจความช่วยเหลือของเขาได้อีก"}
{"word": "count on", "english": "She counts on her faith in tough times.", "thai": "เธอพึ่งพาความศรัทธาในช่วงเวลาที่ยากลำบาก"}
{"word": "count on", "english": "You can count on me to babysit tonight.", "thai": "คุณวางใจได้ว่าฉันจะเลี้ยงเด็กคืนนี้"}
{"word": "count on", "english": "I’m counting on you to pick me up.", "thai": "ฉันวางใจให้คุณมารับฉัน"}
{"word": "count on", "english": "We count on this vendor for supplies.", "thai": "เราพึ่งพาผู้ค้าสำหรับอุปกรณ์"}
{"word": "count on", "english": "Don’t count on her to be punctual.", "thai": "อย่าคาดหวังว่าเธอจะตรงต่อเวลา"}
{"word": "count on", "english": "He counts on his experience to get the job.", "thai": "เขาพึ่งพาประสบการณ์เพื่อได้งาน"}
{"word": "count on", "english": "You can count on us for the fundraiser.", "thai": "คุณวางใจได้ว่าเราจะช่วยงานระดมทุน"}
{"word": "count on", "english": "I count on my walks to clear my head.", "thai": "ฉันพึ่งพาการเดินเพื่อปลอดโปร่งความคิด"}
{"word": "count on", "english": "They’re counting on a quick recovery.", "thai": "พวกเขาคาดหวังว่าจะฟื้นตัวเร็ว"}
{"word": "count on", "english": "We can count on Alex to lead the meeting.", "thai": "เราวางใจได้ว่า อเล็กซ์ จะนำการประชุม"}
{"word": "count on", "english": "Don’t count on me to cook dinner.", "thai": "อย่าคาดหวังว่าฉันจะทำอาหารเย็น"}
{"word": "count on", "english": "She counts on her fans for support.", "thai": "เธอพึ่งพาแฟนๆ เพื่อการสนับสนุน"}
{"word": "count on", "english": "You can count on him to fix the car.", "thai": "คุณวางใจได้ว่าเขาจะซ่อมรถ"}
{"word": "count on", "english": "I’m counting on a good grade this time.", "thai": "ฉันคาดหวังว่าจะได้เกรดดีครั้งนี้"}
{"word": "count on", "english": "We count on this deal to go through.", "thai": "เราวางใจว่าดีลนี้จะสำเร็จ"}
{"word": "count on", "english": "He counts on his charm to win people over.", "thai": "เขาพึ่งพาเสน่ห์เพื่อชนะใจคน"}
{"word": "count on", "english": "You can count on me to cover the shift.", "thai": "คุณวางใจได้ว่าฉันจะเข้ากะแทน"}
{"word": "count on", "english": "I count on my teammates to have my back.", "thai": "ฉันพึ่งพาเพื่อนร่วมทีมเพื่อสนับสนุนฉัน"}
{"word": "count on", "english": "They’re counting on a big crowd tonight.", "thai": "พวกเขาคาดหวังว่าจะมีฝูงชนจำนวนมากคืนนี้"}
{"word": "count on", "english": "Don’t count on the internet working here.", "thai": "อย่าคาดหวังว่าอินเทอร์เน็ตจะใช้ได้ที่นี่"}
{"word": "count on", "english": "She counts on her routine to stay productive.", "thai": "เธอพึ่งพากิจวัตรเพื่อรักษาความ productive"}
{"word": "count on", "english": "You can count on us to clean up after.", "thai": "คุณวางใจได้ว่าเราจะทำความสะอาดหลังจากนั้น"}
{"word": "count on", "english": "I’m counting on you to make the call.", "thai": "ฉันวางใจให้คุณตัดสินใจ"}
{"word": "count on", "english": "We count on her expertise for this project.", "thai": "เราพึ่งพาความเชี่ยวชาญของเธอสำหรับโปรเจกต์นี้"}
{"word": "count on", "english": "He counts on his luck to get by.", "thai": "เขาพึ่งพาโชคเพื่อผ่านไปได้"}
{"word": "count on", "english": "You can count on me to bring the drinks.", "thai": "คุณวางใจได้ว่าฉันจะนำเครื่องดื่มมา"}
{"word": "count on", "english": "I count on my books to escape stress.", "thai": "ฉันพึ่งพาหนังสือเพื่อหนีความเครียด"}
{"word": "count on", "english": "They’re counting on good reviews for the launch.", "thai": "พวกเขาคาดหวังว่าจะได้รีวิวดีสำหรับการเปิดตัว"}
{"word": "count on", "english": "We can count on her to handle the crisis.", "thai": "เราวางใจได้ว่าเธอจะจัดการวิกฤต"}
{"word": "count on", "english": "Don’t count on him to pay you back soon.", "thai": "อย่าคาดหวังว่าเขาจะคืนเงินให้เร็วๆ นี้"}
{"word": "count on", "english": "She counts on her dog to cheer her up.", "thai": "เธอพึ่งพาสุนัขเพื่อทำให้เธอรู้สึกดีขึ้น"}
{"word": "count on", "english": "You can count on me to be honest.", "thai": "คุณวางใจได้ว่าฉันจะซื่อสัตย์"}
{"word": "count on", "english": "I’m counting on a smooth flight tomorrow.", "thai": "ฉันคาดหวังว่าจะได้บินอย่างราบรื่นพรุ่งนี้"}
{"word": "count on", "english": "We count on this event to boost sales.", "thai": "เราวางใจว่างานนี้จะเพิ่มยอดขาย"}
{"word": "count on", "english": "He counts on his skills to stand out.", "thai": "เขาพึ่งพาทักษะเพื่อโดดเด่น"}
{"word": "count on", "english": "You can count on us to show up on time.", "thai": "คุณวางใจได้ว่าเราจะมาถึงตรงเวลา"}
{"word": "count on", "english": "I count on my coffee to stay awake.", "thai": "ฉันพึ่งพากาแฟเพื่อไม่ให้หลับ"}
{"word": "count on", "english": "They’re counting on her to lead the team.", "thai": "พวกเขาวางใจว่าเธอจะนำทีม"}
{"word": "count on", "english": "Don’t count on the plan going perfectly.", "thai": "อย่าคาดหวังว่าแผนจะสมบูรณ์แบบ"}
{"word": "count on", "english": "She counts on her sister for emotional support.", "thai": "เธอพึ่งพาน้องสาวเพื่อการสนับสนุนทางอารมณ์"}
{"word": "count on", "english": "You can count on me to handle the details.", "thai": "คุณวางใจได้ว่าฉันจะจัดการรายละเอียด"}
{"word": "count on", "english": "I’m counting on you to save me a seat.", "thai": "ฉันวางใจให้คุณจองที่นั่งให้ฉัน"}
{"word": "count on", "english": "We count on our fans to spread the word.", "thai": "เราพึ่งพาแฟนๆ เพื่อเผยแพร่ข่าว"}
{"word": "drop off", "english": "Can you drop off the kids at school?", "thai": "คุณส่งเด็กๆ ที่โรงเรียนได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the package at the post office.", "thai": "ฉันจะทิ้งพัสดุที่ไปรษณีย์"}
{"word": "drop off", "english": "Sales tend to drop off after the holidays.", "thai": "ยอดขายมักจะลดลงหลังวันหยุด"}
{"word": "drop off", "english": "I need to drop off my dry cleaning today.", "thai": "ฉันต้องทิ้งเสื้อผ้าไปซักแห้งวันนี้"}
{"word": "drop off", "english": "She dropped off after staying up late.", "thai": "เธอหลับไปหลังจากนอนดึก"}
{"word": "drop off", "english": "Can you drop off some food for the party?", "thai": "คุณนำอาหารมาทิ้งไว้สำหรับงานปาร์ตี้ได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the keys at your place later.", "thai": "ฉันจะทิ้งกุญแจที่บ้านคุณทีหลัง"}
{"word": "drop off", "english": "The temperature will drop off tonight.", "thai": "อุณหภูมิจะลดลงคืนนี้"}
{"word": "drop off", "english": "He dropped off the map after graduation.", "thai": "เขาหายไปเลยหลังจบการศึกษา"}
{"word": "drop off", "english": "Can you drop me off at the mall?", "thai": "คุณส่งฉันที่ห้างได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the books at the library.", "thai": "ฉันจะทิ้งหนังสือที่ห้องสมุด"}
{"word": "drop off", "english": "Her energy tends to drop off in the afternoon.", "thai": "พลังงานของเธอมักจะลดลงในช่วงบ่าย"}
{"word": "drop off", "english": "We need to drop off the donations tomorrow.", "thai": "เราต้องทิ้งของบริจาคพรุ่งนี้"}
{"word": "drop off", "english": "He dropped off during the boring meeting.", "thai": "เขาหลับไปในระหว่างการประชุมที่น่าเบื่อ"}
{"word": "drop off", "english": "Can you drop off my laptop at the repair shop?", "thai": "คุณนำแล็ปท็อปของฉันไปทิ้งที่ร้านซ่อมได้ไหม"}
{"word": "drop off", "english": "I’ll drop off some clothes at the thrift store.", "thai": "ฉันจะทิ้งเสื้อผ้าที่ร้านมือสอง"}
{"word": "drop off", "english": "The signal drops off in the basement.", "thai": "สัญญาณลดลงในชั้นใต้ดิน"}
{"word": "drop off", "english": "She’ll drop off the paperwork by noon.", "thai": "เธอจะทิ้งเอกสารภายในเที่ยง"}
{"word": "drop off", "english": "I dropped off while watching the movie.", "thai": "ฉันหลับไปขณะดูหนัง"}
{"word": "drop off", "english": "Can you drop me off at the airport?", "thai": "คุณส่งฉันที่สนามบินได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the rent check tomorrow.", "thai": "ฉันจะทิ้งเช็คค่าเช่าพรุ่งนี้"}
{"word": "drop off", "english": "Attendance dropped off after the break.", "thai": "การเข้าร่วมลดลงหลังพัก"}
{"word": "drop off", "english": "He needs to drop off his old furniture.", "thai": "เขาต้องทิ้งเฟอร์นิเจอร์เก่า"}
{"word": "drop off", "english": "She dropped off during the long lecture.", "thai": "เธอหลับไปในระหว่างการบรรยายยาว"}
{"word": "drop off", "english": "Can you drop off the groceries at my house?", "thai": "คุณนำของชำมาทิ้งที่บ้านฉันได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the equipment after practice.", "thai": "ฉันจะทิ้งอุปกรณ์หลังซ้อม"}
{"word": "drop off", "english": "The Wi-Fi signal drops off in the backyard.", "thai": "สัญญาณ Wi-Fi ลดลงในสวนหลังบ้าน"}
{"word": "drop off", "english": "We’ll drop off the supplies at the shelter.", "thai": "เราจะทิ้งเสบียงที่ศูนย์พักพิง"}
{"word": "drop off", "english": "He dropped off after a long day at work.", "thai": "เขาหลับไปหลังจากทำงานมาทั้งวัน"}
{"word": "drop off", "english": "Can you drop me off at the train station?", "thai": "คุณส่งฉันที่สถานีรถไฟได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the forms at the office.", "thai": "ฉันจะทิ้งแบบฟอร์มที่สำนักงาน"}
{"word": "drop off", "english": "Business tends to drop off in January.", "thai": "ธุรกิจมักจะลดลงในเดือนมกราคม"}
{"word": "drop off", "english": "She needs to drop off her old phone.", "thai": "เธอต้องทิ้งโทรศัพท์เครื่องเก่า"}
{"word": "drop off", "english": "I dropped off during the car ride.", "thai": "ฉันหลับไประหว่างนั่งรถ"}
{"word": "drop off", "english": "Can you drop off the tools at the site?", "thai": "คุณนำเครื่องมือไปทิ้งที่หน้างานได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the cake for the party.", "thai": "ฉันจะทิ้งเค้กสำหรับงานปาร์ตี้"}
{"word": "drop off", "english": "The crowd’s energy dropped off after halftime.", "thai": "พลังของฝูงชนลดลงหลังพักครึ่ง"}
{"word": "drop off", "english": "We need to drop off the boxes at storage.", "thai": "เราต้องทิ้งกล่องที่คลังเก็บของ"}
{"word": "drop off", "english": "He dropped off during the late-night call.", "thai": "เขาหลับไประหว่างคุยโทรศัพท์ดึก"}
{"word": "drop off", "english": "Can you drop me off at the gym?", "thai": "คุณส่งฉันที่ยิมได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the invitations tomorrow.", "thai": "ฉันจะทิ้งคำเชิญพรุ่งนี้"}
{"word": "drop off", "english": "Her grades started to drop off this semester.", "thai": "เกรดของเธอเริ่มลดลงในเทอมนี้"}
{"word": "drop off", "english": "We’ll drop off the old toys at the charity.", "thai": "เราจะทิ้งของเล่นเก่าที่มูลนิธิ"}
{"word": "drop off", "english": "I dropped off while reading last night.", "thai": "ฉันหลับไปขณะอ่านเมื่อคืน"}
{"word": "drop off", "english": "Can you drop off the documents at city hall?", "thai": "คุณนำเอกสารไปทิ้งที่ศาลากลางได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the bike at the repair shop.", "thai": "ฉันจะทิ้งจักรยานที่ร้านซ่อม"}
{"word": "drop off", "english": "The battery life drops off after a year.", "thai": "อายุแบตเตอรี่ลดลงหลังจากหนึ่งปี"}
{"word": "drop off", "english": "She needs to drop off her resume in person.", "thai": "เธอต้องทิ้งเรซูเม่ด้วยตัวเอง"}
{"word": "drop off", "english": "He dropped off during the long flight.", "thai": "เขาหลับไประหว่างเที่ยวบินยาว"}
{"word": "drop off", "english": "Can you drop me off at the coffee shop?", "thai": "คุณส่งฉันที่ร้านกาแฟได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the gifts before the party.", "thai": "ฉันจะทิ้งของขวัญก่อนงานปาร์ตี้"}
{"word": "drop off", "english": "Website traffic tends to drop off at night.", "thai": "การเข้าชมเว็บไซต์มักจะลดลงตอนกลางคืน"}
{"word": "drop off", "english": "We need to drop off the equipment at the gym.", "thai": "เราต้องทิ้งอุปกรณ์ที่ยิม"}
{"word": "drop off", "english": "She dropped off after the exhausting day.", "thai": "เธอหลับไปหลังจากวันที่เหนื่อยล้า"}
{"word": "drop off", "english": "Can you drop off the files at the client’s office?", "thai": "คุณนำไฟล์ไปทิ้งที่สำนักงานลูกค้าได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the luggage at the hotel.", "thai": "ฉันจะทิ้งกระเป๋าที่โรงแรม"}
{"word": "drop off", "english": "His performance dropped off after the injury.", "thai": "ผลงานของเขาลดลงหลังบาดเจ็บ"}
{"word": "drop off", "english": "We’ll drop off the food at the shelter.", "thai": "เราจะทิ้งอาหารที่ศูนย์พักพิง"}
{"word": "drop off", "english": "I dropped off during the quiet scene.", "thai": "ฉันหลับไปในฉากที่เงียบ"}
{"word": "drop off", "english": "Can you drop me off at the bus stop?", "thai": "คุณส่งฉันที่ป้ายรถเมล์ได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the payment this afternoon.", "thai": "ฉันจะทิ้งเงินจ่ายบ่ายนี้"}
{"word": "drop off", "english": "The stock price dropped off this week.", "thai": "ราคาหุ้นลดลงสัปดาห์นี้"}
{"word": "drop off", "english": "She needs to drop off her old laptop.", "thai": "เธอต้องทิ้งแล็ปท็อปเครื่องเก่า"}
{"word": "drop off", "english": "He dropped off during the car trip.", "thai": "เขาหลับไประหว่างเดินทางโดยรถ"}
{"word": "drop off", "english": "Can you drop off the supplies at the school?", "thai": "คุณนำเสบียงไปทิ้งที่โรงเรียนได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the contract at the lawyer’s.", "thai": "ฉันจะทิ้งสัญญาที่สำนักงานทนาย"}
{"word": "drop off", "english": "Her enthusiasm dropped off after the setback.", "thai": "ความกระตือรือร้นของเธอลดลงหลังจากความล้มเหลว"}
{"word": "drop off", "english": "We’ll drop off the chairs at the venue.", "thai": "เราจะทิ้งเก้าอี้ที่สถานที่จัดงาน"}
{"word": "drop off", "english": "I dropped off while listening to the podcast.", "thai": "ฉันหลับไปขณะฟังพอดแคสต์"}
{"word": "drop off", "english": "Can you drop me off at the doctor’s office?", "thai": "คุณส่งฉันที่สำนักงานหมอได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the package at the neighbor’s.", "thai": "ฉันจะทิ้งพัสดุที่บ้านเพื่อนบ้าน"}
{"word": "drop off", "english": "The team’s morale dropped off after the loss.", "thai": "ขวัญกำลังใจของทีมลดลงหลังแพ้"}
{"word": "drop off", "english": "We need to drop off the old books at the library.", "thai": "เราต้องทิ้งหนังสือเก่าที่ห้องสมุด"}
{"word": "drop off", "english": "She dropped off during the quiet drive.", "thai": "เธอหลับไประหว่างขับรถเงียบๆ"}
{"word": "drop off", "english": "Can you drop off the papers at the bank?", "thai": "คุณนำเอกสารไปทิ้งที่ธนาคารได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the tools after the project.", "thai": "ฉันจะทิ้งเครื่องมือหลังโปรเจกต์"}
{"word": "drop off", "english": "Sales dropped off during the recession.", "thai": "ยอดขายลดลงในช่วงเศรษฐกิจถดถอย"}
{"word": "drop off", "english": "He needs to drop off his old clothes.", "thai": "เขาต้องทิ้งเสื้อผ้าเก่า"}
{"word": "drop off", "english": "I dropped off during the long sermon.", "thai": "ฉันหลับไประหว่างเทศนานาน"}
{"word": "drop off", "english": "Can you drop me off at the park?", "thai": "คุณส่งฉันที่สวนสาธารณะได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the snacks for the meeting.", "thai": "ฉันจะทิ้งของว่างสำหรับการประชุม"}
{"word": "drop off", "english": "The app’s usage dropped off last month.", "thai": "การใช้งานแอปลดลงเมื่อเดือนที่แล้ว"}
{"word": "drop off", "english": "We’ll drop off the decorations at the hall.", "thai": "เราจะทิ้งของตกแต่งที่หอประชุม"}
{"word": "drop off", "english": "He dropped off after the heavy meal.", "thai": "เขาหลับไปหลังอาหารหนัก"}
{"word": "drop off", "english": "Can you drop off the keys at the office?", "thai": "คุณนำกุญแจไปทิ้งที่สำนักงานได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the kids at soccer practice.", "thai": "ฉันจะส่งเด็กๆ ที่ซ้อมฟุตบอล"}
{"word": "drop off", "english": "Her focus dropped off during the exam.", "thai": "สมาธิของเธอลดลงระหว่างสอบ"}
{"word": "drop off", "english": "We need to drop off the gear at the campsite.", "thai": "เราต้องทิ้งอุปกรณ์ที่แคมป์"}
{"word": "drop off", "english": "I dropped off while waiting for the call.", "thai": "ฉันหลับไปขณะรอสาย"}
{"word": "drop off", "english": "Can you drop me off at the theater?", "thai": "คุณส่งฉันที่โรงละครได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the letter at the mailbox.", "thai": "ฉันจะทิ้งจดหมายที่ตู้จดหมาย"}
{"word": "drop off", "english": "The quality dropped off after the update.", "thai": "คุณภาพลดลงหลังการอัปเดต"}
{"word": "drop off", "english": "She needs to drop off her old shoes.", "thai": "เธอต้องทิ้งรองเท้าเก่า"}
{"word": "drop off", "english": "He dropped off during the train ride.", "thai": "เขาหลับไประหว่างนั่งรถไฟ"}
{"word": "drop off", "english": "Can you drop off the food at the event?", "thai": "คุณนำอาหารไปทิ้งที่งานได้ไหม"}
{"word": "drop off", "english": "I’ll drop off the package at the store.", "thai": "ฉันจะทิ้งพัสดุที่ร้าน"}
{"word": "drop off", "english": "Her interest dropped off after the first class.", "thai": "ความสนใจของเธอลดลงหลังคลาสแรก"}
{"word": "drop off", "english": "We’ll drop off the supplies at the warehouse.", "thai": "เราจะทิ้งเสบียงที่โกดัง"}
{"word": "drop off", "english": "I dropped off during the long presentation.", "thai": "ฉันหลับไประหว่างการนำเสนอนานๆ"}
{"word": "figure out", "english": "I need to figure out how to fix this.", "thai": "ฉันต้องหาวิธีแก้ไขสิ่งนี้"}
{"word": "figure out", "english": "Can you figure out what’s wrong with the car?", "thai": "คุณหาสาเหตุที่รถมีปัญหาได้ไหม"}
{"word": "figure out", "english": "We’ll figure out a plan by tomorrow.", "thai": "เราจะวางแผนให้เรียบร้อยภายในพรุ่งนี้"}
{"word": "figure out", "english": "She’s trying to figure out her next move.", "thai": "เธอกำลังพยายามตัดสินใจก้าวต่อไป"}
{"word": "figure out", "english": "I can’t figure out why it’s not working.", "thai": "ฉันไม่เข้าใจว่าทำไมมันไม่ทำงาน"}
{"word": "figure out", "english": "Let’s figure out where to eat tonight.", "thai": "มาหาที่กินคืนนี้กันเถอะ"}
{"word": "figure out", "english": "He needs to figure out his priorities.", "thai": "เขาต้องจัดลำดับความสำคัญของตัวเอง"}
{"word": "figure out", "english": "I’m trying to figure out this puzzle.", "thai": "ฉันกำลังพยายามแก้ปริศนานี้"}
{"word": "figure out", "english": "Can you figure out the password?", "thai": "คุณเดารหัสผ่านได้ไหม"}
{"word": "figure out", "english": "We need to figure out who’s coming.", "thai": "เราต้องหาว่าใครจะมา"}
{"word": "figure out", "english": "I’ll figure out how to pay for it.", "thai": "ฉันจะหาวิธีจ่ายเงินสำหรับมัน"}
{"word": "figure out", "english": "She figured out the trick to the game.", "thai": "เธอค้นพบเคล็ดลับของเกม"}
{"word": "figure out", "english": "I can’t figure out what he meant.", "thai": "ฉันไม่เข้าใจว่าเขาหมายถึงอะไร"}
{"word": "figure out", "english": "Let’s figure out a budget for the trip.", "thai": "มาทำงบประมาณสำหรับการเดินทางกัน"}
{"word": "figure out", "english": "He’s trying to figure out his career path.", "thai": "เขากำลังพยายามหาเส้นทางอาชีพ"}
{"word": "figure out", "english": "We need to figure out this math problem.", "thai": "เราต้องแก้โจทย์คณิตศาสตร์นี้"}
{"word": "figure out", "english": "Can you figure out how to open this?", "thai": "คุณหาวิธีเปิดสิ่งนี้ได้ไหม"}
{"word": "figure out", "english": "I’m still trying to figure out the rules.", "thai": "ฉันยังพยายามทำความเข้าใจกฎ"}
{"word": "figure out", "english": "They figured out a way to save money.", "thai": "พวกเขาหาวิธีประหยัดเงินได้"}
{"word": "figure out", "english": "I need to figure out what to wear.", "thai": "ฉันต้องตัดสินใจว่าจะใส่อะไร"}
{"word": "figure out", "english": "Can you figure out why it’s so slow?", "thai": "คุณหาสาเหตุว่าทำไมมันช้าได้ไหม"}
{"word": "figure out", "english": "We’ll figure out the schedule later.", "thai": "เราจะจัดตารางเวลาในภายหลัง"}
{"word": "figure out", "english": "She’s trying to figure out her feelings.", "thai": "เธอกำลังพยายามทำความเข้าใจความรู้สึกของตัวเอง"}
{"word": "figure out", "english": "I can’t figure out this new software.", "thai": "ฉันไม่เข้าใจซอฟต์แวร์ใหม่นี้"}
{"word": "figure out", "english": "Let’s figure out how to get there.", "thai": "มาหาวิธีไปที่นั่นกัน"}
{"word": "figure out", "english": "He needs to figure out what went wrong.", "thai": "เขาต้องหาว่าอะไรผิดพลาด"}
{"word": "figure out", "english": "I’m trying to figure out the best route.", "thai": "ฉันกำลังหาเส้นทางที่ดีที่สุด"}
{"word": "figure out", "english": "Can you figure out how to set this up?", "thai": "คุณหาวิธีตั้งค่าสิ่งนี้ได้ไหม"}
{"word": "figure out", "english": "We need to figure out the guest list.", "thai": "เราต้องจัดรายชื่อแขก"}
{"word": "figure out", "english": "I’ll figure out how to make it work.", "thai": "ฉันจะหาวิธีทำให้มันทำงาน"}
{"word": "figure out", "english": "She figured out the answer quickly.", "thai": "เธอหาคำตอบได้อย่างรวดเร็ว"}
{"word": "figure out", "english": "I can’t figure out what’s bothering her.", "thai": "ฉันไม่เข้าใจว่าอะไรทำให้เธอรำคาญ"}
{"word": "figure out", "english": "Let’s figure out a time to meet.", "thai": "มาหาเวลานัดเจอกัน"}
{"word": "figure out", "english": "He’s trying to figure out the instructions.", "thai": "เขากำลังพยายามทำความเข้าใจคำแนะนำ"}
{"word": "figure out", "english": "We need to figure out this code error.", "thai": "เราต้องแก้ข้อผิดพลาดของโค้ดนี้"}
{"word": "figure out", "english": "Can you figure out where we parked?", "thai": "คุณจำได้ไหมว่าเราจอดรถที่ไหน"}
{"word": "figure out", "english": "I’m trying to figure out my taxes.", "thai": "ฉันกำลังพยายามจัดการภาษีของฉัน"}
{"word": "figure out", "english": "They figured out how to hack the system.", "thai": "พวกเขาค้นพบวิธีเจาะระบบ"}
{"word": "figure out", "english": "I need to figure out what to cook.", "thai": "ฉันต้องตัดสินใจว่าจะทำอาหารอะไร"}
{"word": "figure out", "english": "Can you figure out why it’s leaking?", "thai": "คุณหาสาเหตุว่ารั่วได้ไหม"}
{"word": "figure out", "english": "We’ll figure out the details tomorrow.", "thai": "เราจะจัดการรายละเอียดพรุ่งนี้"}
{"word": "figure out", "english": "She’s trying to figure out her new phone.", "thai": "เธอกำลังพยายามเรียนรู้โทรศัพท์ใหม่"}
{"word": "figure out", "english": "I can’t figure out how he did it.", "thai": "ฉันไม่เข้าใจว่าเขาทำได้ยังไง"}
{"word": "figure out", "english": "Let’s figure out who’s bringing what.", "thai": "มาจัดว่าใครจะนำอะไรมาบ้าง"}
{"word": "figure out", "english": "He needs to figure out his next steps.", "thai": "เขาต้องวางแผนก้าวต่อไป"}
{"word": "figure out", "english": "I’m trying to figure out this recipe.", "thai": "ฉันกำลังพยายามทำตามสูตรอาหารนี้"}
{"word": "figure out", "english": "Can you figure out the Wi-Fi password?", "thai": "คุณหาได้ไหมว่ารหัส Wi-Fi คืออะไร"}
{"word": "figure out", "english": "We need to figure out our vacation plans.", "thai": "เราต้องวางแผนวันหยุดของเรา"}
{"word": "figure out", "english": "I’ll figure out how to get tickets.", "thai": "ฉันจะหาวิธีซื้อตั๋ว"}
{"word": "figure out", "english": "She figured out the plot twist early.", "thai": "เธอเดาได้ถึงจุดพลิกผันของเรื่องตั้งแต่แรก"}
{"word": "figure out", "english": "I can’t figure out why she’s upset.", "thai": "ฉันไม่เข้าใจว่าทำไมเธอถึงเสียใจ"}
{"word": "figure out", "english": "Let’s figure out how to split the bill.", "thai": "มาหาวิธีแบ่งบิลกัน"}
{"word": "figure out", "english": "He’s trying to figure out the new system.", "thai": "เขากำลังพยายามเรียนรู้ระบบใหม่"}
{"word": "figure out", "english": "We need to figure out this glitch.", "thai": "เราต้องแก้ไขข้อผิดพลาดนี้"}
{"word": "figure out", "english": "Can you figure out what time it starts?", "thai": "คุณหาได้ไหมว่าเริ่มกี่โมง"}
{"word": "figure out", "english": "I’m trying to figure out my schedule.", "thai": "ฉันกำลังพยายามจัดตารางเวลา"}
{"word": "figure out", "english": "They figured out a solution to the problem.", "thai": "พวกเขาหาคำตอบให้ปัญหาได้"}
{"word": "figure out", "english": "I need to figure out what to say.", "thai": "ฉันต้องคิดว่าจะพูดอะไร"}
{"word": "figure out", "english": "Can you figure out how to reset this?", "thai": "คุณหาวิธีรีเซ็ตสิ่งนี้ได้ไหม"}
{"word": "figure out", "english": "We’ll figure out the logistics later.", "thai": "เราจะจัดการเรื่องการจัดการในภายหลัง"}
{"word": "figure out", "english": "She’s trying to figure out her goals.", "thai": "เธอกำลังพยายามกำหนดเป้าหมาย"}
{"word": "figure out", "english": "I can’t figure out this riddle.", "thai": "ฉันแก้ปริศนานี้ไม่ได้"}
{"word": "figure out", "english": "Let’s figure out where to park.", "thai": "มาหาที่จอดรถกัน"}
{"word": "figure out", "english": "He needs to figure out his finances.", "thai": "เขาต้องจัดการเรื่องการเงิน"}
{"word": "figure out", "english": "I’m trying to figure out the directions.", "thai": "ฉันกำลังพยายามหาทิศทาง"}
{"word": "figure out", "english": "Can you figure out why it crashed?", "thai": "คุณหาสาเหตุที่มันล่มได้ไหม"}
{"word": "figure out", "english": "We need to figure out the team lineup.", "thai": "เราต้องจัดรายชื่อทีม"}
{"word": "figure out", "english": "I’ll figure out how to finish this.", "thai": "ฉันจะหาวิธีทำสิ่งนี้ให้เสร็จ"}
{"word": "figure out", "english": "She figured out how to bypass the issue.", "thai": "เธอหาวิธีหลีกเลี่ยงปัญหาได้"}
{"word": "figure out", "english": "I can’t figure out what’s wrong with it.", "thai": "ฉันไม่เข้าใจว่ามันมีอะไรผิดปกติ"}
{"word": "figure out", "english": "Let’s figure out a gift for her.", "thai": "มาหาของขวัญให้เธอกัน"}
{"word": "figure out", "english": "He’s trying to figure out the contract terms.", "thai": "เขากำลังพยายามทำความเข้าใจเงื่อนไขสัญญา"}
{"word": "figure out", "english": "We need to figure out this puzzle game.", "thai": "เราต้องแก้เกมปริศนานี้"}
{"word": "figure out", "english": "Can you figure out how to install it?", "thai": "คุณหาวิธีติดตั้งมันได้ไหม"}
{"word": "figure out", "english": "I’m trying to figure out my next project.", "thai": "ฉันกำลังพยายามวางแผนโปรเจกต์ต่อไป"}
{"word": "figure out", "english": "They figured out how to cut costs.", "thai": "พวกเขาหาวิธีลดต้นทุนได้"}
{"word": "figure out", "english": "I need to figure out where I went wrong.", "thai": "ฉันต้องหาว่าฉันผิดพลาดตรงไหน"}
{"word": "figure out", "english": "Can you figure out what she wants?", "thai": "คุณเดาได้ไหมว่าเธอต้องการอะไร"}
{"word": "figure out", "english": "We’ll figure out the seating arrangement.", "thai": "เราจะจัดการเรื่องการจัดที่นั่ง"}
{"word": "figure out", "english": "She’s trying to figure out her new job.", "thai": "เธอกำลังพยายามปรับตัวกับงานใหม่"}
{"word": "figure out", "english": "I can’t figure out this new app.", "thai": "ฉันไม่เข้าใจแอปใหม่นี้"}
{"word": "figure out", "english": "Let’s figure out how to divide the work.", "thai": "มาจัดการแบ่งงานกัน"}
{"word": "figure out", "english": "He needs to figure out his study plan.", "thai": "เขาต้องวางแผนการเรียน"}
{"word": "figure out", "english": "I’m trying to figure out the plot.", "thai": "ฉันกำลังพยายามเข้าใจโครงเรื่อง"}
{"word": "figure out", "english": "Can you figure out why it’s delayed?", "thai": "คุณหาสาเหตุที่มันล่าช้าได้ไหม"}
{"word": "figure out", "english": "We need to figure out the event details.", "thai": "เราต้องจัดการรายละเอียดงาน"}
{"word": "figure out", "english": "I’ll figure out how to explain this.", "thai": "ฉันจะหาวิธีอธิบายสิ่งนี้"}
{"word": "figure out", "english": "She figured out the shortcut to work.", "thai": "เธอค้นพบทางลัดไปทำงาน"}
{"word": "figure out", "english": "I can’t figure out what to do next.", "thai": "ฉันไม่รู้ว่าจะทำอะไรต่อไป"}
{"word": "figure out", "english": "Let’s figure out how to fix the leak.", "thai": "มาหาวิธีซ่อมรอยรั่วกัน"}
{"word": "figure out", "english": "He’s trying to figure out his new role.", "thai": "เขากำลังพยายามทำความเข้าใจบทบาทใหม่"}
{"word": "figure out", "english": "We need to figure out this science project.", "thai": "เราต้องแก้โปรเจกต์วิทยาศาสตร์นี้"}
{"word": "figure out", "english": "Can you figure out how to unlock it?", "thai": "คุณหาวิธีปลดล็อกมันได้ไหม"}
{"word": "figure out", "english": "I’m trying to figure out my workout plan.", "thai": "ฉันกำลังวางแผนการออกกำลังกาย"}
{"word": "figure out", "english": "They figured out how to boost sales.", "thai": "พวกเขาหาวิธีเพิ่มยอดขายได้"}
{"word": "figure out", "english": "I need to figure out what to bring.", "thai": "ฉันต้องตัดสินใจว่าจะนำอะไรไป"}
{"word": "figure out", "english": "Can you figure out why it’s so noisy?", "thai": "คุณหาสาเหตุว่าทำไมมันดังได้ไหม"}
{"word": "figure out", "english": "We’ll figure out the menu tonight.", "thai": "เราจะจัดการเมนูคืนนี้"}
{"word": "figure out", "english": "She’s trying to figure out her future.", "thai": "เธอกำลังพยายามวางแผนอนาคต"}
{"word": "figure out", "english": "I can’t figure out this new game.", "thai": "ฉันไม่เข้าใจเกมใหม่นี้"}
{"word": "figure out", "english": "Let’s figure out how to surprise him.", "thai": "มาหาวิธีทำให้เขาประหลาดใจกัน"}
