{"word": "get away", "english": "I need to get away for the weekend.", "thai": "ฉันต้องหนีไปพักผ่อนสุดสัปดาห์นี้"}
{"word": "get away", "english": "How did you get away with that mistake?", "thai": "คุณรอดจากความผิดพลาดนั้นได้ยังไง?"}
{"word": "get away", "english": "Let's get away from the city noise.", "thai": "ไปหนีจากเสียงรบกวนในเมืองกันเถอะ"}
{"word": "get away", "english": "You can't get away from your responsibilities.", "thai": "คุณหนีความรับผิดชอบไม่ได้หรอก"}
{"word": "get away", "english": "The thief tried to get away but was caught.", "thai": "โจรพยายามหนีไปแต่ถูกจับได้"}
{"word": "get away", "english": "We should get away to the beach this summer.", "thai": "เราควรหนีไปเที่ยวชายหาดซัมเมอร์นี้"}
{"word": "get away", "english": "He managed to get away from the paparazzi.", "thai": "เขาสามารถหนีจากปาปารัสซี่ได้"}
{"word": "get away", "english": "I wish I could get away from this stress.", "thai": "ฉันหวังว่าฉันจะหนีจากความเครียดนี้ได้"}
{"word": "get away", "english": "Did you get away for the holidays?", "thai": "คุณหนีไปเที่ยวช่วงวันหยุดหรือเปล่า?"}
{"word": "get away", "english": "She told him to get away from her.", "thai": "เธอบอกให้เขาไปให้พ้นจากเธอ"}
{"word": "get away", "english": "They planned to get away to the mountains.", "thai": "พวกเขาวางแผนหนีไปเที่ยวบนเขา"}
{"word": "get away", "english": "How do you get away with being so late?", "thai": "คุณรอดจากการมาสายขนาดนี้ได้ยังไง?"}
{"word": "get away", "english": "I need to get away from my phone for a bit.", "thai": "ฉันต้องหนีจากโทรศัพท์สักพัก"}
{"word": "get away", "english": "The dog tried to get away from the bath.", "thai": "หมาเผ่นหนีจากการอาบน้ำ"}
{"word": "get away", "english": "We can’t let them get away with this.", "thai": "เราไม่สามารถปล่อยให้พวกเขารอดเรื่องนี้ไปได้"}
{"word": "get away", "english": "Let’s get away for a romantic dinner.", "thai": "ไปหนีไปกินข้าวเย็นสุดโรแมนติกกันเถอะ"}
{"word": "get away", "english": "He couldn’t get away from the meeting.", "thai": "เขาไม่สามารถหนีจากประชุมได้"}
{"word": "get away", "english": "I want to get away from all this drama.", "thai": "ฉันอยากหนีจากดราม่าทั้งหมดนี้"}
{"word": "get away", "english": "They got away with cheating on the test.", "thai": "พวกเขารอดจากการโกงข้อสอบ"}
{"word": "get away", "english": "Can we get away this Friday?", "thai": "เราจะหนีไปได้ไหมวันศุกร์นี้?"}
{"word": "get away", "english": "The kids tried to get away with sneaking out.", "thai": "เด็กๆ พยายามรอดจากการแอบหนีออกไป"}
{"word": "get away", "english": "I just want to get away and clear my head.", "thai": "ฉันแค่อยากหนีไปและทำให้หัวโล่ง"}
{"word": "get away", "english": "She helped him get away from danger.", "thai": "เธอช่วยเขาให้หนีจากอันตราย"}
{"word": "get away", "english": "We need to get away from this toxic environment.", "thai": "เราต้องหนีจากสภาพแวดล้อมที่เป็นพิษนี้"}
{"word": "get away", "english": "How did he get away with lying?", "thai": "เขารอดจากการโกหกได้ยังไง?"}
{"word": "get away", "english": "Let’s get away to a quiet cabin.", "thai": "ไปหนีไปที่กระท่อมเงียบๆ กันเถอะ"}
{"word": "get away", "english": "You won’t get away with ignoring me.", "thai": "คุณหนีจากการเมินฉันไม่ได้หรอก"}
{"word": "get away", "english": "They wanted to get away from the cold weather.", "thai": "พวกเขาอยากหนีจากอากาศหนาว"}
{"word": "get away", "english": "I can’t believe you got away with that prank!", "thai": "ไม่น่าเชื่อว่าคุณรอดจากการแกล้งครั้งนั้นได้!"}
{"word": "get away", "english": "We should get away for a family vacation.", "thai": "เราควรหนีไปพักผ่อนกับครอบครัว"}
{"word": "get away", "english": "The suspect tried to get away in a car.", "thai": "ผู้ต้องสงสัยพยายามหนีไปด้วยรถยนต์"}
{"word": "get away", "english": "I need to get away from this boring routine.", "thai": "ฉันต้องหนีจากกิจวัตรที่น่าเบื่อนี้"}
{"word": "get away", "english": "How do they always get away with breaking rules?", "thai": "ทำไมพวกเขารอดจากการฝ่าฝืนกฎได้ตลอด?"}
{"word": "get away", "english": "Let’s get away to a tropical island.", "thai": "ไปหนีไปเกาะเขตร้อนกันเถอะ"}
{"word": "get away", "english": "He tried to get away from the argument.", "thai": "เขาพยายามหนีจากการโต้เถียง"}
{"word": "get away", "english": "I just want to get away and relax.", "thai": "ฉันแค่อยากหนีไปพักผ่อน"}
{"word": "get away", "english": "They didn’t get away with stealing the money.", "thai": "พวกเขาไม่รอดจากการขโมยเงิน"}
{"word": "get away", "english": "Can we get away for a quick trip?", "thai": "เราจะหนีไปเที่ยวสั้นๆ ได้ไหม?"}
{"word": "get away", "english": "She yelled at the dog to get away.", "thai": "เธอตะโกนให้หมาหนีไป"}
{"word": "get away", "english": "I need to get away from my boss for a while.", "thai": "ฉันต้องหนีจากเจ้านายสักพัก"}
{"word": "get away", "english": "The kids got away with eating extra candy.", "thai": "เด็กๆ รอดจากการกินลูกอมเพิ่ม"}
{"word": "get away", "english": "We should get away to a spa resort.", "thai": "เราควรหนีไปที่รีสอร์ทสปา"}
{"word": "get away", "english": "He couldn’t get away from his past mistakes.", "thai": "เขาไม่สามารถหนีจากความผิดพลาดในอดีตได้"}
{"word": "get away", "english": "Let’s get away before the storm hits.", "thai": "ไปหนีไปก่อนที่พายุจะมา"}
{"word": "get away", "english": "How did you get away from that boring party?", "thai": "คุณหนีจากงานปาร์ตี้ที่น่าเบื่อนั้นได้ยังไง?"}
{"word": "get away", "english": "I want to get away from all the negativity.", "thai": "ฉันอยากหนีจากความคิดลบทั้งหมด"}
{"word": "get away", "english": "They tried to get away with bad behavior.", "thai": "พวกเขาพยายามรอดจากการประพฤติตัวแย่"}
{"word": "get away", "english": "We need to get away for some adventure.", "thai": "เราต้องหนีไปหาการผจญภัย"}
{"word": "get away", "english": "The cat tried to get away from the vet.", "thai": "แมวพยายามหนีจากสัตวแพทย์"}
{"word": "get away", "english": "I can’t get away from work this week.", "thai": "ฉันหนีจากงานไม่ได้สัปดาห์นี้"}
{"word": "get away", "english": "Let’s get away to a cozy bed-and-breakfast.", "thai": "ไปหนีไปที่โรงแรมเล็กๆ สบายๆ กันเถอะ"}
{"word": "get away", "english": "You can’t get away with talking like that.", "thai": "คุณหนีจากการพูดแบบนั้นไม่ได้"}
{"word": "get away", "english": "They planned to get away for their anniversary.", "thai": "พวกเขาวางแผนหนีไปฉลองครบรอบ"}
{"word": "get away", "english": "I need to get away from this crowded place.", "thai": "ฉันต้องหนีจากสถานที่ที่แออัดนี้"}
{"word": "get away", "english": "How did she get away with skipping class?", "thai": "เธอรอดจากการโดดเรียนได้ยังไง?"}
{"word": "get away", "english": "We should get away to a national park.", "thai": "เราควรหนีไปที่อุทยานแห่งชาติ"}
{"word": "get away", "english": "He tried to get away from the awkward situation.", "thai": "เขาพยายามหนีจากสถานการณ์ที่อึดอัด"}
{"word": "get away", "english": "I just want to get away for some peace.", "thai": "ฉันแค่อยากหนีไปหาความสงบ"}
{"word": "get away", "english": "They didn’t get away with breaking the vase.", "thai": "พวกเขาไม่รอดจากการทำแจกันแตก"}
{"word": "get away", "english": "Can we get away to a vineyard this fall?", "thai": "เราจะหนีไปที่ไร่องุ่นฤดูใบไม้ร่วงนี้ได้ไหม?"}
{"word": "get away", "english": "She told the stranger to get away from her car.", "thai": "เธอบอกคนแปลกหน้าให้ไปให้พ้นจากรถของเธอ"}
{"word": "get away", "english": "I need to get away from all these emails.", "thai": "ฉันต้องหนีจากอีเมลทั้งหมดนี้"}
{"word": "get away", "english": "The kids got away with staying up late.", "thai": "เด็กๆ รอดจากการนอนดึก"}
{"word": "get away", "english": "We should get away for a hiking trip.", "thai": "เราควรหนีไปเดินป่า"}
{"word": "get away", "english": "He couldn’t get away from his nosy neighbor.", "thai": "เขาไม่สามารถหนีจากเพื่อนบ้านจอมสอดรู้"}
{"word": "get away", "english": "Let’s get away before it gets too late.", "thai": "ไปหนีไปก่อนที่มันจะดึกเกินไป"}
{"word": "get away", "english": "How did you get away from that speeding ticket?", "thai": "คุณรอดจากใบสั่งขับรถเร็วได้ยังไง?"}
{"word": "get away", "english": "I want to get away from this cold weather.", "thai": "ฉันอยากหนีจากอากาศหนาวนี้"}
{"word": "get away", "english": "They tried to get away with skipping chores.", "thai": "พวกเขาพยายามรอดจากการข้ามงานบ้าน"}
{"word": "get away", "english": "We need to get away for some quality time.", "thai": "เราต้องหนีไปใช้เวลาดีๆ ด้วยกัน"}
{"word": "get away", "english": "The mouse tried to get away from the trap.", "thai": "หนูพยายามหนีจากกับดัก"}
{"word": "get away", "english": "I can’t get away from my family this weekend.", "thai": "ฉันหนีจากครอบครัวไม่ได้สุดสัปดาห์นี้"}
{"word": "get away", "english": "Let’s get away to a lakeside cottage.", "thai": "ไปหนีไปที่กระท่อมริมทะเลสาบกันเถอะ"}
{"word": "get away", "english": "You can’t get away with cheating like that.", "thai": "คุณหนีจากการโกงแบบนั้นไม่ได้"}
{"word": "get away", "english": "They planned to get away for a road trip.", "thai": "พวกเขาวางแผนหนีไปทริปขับรถเที่ยว"}
{"word": "get away", "english": "I need to get away from this noisy office.", "thai": "ฉันต้องหนีจากออฟฟิศที่เสียงดังนี้"}
{"word": "get away", "english": "How did she get away with that excuse?", "thai": "เธอรอดจากข้อแก้ตัวนั้นได้ยังไง?"}
{"word": "get away", "english": "We should get away to a ski resort.", "thai": "เราควรหนีไปที่รีสอร์ทสกี"}
{"word": "get away", "english": "He tried to get away from the boring lecture.", "thai": "เขาพยายามหนีจากเลคเชอร์ที่น่าเบื่อ"}
{"word": "get away", "english": "I just want to get away and read a book.", "thai": "ฉันแค่อยากหนีไปอ่านหนังสือ"}
{"word": "get away", "english": "They didn’t get away with sneaking out.", "thai": "พวกเขาไม่รอดจากการแอบหนีออกไป"}
{"word": "get away", "english": "Can we get away for a weekend cruise?", "thai": "เราจะหนีไปล่องเรือสุดสัปดาห์ได้ไหม?"}
{"word": "get away", "english": "She told the kids to get away from the stove.", "thai": "เธอบอกเด็กๆ ให้ไปให้พ้นจากเตา"}
{"word": "get away", "english": "I need to get away from all this chaos.", "thai": "ฉันต้องหนีจากความโกลาหลนี้"}
{"word": "get away", "english": "The kids got away with drawing on the walls.", "thai": "เด็กๆ รอดจากการขีดเขียนบนผนัง"}
{"word": "get away", "english": "We should get away for a camping trip.", "thai": "เราควรหนีไปแคมปิ้ง"}
{"word": "get away", "english": "He couldn’t get away from his clingy friend.", "thai": "เขาไม่สามารถหนีจากเพื่อนที่ติดหนึบได้"}
{"word": "get away", "english": "Let’s get away before the crowd arrives.", "thai": "ไปหนีไปก่อนที่ฝูงชนจะมา"}
{"word": "get away", "english": "How did you get away with missing the deadline?", "thai": "คุณรอดจากการพลาดกำหนดเวลาได้ยังไง?"}
{"word": "get away", "english": "I want to get away from this rainy weather.", "thai": "ฉันอยากหนีจากอากาศฝนตกนี้"}
{"word": "get away", "english": "They tried to get away with lying to the teacher.", "thai": "พวกเขาพยายามรอดจากการโกหกครู"}
{"word": "get away", "english": "We need to get away for a relaxing getaway.", "thai": "เราต้องหนีไปพักผ่อนแบบชิลๆ"}
{"word": "get away", "english": "The rabbit tried to get away from the fox.", "thai": "กระต่ายพยายามหนีจากจิ้งจอก"}
{"word": "get away", "english": "I can’t get away from my chores today.", "thai": "ฉันหนีจากงานบ้านไม่ได้วันนี้"}
{"word": "get away", "english": "Let’s get away to a historic town.", "thai": "ไปหนีไปที่เมืองเก่าแก่กันเถอะ"}
{"word": "get away", "english": "You can’t get away with being so rude.", "thai": "คุณหนีจากการหยาบคายแบบนั้นไม่ได้"}
{"word": "get away", "english": "They planned to get away for a weekend retreat.", "thai": "พวกเขาวางแผนหนีไปพักผ่อนสุดสัปดาห์"}
{"word": "get away", "english": "I need to get away from this endless noise.", "thai": "ฉันต้องหนีจากเสียงรบกวนไม่รู้จบนี้"}
{"word": "get away", "english": "How did he get away with that bad decision?", "thai": "เขารอดจากตัดสินใจแย่ๆ นั้นได้ยังไง?"}
{"word": "get away", "english": "We should get away to a wellness retreat.", "thai": "เราควรหนีไปที่รีทรีทเพื่อสุขภาพ"}
{"word": "get back", "english": "I’ll get back to you tomorrow.", "thai": "ฉันจะติดต่อกลับไปหาคุณพรุ่งนี้"}
{"word": "get back", "english": "When did you get back from your trip?", "thai": "คุณกลับจากทริปเมื่อไหร่?"}
{"word": "get back", "english": "We need to get back to work now.", "thai": "เราต้องกลับไปทำงานแล้ว"}
{"word": "get back", "english": "Can you get back at him for that prank?", "thai": "คุณจะเอาคืนเขาเรื่องแกล้งครั้งนั้นได้ไหม?"}
{"word": "get back", "english": "I forgot my keys, I need to get back home.", "thai": "ฉันลืมกุญแจ ต้องกลับไปที่บ้าน"}
{"word": "get back", "english": "Let’s get back to the main topic.", "thai": "กลับไปที่หัวข้อหลักกันเถอะ"}
{"word": "get back", "english": "She didn’t get back to me about the plan.", "thai": "เธอไม่ได้ติดต่อกลับมาเรื่องแผน"}
{"word": "get back", "english": "How do we get back to the highway?", "thai": "เราจะกลับไปที่ทางหลวงได้ยังไง?"}
{"word": "get back", "english": "I’ll get back at you for this!", "thai": "ฉันจะเอาคืนคุณแน่!"}
{"word": "get back", "english": "He needs to get back to reality.", "thai": "เขาต้องกลับมาสู่ความจริง"}
{"word": "get back", "english": "Can you get back to the office by noon?", "thai": "คุณจะกลับไปที่ออฟฟิศได้ตอนเที่ยงไหม?"}
{"word": "get back", "english": "I want to get back to my old routine.", "thai": "ฉันอยากกลับไปสู่วิถีชีวิตเก่า"}
{"word": "get back", "english": "She promised to get back with the details.", "thai": "เธอสัญญาจะติดต่อกลับมาพร้อมรายละเอียด"}
{"word": "get back", "english": "We should get back before it gets dark.", "thai": "เราควรกลับก่อนที่มันจะมืด"}
{"word": "get back", "english": "He tried to get back at his rival.", "thai": "เขาพยายามเอาคืนคู่แข่ง"}
{"word": "get back", "english": "I need to get back to studying tonight.", "thai": "ฉันต้องกลับไปอ่านหนังสือคืนนี้"}
{"word": "get back", "english": "Did you get back the money you lent?", "thai": "คุณได้เงินที่ยืมไปคืนหรือยัง?"}
{"word": "get back", "english": "Let’s get back to the game plan.", "thai": "กลับไปที่แผนการเล่นกันเถอะ"}
{"word": "get back", "english": "She didn’t get back from the store yet.", "thai": "เธอยังไม่กลับจากร้าน"}
{"word": "get back", "english": "I’ll get back to you after the meeting.", "thai": "ฉันจะติดต่อกลับไปหลังประชุม"}
{"word": "get back", "english": "He wants to get back to his hometown.", "thai": "เขาอยากกลับไปที่บ้านเกิด"}
{"word": "get back", "english": "Can we get back to normal life soon?", "thai": "เราจะกลับไปใช้ชีวิตปกติได้เร็วๆ นี้ไหม?"}
{"word": "get back", "english": "I need to get back my stolen phone.", "thai": "ฉันต้องเอาคืนโทรศัพท์ที่ถูกขโมย"}
{"word": "get back", "english": "Let’s get back at them for cheating.", "thai": "ไปเอาคืนพวกเขาที่โกงกันเถอะ"}
{"word": "get back", "english": "When will you get back to the city?", "thai": "คุณจะกลับไปเมืองเมื่อไหร่?"}
{"word": "get back", "english": "I’ll get back to the email later.", "thai": "ฉันจะตอบอีเมลกลับทีหลัง"}
{"word": "get back", "english": "He needs to get back on his feet.", "thai": "เขาต้องกลับมายืนหยัดได้อีกครั้ง"}
{"word": "get back", "english": "Can you get back to me by Friday?", "thai": "คุณจะติดต่อกลับมาได้ภายในวันศุกร์ไหม?"}
{"word": "get back", "english": "I want to get back to exercising regularly.", "thai": "ฉันอยากกลับไปออกกำลังกายเป็นประจำ"}
{"word": "get back", "english": "She got back at him with a clever remark.", "thai": "เธอเอาคืนเขาด้วยคำพูดเฉียบคม"}
{"word": "get back", "english": "We need to get back to the hotel soon.", "thai": "เราต้องกลับไปที่โรงแรมเร็วๆ นี้"}
{"word": "get back", "english": "I’ll get back with an answer by tonight.", "thai": "ฉันจะติดต่อกลับพร้อมคำตอบคืนนี้"}
{"word": "get back", "english": "He didn’t get back from work until midnight.", "thai": "เขาไม่กลับจากทำงานจนถึงเที่ยงคืน"}
{"word": "get back", "english": "Let’s get back to planning the party.", "thai": "กลับไปวางแผนงานปาร์ตี้กันเถอะ"}
{"word": "get back", "english": "I need to get back my confidence.", "thai": "ฉันต้องเรียกความมั่นใจคืนมา"}
{"word": "get back", "english": "Can you get back at her for that comment?", "thai": "คุณจะเอาคืนเธอเรื่องคำพูดนั้นได้ไหม?"}
{"word": "get back", "english": "When did they get back from vacation?", "thai": "พวกเขากลับจากวันหยุดเมื่อไหร่?"}
{"word": "get back", "english": "I’ll get back to you with the schedule.", "thai": "ฉันจะติดต่อกลับไปพร้อมตาราง"}
{"word": "get back", "english": "We should get back to the trailhead.", "thai": "เราควรกลับไปที่จุดเริ่มต้นเส้นทาง"}
{"word": "get back", "english": "He wants to get back to his old job.", "thai": "เขาอยากกลับไปทำงานเก่า"}
{"word": "get back", "english": "I need to get back to my book tonight.", "thai": "ฉันต้องกลับไปอ่านหนังสือคืนนี้"}
{"word": "get back", "english": "She got back at her boss with sarcasm.", "thai": "เธอเอาคืนเจ้านายด้วยการประชด"}
{"word": "get back", "english": "Can we get back to the original plan?", "thai": "เราจะกลับไปที่แผนเดิมได้ไหม?"}
{"word": "get back", "english": "I’ll get back to the gym next week.", "thai": "ฉันจะกลับไปยิมสัปดาห์หน้า"}
{"word": "get back", "english": "He didn’t get back to the party in time.", "thai": "เขาไม่กลับไปงานปาร์ตี้ทันเวลา"}
{"word": "get back", "english": "Let’s get back at them for spreading rumors.", "thai": "ไปเอาคืนพวกเขาที่ปล่อยข่าวลือกันเถอะ"}
{"word": "get back", "english": "I need to get back my lost keys.", "thai": "ฉันต้องเอาคืนกุญแจที่หายไป"}
{"word": "get back", "english": "When will you get back to town?", "thai": "คุณจะกลับมาที่เมืองเมื่อไหร่?"}
{"word": "get back", "english": "I’ll get back to you after I check.", "thai": "ฉันจะติดต่อกลับไปหลังจากตรวจสอบ"}
{"word": "get back", "english": "She needs to get back to her studies.", "thai": "เธอต้องกลับไปโฟกัสที่การเรียน"}
{"word": "get back", "english": "Can you get back to the store before it closes?", "thai": "คุณจะกลับไปที่ร้านก่อนมันปิดได้ไหม?"}
{"word": "get back", "english": "I want to get back to painting this weekend.", "thai": "ฉันอยากกลับไปวาดรูปสุดสัปดาห์นี้"}
{"word": "get back", "english": "He got back at his friend with a prank.", "thai": "เขาเอาคืนเพื่อนด้วยการแกล้ง"}
{"word": "get back", "english": "We need to get back to the airport by six.", "thai": "เราต้องกลับไปที่สนามบินก่อนหกโมง"}
{"word": "get back", "english": "I’ll get back with the final decision.", "thai": "ฉันจะติดต่อกลับพร้อมการตัดสินใจสุดท้าย"}
{"word": "get back", "english": "She didn’t get back from the concert yet.", "thai": "เธอยังไม่กลับจากคอนเสิร์ต"}
{"word": "get back", "english": "Let’s get back to finishing this project.", "thai": "กลับไปทำให้โปรเจกต์นี้เสร็จกันเถอะ"}
{"word": "get back", "english": "I need to get back my stolen wallet.", "thai": "ฉันต้องเอาคืนกระเป๋าที่ถูกขโมย"}
{"word": "get back", "english": "Can you get back at them for lying?", "thai": "คุณจะเอาคืนพวกเขาที่โกหกได้ไหม?"}
{"word": "get back", "english": "When did you get back to the office?", "thai": "คุณกลับไปที่ออฟฟิศเมื่อไหร่?"}
{"word": "get back", "english": "I’ll get back to you with the price.", "thai": "ฉันจะติดต่อกลับไปพร้อมราคา"}
{"word": "get back", "english": "He needs to get back to his family.", "thai": "เขาต้องกลับไปหาครอบครัว"}
{"word": "get back", "english": "Can we get back to the old days?", "thai": "เราจะกลับไปวันวานได้ไหม?"}
{"word": "get back", "english": "I want to get back to cooking dinner.", "thai": "ฉันอยากกลับไปทำอาหารเย็น"}
{"word": "get back", "english": "She got back at him for ignoring her.", "thai": "เธอเอาคืนเขาเพราะเขาเมินเธอ"}
{"word": "get back", "english": "We need to get back to the campsite.", "thai": "เราต้องกลับไปที่แคมป์"}
{"word": "get back", "english": "I’ll get back to you after lunch.", "thai": "ฉันจะติดต่อกลับไปหลังอาหารเที่ยง"}
{"word": "get back", "english": "He didn’t get back from the gym yet.", "thai": "เขายังไม่กลับจากยิม"}
{"word": "get back", "english": "Let’s get back to practicing our lines.", "thai": "กลับไปซ้อมบทของเรากันเถอะ"}
{"word": "get back", "english": "I need to get back my borrowed book.", "thai": "ฉันต้องเอาคืนหนังสือที่ยืมมา"}
{"word": "get back", "english": "Can you get back at her for that joke?", "thai": "คุณจะเอาคืนเธอเรื่องมุกนั้นได้ไหม?"}
{"word": "get back", "english": "When will they get back to the hotel?", "thai": "พวกเขาจะกลับไปที่โรงแรมเมื่อไหร่?"}
{"word": "get back", "english": "I’ll get back to you with the results.", "thai": "ฉันจะติดต่อกลับไปพร้อมผลลัพธ์"}
{"word": "get back", "english": "She needs to get back to her workout routine.", "thai": "เธอต้องกลับไปสู่วงจรออกกำลังกาย"}
{"word": "get back", "english": "Can you get back to the house before dinner?", "thai": "คุณจะกลับไปที่บ้านก่อนอาหารเย็นได้ไหม?"}
{"word": "get back", "english": "I want to get back to writing my novel.", "thai": "ฉันอยากกลับไปเขียนนิยาย"}
{"word": "get back", "english": "He got back at his coworker with a witty reply.", "thai": "เขาเอาคืนเพื่อนร่วมงานด้วยคำตอบแสบๆ"}
{"word": "get back", "english": "We need to get back to the meeting room.", "thai": "เราต้องกลับไปที่ห้องประชุม"}
{"word": "get back", "english": "I’ll get back with the updated plan.", "thai": "ฉันจะติดต่อกลับพร้อมแผนที่อัปเดต"}
{"word": "get back", "english": "She didn’t get back from school yet.", "thai": "เธอยังไม่กลับจากโรงเรียน"}
{"word": "get back", "english": "Let’s get back to fixing the car.", "thai": "กลับไปซ่อมรถกันเถอะ"}
{"word": "get back", "english": "I need to get back my old jacket.", "thai": "ฉันต้องเอาคืนแจ็คเก็ตตัวเก่า"}
{"word": "get back", "english": "Can you get back at them for cutting you off?", "thai": "คุณจะเอาคืนพวกที่ตัดหน้าคุณได้ไหม?"}
{"word": "get back", "english": "When did you get back from the beach?", "thai": "คุณกลับจากชายหาดเมื่อไหร่?"}
{"word": "get back", "english": "I’ll get back to you about the invitation.", "thai": "ฉันจะติดต่อกลับไปเรื่องคำเชิญ"}
{"word": "get back", "english": "He needs to get back to his music practice.", "thai": "เขาต้องกลับไปฝึกดนตรี"}
{"word": "get back", "english": "Can we get back to the old schedule?", "thai": "เราจะกลับไปที่ตารางเวลาเก่าได้ไหม?"}
{"word": "get back", "english": "I want to get back to gardening this spring.", "thai": "ฉันอยากกลับไปทำสวนฤดูใบไม้ผลินี้"}
{"word": "get back", "english": "She got back at her ex with a bold move.", "thai": "เธอเอาคืนแฟนเก่าด้วยการเคลื่อนไหวที่กล้าได้กล้าเสีย"}
{"word": "get back", "english": "We need to get back to the train station.", "thai": "เราต้องกลับไปที่สถานีรถไฟ"}
{"word": "get back", "english": "I’ll get back with the final numbers.", "thai": "ฉันจะติดต่อกลับพร้อมตัวเลขสุดท้าย"}
{"word": "get back", "english": "He didn’t get back from the bar yet.", "thai": "เขายังไม่กลับจากบาร์"}
{"word": "get back", "english": "Let’s get back to cleaning the house.", "thai": "กลับไปทำความสะอาดบ้านกันเถอะ"}
{"word": "get back", "english": "I need to get back my confidence at work.", "thai": "ฉันต้องเรียกความมั่นใจในการทำงานคืนมา"}
{"word": "get back", "english": "Can you get back at him for that insult?", "thai": "คุณจะเอาคืนเขาเรื่องการดูถูกนั้นได้ไหม?"}
{"word": "get back", "english": "When will you get back to the apartment?", "thai": "คุณจะกลับไปที่อพาร์ตเมนต์เมื่อไหร่?"}
{"word": "get back", "english": "I’ll get back to you with feedback soon.", "thai": "ฉันจะติดต่อกลับไปพร้อมฟีดแบ็กเร็วๆ นี้"}
{"word": "get back", "english": "She needs to get back to her yoga classes.", "thai": "เธอต้องกลับไปเรียนโยคะ"}
{"word": "get back", "english": "Can you get back to the park before sunset?", "thai": "คุณจะกลับไปที่สวนสาธารณะก่อนพระอาทิตย์ตกได้ไหม?"}
{"word": "get back", "english": "I want to get back to my hobby of knitting.", "thai": "ฉันอยากกลับไปถักนิตติ้งที่เป็นงานอดิเรก"}
{"word": "get by", "english": "I can get by with just a little money.", "thai": "ฉันพออยู่ได้ด้วยเงินนิดหน่อย"}
{"word": "get by", "english": "How do you get by without a car?", "thai": "คุณอยู่ได้ยังไงถ้าไม่มีรถ?"}
{"word": "get by", "english": "We’ll get by somehow this month.", "thai": "เราจะผ่านไปได้ยังไงก็ตามเดือนนี้"}
{"word": "get by", "english": "She managed to get by with basic English.", "thai": "เธอพออยู่ได้ด้วยภาษาอังกฤษพื้นฐาน"}
{"word": "get by", "english": "I need to get by on this tight budget.", "thai": "ฉันต้องผ่านไปให้ได้ด้วยงบจำกัด"}
{"word": "get by", "english": "He’s trying to get by without a job.", "thai": "เขาพยายามอยู่ให้ได้โดยไม่มีงาน"}
{"word": "get by", "english": "Can you get by with one meal a day?", "thai": "คุณจะอยู่ได้ไหมถ้ากินวันละมื้อ?"}
{"word": "get by", "english": "They get by with help from their family.", "thai": "พวกเขาผ่านไปได้ด้วยความช่วยเหลือจากครอบครัว"}
{"word": "get by", "english": "I’ll get by without my phone for a day.", "thai": "ฉันจะอยู่ได้โดยไม่มีโทรศัพท์สักวัน"}
{"word": "get by", "english": "She can get by with minimal effort.", "thai": "เธอผ่านไปได้ด้วยความพยายามน้อยนิด"}
{"word": "get by", "english": "We need to get by until payday.", "thai": "เราต้องผ่านไปให้ได้จนถึงวันเงินเดือน"}
{"word": "get by", "english": "He gets by on his small savings.", "thai": "เขาใช้ชีวิตด้วยเงินออมเพียงเล็กน้อย"}
{"word": "get by", "english": "Can you get by without internet access?", "thai": "คุณอยู่ได้ไหมถ้าไม่มีอินเทอร์เน็ต?"}
{"word": "get by", "english": "I just need to get by this tough week.", "thai": "ฉันแค่ต้องผ่านสัปดาห์ที่ยากลำบากนี้ไป"}
{"word": "get by", "english": "They get by with second-hand clothes.", "thai": "พวกเขาใช้ชีวิตด้วยเสื้อผ้ามือสอง"}
{"word": "get by", "english": "She’s learning to get by in a new city.", "thai": "เธอกำลังเรียนรู้ที่จะใช้ชีวิตในเมืองใหม่"}
{"word": "get by", "english": "I can get by with a few hours of sleep.", "thai": "ฉันพออยู่ได้ด้วยการนอนแค่ไม่กี่ชั่วโมง"}
{"word": "get by", "english": "How do they get by with so little food?", "thai": "พวกเขาอยู่ได้ยังไงด้วยอาหารน้อยขนาดนั้น?"}
{"word": "get by", "english": "We’ll get by without the extra income.", "thai": "เราจะผ่านไปได้โดยไม่มีรายได้พิเศษ"}
{"word": "get by", "english": "He gets by with odd jobs here and there.", "thai": "เขาใช้ชีวิตด้วยงานจรที่นี่นั่น"}
{"word": "get by", "english": "Can you get by with this old laptop?", "thai": "คุณจะใช้ชีวิตได้ไหมด้วยแล็ปท็อปเครื่องเก่านี้?"}
{"word": "get by", "english": "I need to get by this exam somehow.", "thai": "ฉันต้องผ่านการสอบนี้ไปให้ได้"}
{"word": "get by", "english": "She gets by with her part-time job.", "thai": "เธอใช้ชีวิตด้วยงานพาร์ทไทม์"}
{"word": "get by", "english": "We can get by with just the basics.", "thai": "เราพออยู่ได้ด้วยของพื้นฐาน"}
{"word": "get by", "english": "He’s struggling to get by on his own.", "thai": "เขากำลังดิ้นรนเพื่อใช้ชีวิตด้วยตัวเอง"}
{"word": "get by", "english": "I’ll get by without coffee for a day.", "thai": "ฉันจะอยู่ได้โดยไม่มีกาแฟสักวัน"}
{"word": "get by", "english": "They get by with help from friends.", "thai": "พวกเขาผ่านไปได้ด้วยความช่วยเหลือจากเพื่อน"}
{"word": "get by", "english": "Can she get by with limited resources?", "thai": "เธอจะอยู่ได้ไหมด้วยทรัพยากรจำกัด?"}
{"word": "get by", "english": "I just need to get by until next month.", "thai": "ฉันแค่ต้องผ่านไปให้ได้ถึงเดือนหน้า"}
{"word": "get by", "english": "He gets by with his old car.", "thai": "เขาใช้ชีวิตด้วยรถเก่าๆ"}
{"word": "get by", "english": "We’ll get by with what we have.", "thai": "เราจะผ่านไปได้ด้วยสิ่งที่มี"}
{"word": "get by", "english": "She can get by with simple meals.", "thai": "เธอพออยู่ได้ด้วยอาหารง่ายๆ"}
{"word": "get by", "english": "I need to get by this busy season.", "thai": "ฉันต้องผ่านช่วงที่วุ่นวายนี้ไป"}
{"word": "get by", "english": "They get by with public transportation.", "thai": "พวกเขาใช้ชีวิตด้วยขนส่งสาธารณะ"}
{"word": "get by", "english": "Can you get by without your glasses?", "thai": "คุณจะอยู่ได้ไหมถ้าไม่มีแว่น?"}
{"word": "get by", "english": "He’s trying to get by with no support.", "thai": "เขาพยายามใช้ชีวิตโดยไม่มีการสนับสนุน"}
{"word": "get by", "english": "I’ll get by with this old phone.", "thai": "ฉันจะอยู่ได้ด้วยโทรศัพท์เครื่องเก่านี้"}
{"word": "get by", "english": "She gets by with her freelance work.", "thai": "เธอใช้ชีวิตด้วยงานฟรีแลนซ์"}
{"word": "get by", "english": "We need to get by without electricity tonight.", "thai": "เราต้องผ่านคืนนี้ไปโดยไม่มีไฟฟ้า"}
{"word": "get by", "english": "He can get by with basic tools.", "thai": "เขาใช้ชีวิตได้ด้วยเครื่องมือพื้นฐาน"}
{"word": "get by", "english": "I just need to get by this cold weather.", "thai": "ฉันแค่ต้องผ่านอากาศหนาวนี้ไป"}
{"word": "get by", "english": "They get by with their small garden.", "thai": "พวกเขาใช้ชีวิตด้วยสวนเล็กๆ"}
{"word": "get by", "english": "Can you get by with one suitcase?", "thai": "คุณจะอยู่ได้ไหมด้วยกระเป๋าเดินทางใบเดียว?"}
{"word": "get by", "english": "She’s learning to get by in a new job.", "thai": "เธอกำลังเรียนรู้ที่จะใช้ชีวิตในงานใหม่"}
{"word": "get by", "english": "I can get by with a small apartment.", "thai": "ฉันพออยู่ได้ด้วยอพาร์ตเมนต์เล็กๆ"}
{"word": "get by", "english": "How do you get by with so little time?", "thai": "คุณอยู่ได้ยังไงด้วยเวลาน้อยขนาดนั้น?"}
{"word": "get by", "english": "We’ll get by with these old supplies.", "thai": "เราจะผ่านไปได้ด้วยของเก่าๆ เหล่านี้"}
{"word": "get by", "english": "He gets by with his side hustle.", "thai": "เขาใช้ชีวิตด้วยงานเสริม"}
{"word": "get by", "english": "Can you get by without your car keys?", "thai": "คุณจะอยู่ได้ไหมถ้าไม่มีกุญแจรถ?"}
{"word": "get by", "english": "I need to get by this stressful period.", "thai": "ฉันต้องผ่านช่วงที่เครียดนี้ไป"}
{"word": "get by", "english": "She gets by with her cooking skills.", "thai": "เธอใช้ชีวิตด้วยทักษะการทำอาหาร"}
{"word": "get by", "english": "We can get by with hand-me-down furniture.", "thai": "เราพออยู่ได้ด้วยเฟอร์นิเจอร์มือสอง"}
{"word": "get by", "english": "He’s trying to get by with no savings.", "thai": "เขาพยายามใช้ชีวิตโดยไม่มีเงินออม"}
{"word": "get by", "english": "I’ll get by without my usual coffee.", "thai": "ฉันจะอยู่ได้โดยไม่มีกาแฟประจำ"}
{"word": "get by", "english": "They get by with free Wi-Fi spots.", "thai": "พวกเขาใช้ชีวิตด้วยจุดไวไฟฟรี"}
{"word": "get by", "english": "Can she get by with just one outfit?", "thai": "เธอจะอยู่ได้ไหมด้วยชุดเดียว?"}
{"word": "get by", "english": "I just need to get by until the weekend.", "thai": "ฉันแค่ต้องผ่านไปให้ได้ถึงสุดสัปดาห์"}
{"word": "get by", "english": "He gets by with his old bicycle.", "thai": "เขาใช้ชีวิตด้วยจักรยานเก่าๆ"}
{"word": "get by", "english": "We’ll get by without air conditioning.", "thai": "เราจะผ่านไปได้โดยไม่มีเครื่องปรับอากาศ"}
{"word": "get by", "english": "She can get by with basic sewing skills.", "thai": "เธอพออยู่ได้ด้วยทักษะการเย็บผ้าพื้นฐาน"}
{"word": "get by", "english": "I need to get by this tough project.", "thai": "ฉันต้องผ่านโปรเจกต์ที่ยากนี้ไป"}
{"word": "get by", "english": "They get by with shared housing.", "thai": "พวกเขาใช้ชีวิตด้วยการอยู่บ้านร่วมกัน"}
{"word": "get by", "english": "Can you get by without your wallet?", "thai": "คุณจะอยู่ได้ไหมถ้าไม่มีกระเป๋าเงิน?"}
{"word": "get by", "english": "He’s learning to get by in a new country.", "thai": "เขากำลังเรียนรู้ที่จะใช้ชีวิตในประเทศใหม่"}
{"word": "get by", "english": "I can get by with a small backpack.", "thai": "ฉันพออยู่ได้ด้วยเป้ใบเล็ก"}
{"word": "get by", "english": "How do they get by with no electricity?", "thai": "พวกเขาอยู่ได้ยังไงถ้าไม่มีไฟฟ้า?"}
{"word": "get by", "english": "We’ll get by with our old textbooks.", "thai": "เราจะผ่านไปได้ด้วยตำราเก่าๆ"}
{"word": "get by", "english": "She gets by with her tutoring income.", "thai": "เธอใช้ชีวิตด้วยรายได้จากการสอนพิเศษ"}
{"word": "get by", "english": "Can you get by with just one phone?", "thai": "คุณจะอยู่ได้ไหมด้วยโทรศัพท์เครื่องเดียว?"}
{"word": "get by", "english": "I need to get by this rainy season.", "thai": "ฉันต้องผ่านฤดูฝนนี้ไป"}
{"word": "get by", "english": "They get by with homemade meals.", "thai": "พวกเขาใช้ชีวิตด้วยอาหารทำเอง"}
{"word": "get by", "english": "He can get by with his basic skills.", "thai": "เขาใช้ชีวิตได้ด้วยทักษะพื้นฐาน"}
{"word": "get by", "english": "I’ll get by without my usual snacks.", "thai": "ฉันจะอยู่ได้โดยไม่มีขนมประจำ"}
{"word": "get by", "english": "She gets by with her small business.", "thai": "เธอใช้ชีวิตด้วยธุรกิจเล็กๆ"}
{"word": "get by", "english": "We need to get by without hot water.", "thai": "เราต้องผ่านไปได้โดยไม่มีน้ำร้อน"}
{"word": "get by", "english": "Can you get by with a borrowed laptop?", "thai": "คุณจะอยู่ได้ไหมด้วยแล็ปท็อปยืมมา?"}
{"word": "get by", "english": "I just need to get by this hard day.", "thai": "ฉันแค่ต้องผ่านวันที่ยากนี้ไป"}
{"word": "get by", "english": "He gets by with his old guitar.", "thai": "เขาใช้ชีวิตด้วยกีตาร์เก่าๆ"}
{"word": "get by", "english": "We’ll get by with our limited budget.", "thai": "เราจะผ่านไปได้ด้วยงบจำกัด"}
{"word": "get by", "english": "She can get by with her language skills.", "thai": "เธอพออยู่ได้ด้วยทักษะภาษา"}
{"word": "get by", "english": "I need to get by this crowded event.", "thai": "ฉันต้องผ่านงานที่แออัดนี้ไป"}
{"word": "get by", "english": "They get by with community support.", "thai": "พวกเขาใช้ชีวิตด้วยการสนับสนุนจากชุมชน"}
{"word": "get by", "english": "Can you get by without your headphones?", "thai": "คุณจะอยู่ได้ไหมถ้าไม่มีหูฟัง?"}
{"word": "get by", "english": "He’s trying to get by with no income.", "thai": "เขาพยายามใช้ชีวิตโดยไม่มีรายได้"}
{"word": "get by", "english": "I’ll get by with this old jacket.", "thai": "ฉันจะอยู่ได้ด้วยแจ็คเก็ตตัวเก่านี้"}
{"word": "get by", "english": "She gets by with her crafting skills.", "thai": "เธอใช้ชีวิตด้วยทักษะงานฝีมือ"}
{"word": "get by", "english": "We need to get by without a fridge.", "thai": "เราต้องผ่านไปได้โดยไม่มีตู้เย็น"}
{"word": "get by", "english": "Can you get by with a small tent?", "thai": "คุณจะอยู่ได้ไหมด้วยเต็นท์เล็กๆ?"}
{"word": "get by", "english": "I just need to get by this long meeting.", "thai": "ฉันแค่ต้องผ่านการประชุมยาวๆ นี้ไป"}
{"word": "get by", "english": "He gets by with his old shoes.", "thai": "เขาใช้ชีวิตด้วยรองเท้าเก่าๆ"}
{"word": "get by", "english": "We’ll get by with our shared car.", "thai": "เราจะผ่านไปได้ด้วยรถที่ใช้ร่วมกัน"}
{"word": "get by", "english": "She can get by with her basic cooking.", "thai": "เธอพออยู่ได้ด้วยการทำอาหารพื้นฐาน"}
{"word": "get by", "english": "I need to get by this tough semester.", "thai": "ฉันต้องผ่านเทอมที่ยากนี้ไป"}
{"word": "get by", "english": "They get by with donated supplies.", "thai": "พวกเขาใช้ชีวิตด้วยของบริจาค"}
{"word": "get by", "english": "Can you get by without your watch?", "thai": "คุณจะอยู่ได้ไหมถ้าไม่มีนาฬิกา?"}
{"word": "get by", "english": "He’s learning to get by with less.", "thai": "เขากำลังเรียนรู้ที่จะใช้ชีวิตด้วยของน้อยลง"}
{"word": "get by", "english": "I can get by with a small salary.", "thai": "ฉันพออยู่ได้ด้วยเงินเดือนเล็กๆ"}
{"word": "get by", "english": "How do you get by with no savings?", "thai": "คุณอยู่ได้ยังไงถ้าไม่มีเงินออม?"}
{"word": "get by", "english": "We’ll get by with our old furniture.", "thai": "เราจะผ่านไปได้ด้วยเฟอร์นิเจอร์เก่าๆ"}
{"word": "get over", "english": "I need to get over my fear of flying.", "thai": "ฉันต้องเอาชนะความกลัวการบิน"}
{"word": "get over", "english": "How did you get over your breakup?", "thai": "คุณผ่านการเลิกราได้ยังไง?"}
{"word": "get over", "english": "She can’t get over losing her job.", "thai": "เธอทำใจไม่ได้ที่เสียงาน"}
{"word": "get over", "english": "We need to get over this obstacle quickly.", "thai": "เราต้องข้ามอุปสรรคนี้ไปให้เร็ว"}
{"word": "get over", "english": "He finally got over his cold.", "thai": "ในที่สุดเขาก็หายจากหวัด"}
{"word": "get over", "english": "Can you get over that high fence?", "thai": "คุณข้ามรั้วสูงนั้นได้ไหม?"}
{"word": "get over", "english": "I’m trying to get over my shyness.", "thai": "ฉันพยายามเอาชนะความเขินอาย"}
{"word": "get over", "english": "They got over their argument last night.", "thai": "พวกเขาทำใจเรื่องการทะเลาะเมื่อคืนได้แล้ว"}
{"word": "get over", "english": "It’s hard to get over a bad day.", "thai": "มันยากที่จะผ่านวันที่แย่ๆ ไป"}
{"word": "get over", "english": "She needs to get over her stage fright.", "thai": "เธอต้องเอาชนะความกลัวการแสดงบนเวที"}
{"word": "get over", "english": "I can’t get over how fast time flies.", "thai": "ฉันทำใจไม่ได้ว่าเวลาผ่านไปเร็วขนาดไหน"}
{"word": "get over", "english": "He’s struggling to get over his injury.", "thai": "เขากำลังดิ้นรนเพื่อฟื้นจากอาการบาดเจ็บ"}
{"word": "get over", "english": "We need to get over this rough patch.", "thai": "เราต้องผ่านช่วงที่ยากลำบากนี้ไป"}
{"word": "get over", "english": "Can you get over to the other side?", "thai": "คุณข้ามไปอีกฝั่งได้ไหม?"}
{"word": "get over", "english": "She got over her fear of dogs.", "thai": "เธอเอาชนะความกลัวสุนัขได้"}
{"word": "get over", "english": "I’m trying to get over my disappointment.", "thai": "ฉันพยายามทำใจกับความผิดหวัง"}
{"word": "get over", "english": "He can’t get over his ex’s betrayal.", "thai": "เขาทำใจไม่ได้กับการทรยศของแฟนเก่า"}
{"word": "get over", "english": "We’ll get over this financial mess.", "thai": "เราจะผ่านปัญหาการเงินนี้ไป"}
{"word": "get over", "english": "I need to get over this stomach bug.", "thai": "ฉันต้องหายจากอาการป่วยท้อง"}
{"word": "get over", "english": "Can you get over that big puddle?", "thai": "คุณข้ามแอ่งน้ำใหญ่ๆ นั้นได้ไหม?"}
{"word": "get over", "english": "She’s trying to get over her anxiety.", "thai": "เธอกำลังพยายามเอาชนะความกังวล"}
{"word": "get over", "english": "I can’t get over how beautiful this place is.", "thai": "ฉันทำใจไม่ได้ว่าสถานที่นี้สวยขนาดไหน"}
{"word": "get over", "english": "He got over his fear of public speaking.", "thai": "เขาเอาชนะความกลัวการพูดในที่สาธารณะ"}
{"word": "get over", "english": "We need to get over this misunderstanding.", "thai": "เราต้องผ่านความเข้าใจผิดนี้ไป"}
{"word": "get over", "english": "She’s struggling to get over her loss.", "thai": "เธอกำลังดิ้นรนเพื่อทำใจกับการสูญเสีย"}
{"word": "get over", "english": "Can you get over to the meeting on time?", "thai": "คุณไปถึงการประชุมได้ทันเวลาไหม?"}
{"word": "get over", "english": "I need to get over my jet lag.", "thai": "ฉันต้องฟื้นจากอาการเจ็ตแล็ก"}
{"word": "get over", "english": "They got over their rivalry eventually.", "thai": "ในที่สุดพวกเขาก็ผ่านความเป็นคู่แข่งไปได้"}
{"word": "get over", "english": "I can’t get over how cold it is today.", "thai": "ฉันทำใจไม่ได้ว่าวันนี้อากาศหนาวขนาดไหน"}
{"word": "get over", "english": "He’s trying to get over his bad habits.", "thai": "เขาพยายามเอาชนะนิสัยแย่ๆ"}
{"word": "get over", "english": "We need to get over this tough exam.", "thai": "เราต้องผ่านการสอบที่ยากนี้ไป"}
{"word": "get over", "english": "She got over her flu in a week.", "thai": "เธอหายจากไข้หวัดในหนึ่งสัปดาห์"}
{"word": "get over", "english": "Can you get over that fallen tree?", "thai": "คุณข้ามต้นไม้ที่ล้มนั้นได้ไหม?"}
{"word": "get over", "english": "I’m trying to get over my insecurities.", "thai": "ฉันพยายามเอาชนะความไม่มั่นใจ"}
{"word": "get over", "english": "He can’t get over his team’s loss.", "thai": "เขาทำใจไม่ได้ที่ทีมของเขาแพ้"}
{"word": "get over", "english": "We’ll get over this family dispute.", "thai": "เราจะผ่านข้อพิพาทในครอบครัวนี้ไป"}
{"word": "get over", "english": "I need to get over this headache soon.", "thai": "ฉันต้องหายจากอาการปวดหัวนี้เร็วๆ"}
{"word": "get over", "english": "Can you get over to the store before it closes?", "thai": "คุณไปถึงร้านก่อนมันปิดได้ไหม?"}
{"word": "get over", "english": "She got over her fear of heights.", "thai": "เธอเอาชนะความกลัวความสูง"}
{"word": "get over", "english": "I can’t get over how funny that movie was.", "thai": "ฉันทำใจไม่ได้ว่าหนังเรื่องนั้นตลกขนาดไหน"}
{"word": "get over", "english": "He’s struggling to get over his divorce.", "thai": "เขากำลังดิ้นรนเพื่อทำใจกับการหย่า"}
{"word": "get over", "english": "We need to get over this work stress.", "thai": "เราต้องผ่านความเครียดจากงานนี้ไป"}
{"word": "get over", "english": "She’s trying to get over her stage nerves.", "thai": "เธอกำลังพยายามเอาชนะความตื่นเต้นบนเวที"}
{"word": "get over", "english": "I need to get over this bad cold.", "thai": "ฉันต้องหายจากหวัดหนักนี้"}
{"word": "get over", "english": "Can you get over that steep hill?", "thai": "คุณข้ามเนินเขาชันนั้นได้ไหม?"}
{"word": "get over", "english": "They got over their disagreement quickly.", "thai": "พวกเขาผ่านความขัดแย้งได้เร็ว"}
{"word": "get over", "english": "I can’t get over how expensive this is.", "thai": "ฉันทำใจไม่ได้ว่ามันแพงขนาดนี้"}
{"word": "get over", "english": "He’s trying to get over his bad grades.", "thai": "เขาพยายามทำใจกับเกรดแย่ๆ"}
{"word": "get over", "english": "We need to get over this long winter.", "thai": "เราต้องผ่านฤดูหนาวที่ยาวนานนี้ไป"}
{"word": "get over", "english": "She got over her fear of swimming.", "thai": "เธอเอาชนะความกลัวการว่ายน้ำ"}
{"word": "get over", "english": "I’m trying to get over my embarrassment.", "thai": "ฉันพยายามเอาชนะความอาย"}
{"word": "get over", "english": "He can’t get over his missed opportunity.", "thai": "เขาทำใจไม่ได้ที่พลาดโอกาส"}
{"word": "get over", "english": "We’ll get over this project deadline.", "thai": "เราจะผ่านกำหนดเวลาโปรเจกต์นี้ไป"}
{"word": "get over", "english": "I need to get over this sore throat.", "thai": "ฉันต้องหายจากอาการเจ็บคอนี้"}
{"word": "get over", "english": "Can you get over to the party tonight?", "thai": "คุณไปถึงงานปาร์ตี้คืนนี้ได้ไหม?"}
{"word": "get over", "english": "She got over her fear of spiders.", "thai": "เธอเอาชนะความกลัวแมงมุม"}
{"word": "get over", "english": "I can’t get over how cute that puppy is.", "thai": "ฉันทำใจไม่ได้ว่าลูกหมาน่ารักขนาดไหน"}
{"word": "get over", "english": "He’s struggling to get over his failure.", "thai": "เขากำลังดิ้นรนเพื่อทำใจกับความล้มเหลว"}
{"word": "get over", "english": "We need to get over this team conflict.", "thai": "เราต้องผ่านความขัดแย้งในทีมนี้ไป"}
{"word": "get over", "english": "She’s trying to get over her nervousness.", "thai": "เธอกำลังพยายามเอาชนะความประหม่า"}
{"word": "get over", "english": "I need to get over this ankle sprain.", "thai": "ฉันต้องฟื้นจากอาการข้อเท้าแพลง"}
{"word": "get over", "english": "Can you get over that narrow bridge?", "thai": "คุณข้ามสะพานแคบนั้นได้ไหม?"}
{"word": "get over", "english": "They got over their fight in a day.", "thai": "พวกเขาทำใจเรื่องการทะเลาะได้ในหนึ่งวัน"}
{"word": "get over", "english": "I can’t get over how loud this place is.", "thai": "ฉันทำใจไม่ได้ว่าสถานที่นี้ดังขนาดไหน"}
{"word": "get over", "english": "He’s trying to get over his laziness.", "thai": "เขาพยายามเอาชนะความขี้เกียจ"}
{"word": "get over", "english": "We need to get over this bad weather.", "thai": "เราต้องผ่านสภาพอากาศแย่ๆ นี้ไป"}
{"word": "get over", "english": "She got over her fear of needles.", "thai": "เธอเอาชนะความกลัวเข็ม"}
{"word": "get over", "english": "I’m trying to get over my frustration.", "thai": "ฉันพยายามเอาชนะความหงุดหงิด"}
{"word": "get over", "english": "He can’t get over his friend’s betrayal.", "thai": "เขาทำใจไม่ได้ที่เพื่อนทรยศ"}
{"word": "get over", "english": "We’ll get over this tough competition.", "thai": "เราจะผ่านการแข่งขันที่ยากนี้ไป"}
{"word": "get over", "english": "I need to get over this back pain.", "thai": "ฉันต้องฟื้นจากอาการปวดหลังนี้"}
{"word": "get over", "english": "Can you get over to the office by noon?", "thai": "คุณไปถึงออฟฟิศได้ตอนเที่ยงไหม?"}
{"word": "get over", "english": "She got over her fear of the dark.", "thai": "เธอเอาชนะความกลัวความมืด"}
{"word": "get over", "english": "I can’t get over how amazing that concert was.", "thai": "ฉันทำใจไม่ได้ว่าคอนเสิร์ตนั้นเจ๋งขนาดไหน"}
{"word": "get over", "english": "He’s struggling to get over his rejection.", "thai": "เขากำลังดิ้นรนเพื่อทำใจกับการถูกปฏิเสธ"}
{"word": "get over", "english": "We need to get over this budget crisis.", "thai": "เราต้องผ่านวิกฤตงบประมาณนี้ไป"}
{"word": "get over", "english": "She’s trying to get over her self-doubt.", "thai": "เธอกำลังพยายามเอาชนะความสงสัยในตัวเอง"}
{"word": "get over", "english": "I need to get over this fever soon.", "thai": "ฉันต้องหายจากไข้เร็วๆ นี้"}
{"word": "get over", "english": "Can you get over that muddy path?", "thai": "คุณข้ามทางโคลนนั้นได้ไหม?"}
{"word": "get over", "english": "They got over their grudge eventually.", "thai": "ในที่สุดพวกเขาก็ปล่อยวางความแค้น"}
{"word": "get over", "english": "I can’t get over how tasty this food is.", "thai": "ฉันทำใจไม่ได้ว่าอาหารนี้อร่อยขนาดไหน"}
{"word": "get over", "english": "He’s trying to get over his anger issues.", "thai": "เขาพยายามเอาชนะปัญหาความโกรธ"}
{"word": "get over", "english": "We need to get over this long commute.", "thai": "เราต้องผ่านการเดินทางไกลนี้ไป"}
{"word": "get over", "english": "She got over her fear of crowds.", "thai": "เธอเอาชนะความกลัวฝูงชน"}
{"word": "get over", "english": "I’m trying to get over my sadness.", "thai": "ฉันพยายามเอาชนะความเศร้า"}
{"word": "get over", "english": "He can’t get over his team’s defeat.", "thai": "เขาทำใจไม่ได้ที่ทีมของเขาแพ้"}
{"word": "get over", "english": "We’ll get over this tight schedule.", "thai": "เราจะผ่านตารางเวลาที่แน่นนี้ไป"}
{"word": "get over", "english": "I need to get over this cough soon.", "thai": "ฉันต้องหายจากอาการไอนี้เร็วๆ"}
{"word": "get over", "english": "Can you get over to the park by five?", "thai": "คุณไปถึงสวนสาธารณะได้ตอนห้าโมงไหม?"}
{"word": "get over", "english": "She got over her fear of flying solo.", "thai": "เธอเอาชนะความกลัวการบินคนเดียว"}
{"word": "get over", "english": "I can’t get over how stunning that view is.", "thai": "ฉันทำใจไม่ได้ว่าวิวนี้สวยงามขนาดไหน"}
{"word": "get over", "english": "He’s struggling to get over his guilt.", "thai": "เขากำลังดิ้นรนเพื่อทำใจกับความรู้สึกผิด"}
{"word": "get over", "english": "We need to get over this team setback.", "thai": "เราต้องผ่านความพ่ายแพ้ของทีมนี้ไป"}
{"word": "get over", "english": "She’s trying to get over her stage jitters.", "thai": "เธอกำลังพยายามเอาชนะความตื่นเต้นบนเวที"}
{"word": "get over", "english": "I need to get over this knee injury.", "thai": "ฉันต้องฟื้นจากอาการบาดเจ็บที่เข่า"}
{"word": "get over", "english": "Can you get over that low wall?", "thai": "คุณข้ามกำแพงเตี้ยนั้นได้ไหม?"}
{"word": "get over", "english": "They got over their feud last week.", "thai": "พวกเขาทำใจเรื่องความบาดหมางได้เมื่อสัปดาห์ที่แล้ว"}
{"word": "get over", "english": "I can’t get over how quick that was.", "thai": "ฉันทำใจไม่ได้ว่ามันเร็วขนาดนั้น"}
{"word": "get over", "english": "He’s trying to get over his bad mood.", "thai": "เขาพยายามเอาชนะอารมณ์แย่ๆ"}
{"word": "get up", "english": "I need to get up early tomorrow.", "thai": "ฉันต้องตื่นเช้าพรุ่งนี้"}
{"word": "get up", "english": "Why can’t you get up on time?", "thai": "ทำไมคุณตื่นตรงเวลาไม่ได้?"}
{"word": "get up", "english": "She got up to answer the door.", "thai": "เธอลุกไปเปิดประตู"}
{"word": "get up", "english": "We should get up and start the day.", "thai": "เราควรลุกขึ้นมาเริ่มวันใหม่"}
{"word": "get up", "english": "He gets up at six every morning.", "thai": "เขาตื่นหกโมงทุกเช้า"}
{"word": "get up", "english": "Can you get up from that chair?", "thai": "คุณลุกจากเก้าอี้ตัวนั้นได้ไหม?"}
{"word": "get up", "english": "I’m too tired to get up now.", "thai": "ฉันเหนื่อยเกินกว่าจะลุกตอนนี้"}
{"word": "get up", "english": "They got up to cheer for the team.", "thai": "พวกเขาลุกขึ้นมาเชียร์ทีม"}
{"word": "get up", "english": "Get up, we’re late for school!", "thai": "ตื่นสิ เราไปโรงเรียนสายแล้ว!"}
{"word": "get up", "english": "She needs to get up for work soon.", "thai": "เธอต้องตื่นไปทำงานเร็วๆ นี้"}
{"word": "get up", "english": "I can’t get up after that workout.", "thai": "ฉันลุกไม่ไหวหลังออกกำลังกาย"}
{"word": "get up", "english": "He got up to grab some water.", "thai": "เขาลุกไปหยิบน้ำ"}
{"word": "get up", "english": "We get up early on weekends too.", "thai": "เราตื่นเช้าในวันหยุดด้วย"}
{"word": "get up", "english": "Can you get up and help me?", "thai": "คุณลุกขึ้นมาช่วยฉันได้ไหม?"}
{"word": "get up", "english": "She got up to give her speech.", "thai": "เธอลุกขึ้นไปกล่าวสุนทรพจน์"}
{"word": "get up", "english": "I need to get up and clean the house.", "thai": "ฉันต้องลุกขึ้นมาทำความสะอาดบ้าน"}
{"word": "get up", "english": "He’s too lazy to get up today.", "thai": "เขาขี้เกียจเกินกว่าจะตื่นวันนี้"}
{"word": "get up", "english": "They got up to dance at the party.", "thai": "พวกเขาลุกขึ้นมาเต้นในงานปาร์ตี้"}
{"word": "get up", "english": "Get up, the movie’s about to start!", "thai": "ตื่นสิ หนังกำลังจะเริ่มแล้ว!"}
{"word": "get up", "english": "She gets up before dawn to jog.", "thai": "เธอตื่นก่อนรุ่งสางเพื่อไปวิ่ง"}
{"word": "get up", "english": "I can’t get up, my back hurts.", "thai": "ฉันลุกไม่ไหว ปวดหลัง"}
{"word": "get up", "english": "He got up to turn off the light.", "thai": "เขาลุกไปปิดไฟ"}
{"word": "get up", "english": "We need to get up for the meeting.", "thai": "เราต้องตื่นไปประชุม"}
{"word": "get up", "english": "Can you get up and grab the phone?", "thai": "คุณลุกไปหยิบโทรศัพท์ได้ไหม?"}
{"word": "get up", "english": "She got up to feed the baby.", "thai": "เธอลุกไปป้อนนมลูก"}
{"word": "get up", "english": "I’m trying to get up earlier these days.", "thai": "ฉันพยายามตื่นเช้าขึ้นช่วงนี้"}
{"word": "get up", "english": "He gets up to make coffee every day.", "thai": "เขาตื่นมาชงกาแฟทุกวัน"}
{"word": "get up", "english": "They got up to catch the sunrise.", "thai": "พวกเขาตื่นไปดูพระอาทิตย์ขึ้น"}
{"word": "get up", "english": "Get up, we’re going hiking!", "thai": "ตื่นสิ เราไปเดินป่ากัน!"}
{"word": "get up", "english": "She needs to get up for her flight.", "thai": "เธอต้องตื่นเพื่อขึ้นเครื่องบิน"}
{"word": "get up", "english": "I can’t get up, I’m too sore.", "thai": "ฉันลุกไม่ไหว ตัวเจ็บไปหมด"}
{"word": "get up", "english": "He got up to check the noise outside.", "thai": "เขาลุกไปดูเสียงดังข้างนอก"}
{"word": "get up", "english": "We get up late on Sundays.", "thai": "เราตื่นสายในวันอาทิตย์"}
{"word": "get up", "english": "Can you get up and close the window?", "thai": "คุณลุกไปปิดหน้าต่างได้ไหม?"}
{"word": "get up", "english": "She got up to start breakfast.", "thai": "เธอลุกไปเริ่มทำอาหารเช้า"}
{"word": "get up", "english": "I need to get up and study tonight.", "thai": "ฉันต้องลุกขึ้นมาอ่านหนังสือคืนนี้"}
{"word": "get up", "english": "He’s too tired to get up early.", "thai": "เขาเหนื่อยเกินกว่าจะตื่นเช้า"}
{"word": "get up", "english": "They got up to clap for the performer.", "thai": "พวกเขาลุกขึ้นมาปรบมือให้ผู้แสดง"}
{"word": "get up", "english": "Get up, the bus is here!", "thai": "ตื่นสิ รถบัสมาแล้ว!"}
{"word": "get up", "english": "She gets up to walk the dog daily.", "thai": "เธอตื่นมาพาสุนัขไปเดินทุกวัน"}
{"word": "get up", "english": "I can’t get up, my leg’s asleep.", "thai": "ฉันลุกไม่ไหว ขาชา"}
{"word": "get up", "english": "He got up to get his jacket.", "thai": "เขาลุกไปหยิบแจ็คเก็ต"}
{"word": "get up", "english": "We need to get up for the road trip.", "thai": "เราต้องตื่นไปทริปขับรถ"}
{"word": "get up", "english": "Can you get up and turn on the TV?", "thai": "คุณลุกไปเปิดทีวีได้ไหม?"}
{"word": "get up", "english": "She got up to greet her guests.", "thai": "เธอลุกไปต้อนรับแขก"}
{"word": "get up", "english": "I’m trying to get up at five tomorrow.", "thai": "ฉันพยายามตื่นห้าโมงพรุ่งนี้"}
{"word": "get up", "english": "He gets up to meditate every morning.", "thai": "เขาตื่นมานั่งสมาธิทุกเช้า"}
{"word": "get up", "english": "They got up to join the protest.", "thai": "พวกเขาลุกขึ้นไปร่วมประท้วง"}
{"word": "get up", "english": "Get up, we’re missing the game!", "thai": "ตื่นสิ เราพลาดเกมแล้ว!"}
{"word": "get up", "english": "She needs to get up for her class.", "thai": "เธอต้องตื่นไปเรียน"}
{"word": "get up", "english": "I can’t get up, I’m too comfy.", "thai": "ฉันลุกไม่ไหว สบายเกินไป"}
{"word": "get up", "english": "He got up to answer the phone.", "thai": "เขาลุกไปรับโทรศัพท์"}
{"word": "get up", "english": "We get up early for the farmers’ market.", "thai": "เราตื่นเช้าเพื่อไปตลาดเกษตรกร"}
{"word": "get up", "english": "Can you get up and lock the door?", "thai": "คุณลุกไปล็อกประตูได้ไหม?"}
{"word": "get up", "english": "She got up to make some tea.", "thai": "เธอลุกไปชงชา"}
{"word": "get up", "english": "I need to get up and finish my homework.", "thai": "ฉันต้องลุกขึ้นมาทำการบ้านให้เสร็จ"}
{"word": "get up", "english": "He’s too groggy to get up now.", "thai": "เขางัวเงียเกินกว่าจะตื่นตอนนี้"}
{"word": "get up", "english": "They got up to sing at the event.", "thai": "พวกเขาลุกขึ้นไปร้องเพลงในงาน"}
{"word": "get up", "english": "Get up, the alarm’s been ringing!", "thai": "ตื่นสิ นาฬิกาปลุกดังแล้ว!"}
{"word": "get up", "english": "She gets up to do yoga every day.", "thai": "เธอตื่นมาทำโยคะทุกวัน"}
{"word": "get up", "english": "I can’t get up, I’m stuck in bed.", "thai": "ฉันลุกไม่ไหว ติดอยู่บนเตียง"}
{"word": "get up", "english": "He got up to check the mail.", "thai": "เขาลุกไปเช็คจดหมาย"}
{"word": "get up", "english": "We need to get up for the picnic.", "thai": "เราต้องตื่นไปปิกนิก"}
{"word": "get up", "english": "Can you get up and grab the remote?", "thai": "คุณลุกไปหยิบรีโมตได้ไหม?"}
{"word": "get up", "english": "She got up to water the plants.", "thai": "เธอลุกไปรดน้ำต้นไม้"}
{"word": "get up", "english": "I’m trying to get up before sunrise.", "thai": "ฉันพยายามตื่นก่อนพระอาทิตย์ขึ้น"}
{"word": "get up", "english": "He gets up to read the news daily.", "thai": "เขาตื่นมาอ่านข่าวทุกวัน"}
{"word": "get up", "english": "They got up to watch the parade.", "thai": "พวกเขาตื่นไปดูขบวนพาเหรด"}
{"word": "get up", "english": "Get up, we’re going to the beach!", "thai": "ตื่นสิ เราไปชายหาดกัน!"}
{"word": "get up", "english": "She needs to get up for her exam.", "thai": "เธอต้องตื่นไปสอบ"}
{"word": "get up", "english": "I can’t get up, my ankle’s sore.", "thai": "ฉันลุกไม่ไหว ข้อเท้าเจ็บ"}
{"word": "get up", "english": "He got up to fix the broken lamp.", "thai": "เขาลุกไปซ่อมโคมไฟที่เสีย"}
{"word": "get up", "english": "We get up early for family breakfast.", "thai": "เราตื่นเช้าเพื่อกินอาหารเช้ากับครอบครัว"}
{"word": "get up", "english": "Can you get up and open the gate?", "thai": "คุณลุกไปเปิดประตูรั้วได้ไหม?"}
{"word": "get up", "english": "She got up to start the laundry.", "thai": "เธอลุกไปเริ่มซักผ้า"}
{"word": "get up", "english": "I need to get up and pack my bag.", "thai": "ฉันต้องลุกขึ้นมาเก็บกระเป๋า"}
{"word": "get up", "english": "He’s too sleepy to get up yet.", "thai": "เขาง่วงเกินกว่าจะตื่นตอนนี้"}
{"word": "get up", "english": "They got up to join the race.", "thai": "พวกเขาลุกขึ้นไปร่วมการแข่งขัน"}
{"word": "get up", "english": "Get up, the delivery guy’s here!", "thai": "ตื่นสิ คนส่งของมาแล้ว!"}
{"word": "get up", "english": "She gets up to bake every weekend.", "thai": "เธอตื่นมาอบขนมทุกสุดสัปดาห์"}
{"word": "get up", "english": "I can’t get up, I’m too relaxed.", "thai": "ฉันลุกไม่ไหว ผ่อนคลายเกินไป"}
{"word": "get up", "english": "He got up to let the dog out.", "thai": "เขาลุกไปปล่อยสุนัขออกไป"}
{"word": "get up", "english": "We need to get up for the camping trip.", "thai": "เราต้องตื่นไปแคมปิ้ง"}
{"word": "get up", "english": "Can you get up and check the stove?", "thai": "คุณลุกไปเช็คเตาได้ไหม?"}
{"word": "get up", "english": "She got up to practice her lines.", "thai": "เธอลุกไปซ้อมบท"}
{"word": "get up", "english": "I’m trying to get up at seven daily.", "thai": "ฉันพยายามตื่นเจ็ดโมงทุกวัน"}
{"word": "get up", "english": "He gets up to feed the chickens.", "thai": "เขาตื่นไปให้อาหารไก่"}
{"word": "get up", "english": "They got up to see the fireworks.", "thai": "พวกเขาตื่นไปดูดอกไม้ไฟ"}
{"word": "get up", "english": "Get up, we’re going shopping!", "thai": "ตื่นสิ เราไปช็อปปิ้งกัน!"}
{"word": "get up", "english": "She needs to get up for her shift.", "thai": "เธอต้องตื่นไปทำงานกะ"}
{"word": "get up", "english": "I can’t get up, my head’s spinning.", "thai": "ฉันลุกไม่ไหว หัวหมุน"}
{"word": "get up", "english": "He got up to check the thermostat.", "thai": "เขาลุกไปเช็คเครื่องควบคุมอุณหภูมิ"}
{"word": "get up", "english": "We get up early for the festival.", "thai": "เราตื่นเช้าเพื่อไปงานเทศกาล"}
{"word": "get up", "english": "Can you get up and feed the cat?", "thai": "คุณลุกไปให้อาหารแมวได้ไหม?"}
{"word": "get up", "english": "She got up to tidy the room.", "thai": "เธอลุกไปจัดห้อง"}
{"word": "get up", "english": "I need to get up and catch the bus.", "thai": "ฉันต้องตื่นไปขึ้นรถบัส"}
{"word": "get up", "english": "He’s too cozy to get up now.", "thai": "เขาสบายเกินกว่าจะตื่นตอนนี้"}
{"word": "get up", "english": "They got up to wave at the parade.", "thai": "พวกเขาลุกขึ้นมาโบกมือให้ขบวนพาเหรด"}
{"word": "get up", "english": "Get up, the sun’s already out!", "thai": "ตื่นสิ พระอาทิตย์ขึ้นแล้ว!"}
{"word": "give away", "english": "I want to give away my old clothes.", "thai": "ฉันอยากบริจาคเสื้อผ้าเก่า"}
{"word": "give away", "english": "Don’t give away the surprise party!", "thai": "อย่าเผลอบอกเรื่องงานเลี้ยงเซอร์ไพรส์!"}
{"word": "give away", "english": "They’re giving away free samples at the store.", "thai": "พวกเขากำลังแจกตัวอย่างฟรีที่ร้าน"}
{"word": "give away", "english": "She gave away her secret by mistake.", "thai": "เธอเผลอบอกความลับโดยไม่ได้ตั้งใจ"}
{"word": "give away", "english": "We should give away these extra tickets.", "thai": "เราควรแจกตั๋วส่วนเกินเหล่านี้"}
{"word": "give away", "english": "He gave away his position with that noise.", "thai": "เขาเปิดเผยตำแหน่งด้วยเสียงนั้น"}
{"word": "give away", "english": "The shop is giving away free coffee today.", "thai": "ร้านนี้กำลังแจกกาแฟฟรีวันนี้"}
{"word": "give away", "english": "I don’t want to give away the ending.", "thai": "ฉันไม่อยากบอกตอนจบ"}
{"word": "give away", "english": "They gave away their old furniture.", "thai": "พวกเขาบริจาคเฟอร์นิเจอร์เก่า"}
{"word": "give away", "english": "You’ll give away our plan if you talk!", "thai": "คุณจะเผยแผนของเราถ้าพูด!"}
{"word": "give away", "english": "The radio station is giving away concert tickets.", "thai": "สถานีวิทยุกำลังแจกตั๋วคอนเสิร์ต"}
{"word": "give away", "english": "She gave away her intentions with a smile.", "thai": "เธอเผยความตั้งใจด้วยรอยยิ้ม"}
{"word": "give away", "english": "I’m going to give away these books.", "thai": "ฉันจะบริจาคหนังสือเหล่านี้"}
{"word": "give away", "english": "Don’t give away where we’re hiding!", "thai": "อย่าบอกที่ที่เราซ่อนอยู่!"}
{"word": "give away", "english": "They’re giving away free food at the event.", "thai": "พวกเขาแจกอาหารฟรีในงาน"}
{"word": "give away", "english": "He gave away his advantage in the game.", "thai": "เขาเสียเปรียบในเกมไป"}
{"word": "give away", "english": "We can give away these extra chairs.", "thai": "เราสามารถบริจาคเก้าอี้ส่วนเกินเหล่านี้"}
{"word": "give away", "english": "She didn’t mean to give away the answer.", "thai": "เธอไม่ได้ตั้งใจบอกคำตอบ"}
{"word": "give away", "english": "The store is giving away tote bags.", "thai": "ร้านนี้กำลังแจกกระเป๋าผ้า"}
{"word": "give away", "english": "I gave away my old phone to a friend.", "thai": "ฉันให้โทรศัพท์เก่าแก่เพื่อน"}
{"word": "give away", "english": "Don’t give away our strategy!", "thai": "อย่าเผยกลยุทธ์ของเรา!"}
{"word": "give away", "english": "They’re giving away prizes at the fair.", "thai": "พวกเขาแจกรางวัลในงานเทศกาล"}
{"word": "give away", "english": "He gave away his feelings with a blush.", "thai": "เขาเผยความรู้สึกด้วยการหน้าแดง"}
{"word": "give away", "english": "I want to give away my old toys.", "thai": "ฉันอยากบริจาคของเล่นเก่า"}
{"word": "give away", "english": "She gave away the plot of the movie.", "thai": "เธอบอกเนื้อเรื่องของหนัง"}
{"word": "give away", "english": "The bakery is giving away free cookies.", "thai": "ร้านเบเกอรี่แจกคุกกี้ฟรี"}
{"word": "give away", "english": "He gave away his location with that call.", "thai": "เขาเปิดเผยตำแหน่งด้วยการโทรนั้น"}
{"word": "give away", "english": "We should give away these extra blankets.", "thai": "เราควรบริจาคผ้าห่มส่วนเกินเหล่านี้"}
{"word": "give away", "english": "Don’t give away the surprise gift!", "thai": "อย่าบอกเรื่องของขวัญเซอร์ไพรส์!"}
{"word": "give away", "english": "They’re giving away free drinks tonight.", "thai": "พวกเขาแจกเครื่องดื่มฟรีคืนนี้"}
{"word": "give away", "english": "She gave away her plan with a glance.", "thai": "เธอเผยแผนด้วยสายตา"}
{"word": "give away", "english": "I’m going to give away my old laptop.", "thai": "ฉันจะบริจาคแล็ปท็อปเก่า"}
{"word": "give away", "english": "He didn’t want to give away his source.", "thai": "เขาไม่อยากเผยแหล่งที่มา"}
{"word": "give away", "english": "The company is giving away free pens.", "thai": "บริษัทแจกปากกาฟรี"}
{"word": "give away", "english": "She gave away her hiding spot by giggling.", "thai": "เธอเผยที่ซ่อนด้วยการหัวเราะคิกคัก"}
{"word": "give away", "english": "We can give away these old magazines.", "thai": "เราสามารถบริจาคนิตยสารเก่าเหล่านี้"}
{"word": "give away", "english": "Don’t give away the game’s secret!", "thai": "อย่าบอกความลับของเกม!"}
{"word": "give away", "english": "They’re giving away free hats at the game.", "thai": "พวกเขาแจกหมวกฟรีในเกม"}
{"word": "give away", "english": "He gave away his strategy by talking.", "thai": "เขาเผยกลยุทธ์ด้วยการพูด"}
{"word": "give away", "english": "I gave away my old shoes to charity.", "thai": "ฉันบริจาครองเท้าเก่าให้การกุศล"}
{"word": "give away", "english": "She didn’t mean to give away the truth.", "thai": "เธอไม่ได้ตั้งใจบอกความจริง"}
{"word": "give away", "english": "The cafe is giving away free pastries.", "thai": "ร้านกาแฟแจกขนมอบฟรี"}
{"word": "give away", "english": "He gave away his cover by moving.", "thai": "เขาเปิดเผยที่กำบังด้วยการขยับ"}
{"word": "give away", "english": "We should give away these extra plates.", "thai": "เราควรบริจาคจานส่วนเกินเหล่านี้"}
{"word": "give away", "english": "Don’t give away our meeting place!", "thai": "อย่าบอกสถานที่ประชุมของเรา!"}
{"word": "give away", "english": "They’re giving away free stickers today.", "thai": "พวกเขาแจกสติกเกอร์ฟรีวันนี้"}
{"word": "give away", "english": "She gave away her excitement with a squeal.", "thai": "เธอเผยความตื่นเต้นด้วยการกรี๊ด"}
{"word": "give away", "english": "I’m going to give away my old bike.", "thai": "ฉันจะบริจาคจักรยานเก่า"}
{"word": "give away", "english": "He gave away his plan with a nervous laugh.", "thai": "เขาเผยแผนด้วยการหัวเราะประหม่า"}
{"word": "give away", "english": "The store is giving away free balloons.", "thai": "ร้านค้าแจกลูกโป่งฟรี"}
{"word": "give away", "english": "She gave away the answer during the quiz.", "thai": "เธอบอกคำตอบระหว่างควิซ"}
{"word": "give away", "english": "We can give away these old curtains.", "thai": "เราสามารถบริจาคผ้าม่านเก่าเหล่านี้"}
{"word": "give away", "english": "Don’t give away our secret code!", "thai": "อย่าบอกรหัสลับของเรา!"}
{"word": "give away", "english": "They’re giving away free posters at the event.", "thai": "พวกเขาแจกโปสเตอร์ฟรีในงาน"}
{"word": "give away", "english": "He gave away his identity with that accent.", "thai": "เขาเผยตัวตนด้วยสำเนียงนั้น"}
{"word": "give away", "english": "I gave away my old jackets to a shelter.", "thai": "ฉันบริจาคแจ็คเก็ตเก่าให้ที่พักพิง"}
{"word": "give away", "english": "She didn’t want to give away her recipe.", "thai": "เธอไม่อยากบอกสูตรอาหาร"}
{"word": "give away", "english": "The festival is giving away free wristbands.", "thai": "งานเทศกาลแจกสายรัดข้อมือฟรี"}
{"word": "give away", "english": "He gave away his location with a flashlight.", "thai": "เขาเปิดเผยตำแหน่งด้วยไฟฉาย"}
{"word": "give away", "english": "We should give away these extra pillows.", "thai": "เราควรบริจาคหมอนส่วนเกินเหล่านี้"}
{"word": "give away", "english": "Don’t give away the surprise ending!", "thai": "อย่าบอกตอนจบที่เซอร์ไพรส์!"}
{"word": "give away", "english": "They’re giving away free snacks at the booth.", "thai": "พวกเขาแจกของว่างฟรีที่บูธ"}
{"word": "give away", "english": "She gave away her nervousness with a fidget.", "thai": "เธอเผยความประหม่าโดยการกระสับกระส่าย"}
{"word": "give away", "english": "I’m going to give away my old camera.", "thai": "ฉันจะบริจาคกล้องเก่า"}
{"word": "give away", "english": "He gave away his intentions by staring.", "thai": "เขาเผยความตั้งใจด้วยการจ้องมอง"}
{"word": "give away", "english": "The shop is giving away free keychains.", "thai": "ร้านค้าแจกพวงกุญแจฟรี"}
{"word": "give away", "english": "She gave away the secret by whispering.", "thai": "เธอบอกความลับโดยการกระซิบ"}
{"word": "give away", "english": "We can give away these old lamps.", "thai": "เราสามารถบริจาคโคมไฟเก่าเหล่านี้"}
{"word": "give away", "english": "Don’t give away our hiding spot!", "thai": "อย่าบอกที่ซ่อนของเรา!"}
{"word": "give away", "english": "They’re giving away free mugs at the fair.", "thai": "พวกเขาแจกแก้วฟรีในงานเทศกาล"}
{"word": "give away", "english": "He gave away his plan with a smirk.", "thai": "เขาเผยแผนด้วยรอยยิ้มเจ้าเล่ห์"}
{"word": "give away", "english": "I gave away my old books to a library.", "thai": "ฉันบริจาคหนังสือเก่าให้ห้องสมุด"}
{"word": "give away", "english": "She didn’t mean to give away her strategy.", "thai": "เธอไม่ได้ตั้งใจเผยกลยุทธ์"}
{"word": "give away", "english": "The event is giving away free t-shirts.", "thai": "งานนี้แจกเสื้อยืดฟรี"}
{"word": "give away", "english": "He gave away his presence with a cough.", "thai": "เขาเปิดเผยตัวตนด้วยการไอ"}
{"word": "give away", "english": "We should give away these extra towels.", "thai": "เราควรบริจาคผ้าเช็ดตัวส่วนเกินเหล่านี้"}
{"word": "give away", "english": "Don’t give away the prank we planned!", "thai": "อย่าบอกเรื่องการแกล้งที่เราวางแผนไว้!"}
{"word": "give away", "english": "They’re giving away free bookmarks today.", "thai": "พวกเขาแจกที่คั่นหนังสือฟรีวันนี้"}
{"word": "give away", "english": "She gave away her excitement by clapping.", "thai": "เธอเผยความตื่นเต้นด้วยการตบมือ"}
{"word": "give away", "english": "I’m going to give away my old desk.", "thai": "ฉันจะบริจาคโต๊ะเก่า"}
{"word": "give away", "english": "He gave away his secret with a slip.", "thai": "เขาเผยความลับด้วยการหลุดปาก"}
{"word": "give away", "english": "The store is giving away free candles.", "thai": "ร้านค้าแจกเทียนฟรี"}
{"word": "give away", "english": "She gave away her position by laughing.", "thai": "เธอเปิดเผยตำแหน่งด้วยการหัวเราะ"}
{"word": "give away", "english": "We can give away these old rugs.", "thai": "เราสามารถบริจาคพรมเก่าเหล่านี้"}
{"word": "give away", "english": "Don’t give away our next move!", "thai": "อย่าบอกการเคลื่อนไหวต่อไปของเรา!"}
{"word": "give away", "english": "They’re giving away free water bottles.", "thai": "พวกเขาแจกขวดน้ำฟรี"}
{"word": "give away", "english": "He gave away his fear with a tremble.", "thai": "เขาเผยความกลัวด้วยการสั่น"}
{"word": "give away", "english": "I gave away my old guitar to a school.", "thai": "ฉันบริจาคกีตาร์เก่าให้โรงเรียน"}
{"word": "give away", "english": "She didn’t want to give away her idea.", "thai": "เธอไม่อยากบอกไอเดียของเธอ"}
{"word": "give away", "english": "The booth is giving away free notebooks.", "thai": "บูธนี้แจกสมุดบันทึกฟรี"}
{"word": "give away", "english": "He gave away his advantage by hesitating.", "thai": "เขาเสียเปรียบเพราะลังเล"}
{"word": "give away", "english": "We should give away these extra utensils.", "thai": "เราควรบริจาคช้อนส้อมส่วนเกินเหล่านี้"}
{"word": "give away", "english": "Don’t give away the surprise vacation!", "thai": "อย่าบอกเรื่องวันหยุดเซอร์ไพรส์!"}
{"word": "give away", "english": "They’re giving away free plants at the market.", "thai": "พวกเขาแจกต้นไม้ฟรีที่ตลาด"}
{"word": "give away", "english": "She gave away her plan with a wink.", "thai": "เธอเผยแผนด้วยการขยิบตา"}
{"word": "give away", "english": "I’m going to give away my old couch.", "thai": "ฉันจะบริจาคโซฟาเก่า"}
{"word": "give away", "english": "He gave away his location with a shout.", "thai": "เขาเปิดเผยตำแหน่งด้วยการตะโกน"}
{"word": "give away", "english": "The shop is giving away free magnets.", "thai": "ร้านค้าแจกแม่เหล็กฟรี"}
{"word": "give away", "english": "She gave away the secret by accident.", "thai": "เธอบอกความลับโดยไม่ตั้งใจ"}
{"word": "give in", "english": "I don’t want to give in to their demands.", "thai": "ฉันไม่อยากยอมตามข้อเรียกร้องของพวกเขา"}
{"word": "give in", "english": "She finally gave in and ate the cake.", "thai": "ในที่สุดเธอก็ยอมกินเค้ก"}
{"word": "give in", "english": "He refused to give in during the argument.", "thai": "เขาปฏิเสธที่จะยอมในการโต้เถียง"}
{"word": "give in", "english": "We can’t give in to fear right now.", "thai": "เราไม่สามารถยอมจำนนต่อความกลัวตอนนี้"}
{"word": "give in", "english": "They gave in to the kids’ begging.", "thai": "พวกเขายอมตามคำร้องของเด็กๆ"}
{"word": "give in", "english": "I might give in and buy that dress.", "thai": "ฉันอาจจะยอมซื้อชุดนั้น"}
{"word": "give in", "english": "Don’t give in to peer pressure!", "thai": "อย่ายอมตามแรงกดดันจากเพื่อน!"}
{"word": "give in", "english": "She gave in and agreed to the plan.", "thai": "เธอยอมและตกลงตามแผน"}
{"word": "give in", "english": "He won’t give in no matter what.", "thai": "เขาไม่ยอมไม่ว่าเกิดอะไรขึ้น"}
{"word": "give in", "english": "We had to give in to their schedule.", "thai": "เราต้องยอมตามตารางของพวกเขา"}
{"word": "give in", "english": "I gave in and let him borrow my car.", "thai": "ฉันยอมให้เขายืมรถ"}
{"word": "give in", "english": "She’s too stubborn to give in easily.", "thai": "เธอดื้อเกินกว่าจะยอมง่ายๆ"}
{"word": "give in", "english": "They gave in after hours of debate.", "thai": "พวกเขายอมหลังจากถกเถียงหลายชั่วโมง"}
{"word": "give in", "english": "Don’t give in to temptation!", "thai": "อย่ายอมจำนนต่อสิ่งล่อใจ!"}
{"word": "give in", "english": "He gave in and signed the contract.", "thai": "เขายอมเซ็นสัญญา"}
{"word": "give in", "english": "I can’t give in to his whining anymore.", "thai": "ฉันทนการบ่นของเขาไม่ได้อีกแล้ว"}
{"word": "give in", "english": "She gave in to her curiosity and opened the box.", "thai": "เธอยอมตามความอยากรู้และเปิดกล่อง"}
{"word": "give in", "english": "We won’t give in to their threats.", "thai": "เราจะไม่ยอมตามคำขู่ของพวกเขา"}
{"word": "give in", "english": "He gave in and bought the expensive phone.", "thai": "เขายอมซื้อโทรศัพท์ราคาแพง"}
{"word": "give in", "english": "I might give in and skip the gym today.", "thai": "ฉันอาจจะยอมข้ามการไปยิมวันนี้"}
{"word": "give in", "english": "They gave in to the group’s decision.", "thai": "พวกเขายอมตามการตัดสินใจของกลุ่ม"}
{"word": "give in", "english": "Don’t give in to his excuses!", "thai": "อย่ายอมตามข้อแก้ตัวของเขา!"}
{"word": "give in", "english": "She gave in and let the kids stay up late.", "thai": "เธอยอมให้เด็กๆ นอนดึก"}
{"word": "give in", "english": "He refused to give in to the pressure.", "thai": "เขาปฏิเสธที่จะยอมต่อแรงกดดัน"}
{"word": "give in", "english": "We had to give in to their new rules.", "thai": "เราต้องยอมตามกฎใหม่ของพวกเขา"}
{"word": "give in", "english": "I gave in and tried the spicy food.", "thai": "ฉันยอมลองกินอาหารเผ็ด"}
{"word": "give in", "english": "She’s not one to give in quickly.", "thai": "เธอไม่ใช่คนที่จะยอมง่ายๆ"}
{"word": "give in", "english": "They gave in and canceled the trip.", "thai": "พวกเขายอมยกเลิกทริป"}
{"word": "give in", "english": "Don’t give in to your doubts!", "thai": "อย่ายอมจำนนต่อความสงสัย!"}
{"word": "give in", "english": "He gave in to his boss’s request.", "thai": "เขายอมตามคำขอของเจ้านาย"}
{"word": "give in", "english": "I can’t give in to laziness today.", "thai": "ฉันยอมขี้เกียจไม่ได้วันนี้"}
{"word": "give in", "english": "She gave in and watched the movie.", "thai": "เธอยอมดูหนัง"}
{"word": "give in", "english": "We won’t give in to their complaints.", "thai": "เราจะไม่ยอมตามคำบ่นของพวกเขา"}
{"word": "give in", "english": "He gave in and joined the party.", "thai": "เขายอมไปงานปาร์ตี้"}
{"word": "give in", "english": "I might give in and eat some ice cream.", "thai": "ฉันอาจจะยอมกินไอศกรีม"}
{"word": "give in", "english": "They gave in to the new policy.", "thai": "พวกเขายอมตามนโยบายใหม่"}
{"word": "give in", "english": "Don’t give in to his manipulation!", "thai": "อย่ายอมถูกเขาจัดการ!"}
{"word": "give in", "english": "She gave in and bought the shoes.", "thai": "เธอยอมซื้อรองเท้า"}
{"word": "give in", "english": "He refused to give in to despair.", "thai": "เขาปฏิเสธที่จะยอมจำนนต่อความสิ้นหวัง"}
{"word": "give in", "english": "We had to give in to their timeline.", "thai": "เราต้องยอมตามกรอบเวลาของพวกเขา"}
{"word": "give in", "english": "I gave in and took a nap.", "thai": "ฉันยอมงีบหลับ"}
{"word": "give in", "english": "She’s too proud to give in easily.", "thai": "เธอหยิ่งเกินกว่าจะยอมง่ายๆ"}
{"word": "give in", "english": "They gave in after a long negotiation.", "thai": "พวกเขายอมหลังจากการเจรจายาวนาน"}
{"word": "give in", "english": "Don’t give in to their whining!", "thai": "อย่ายอมตามการบ่นของพวกเขา!"}
{"word": "give in", "english": "He gave in and let her choose.", "thai": "เขายอมให้เธอเลือก"}
{"word": "give in", "english": "I can’t give in to stress right now.", "thai": "ฉันยอมจำนนต่อความเครียดไม่ได้ตอนนี้"}
{"word": "give in", "english": "She gave in to her kids’ pleas.", "thai": "เธอยอมตามคำขอของเด็กๆ"}
{"word": "give in", "english": "We won’t give in to their bullying.", "thai": "เราจะไม่ยอมต่อการกลั่นแกล้งของพวกเขา"}
{"word": "give in", "english": "He gave in and tried the new restaurant.", "thai": "เขายอมลองร้านอาหารใหม่"}
{"word": "give in", "english": "I might give in and skip my homework.", "thai": "ฉันอาจจะยอมข้ามการบ้าน"}
{"word": "give in", "english": "They gave in to the team’s request.", "thai": "พวกเขายอมตามคำขอของทีม"}
{"word": "give in", "english": "Don’t give in to his tantrums!", "thai": "อย่ายอมตามอารมณ์ฉุนเฉียวของเขา!"}
{"word": "give in", "english": "She gave in and stayed home.", "thai": "เธอยอมอยู่บ้าน"}
{"word": "give in", "english": "He refused to give in to doubt.", "thai": "เขาปฏิเสธที่จะยอมจำนนต่อความสงสัย"}
{"word": "give in", "english": "We had to give in to their terms.", "thai": "เราต้องยอมตามเงื่อนไขของพวกเขา"}
{"word": "give in", "english": "I gave in and watched the game.", "thai": "ฉันยอมดูเกม"}
{"word": "give in", "english": "She’s not going to give in soon.", "thai": "เธอจะไม่ยอมง่ายๆ เร็วๆ นี้"}
{"word": "give in", "english": "They gave in to the new schedule.", "thai": "พวกเขายอมตามตารางใหม่"}
{"word": "give in", "english": "Don’t give in to their arguments!", "thai": "อย่ายอมตามการโต้เถียงของพวกเขา!"}
{"word": "give in", "english": "He gave in and helped with the project.", "thai": "เขายอมช่วยในโปรเจกต์"}
{"word": "give in", "english": "I can’t give in to my cravings today.", "thai": "ฉันยอมตามความอยากไม่ได้วันนี้"}
{"word": "give in", "english": "She gave in to her friend’s advice.", "thai": "เธอยอมตามคำแนะนำของเพื่อน"}
{"word": "give in", "english": "We won’t give in to their pressure.", "thai": "เราจะไม่ยอมต่อแรงกดดันของพวกเขา"}
{"word": "give in", "english": "He gave in and went to the party.", "thai": "เขายอมไปงานปาร์ตี้"}
{"word": "give in", "english": "I might give in and take a break.", "thai": "ฉันอาจจะยอมพักผ่อน"}
{"word": "give in", "english": "They gave in to the client’s demands.", "thai": "พวกเขายอมตามข้อเรียกร้องของลูกค้า"}
{"word": "give in", "english": "Don’t give in to his complaints!", "thai": "อย่ายอมตามคำบ่นของเขา!"}
{"word": "give in", "english": "She gave in and bought the book.", "thai": "เธอยอมซื้อหนังสือ"}
{"word": "give in", "english": "He refused to give in to exhaustion.", "thai": "เขาปฏิเสธที่จะยอมจำนนต่อความเหนื่อยล้า"}
{"word": "give in", "english": "We had to give in to their budget.", "thai": "เราต้องยอมตามงบประมาณของพวกเขา"}
{"word": "give in", "english": "I gave in and ate the pizza.", "thai": "ฉันยอมกินพิซซ่า"}
{"word": "give in", "english": "She’s too strong to give in now.", "thai": "เธอเข้มแข็งเกินกว่าจะยอมตอนนี้"}
{"word": "give in", "english": "They gave in after a long discussion.", "thai": "พวกเขายอมหลังจากการสนทนายาวนาน"}
{"word": "give in", "english": "Don’t give in to their tricks!", "thai": "อย่ายอมตามเล่ห์เหลี่ยมของพวกเขา!"}
{"word": "give in", "english": "He gave in and let her drive.", "thai": "เขายอมให้เธอขับรถ"}
{"word": "give in", "english": "I can’t give in to distractions today.", "thai": "ฉันยอมเสียสมาธิไม่ได้วันนี้"}
{"word": "give in", "english": "She gave in to her parents’ wishes.", "thai": "เธอยอมตามความต้องการของพ่อแม่"}
{"word": "give in", "english": "We won’t give in to their objections.", "thai": "เราจะไม่ยอมตามการคัดค้านของพวกเขา"}
{"word": "give in", "english": "He gave in and tried the new game.", "thai": "เขายอมลองเล่นเกมใหม่"}
{"word": "give in", "english": "I might give in and sleep early.", "thai": "ฉันอาจจะยอมนอนเร็ว"}
{"word": "give in", "english": "They gave in to the new contract.", "thai": "พวกเขายอมตามสัญญาใหม่"}
{"word": "give in", "english": "Don’t give in to his nagging!", "thai": "อย่ายอมตามการจู้จี้ของเขา!"}
{"word": "give in", "english": "She gave in and joined the club.", "thai": "เธอยอมเข้าร่วมชมรม"}
{"word": "give in", "english": "He refused to give in to sadness.", "thai": "เขาปฏิเสธที่จะยอมจำนนต่อความเศร้า"}
{"word": "give in", "english": "We had to give in to their proposal.", "thai": "เราต้องยอมตามข้อเสนอของพวกเขา"}
{"word": "give in", "english": "I gave in and got the extra dessert.", "thai": "ฉันยอมสั่งของหวานเพิ่ม"}
{"word": "give in", "english": "She’s not likely to give in soon.", "thai": "เธอไม่น่าจะยอมเร็วๆ นี้"}
{"word": "give in", "english": "They gave in to the public’s demands.", "thai": "พวกเขายอมตามข้อเรียกร้องของสาธารณะ"}
{"word": "give in", "english": "Don’t give in to their persuasion!", "thai": "อย่ายอมตามการชักชวนของพวกเขา!"}
{"word": "give in", "english": "He gave in and took the day off.", "thai": "เขายอมลาหยุดหนึ่งวัน"}
{"word": "give in", "english": "I can’t give in to my fears now.", "thai": "ฉันยอมจำนนต่อความกลัวไม่ได้ตอนนี้"}
{"word": "give in", "english": "She gave in to her friend’s begging.", "thai": "เธอยอมตามคำขอร้องของเพื่อน"}
{"word": "give in", "english": "We won’t give in to their tactics.", "thai": "เราจะไม่ยอมตามกลยุทธ์ของพวกเขา"}
{"word": "give in", "english": "He gave in and watched the show.", "thai": "เขายอมดูรายการ"}
{"word": "give in", "english": "I might give in and go shopping.", "thai": "ฉันอาจจะยอมไปช็อปปิ้ง"}
{"word": "give in", "english": "They gave in to the new regulations.", "thai": "พวกเขายอมตามกฎระเบียบใหม่"}
{"word": "give in", "english": "Don’t give in to their complaints!", "thai": "อย่ายอมตามคำบ่นของพวกเขา!"}
{"word": "give in", "english": "She gave in and let him win.", "thai": "เธอยอมให้เขาชนะ"}
{"word": "give up", "english": "I don’t want to give up on my dreams.", "thai": "ฉันไม่อยากยอมแพ้ในความฝัน"}
{"word": "give up", "english": "She gave up smoking last year.", "thai": "เธอเลิกสูบบุหรี่เมื่อปีที่แล้ว"}
{"word": "give up", "english": "He refused to give up during the race.", "thai": "เขาปฏิเสธที่จะยอมแพ้ในระหว่างการแข่งขัน"}
{"word": "give up", "english": "We can’t give up hope now.", "thai": "เราไม่สามารถยอมแพ้ความหวังตอนนี้"}
{"word": "give up", "english": "They gave up their search for the dog.", "thai": "พวกเขายอมเลิกค้นหาสุนัข"}
{"word": "give up", "english": "I might give up on this puzzle.", "thai": "ฉันอาจจะยอมเลิกเล่นปริศนานี้"}
{"word": "give up", "english": "Don’t give up on your studies!", "thai": "อย่ายอมแพ้ในการเรียน!"}
{"word": "give up", "english": "She gave up her seat for an elderly man.", "thai": "เธอยอมสละที่นั่งให้ชายชรา"}
{"word": "give up", "english": "He won’t give up his favorite hobby.", "thai": "เขาไม่ยอมเลิกงานอดิเรกที่ชอบ"}
{"word": "give up", "english": "We had to give up on the camping trip.", "thai": "เราต้องยอมเลิกทริปแคมปิ้ง"}
{"word": "give up", "english": "I gave up trying to fix the old car.", "thai": "ฉันยอมเลิกพยายามซ่อมรถเก่า"}
{"word": "give up", "english": "She’s too stubborn to give up easily.", "thai": "เธอดื้อเกินกว่าจะยอมแพ้ง่ายๆ"}
{"word": "give up", "english": "They gave up after hours of trying.", "thai": "พวกเขายอมแพ้หลังจากพยายามหลายชั่วโมง"}
{"word": "give up", "english": "Don’t give up on your goals!", "thai": "อย่ายอมแพ้ในเป้าหมายของตัวเอง!"}
{"word": "give up", "english": "He gave up his job to travel.", "thai": "เขาเลิกงานเพื่อไปเที่ยว"}
{"word": "give up", "english": "I can’t give up on this project yet.", "thai": "ฉันยังยอมเลิกโปรเจกต์นี้ไม่ได้"}
{"word": "give up", "english": "She gave up sugar for her health.", "thai": "เธอเลิกกินน้ำตาลเพื่อสุขภาพ"}
{"word": "give up", "english": "We won’t give up until we succeed.", "thai": "เราจะไม่ยอมแพ้จนกว่าจะสำเร็จ"}
{"word": "give up", "english": "He gave up his chance to win.", "thai": "เขายอมสละโอกาสที่จะชนะ"}
{"word": "give up", "english": "I might give up on learning guitar.", "thai": "ฉันอาจจะยอมเลิกเรียนกีตาร์"}
{"word": "give up", "english": "They gave up their old apartment.", "thai": "พวกเขายอมสละอพาร์ตเมนต์เก่า"}
{"word": "give up", "english": "Don’t give up, you’re almost there!", "thai": "อย่ายอมแพ้ คุณใกล้ถึงแล้ว!"}
{"word": "give up", "english": "She gave up her weekend to work.", "thai": "เธอยอมสละวันหยุดเพื่อทำงาน"}
{"word": "give up", "english": "He refused to give up his beliefs.", "thai": "เขาปฏิเสธที่จะยอมละทิ้งความเชื่อ"}
{"word": "give up", "english": "We had to give up on the old plan.", "thai": "เราต้องยอมเลิกแผนเก่า"}
{"word": "give up", "english": "I gave up coffee for a month.", "thai": "ฉันเลิกกินกาแฟเป็นเวลาหนึ่งเดือน"}
{"word": "give up", "english": "She’s not one to give up quickly.", "thai": "เธอไม่ใช่คนที่ยอมแพ้เร็วๆ"}
{"word": "give up", "english": "They gave up on fixing the broken chair.", "thai": "พวกเขายอมเลิกซ่อมเก้าอี้ที่เสีย"}
{"word": "give up", "english": "Don’t give up on your dreams!", "thai": "อย่ายอมแพ้ในความฝันของตัวเอง!"}
{"word": "give up", "english": "He gave up his spot in line.", "thai": "เขายอมสละที่ยืนในแถว"}
{"word": "give up", "english": "I can’t give up on this book yet.", "thai": "ฉันยังยอมเลิกอ่านหนังสือเล่มนี้ไม่ได้"}
{"word": "give up", "english": "She gave up dairy for her diet.", "thai": "เธอเลิกกินผลิตภัณฑ์นมเพื่อควบคุมอาหาร"}
{"word": "give up", "english": "We won’t give up on finding a solution.", "thai": "เราจะไม่ยอมเลิกหาทางแก้ปัญหา"}
{"word": "give up", "english": "He gave up his role in the play.", "thai": "เขายอมสละบทบาทในละคร"}
{"word": "give up", "english": "I might give up on this hard game.", "thai": "ฉันอาจจะยอมเลิกเล่นเกมยากนี้"}
{"word": "give up", "english": "They gave up their old traditions.", "thai": "พวกเขายอมละทิ้งประเพณีเก่า"}
{"word": "give up", "english": "Don’t give up, keep practicing!", "thai": "อย่ายอมแพ้ ฝึกต่อไป!"}
{"word": "give up", "english": "She gave up her free time for charity.", "thai": "เธอยอมสละเวลาว่างเพื่อการกุศล"}
{"word": "give up", "english": "He refused to give up his fight.", "thai": "เขาปฏิเสธที่จะยอมแพ้ในการต่อสู้"}
{"word": "give up", "english": "We had to give up on the broken project.", "thai": "เราต้องยอมเลิกโปรเจกต์ที่เสียหาย"}
{"word": "give up", "english": "I gave up soda for better health.", "thai": "ฉันเลิกดื่มโซดาเพื่อสุขภาพที่ดีขึ้น"}
{"word": "give up", "english": "She’s too determined to give up now.", "thai": "เธอมุ่งมั่นเกินกว่าจะยอมแพ้ตอนนี้"}
{"word": "give up", "english": "They gave up on repairing the old car.", "thai": "พวกเขายอมเลิกซ่อมรถเก่า"}
{"word": "give up", "english": "Don’t give up on your new business!", "thai": "อย่ายอมแพ้ในธุรกิจใหม่ของตัวเอง!"}
{"word": "give up", "english": "He gave up his parking spot.", "thai": "เขายอมสละที่จอดรถ"}
{"word": "give up", "english": "I can’t give up on this challenge yet.", "thai": "ฉันยังยอมเลิกความท้าทายนี้ไม่ได้"}
{"word": "give up", "english": "She gave up desserts for a month.", "thai": "เธอเลิกกินของหวานเป็นเวลาหนึ่งเดือน"}
{"word": "give up", "english": "We won’t give up on our team.", "thai": "เราจะไม่ยอมเลิกสนับสนุนทีมของเรา"}
{"word": "give up", "english": "He gave up his seat on the bus.", "thai": "เขายอมสละที่นั่งบนรถบัส"}
{"word": "give up", "english": "I might give up on this knitting project.", "thai": "ฉันอาจจะยอมเลิกโปรเจกต์ถักนิตติ้งนี้"}
{"word": "give up", "english": "They gave up their old house.", "thai": "พวกเขายอมสละบ้านเก่า"}
{"word": "give up", "english": "Don’t give up, you can do it!", "thai": "อย่ายอมแพ้ คุณทำได้!"}
{"word": "give up", "english": "She gave up her time to help a friend.", "thai": "เธอยอมสละเวลาเพื่อช่วยเพื่อน"}
{"word": "give up", "english": "He refused to give up his principles.", "thai": "เขาปฏิเสธที่จะยอมละทิ้งหลักการ"}
{"word": "give up", "english": "We had to give up on the old strategy.", "thai": "เราต้องยอมเลิกกลยุทธ์เก่า"}
{"word": "give up", "english": "I gave up trying to solve the riddle.", "thai": "ฉันยอมเลิกพยายามแก้ปริศนา"}
{"word": "give up", "english": "She’s not likely to give up soon.", "thai": "เธอไม่น่าจะยอมแพ้เร็วๆ นี้"}
{"word": "give up", "english": "They gave up on the failing business.", "thai": "พวกเขายอมเลิกธุรกิจที่ล้มเหลว"}
{"word": "give up", "english": "Don’t give up on your workout routine!", "thai": "อย่ายอมเลิกตารางออกกำลังกาย!"}
{"word": "give up", "english": "He gave up his turn to play.", "thai": "เขายอมสละตาเล่น"}
{"word": "give up", "english": "I can’t give up on this math problem.", "thai": "ฉันยอมเลิกโจทย์คณิตนี้ไม่ได้"}
{"word": "give up", "english": "She gave up alcohol for a year.", "thai": "เธอเลิกดื่มแอลกอฮอล์เป็นเวลาหนึ่งปี"}
{"word": "give up", "english": "We won’t give up on our mission.", "thai": "เราจะไม่ยอมเลิกภารกิจของเรา"}
{"word": "give up", "english": "He gave up his place in the queue.", "thai": "เขายอมสละที่ในแถว"}
{"word": "give up", "english": "I might give up on this old laptop.", "thai": "ฉันอาจจะยอมเลิกใช้แล็ปท็อปเก่านี้"}
{"word": "give up", "english": "They gave up their old furniture.", "thai": "พวกเขายอมสละเฟอร์นิเจอร์เก่า"}
{"word": "give up", "english": "Don’t give up on learning piano!", "thai": "อย่ายอมเลิกเรียนเปียโน!"}
{"word": "give up", "english": "She gave up her evening to volunteer.", "thai": "เธอยอมสละช่วงเย็นเพื่อเป็นอาสาสมัคร"}
{"word": "give up", "english": "He refused to give up his dream job.", "thai": "เขาปฏิเสธที่จะยอมเลิกงานในฝัน"}
{"word": "give up", "english": "We had to give up on the old recipe.", "thai": "เราต้องยอมเลิกสูตรเก่า"}
{"word": "give up", "english": "I gave up trying to convince her.", "thai": "ฉันยอมเลิกพยายามโน้มน้าวเธอ"}
{"word": "give up", "english": "She’s too persistent to give up now.", "thai": "เธอมุ่งมั่นเกินกว่าจะยอมแพ้ตอนนี้"}
{"word": "give up", "english": "They gave up on the broken machine.", "thai": "พวกเขายอมเลิกซ่อมเครื่องที่เสีย"}
{"word": "give up", "english": "Don’t give up on your art project!", "thai": "อย่ายอมเลิกโปรเจกต์ศิลปะของตัวเอง!"}
{"word": "give up", "english": "He gave up his spot in the class.", "thai": "เขายอมสละที่ในชั้นเรียน"}
{"word": "give up", "english": "I can’t give up on this diet yet.", "thai": "ฉันยังยอมเลิกควบคุมอาหารนี้ไม่ได้"}
{"word": "give up", "english": "She gave up meat for the month.", "thai": "เธอเลิกกินเนื้อเป็นเวลาหนึ่งเดือน"}
{"word": "give up", "english": "We won’t give up on our friendship.", "thai": "เราจะไม่ยอมเลิกมิตรภาพของเรา"}
{"word": "give up", "english": "He gave up his role in the team.", "thai": "เขายอมสละบทบาทในทีม"}
{"word": "give up", "english": "I might give up on this old book.", "thai": "ฉันอาจจะยอมเลิกอ่านหนังสือเก่านี้"}
{"word": "give up", "english": "They gave up their old habits.", "thai": "พวกเขายอมเลิกนิสัยเก่า"}
{"word": "give up", "english": "Don’t give up on your new hobby!", "thai": "อย่ายอมเลิกงานอดิเรกใหม่!"}
{"word": "give up", "english": "She gave up her night to babysit.", "thai": "เธอยอมสละคืนเพื่อเลี้ยงเด็ก"}
{"word": "give up", "english": "He refused to give up his values.", "thai": "เขาปฏิเสธที่จะยอมละทิ้งคุณค่า"}
{"word": "give up", "english": "We had to give up on the old design.", "thai": "เราต้องยอมเลิกการออกแบบเก่า"}
{"word": "give up", "english": "I gave up trying to win the argument.", "thai": "ฉันยอมเลิกพยายามชนะการโต้เถียง"}
{"word": "give up", "english": "She’s not going to give up easily.", "thai": "เธอจะไม่ยอมแพ้ง่ายๆ"}
{"word": "give up", "english": "They gave up on the old system.", "thai": "พวกเขายอมเลิกระบบเก่า"}
{"word": "give up", "english": "Don’t give up on your fitness goals!", "thai": "อย่ายอมเลิกเป้าหมายการออกกำลังกาย!"}
{"word": "give up", "english": "He gave up his ticket for a friend.", "thai": "เขายอมสละตั๋วให้เพื่อน"}
{"word": "give up", "english": "I can’t give up on this recipe yet.", "thai": "ฉันยังยอมเลิกสูตรนี้ไม่ได้"}
{"word": "give up", "english": "She gave up social media for a week.", "thai": "เธอเลิกเล่นโซเชียลมีเดียเป็นเวลาหนึ่งสัปดาห์"}
{"word": "give up", "english": "We won’t give up on our plan.", "thai": "เราจะไม่ยอมเลิกแผนของเรา"}
{"word": "give up", "english": "He gave up his chair for a guest.", "thai": "เขายอมสละเก้าอี้ให้แขก"}
{"word": "give up", "english": "I might give up on this hard level.", "thai": "ฉันอาจจะยอมเลิกเล่นเลเวลยากนี้"}
{"word": "give up", "english": "They gave up their old car.", "thai": "พวกเขายอมสละรถเก่า"}
{"word": "give up", "english": "Don’t give up on your career!", "thai": "อย่ายอมเลิกในอาชีพของตัวเอง!"}
{"word": "give up", "english": "She gave up her lunch break to help.", "thai": "เธอยอมสละช่วงพักเที่ยงเพื่อช่วย"}
{"word": "go ahead", "english": "Go ahead and take the last slice.", "thai": "ไปเลย หยิบชิ้นสุดท้ายได้"}
{"word": "go ahead", "english": "You can go ahead and start the meeting.", "thai": "คุณเริ่มประชุมได้เลย"}
{"word": "go ahead", "english": "I told her to go ahead and book the tickets.", "thai": "ฉันบอกเธอให้ไปจองตั๋วได้เลย"}
{"word": "go ahead", "english": "Go ahead and try the new recipe.", "thai": "ลองสูตรใหม่ไปเลย"}
{"word": "go ahead", "english": "He said to go ahead and use his car.", "thai": "เขาบอกให้ใช้รถของเขาได้เลย"}
{"word": "go ahead", "english": "Go ahead, tell me what happened.", "thai": "ไปเลย บอกฉันว่าเกิดอะไรขึ้น"}
{"word": "go ahead", "english": "You should go ahead and ask for a raise.", "thai": "คุณควรไปขอขึ้นเงินเดือนเลย"}
{"word": "go ahead", "english": "She went ahead and painted the room.", "thai": "เธอไปทาสีห้องเลย"}
{"word": "go ahead", "english": "Go ahead and call him now.", "thai": "โทรหาเขาได้เลย"}
{"word": "go ahead", "english": "They told us to go ahead with the plan.", "thai": "พวกเขาบอกให้ดำเนินตามแผนได้เลย"}
{"word": "go ahead", "english": "Go ahead and take a break.", "thai": "พักได้เลย"}
{"word": "go ahead", "english": "I’ll go ahead and order the food.", "thai": "ฉันจะไปสั่งอาหารเลย"}
{"word": "go ahead", "english": "You can go ahead and send the email.", "thai": "คุณส่งอีเมลได้เลย"}
{"word": "go ahead", "english": "Go ahead and pick any seat.", "thai": "เลือกที่นั่งได้เลย"}
{"word": "go ahead", "english": "She went ahead and signed up for the class.", "thai": "เธอไปสมัครเรียนเลย"}
{"word": "go ahead", "english": "Go ahead, give it a try!", "thai": "ไปเลย ลองดู!"}
{"word": "go ahead", "english": "He said to go ahead and borrow his book.", "thai": "เขาบอกให้ยืมหนังสือของเขาได้เลย"}
{"word": "go ahead", "english": "Go ahead and make yourself at home.", "thai": "ทำตัวตามสบายได้เลย"}
{"word": "go ahead", "english": "They went ahead and launched the project.", "thai": "พวกเขาไปเริ่มโปรเจกต์เลย"}
{"word": "go ahead", "english": "You should go ahead and apply for the job.", "thai": "คุณควรไปสมัครงานเลย"}
{"word": "go ahead", "english": "Go ahead and eat, it’s getting cold.", "thai": "กินได้เลย อาหารจะเย็นแล้ว"}
{"word": "go ahead", "english": "I told him to go ahead and fix the leak.", "thai": "ฉันบอกเขาให้ไปซ่อมรอยรั่วเลย"}
{"word": "go ahead", "english": "Go ahead and ask your question.", "thai": "ถามคำถามของคุณได้เลย"}
{"word": "go ahead", "english": "She went ahead and bought the dress.", "thai": "เธอไปซื้อชุดเลย"}
{"word": "go ahead", "english": "You can go ahead and park here.", "thai": "คุณจอดรถที่นี่ได้เลย"}
{"word": "go ahead", "english": "Go ahead and share your idea.", "thai": "แชร์ไอเดียของคุณได้เลย"}
{"word": "go ahead", "english": "He went ahead and cleaned the kitchen.", "thai": "เขาไปทำความสะอาดครัวเลย"}
{"word": "go ahead", "english": "Go ahead, take a look at the menu.", "thai": "ไปเลย ดูเมนูได้"}
{"word": "go ahead", "english": "They said to go ahead with the event.", "thai": "พวกเขาบอกให้ดำเนินงานอีเวนต์ได้เลย"}
{"word": "go ahead", "english": "You should go ahead and call her.", "thai": "คุณควรโทรหาเธอเลย"}
{"word": "go ahead", "english": "Go ahead and grab a drink.", "thai": "หยิบเครื่องดื่มได้เลย"}
{"word": "go ahead", "english": "I went ahead and reserved a table.", "thai": "ฉันไปจองโต๊ะเลย"}
{"word": "go ahead", "english": "Go ahead and finish your homework.", "thai": "ทำการบ้านให้เสร็จได้เลย"}
{"word": "go ahead", "english": "She went ahead and adopted the puppy.", "thai": "เธอไปรับเลี้ยงลูกสุนัขเลย"}
{"word": "go ahead", "english": "You can go ahead and leave early.", "thai": "คุณออกไปก่อนได้เลย"}
{"word": "go ahead", "english": "Go ahead and choose your favorite.", "thai": "เลือกอันที่ชอบได้เลย"}
{"word": "go ahead", "english": "He went ahead and fixed the computer.", "thai": "เขาไปซ่อมคอมพิวเตอร์เลย"}
{"word": "go ahead", "english": "Go ahead, tell us your story.", "thai": "ไปเลย เล่าเรื่องของคุณให้เราฟัง"}
{"word": "go ahead", "english": "They went ahead and renovated the house.", "thai": "พวกเขาไปปรับปรุงบ้านเลย"}
{"word": "go ahead", "english": "You should go ahead and join the club.", "thai": "คุณควรไปเข้าร่วมชมรมเลย"}
{"word": "go ahead", "english": "Go ahead and try the new game.", "thai": "ลองเกมใหม่ได้เลย"}
{"word": "go ahead", "english": "I told her to go ahead and paint the fence.", "thai": "ฉันบอกเธอให้ไปทาสีรั้วเลย"}
{"word": "go ahead", "english": "Go ahead and take a seat.", "thai": "นั่งได้เลย"}
{"word": "go ahead", "english": "She went ahead and ordered dessert.", "thai": "เธอไปสั่งของหวานเลย"}
{"word": "go ahead", "english": "You can go ahead and start cooking.", "thai": "คุณเริ่มทำอาหารได้เลย"}
{"word": "go ahead", "english": "Go ahead and open the gift.", "thai": "เปิดของขวัญได้เลย"}
{"word": "go ahead", "english": "He went ahead and booked the hotel.", "thai": "เขาไปจองโรงแรมเลย"}
{"word": "go ahead", "english": "Go ahead, give me your opinion.", "thai": "ไปเลย บอกความเห็นของคุณ"}
{"word": "go ahead", "english": "They went ahead and planted the garden.", "thai": "พวกเขาไปปลูกสวนเลย"}
{"word": "go ahead", "english": "You should go ahead and take the day off.", "thai": "คุณควรลาวันนี้เลย"}
{"word": "go ahead", "english": "Go ahead and use my laptop.", "thai": "ใช้แล็ปท็อปของฉันได้เลย"}
{"word": "go ahead", "english": "I went ahead and paid the bill.", "thai": "ฉันไปจ่ายบิลเลย"}
{"word": "go ahead", "english": "Go ahead and pick a movie.", "thai": "เลือกหนังได้เลย"}
{"word": "go ahead", "english": "She went ahead and tried the new gym.", "thai": "เธอไปลองยิมใหม่เลย"}
{"word": "go ahead", "english": "You can go ahead and borrow my jacket.", "thai": "คุณยืมแจ็คเก็ตของฉันได้เลย"}
{"word": "go ahead", "english": "Go ahead and read the instructions.", "thai": "อ่านคำแนะนำได้เลย"}
{"word": "go ahead", "english": "He went ahead and installed the app.", "thai": "เขาไปติดตั้งแอปเลย"}
{"word": "go ahead", "english": "Go ahead, tell them what you think.", "thai": "ไปเลย บอกพวกเขาว่าคุณคิดอะไร"}
{"word": "go ahead", "english": "They went ahead and canceled the meeting.", "thai": "พวกเขาไปยกเลิกประชุมเลย"}
{"word": "go ahead", "english": "You should go ahead and buy the tickets.", "thai": "คุณควรไปซื้อตั๋วเลย"}
{"word": "go ahead", "english": "Go ahead and water the plants.", "thai": "รดน้ำต้นไม้ได้เลย"}
{"word": "go ahead", "english": "I went ahead and cleaned the car.", "thai": "ฉันไปทำความสะอาดรถเลย"}
{"word": "go ahead", "english": "Go ahead and take the first step.", "thai": "ก้าวแรกได้เลย"}
{"word": "go ahead", "english": "She went ahead and wrote the letter.", "thai": "เธอไปเขียนจดหมายเลย"}
{"word": "go ahead", "english": "You can go ahead and use the printer.", "thai": "คุณใช้เครื่องพิมพ์ได้เลย"}
{"word": "go ahead", "english": "Go ahead and try the new coffee.", "thai": "ลองกาแฟใหม่ได้เลย"}
{"word": "go ahead", "english": "He went ahead and fixed the shelf.", "thai": "เขาไปซ่อมชั้นวางเลย"}
{"word": "go ahead", "english": "Go ahead, ask for directions.", "thai": "ไปเลย ถามทาง"}
{"word": "go ahead", "english": "They went ahead and changed the design.", "thai": "พวกเขาไปเปลี่ยนการออกแบบเลย"}
{"word": "go ahead", "english": "You should go ahead and invite her.", "thai": "คุณควรไปเชิญเธอเลย"}
{"word": "go ahead", "english": "Go ahead and check the schedule.", "thai": "เช็คตารางได้เลย"}
{"word": "go ahead", "english": "I went ahead and packed the bags.", "thai": "ฉันไปเก็บกระเป๋าเลย"}
{"word": "go ahead", "english": "Go ahead and call the restaurant.", "thai": "โทรร้านอาหารได้เลย"}
{"word": "go ahead", "english": "She went ahead and dyed her hair.", "thai": "เธอไปย้อมผมเลย"}
{"word": "go ahead", "english": "You can go ahead and take a nap.", "thai": "คุณงีบได้เลย"}
{"word": "go ahead", "english": "Go ahead and choose a color.", "thai": "เลือกสีได้เลย"}
{"word": "go ahead", "english": "He went ahead and started the car.", "thai": "เขาไปสตาร์ทรถเลย"}
{"word": "go ahead", "english": "Go ahead, share your feedback.", "thai": "ไปเลย แชร์ความคิดเห็นของคุณ"}
{"word": "go ahead", "english": "They went ahead and approved the budget.", "thai": "พวกเขาไปอนุมัติงบประมาณเลย"}
{"word": "go ahead", "english": "You should go ahead and sign up.", "thai": "คุณควรไปสมัครเลย"}
{"word": "go ahead", "english": "Go ahead and eat the dessert.", "thai": "กินของหวานได้เลย"}
{"word": "go ahead", "english": "I went ahead and sent the package.", "thai": "ฉันไปส่งพัสดุเลย"}
{"word": "go ahead", "english": "Go ahead and try the new app.", "thai": "ลองแอปใหม่ได้เลย"}
{"word": "go ahead", "english": "She went ahead and organized the party.", "thai": "เธอไปจัดงานปาร์ตี้เลย"}
{"word": "go ahead", "english": "You can go ahead and borrow my pen.", "thai": "คุณยืมปากกาของฉันได้เลย"}
{"word": "go ahead", "english": "Go ahead and play the song.", "thai": "เล่นเพลงได้เลย"}
{"word": "go ahead", "english": "He went ahead and washed the dishes.", "thai": "เขาไปล้างจานเลย"}
{"word": "go ahead", "english": "Go ahead, tell me your plan.", "thai": "ไปเลย บอกแผนของคุณให้ฉันฟัง"}
{"word": "go ahead", "english": "They went ahead and hired the new guy.", "thai": "พวกเขาไปจ้างคนใหม่เลย"}
{"word": "go ahead", "english": "You should go ahead and take the photo.", "thai": "คุณควรไปถ่ายรูปเลย"}
{"word": "go ahead", "english": "Go ahead and lock the door.", "thai": "ล็อกประตูได้เลย"}
{"word": "go ahead", "english": "I went ahead and bought the gift.", "thai": "ฉันไปซื้อของขวัญเลย"}
{"word": "go ahead", "english": "Go ahead and feed the cat.", "thai": "ให้อาหารแมวได้เลย"}
{"word": "go ahead", "english": "She went ahead and planned the trip.", "thai": "เธอไปวางแผนทริปเลย"}
{"word": "go ahead", "english": "You can go ahead and use my phone.", "thai": "คุณใช้โทรศัพท์ของฉันได้เลย"}
{"word": "go ahead", "english": "Go ahead and write your name.", "thai": "เขียนชื่อของคุณได้เลย"}
{"word": "go ahead", "english": "He went ahead and repaired the bike.", "thai": "เขาไปซ่อมจักรยานเลย"}
{"word": "go ahead", "english": "Go ahead, take the first bite.", "thai": "ไปเลย กัดคำแรก"}
{"word": "go ahead", "english": "They went ahead and opened the store.", "thai": "พวกเขาไปเปิดร้านเลย"}
{"word": "go back", "english": "I need to go back to the store.", "thai": "ฉันต้องกลับไปที่ร้าน"}
{"word": "go back", "english": "When did you go back to school?", "thai": "คุณกลับไปโรงเรียนเมื่อไหร่?"}
{"word": "go back", "english": "She wants to go back to her hometown.", "thai": "เธออยากกลับไปบ้านเกิด"}
{"word": "go back", "english": "We should go back to our old plan.", "thai": "เราควรกลับไปใช้แผนเดิม"}
{"word": "go back", "english": "He went back to check his work.", "thai": "เขา回去ตรวจงาน"}
{"word": "go back", "english": "Can you go back and grab my jacket?", "thai": "คุณกลับไปหยิบแจ็คเก็ตให้ฉันได้ไหม?"}
{"word": "go back", "english": "I don’t want to go back to that job.", "thai": "ฉันไม่อยากกลับไปทำงานนั้น"}
{"word": "go back", "english": "They went back to their old habits.", "thai": "พวกเขากลับไปสู่นิสัยเดิม"}
{"word": "go back", "english": "Let’s go back to the restaurant.", "thai": "กลับไปที่ร้านอาหารกันเถอะ"}
{"word": "go back", "english": "She went back to finish her book.", "thai": "เธอกลับไปอ่านหนังสือให้จบ"}
{"word": "go back", "english": "I need to go back and fix my mistake.", "thai": "ฉันต้องกลับไปแก้ไขความผิดพลาด"}
{"word": "go back", "english": "He decided to go back to college.", "thai": "เขาตัดสินใจกลับไปเรียนมหาวิทยาลัย"}
{"word": "go back", "english": "We can’t go back to how things were.", "thai": "เราไม่สามารถกลับไปเป็นเหมือนเดิมได้"}
{"word": "go back", "english": "Go back and check the door’s locked.", "thai": "กลับไปเช็คว่าประตูล็อกแล้ว"}
{"word": "go back", "english": "She went back to her old apartment.", "thai": "เธอกลับไปที่อพาร์ตเมนต์เก่า"}
{"word": "go back", "english": "I want to go back to the beach.", "thai": "ฉันอยากกลับไปที่ชายหาด"}
{"word": "go back", "english": "They went back to their favorite cafe.", "thai": "พวกเขากลับไปที่ร้านกาแฟโปรด"}
{"word": "go back", "english": "He needs to go back to the office.", "thai": "เขาต้องกลับไปที่ออฟฟิศ"}
{"word": "go back", "english": "Can you go back and get my phone?", "thai": "คุณกลับไปหยิบโทรศัพท์ให้ฉันได้ไหม?"}
{"word": "go back", "english": "I’ll go back to studying tomorrow.", "thai": "ฉันจะกลับไปอ่านหนังสือพรุ่งนี้"}
{"word": "go back", "english": "She went back to her old routine.", "thai": "เธอกลับไปสู่วิถีชีวิตเดิม"}
{"word": "go back", "english": "We should go back to the park.", "thai": "เราควรกลับไปที่สวนสาธารณะ"}
{"word": "go back", "english": "He went back to pick up his keys.", "thai": "เขากลับไปหยิบกุญแจ"}
{"word": "go back", "english": "I don’t want to go back to that place.", "thai": "ฉันไม่อยากกลับไปที่นั้น"}
{"word": "go back", "english": "They went back to their old school.", "thai": "พวกเขากลับไปที่โรงเรียนเก่า"}
{"word": "go back", "english": "Go back and make sure it’s done.", "thai": "กลับไปดูให้แน่ใจว่าเสร็จแล้ว"}
{"word": "go back", "english": "She wants to go back to her old job.", "thai": "เธออยากกลับไปทำงานเก่า"}
{"word": "go back", "english": "I need to go back to the gym.", "thai": "ฉันต้องกลับไปยิม"}
{"word": "go back", "english": "He went back to his parents’ house.", "thai": "เขากลับไปบ้านพ่อแม่"}
{"word": "go back", "english": "Can we go back to the old rules?", "thai": "เรากลับไปใช้กฎเก่าได้ไหม?"}
{"word": "go back", "english": "I’ll go back and check my email.", "thai": "ฉันจะกลับไปเช็คอีเมล"}
{"word": "go back", "english": "She went back to her yoga class.", "thai": "เธอกลับไปเรียนโยคะ"}
{"word": "go back", "english": "We should go back to the hotel.", "thai": "เราควรกลับไปที่โรงแรม"}
{"word": "go back", "english": "He went back to grab his wallet.", "thai": "เขากลับไปหยิบกระเป๋าเงิน"}
{"word": "go back", "english": "I want to go back to that restaurant.", "thai": "ฉันอยากกลับไปที่ร้านอาหารนั้น"}
{"word": "go back", "english": "They went back to their old schedule.", "thai": "พวกเขากลับไปใช้ตารางเวลาเก่า"}
{"word": "go back", "english": "Go back and see if it’s still there.", "thai": "กลับไปดูว่ามันยังอยู่ไหม"}
{"word": "go back", "english": "She went back to her old neighborhood.", "thai": "เธอกลับไปที่ย่านเก่า"}
{"word": "go back", "english": "I need to go back to my desk.", "thai": "ฉันต้องกลับไปที่โต๊ะทำงาน"}
{"word": "go back", "english": "He went back to his old team.", "thai": "เขากลับไปทีมเก่า"}
{"word": "go back", "english": "Can you go back and get the book?", "thai": "คุณกลับไปหยิบหนังสือได้ไหม?"}
{"word": "go back", "english": "I’ll go back to cooking tonight.", "thai": "ฉันจะกลับไปทำอาหารคืนนี้"}
{"word": "go back", "english": "She went back to her art project.", "thai": "เธอกลับไปทำโปรเจกต์ศิลปะ"}
{"word": "go back", "english": "We should go back to the campsite.", "thai": "เราควรกลับไปที่แคมป์"}
{"word": "go back", "english": "He went back to find his glasses.", "thai": "เขากลับไปหาแว่นตา"}
{"word": "go back", "english": "I don’t want to go back to that city.", "thai": "ฉันไม่อยากกลับไปเมืองนั้น"}
{"word": "go back", "english": "They went back to their old diet.", "thai": "พวกเขากลับไปกินอาหารแบบเดิม"}
{"word": "go back", "english": "Go back and check the stove.", "thai": "กลับไปเช็คเตา"}
{"word": "go back", "english": "She wants to go back to dancing.", "thai": "เธออยากกลับไปเต้นรำ"}
{"word": "go back", "english": "I need to go back to the library.", "thai": "ฉันต้องกลับไปที่ห้องสมุด"}
{"word": "go back", "english": "He went back to his old gym.", "thai": "เขากลับไปยิมเก่า"}
{"word": "go back", "english": "Can we go back to the old design?", "thai": "เรากลับไปใช้การออกแบบเก่าได้ไหม?"}
{"word": "go back", "english": "I’ll go back and finish my homework.", "thai": "ฉันจะกลับไปทำการบ้านให้เสร็จ"}
{"word": "go back", "english": "She went back to her old friends.", "thai": "เธอกลับไปหาเพื่อนเก่า"}
{"word": "go back", "english": "We should go back to the beach house.", "thai": "เราควรกลับไปที่บ้านริมชายหาด"}
{"word": "go back", "english": "He went back to get his backpack.", "thai": "เขากลับไปหยิบเป้"}
{"word": "go back", "english": "I want to go back to the museum.", "thai": "ฉันอยากกลับไปที่พิพิธภัณฑ์"}
{"word": "go back", "english": "They went back to their old system.", "thai": "พวกเขากลับไปใช้ระบบเก่า"}
{"word": "go back", "english": "Go back and look for my pen.", "thai": "กลับไปหาปากกาของฉัน"}
{"word": "go back", "english": "She went back to her painting hobby.", "thai": "เธอกลับไปสู่งานอดิเรกวาดภาพ"}
{"word": "go back", "english": "I need to go back to the classroom.", "thai": "ฉันต้องกลับไปที่ห้องเรียน"}
{"word": "go back", "english": "He went back to his old apartment.", "thai": "เขากลับไปที่อพาร์ตเมนต์เก่า"}
{"word": "go back", "english": "Can you go back and get the charger?", "thai": "คุณกลับไปหยิบที่ชาร์จได้ไหม?"}
{"word": "go back", "english": "I’ll go back to work tomorrow.", "thai": "ฉันจะกลับไปทำงานพรุ่งนี้"}
{"word": "go back", "english": "She went back to her old workout.", "thai": "เธอกลับไปออกกำลังกายแบบเดิม"}
{"word": "go back", "english": "We should go back to the trailhead.", "thai": "เราควรกลับไปที่จุดเริ่มต้นเส้นทาง"}
{"word": "go back", "english": "He went back to find his phone.", "thai": "เขากลับไปหาโทรศัพท์"}
{"word": "go back", "english": "I don’t want to go back to that hotel.", "thai": "ฉันไม่อยากกลับไปโรงแรมนั้น"}
{"word": "go back", "english": "They went back to their old recipe.", "thai": "พวกเขากลับไปใช้สูตรเก่า"}
{"word": "go back", "english": "Go back and make sure it’s safe.", "thai": "กลับไปดูให้แน่ใจว่าปลอดภัย"}
{"word": "go back", "english": "She wants to go back to her old club.", "thai": "เธออยากกลับไปที่ชมรมเก่า"}
{"word": "go back", "english": "I need to go back to the kitchen.", "thai": "ฉันต้องกลับไปที่ครัว"}
{"word": "go back", "english": "He went back to his old routine.", "thai": "เขากลับไปสู่วิถีชีวิตเดิม"}
{"word": "go back", "english": "Can we go back to the old format?", "thai": "เรากลับไปใช้รูปแบบเก่าได้ไหม?"}
{"word": "go back", "english": "I’ll go back and review my notes.", "thai": "ฉันจะกลับไปทบทวนบันทึก"}
{"word": "go back", "english": "She went back to her old hairstyle.", "thai": "เธอกลับไปทำทรงผมแบบเดิม"}
{"word": "go back", "english": "We should go back to the lake.", "thai": "เราควรกลับไปที่ทะเลสาบ"}
{"word": "go back", "english": "He went back to get his hat.", "thai": "เขากลับไปหยิบหมวก"}
{"word": "go back", "english": "I want to go back to that cafe.", "thai": "ฉันอยากกลับไปที่ร้านกาแฟนั้น"}
{"word": "go back", "english": "They went back to their old strategy.", "thai": "พวกเขากลับไปใช้กลยุทธ์เก่า"}
{"word": "go back", "english": "Go back and find my umbrella.", "thai": "กลับไปหาร่มของฉัน"}
{"word": "go back", "english": "She went back to her old diet plan.", "thai": "เธอกลับไปใช้แผนควบคุมอาหารเดิม"}
{"word": "go back", "english": "I need to go back to the meeting.", "thai": "ฉันต้องกลับไปที่ประชุม"}
{"word": "go back", "english": "He went back to his old band.", "thai": "เขากลับไปวงดนตรีเก่า"}
{"word": "go back", "english": "Can you go back and get the tickets?", "thai": "คุณกลับไปหยิบตั๋วได้ไหม?"}
{"word": "go back", "english": "I’ll go back to practicing piano.", "thai": "ฉันจะกลับไปฝึกเปียโน"}
{"word": "go back", "english": "She went back to her old city.", "thai": "เธอกลับไปเมืองเก่า"}
{"word": "go back", "english": "We should go back to the festival.", "thai": "เราควรกลับไปที่งานเทศกาล"}
{"word": "go back", "english": "He went back to grab his laptop.", "thai": "เขากลับไปหยิบแล็ปท็อป"}
{"word": "go back", "english": "I don’t want to go back to that park.", "thai": "ฉันไม่อยากกลับไปที่สวนสาธารณะนั้น"}
{"word": "go back", "english": "They went back to their old rules.", "thai": "พวกเขากลับไปใช้กฎเก่า"}
{"word": "go back", "english": "Go back and check your bag.", "thai": "กลับไปเช็คกระเป๋าของคุณ"}
{"word": "go back", "english": "She wants to go back to her old gym.", "thai": "เธออยากกลับไปยิมเก่า"}
{"word": "go back", "english": "I need to go back to the car.", "thai": "ฉันต้องกลับไปที่รถ"}
{"word": "go back", "english": "He went back to his old project.", "thai": "เขากลับไปทำโปรเจกต์เก่า"}
{"word": "go back", "english": "Can we go back to the old schedule?", "thai": "เรากลับไปใช้ตารางเวลาเก่าได้ไหม?"}
{"word": "go back", "english": "I’ll go back and tidy the room.", "thai": "ฉันจะกลับไปจัดห้อง"}
{"word": "go back", "english": "She went back to her old book club.", "thai": "เธอกลับไปที่ชมรมหนังสือเก่า"}
{"word": "go back", "english": "We should go back to the old trail.", "thai": "เราควรกลับไปที่เส้นทางเก่า"}
{"word": "go back", "english": "He went back to get his shoes.", "thai": "เขากลับไปหยิบรองเท้า"}
{"word": "go on", "english": "Go on, tell me what happened next.", "thai": "เล่าต่อไปสิ บอกฉันว่าเกิดอะไรต่อ"}
{"word": "go on", "english": "I can’t believe this is going on!", "thai": "ฉันไม่อยากเชื่อว่านี่มันเกิดขึ้นอยู่!"}
{"word": "go on", "english": "She went on talking for hours.", "thai": "เธอพูดต่อไปเป็นชั่วโมง"}
{"word": "go on", "english": "Just go on and finish your work.", "thai": "ทำต่อไปเลย เสร็จงานของเธอ"}
{"word": "go on", "english": "What’s going on with the project?", "thai": "โปรเจกต์นี้มันดำเนินไปยังไง?"}
{"word": "go on", "english": "He went on to win the championship.", "thai": "เขาไปคว้าแชมป์ต่อ"}
{"word": "go on", "english": "Go on, take the first step!", "thai": "ไปเลย ก้าวแรก!"}
{"word": "go on", "english": "The party went on until midnight.", "thai": "งานปาร์ตี้ดำเนินต่อไปจนถึงเที่ยงคืน"}
{"word": "go on", "english": "I told her to go on without me.", "thai": "ฉันบอกให้เธอไปต่อโดยไม่มีฉัน"}
{"word": "go on", "english": "What’s going on with your new job?", "thai": "งานใหม่ของเธอเป็นยังไงบ้าง?"}
{"word": "go on", "english": "Go on, give it a try!", "thai": "ไปเลย ลองดู!"}
{"word": "go on", "english": "He went on explaining the rules.", "thai": "เขาอธิบายกฎต่อไป"}
{"word": "go on", "english": "The show must go on!", "thai": "การแสดงต้องดำเนินต่อ!"}
{"word": "go on", "english": "She went on to start her own company.", "thai": "เธอไปเริ่มบริษัทของตัวเองต่อ"}
{"word": "go on", "english": "Go on and ask your question.", "thai": "ถามคำถามของเธอต่อไปเลย"}
{"word": "go on", "english": "What’s going on at the park today?", "thai": "วันนี้ที่สวนสาธารณะมีอะไรเกิดขึ้น?"}
{"word": "go on", "english": "He went on about his new car all day.", "thai": "เขาพูดถึงรถใหม่ทั้งวัน"}
{"word": "go on", "english": "Go on, you can do it!", "thai": "ไปเลย เธอทำได้!"}
{"word": "go on", "english": "The meeting went on longer than expected.", "thai": "การประชุมดำเนินต่อไปนานกว่าที่คาด"}
{"word": "go on", "english": "I can’t go on working like this.", "thai": "ฉันทำงานแบบนี้ต่อไปไม่ไหว"}
{"word": "go on", "english": "Go on and pick your favorite.", "thai": "ไปเลย เลือกอันที่ชอบ"}
{"word": "go on", "english": "She went on to write a bestseller.", "thai": "เธอไปเขียนหนังสือขายดีต่อ"}
{"word": "go on", "english": "What’s going on with the weather?", "thai": "สภาพอากาศมันเป็นยังไง?"}
{"word": "go on", "english": "He went on complaining about the food.", "thai": "เขาบ่นเรื่องอาหารต่อไป"}
{"word": "go on", "english": "Go on, share your story!", "thai": "เล่าต่อไปสิ แชร์เรื่องของเธอ!"}
{"word": "go on", "english": "The game went on despite the rain.", "thai": "เกมดำเนินต่อไปทั้งๆ ที่ฝนตก"}
{"word": "go on", "english": "I told him to go on without waiting.", "thai": "ฉันบอกให้เขาไปต่อโดยไม่ต้องรอ"}
{"word": "go on", "english": "What’s going on at school today?", "thai": "วันนี้ที่โรงเรียนมีอะไรเกิดขึ้น?"}
{"word": "go on", "english": "She went on singing despite the noise.", "thai": "เธอร้องเพลงต่อไปทั้งๆ ที่มีเสียงดัง"}
{"word": "go on", "english": "Go on and try the new recipe.", "thai": "ไปเลย ลองสูตรใหม่"}
{"word": "go on", "english": "He went on to become a doctor.", "thai": "เขาไปเป็นหมอต่อ"}
{"word": "go on", "english": "The concert went on for three hours.", "thai": "คอนเสิร์ตดำเนินต่อไปสามชั่วโมง"}
{"word": "go on", "english": "Go on, tell us your idea.", "thai": "เล่าต่อไปสิ บอกไอเดียของเธอ"}
{"word": "go on", "english": "What’s going on with your plans?", "thai": "แผนของเธอเป็นยังไงบ้าง?"}
{"word": "go on", "english": "She went on about her vacation all day.", "thai": "เธอพูดถึงวันหยุดทั้งวัน"}
{"word": "go on", "english": "Go on, you’re doing great!", "thai": "ไปเลย เธอทำได้ดี!"}
{"word": "go on", "english": "The argument went on for too long.", "thai": "การโต้เถียงดำเนินต่อไปนานเกิน"}
{"word": "go on", "english": "I can’t go on without some rest.", "thai": "ฉันไปต่อไม่ไหวถ้าไม่พัก"}
{"word": "go on", "english": "Go on and take the first bite.", "thai": "ไปเลย กัดคำแรก"}
{"word": "go on", "english": "He went on to lead the team.", "thai": "เขาไปนำทีมต่อ"}
{"word": "go on", "english": "What’s going on at the office?", "thai": "ที่ออฟฟิศมีอะไรเกิดขึ้น?"}
{"word": "go on", "english": "She went on reading despite the noise.", "thai": "เธออ่านต่อไปทั้งๆ ที่มีเสียงดัง"}
{"word": "go on", "english": "Go on and open the gift.", "thai": "ไปเลย เปิดของขวัญ"}
{"word": "go on", "english": "The festival went on all weekend.", "thai": "งานเทศกาลดำเนินต่อไปทั้งสุดสัปดาห์"}
{"word": "go on", "english": "Go on, share your opinion.", "thai": "ไปเลย แชร์ความเห็นของเธอ"}
{"word": "go on", "english": "He went on to finish the project.", "thai": "เขาไปทำโปรเจกต์ให้เสร็จต่อ"}
{"word": "go on", "english": "What’s going on with the neighbors?", "thai": "เพื่อนบ้านมีอะไรเกิดขึ้น?"}
{"word": "go on", "english": "She went on dancing all night.", "thai": "เธอเต้นต่อไปทั้งคืน"}
{"word": "go on", "english": "Go on and call her now.", "thai": "ไปเลย โทรหาเธอตอนนี้"}
{"word": "go on", "english": "The class went on despite the power outage.", "thai": "ชั้นเรียนดำเนินต่อไปทั้งๆ ที่ไฟดับ"}
{"word": "go on", "english": "I told them to go on without me.", "thai": "ฉันบอกให้พวกเขาไปต่อโดยไม่มีฉัน"}
{"word": "go on", "english": "What’s going on at the club tonight?", "thai": "คืนนี้ที่คลับมีอะไรเกิดขึ้น?"}
{"word": "go on", "english": "He went on about his new phone.", "thai": "เขาพูดถึงโทรศัพท์ใหม่ต่อไป"}
{"word": "go on", "english": "Go on, you can finish the race!", "thai": "ไปเลย เธอวิ่งถึงเส้นชัยได้!"}
{"word": "go on", "english": "The event went on as planned.", "thai": "งานดำเนินต่อไปตามแผน"}
{"word": "go on", "english": "Go on and eat, it’s getting cold.", "thai": "ไปเลย กินสิ อาหารจะเย็นแล้ว"}
{"word": "go on", "english": "She went on to teach at the university.", "thai": "เธอไปสอนที่มหาวิทยาลัยต่อ"}
{"word": "go on", "english": "What’s going on with your car?", "thai": "รถของเธอเป็นยังไงบ้าง?"}
{"word": "go on", "english": "He went on working late into the night.", "thai": "เขาทำงานต่อไปจนดึก"}
{"word": "go on", "english": "Go on and pick a color.", "thai": "ไปเลย เลือกสี"}
{"word": "go on", "english": "The debate went on for hours.", "thai": "การถกเถียงดำเนินต่อไปเป็นชั่วโมง"}
{"word": "go on", "english": "I can’t go on without some help.", "thai": "ฉันไปต่อไม่ไหวถ้าไม่มีคนช่วย"}
{"word": "go on", "english": "Go on, tell me your secret.", "thai": "ไปเลย บอกความลับของเธอให้ฉันฟัง"}
{"word": "go on", "english": "She went on to win the award.", "thai": "เธอไปคว้ารางวัลต่อ"}
{"word": "go on", "english": "What’s going on at the market?", "thai": "ที่ตลาดมีอะไรเกิดขึ้น?"}
{"word": "go on", "english": "He went on about his favorite book.", "thai": "เขาพูดถึงหนังสือเล่มโปรดต่อไป"}
{"word": "go on", "english": "Go on and try the new drink.", "thai": "ไปเลย ลองเครื่องดื่มใหม่"}
{"word": "go on", "english": "The play went on despite the rain.", "thai": "ละครดำเนินต่อไปทั้งๆ ที่ฝนตก"}
{"word": "go on", "english": "Go on, you’re almost done!", "thai": "ไปเลย เธอเกือบเสร็จแล้ว!"}
{"word": "go on", "english": "She went on to learn a new skill.", "thai": "เธอไปเรียนทักษะใหม่ต่อ"}
{"word": "go on", "english": "What’s going on with your family?", "thai": "ครอบครัวของเธอเป็นยังไงบ้าง?"}
{"word": "go on", "english": "He went on painting despite the mess.", "thai": "เขาวาดภาพต่อไปทั้งๆ ที่เลอะเทอะ"}
{"word": "go on", "english": "Go on and take a seat.", "thai": "ไปเลย นั่งลง"}
{"word": "go on", "english": "The protest went on all day.", "thai": "การประท้วงดำเนินต่อไปทั้งวัน"}
{"word": "go on", "english": "Go on, tell us your plan.", "thai": "ไปเลย บอกแผนของเธอให้เราฟัง"}
{"word": "go on", "english": "She went on to open her own store.", "thai": "เธอไปเปิดร้านของตัวเองต่อ"}
{"word": "go on", "english": "What’s going on at the beach?", "thai": "ที่ชายหาดมีอะไรเกิดขึ้น?"}
{"word": "go on", "english": "He went on about his new job.", "thai": "เขาพูดถึงงานใหม่ต่อไป"}
{"word": "go on", "english": "Go on and finish your story.", "thai": "เล่าต่อไปเลย จบเรื่องของเธอ"}
{"word": "go on", "english": "The lecture went on too long.", "thai": "การบรรยายดำเนินต่อไปนานเกิน"}
{"word": "go on", "english": "I can’t go on without some food.", "thai": "ฉันไปต่อไม่ไหวถ้าไม่มีอาหาร"}
{"word": "go on", "english": "Go on, show us your dance.", "thai": "ไปเลย โชว์เต้นของเธอ"}
{"word": "go on", "english": "She went on to climb the mountain.", "thai": "เธอไปปีนเขาต่อ"}
{"word": "go on", "english": "What’s going on with the team?", "thai": "ทีมนี้เป็นยังไงบ้าง?"}
{"word": "go on", "english": "He went on writing his book.", "thai": "เขาเขียนหนังสือต่อไป"}
{"word": "go on", "english": "Go on and start the game.", "thai": "ไปเลย เริ่มเกม"}
{"word": "go on", "english": "The festival went on despite the storm.", "thai": "งานเทศกาลดำเนินต่อไปทั้งๆ ที่มีพายุ"}
{"word": "go on", "english": "Go on, you can win this!", "thai": "ไปเลย เธอชนะได้!"}
{"word": "go on", "english": "She went on to study abroad.", "thai": "เธอไปเรียนต่อต่างประเทศ"}
{"word": "go on", "english": "What’s going on at the concert?", "thai": "ที่คอนเสิร์ตมีอะไรเกิดขึ้น?"}
{"word": "go on", "english": "He went on about his trip.", "thai": "เขาพูดถึงทริปของเขาต่อไป"}
{"word": "go on", "english": "Go on and sing your song.", "thai": "ไปเลย ร้องเพลงของเธอ"}
{"word": "go on", "english": "The meeting went on without a break.", "thai": "การประชุมดำเนินต่อไปโดยไม่พัก"}
{"word": "go on", "english": "I told her to go on with her speech.", "thai": "ฉันบอกให้เธอพูดต่อ"}
{"word": "go on", "english": "What’s going on with the kids?", "thai": "เด็กๆ เป็นยังไงบ้าง?"}
{"word": "go on", "english": "She went on cooking despite the chaos.", "thai": "เธอทำอาหารต่อไปทั้งๆ ที่โกลาหล"}
{"word": "go on", "english": "Go on and take the lead!", "thai": "ไปเลย นำไป!"}
{"word": "go on", "english": "He went on to run a marathon.", "thai": "เขาไปวิ่งมาราธอนต่อ"}
{"word": "go out", "english": "Let’s go out for dinner tonight.", "thai": "ไปกินข้าวเย็นข้างนอกกันคืนนี้"}
{"word": "go out", "english": "I don’t want to go out in this rain.", "thai": "ฉันไม่อยากออกไปข้างนอกตอนฝนตก"}
{"word": "go out", "english": "She went out with her friends last night.", "thai": "เมื่อคืนเธอออกไปกับเพื่อน"}
{"word": "go out", "english": "The fire went out after a few hours.", "thai": "ไฟดับลงหลังจากไม่กี่ชั่วโมง"}
{"word": "go out", "english": "He wants to go out and see a movie.", "thai": "เขาอยากออกไปดูหนัง"}
{"word": "go out", "english": "Can we go out for coffee later?", "thai": "ไปดื่มกาแฟด้วยกันทีหลังได้ไหม?"}
{"word": "go out", "english": "They went out to celebrate their anniversary.", "thai": "พวกเขาออกไปฉลองครบรอบ"}
{"word": "go out", "english": "The power went out during the storm.", "thai": "ไฟฟ้าดับระหว่างพายุ"}
{"word": "go out", "english": "I’m too tired to go out tonight.", "thai": "ฉันเหนื่อยเกินกว่าจะออกไปคืนนี้"}
{"word": "go out", "english": "She’s going out with her new boyfriend.", "thai": "เธอกำลังคบกับแฟนใหม่"}
{"word": "go out", "english": "Let’s go out and explore the city.", "thai": "ไปสำรวจเมืองกันเถอะ"}
{"word": "go out", "english": "The candle went out in the wind.", "thai": "เทียนดับลงเพราะลม"}
{"word": "go out", "english": "He went out to buy some groceries.", "thai": "เขาออกไปซื้อของชำ"}
{"word": "go out", "english": "Do you want to go out dancing?", "thai": "อยากออกไปเต้นรำไหม?"}
{"word": "go out", "english": "They went out for a late-night snack.", "thai": "พวกเขาออกไปกินของว่างดึกๆ"}
{"word": "go out", "english": "The lights went out in the theater.", "thai": "ไฟในโรงละครดับลง"}
{"word": "go out", "english": "I need to go out and get some air.", "thai": "ฉันต้องออกไปสูดอากาศ"}
{"word": "go out", "english": "She doesn’t go out much anymore.", "thai": "เธอไม่ออกไปไหนบ่อยแล้ว"}
{"word": "go out", "english": "Let’s go out to the new restaurant.", "thai": "ไปร้านอาหารใหม่กันเถอะ"}
{"word": "go out", "english": "The campfire went out before dawn.", "thai": "กองไฟดับลงก่อนรุ่งสาง"}
{"word": "go out", "english": "He went out to walk the dog.", "thai": "เขาออกไปพาสุนัขไปเดิน"}
{"word": "go out", "english": "Do you want to go out for drinks?", "thai": "อยากออกไปดื่มอะไรกันไหม?"}
{"word": "go out", "english": "They went out to see a concert.", "thai": "พวกเขาออกไปดูคอนเสิร์ต"}
{"word": "go out", "english": "The stove went out during cooking.", "thai": "เตาดับลงระหว่างทำอาหาร"}
{"word": "go out", "english": "I’m going out with my coworkers later.", "thai": "ฉันจะออกไปกับเพื่อนร่วมงานทีหลัง"}
{"word": "go out", "english": "She went out to the park with her kids.", "thai": "เธอพาเด็กๆ ออกไปที่สวนสาธารณะ"}
{"word": "go out", "english": "Let’s go out and watch the sunset.", "thai": "ไปดูพระอาทิตย์ตกกันเถอะ"}
{"word": "go out", "english": "The lantern went out in the rain.", "thai": "โคมไฟดับลงในฝน"}
{"word": "go out", "english": "He doesn’t go out on weeknights.", "thai": "เขาไม่ออกไปไหนในคืนวันทำงาน"}
{"word": "go out", "english": "They’re going out to a fancy dinner.", "thai": "พวกเขาจะออกไปกินข้าวเย็นสุดหรู"}
{"word": "go out", "english": "The electricity went out last night.", "thai": "เมื่อคืนไฟฟ้าดับ"}
{"word": "go out", "english": "I want to go out and have some fun.", "thai": "ฉันอยากออกไปสนุก"}
{"word": "go out", "english": "She went out to meet her date.", "thai": "เธอออกไปเจอคนที่เดตด้วย"}
{"word": "go out", "english": "Let’s go out for ice cream.", "thai": "ไปกินไอศกรีมกันเถอะ"}
{"word": "go out", "english": "The fireplace went out after midnight.", "thai": "เตาผิงดับลงหลังเที่ยงคืน"}
{"word": "go out", "english": "He went out to grab some coffee.", "thai": "เขาออกไปซื้อกาแฟ"}
{"word": "go out", "english": "Do you go out with your friends often?", "thai": "คุณออกไปกับเพื่อนบ่อยไหม?"}
{"word": "go out", "english": "They went out to the club last weekend.", "thai": "สุดสัปดาห์ที่แล้วพวกเขาออกไปที่คลับ"}
{"word": "go out", "english": "The light bulb went out in the hallway.", "thai": "หลอดไฟในโถงทางเดินดับ"}
{"word": "go out", "english": "I’m going out to run some errands.", "thai": "ฉันจะออกไปทำธุระ"}
{"word": "go out", "english": "She went out with her sister tonight.", "thai": "คืนนี้เธอออกไปกับน้องสาว"}
{"word": "go out", "english": "Let’s go out and see the fireworks.", "thai": "ไปดูดอกไม้ไฟกันเถอะ"}
{"word": "go out", "english": "The torch went out in the wind.", "thai": "คบเพลิงดับลงเพราะลม"}
{"word": "go out", "english": "He wants to go out and play soccer.", "thai": "เขาอยากออกไปเล่นฟุตบอล"}
{"word": "go out", "english": "They’re going out for a romantic date.", "thai": "พวกเขาจะออกไปเดตสุดโรแมนติก"}
{"word": "go out", "english": "The heater went out during the night.", "thai": "เครื่องทำความร้อนดับลงตอนกลางคืน"}
{"word": "go out", "english": "I don’t feel like going out today.", "thai": "วันนี้ฉันไม่อยากออกไปไหน"}
{"word": "go out", "english": "She went out to buy a new dress.", "thai": "เธอออกไปซื้อชุดใหม่"}
{"word": "go out", "english": "Let’s go out for a walk in the park.", "thai": "ไปเดินเล่นในสวนกันเถอะ"}
{"word": "go out", "english": "The streetlights went out after the storm.", "thai": "ไฟถนนดับลงหลังพายุ"}
{"word": "go out", "english": "He went out to check the mail.", "thai": "เขาออกไปเช็คจดหมาย"}
{"word": "go out", "english": "Do you want to go out for pizza?", "thai": "อยากออกไปกินพิซซ่าไหม?"}
{"word": "go out", "english": "They went out to the beach yesterday.", "thai": "เมื่อวานพวกเขาออกไปที่ชายหาด"}
{"word": "go out", "english": "The pilot light went out on the stove.", "thai": "ไฟนำร่องบนเตาดับลง"}
{"word": "go out", "english": "I’m going out with my family tonight.", "thai": "คืนนี้ฉันจะออกไปกับครอบครัว"}
{"word": "go out", "english": "She went out to take some photos.", "thai": "เธอออกไปถ่ายรูป"}
{"word": "go out", "english": "Let’s go out and enjoy the festival.", "thai": "ไปสนุกกับงานเทศกาลกันเถอะ"}
{"word": "go out", "english": "The bonfire went out before we left.", "thai": "กองไฟดับลงก่อนเราจะไป"}
{"word": "go out", "english": "He doesn’t go out much since moving.", "thai": "เขาไม่ออกไปไหนบ่อยตั้งแต่ย้ายมา"}
{"word": "go out", "english": "They’re going out to a new bar.", "thai": "พวกเขาจะออกไปที่บาร์ใหม่"}
{"word": "go out", "english": "The signal went out during the call.", "thai": "สัญญาณขาดหายระหว่างการโทร"}
{"word": "go out", "english": "I want to go out and try new food.", "thai": "ฉันอยากออกไปลองอาหารใหม่"}
{"word": "go out", "english": "She went out with her classmates.", "thai": "เธอออกไปกับเพื่อนร่วมชั้น"}
{"word": "go out", "english": "Let’s go out for a quick lunch.", "thai": "ไปกินข้าวเที่ยงเร็วๆ กันเถอะ"}
{"word": "go out", "english": "The lamp went out in the living room.", "thai": "โคมไฟในห้องนั่งเล่นดับลง"}
{"word": "go out", "english": "He went out to fix the fence.", "thai": "เขาออกไปซ่อมรั้ว"}
{"word": "go out", "english": "Do you go out to clubs often?", "thai": "คุณออกไปคลับบ่อยไหม?"}
{"word": "go out", "english": "They went out for a night hike.", "thai": "พวกเขาออกไปเดินป่ากลางคืน"}
{"word": "go out", "english": "The flashlight went out in the dark.", "thai": "ไฟฉายดับลงในความมืด"}
{"word": "go out", "english": "I’m going out to meet a friend.", "thai": "ฉันจะออกไปเจอเพื่อน"}
{"word": "go out", "english": "She went out to shop for shoes.", "thai": "เธอออกไปซื้อรองเท้า"}
{"word": "go out", "english": "Let’s go out and see the parade.", "thai": "ไปดูขบวนพาเหรดกันเถอะ"}
{"word": "go out", "english": "The stove’s flame went out again.", "thai": "เปลวไฟเตาดับลงอีกแล้ว"}
{"word": "go out", "english": "He went out to jog this morning.", "thai": "เขาออกไปวิ่งตอนเช้า"}
{"word": "go out", "english": "They’re going out to a comedy show.", "thai": "พวกเขาจะออกไปดูโชว์ตลก"}
{"word": "go out", "english": "The radio went out during the drive.", "thai": "วิทยุดับลงระหว่างขับรถ"}
{"word": "go out", "english": "I don’t go out as much as I used to.", "thai": "ฉันไม่ออกไปไหนบ่อยเหมือนแต่ก่อน"}
{"word": "go out", "english": "She went out to visit her parents.", "thai": "เธอออกไปเยี่ยมพ่อแม่"}
{"word": "go out", "english": "Let’s go out for some sushi.", "thai": "ไปกินซูชิกันเถอะ"}
{"word": "go out", "english": "The spark went out in the firepit.", "thai": "ประกายไฟดับลงในหลุมไฟ"}
{"word": "go out", "english": "He went out to water the plants.", "thai": "เขาออกไปรดน้ำต้นไม้"}
{"word": "go out", "english": "Do you want to go out for a hike?", "thai": "อยากออกไปเดินป่าไหม?"}
{"word": "go out", "english": "They went out to a karaoke bar.", "thai": "พวกเขาออกไปที่บาร์คาราโอเกะ"}
{"word": "go out", "english": "The phone signal went out in the tunnel.", "thai": "สัญญาณโทรศัพท์ขาดหายในอุโมงค์"}
{"word": "go out", "english": "I’m going out to grab some lunch.", "thai": "ฉันจะออกไปซื้อข้าวเที่ยง"}
{"word": "go out", "english": "She went out with her book club.", "thai": "เธอออกไปกับชมรมหนังสือ"}
{"word": "go out", "english": "Let’s go out and stargaze tonight.", "thai": "ไปดูดาวกันคืนนี้"}
{"word": "go out", "english": "The grill’s fire went out early.", "thai": "ไฟเตาย่างดับลงเร็ว"}
{"word": "go out", "english": "He went out to feed the chickens.", "thai": "เขาออกไปให้อาหารไก่"}
{"word": "go out", "english": "They’re going out to a new cafe.", "thai": "พวกเขาจะออกไปที่ร้านกาแฟใหม่"}
{"word": "go out", "english": "The TV went out during the game.", "thai": "ทีวีดับลงระหว่างเกม"}
{"word": "go out", "english": "I want to go out and relax tonight.", "thai": "ฉันอยากออกไปผ่อนคลายคืนนี้"}
{"word": "go out", "english": "She went out to the mall with friends.", "thai": "เธอออกไปห้างกับเพื่อน"}
{"word": "go out", "english": "Let’s go out for a bike ride.", "thai": "ไปปั่นจักรยานกันเถอะ"}
{"word": "go out", "english": "The candle went out during dinner.", "thai": "เทียนดับลงระหว่างมื้อเย็น"}
{"word": "go out", "english": "He went out to check the car.", "thai": "เขาออกไปเช็ครถ"}
{"word": "go out", "english": "Do you go out for breakfast often?", "thai": "คุณออกไปกินอาหารเช้าบ่อยไหม?"}
{"word": "go out", "english": "They went out to a museum exhibit.", "thai": "พวกเขาออกไปดูนิทรรศการพิพิธภัณฑ์"}
{"word": "go out", "english": "The Wi-Fi went out this morning.", "thai": "ไวไฟขาดหายเช้านี้"}
{"word": "grow up", "english": "I can’t wait to grow up and move out.", "thai": "ฉันรอไม่ไหวที่จะโตขึ้นและย้ายออก"}
{"word": "grow up", "english": "He needs to grow up and take responsibility.", "thai": "เขาต้องโตขึ้นและรับผิดชอบ"}
{"word": "grow up", "english": "She grew up in a small town.", "thai": "เธอโตมาในเมืองเล็กๆ"}
{"word": "grow up", "english": "Stop acting like a kid, grow up!", "thai": "เลิกทำตัวเหมือนเด็ก โตขึ้นหน่อย!"}
{"word": "grow up", "english": "They grew up together as neighbors.", "thai": "พวกเขาโตมาด้วยกันในฐานะเพื่อนบ้าน"}
{"word": "grow up", "english": "I want my kids to grow up happy.", "thai": "ฉันอยากให้ลูกๆ โตขึ้นอย่างมีความสุข"}
{"word": "grow up", "english": "He grew up dreaming of being a pilot.", "thai": "เขาโตมาพร้อมความฝันอยากเป็นนักบิน"}
{"word": "grow up", "english": "You need to grow up and face reality.", "thai": "คุณต้องโตขึ้นและเผชิญหน้ากับความจริง"}
{"word": "grow up", "english": "She grew up with strict parents.", "thai": "เธอโตมากับพ่อแม่ที่เข้มงวด"}
{"word": "grow up", "english": "Kids grow up so fast these days.", "thai": "เด็กสมัยนี้โตเร็วมาก"}
{"word": "grow up", "english": "I grew up watching old cartoons.", "thai": "ฉันโตมากับการดูการ์ตูนเก่าๆ"}
{"word": "grow up", "english": "He’s 30, it’s time to grow up!", "thai": "เขาอายุ 30 แล้ว ถึงเวลาโตขึ้นแล้ว!"}
{"word": "grow up", "english": "She wants to grow up to be a doctor.", "thai": "เธออยากโตขึ้นเป็นหมอ"}
{"word": "grow up", "english": "They grew up in a big city.", "thai": "พวกเขาโตมาในเมืองใหญ่"}
{"word": "grow up", "english": "Grow up and stop whining!", "thai": "โตขึ้นหน่อย เลิกบ่นได้แล้ว!"}
{"word": "grow up", "english": "I grew up on a farm with animals.", "thai": "ฉันโตมาในฟาร์มที่มีสัตว์เลี้ยng"}
{"word": "grow up", "english": "She grew up speaking two languages.", "thai": "เธอโตมาพูดได้สองภาษา"}
{"word": "grow up", "english": "He needs to grow up and get a job.", "thai": "เขาต้องโตขึ้นและหางานทำ"}
{"word": "grow up", "english": "We grew up playing in the park.", "thai": "เราโตมากับการเล่นในสวนสาธารณะ"}
{"word": "grow up", "english": "I hope my kids grow up kind.", "thai": "ฉันหวังว่าลูกๆ จะโตขึ้นเป็นคนใจดี"}
{"word": "grow up", "english": "She grew up without much money.", "thai": "เธอโตมาโดยไม่มีเงินมาก"}
{"word": "grow up", "english": "Grow up, you can’t always have your way!", "thai": "โตขึ้นหน่อย คุณไม่ได้อะไรตามใจทุกครั้ง!"}
{"word": "grow up", "english": "He grew up in a musical family.", "thai": "เขาโตมาในครอบครัวที่รักดนตรี"}
{"word": "grow up", "english": "I want to grow up to be like my dad.", "thai": "ฉันอยากโตขึ้นเป็นเหมือนพ่อ"}
{"word": "grow up", "english": "They grew up with lots of pets.", "thai": "พวกเขาโตมากับสัตว์เลี้ยงเยอะ"}
{"word": "grow up", "english": "You need to grow up and apologize.", "thai": "คุณต้องโตขึ้นและขอโทษ"}
{"word": "grow up", "english": "She grew up near the beach.", "thai": "เธอโตมาใกล้ชายหาด"}
{"word": "grow up", "english": "I grew up reading comic books.", "thai": "ฉันโตมากับการอ่านการ์ตูน"}
{"word": "grow up", "english": "He’s old enough to grow up now.", "thai": "เขาอายุมากพอที่จะโตขึ้นแล้ว"}
{"word": "grow up", "english": "She wants to grow up to be a teacher.", "thai": "เธออยากโตขึ้นเป็นครู"}
{"word": "grow up", "english": "They grew up in different countries.", "thai": "พวกเขาโตมาในประเทศที่ต่างกัน"}
{"word": "grow up", "english": "Grow up and stop being so selfish!", "thai": "โตขึ้นหน่อย เลิกเห็นแก่ตัว!"}
{"word": "grow up", "english": "I grew up in a noisy neighborhood.", "thai": "ฉันโตมาในย่านที่วุ่นวาย"}
{"word": "grow up", "english": "She grew up loving to dance.", "thai": "เธอโตมาพร้อมความรักในการเต้น"}
{"word": "grow up", "english": "He needs to grow up and move on.", "thai": "เขาต้องโตขึ้นและก้าวต่อไป"}
{"word": "grow up", "english": "We grew up going to summer camp.", "thai": "เราโตมากับการไปแคมป์ฤดูร้อน"}
{"word": "grow up", "english": "I hope my kids grow up confident.", "thai": "ฉันหวังว่าลูกๆ จะโตขึ้นอย่างมั่นใจ"}
{"word": "grow up", "english": "She grew up in a single-parent home.", "thai": "เธอโตมาในบ้านที่มีพ่อแม่เลี้ยงเดี่ยว"}
{"word": "grow up", "english": "Grow up, you’re not a kid anymore!", "thai": "โตขึ้นหน่อย คุณไม่ใช่เด็กแล้ว!"}
{"word": "grow up", "english": "He grew up with his grandparents.", "thai": "เขาโตมากับปู่ย่าตายาย"}
{"word": "grow up", "english": "I want to grow up to be an artist.", "thai": "ฉันอยากโตขึ้นเป็นศิลปิน"}
{"word": "grow up", "english": "They grew up in the same village.", "thai": "พวกเขาโตมาในหมู่บ้านเดียวกัน"}
{"word": "grow up", "english": "You need to grow up and make decisions.", "thai": "คุณต้องโตขึ้นและตัดสินใจ"}
{"word": "grow up", "english": "She grew up surrounded by books.", "thai": "เธอโตมาท่ามกลางหนังสือ"}
{"word": "grow up", "english": "I grew up playing soccer every day.", "thai": "ฉันโตมากับการเล่นฟุตบอลทุกวัน"}
{"word": "grow up", "english": "He’s too immature, he needs to grow up.", "thai": "เขาเด็กเกินไป ต้องโตขึ้น"}
{"word": "grow up", "english": "She wants to grow up to be a chef.", "thai": "เธออยากโตขึ้นเป็นเชฟ"}
{"word": "grow up", "english": "They grew up with no technology.", "thai": "พวกเขาโตมาโดยไม่มีเทคโนโลยี"}
{"word": "grow up", "english": "Grow up and stop fighting over toys!", "thai": "โตขึ้นหน่อย เลิกแย่งของเล่น!"}
{"word": "grow up", "english": "I grew up in a quiet suburb.", "thai": "ฉันโตมาในย่านชานเมืองที่เงียบสงบ"}
{"word": "grow up", "english": "She grew up learning to play piano.", "thai": "เธอโตมากับการเรียนเปียโน"}
{"word": "grow up", "english": "He needs to grow up and pay his bills.", "thai": "เขาต้องโตขึ้นและจ่ายบิล"}
{"word": "grow up", "english": "We grew up riding bikes everywhere.", "thai": "เราโตมากับการปั่นจักรยานไปทุกที่"}
{"word": "grow up", "english": "I hope my kids grow up curious.", "thai": "ฉันหวังว่าลูกๆ จะโตขึ้นพร้อมความอยากรู้"}
{"word": "grow up", "english": "She grew up in a rural area.", "thai": "เธอโตมาในพื้นที่ชนบท"}
{"word": "grow up", "english": "Grow up, you can’t keep complaining!", "thai": "โตขึ้นหน่อย คุณบ่นตลอดไม่ได้!"}
{"word": "grow up", "english": "He grew up with a love for animals.", "thai": "เขาโตมาพร้อมความรักสัตว์"}
{"word": "grow up", "english": "I want to grow up to be a writer.", "thai": "ฉันอยากโตขึ้นเป็นนักเขียน"}
{"word": "grow up", "english": "They grew up in a bilingual home.", "thai": "พวกเขาโตมาในบ้านที่พูดสองภาษา"}
{"word": "grow up", "english": "You need to grow up and be serious.", "thai": "คุณต้องโตขึ้นและจริงจัง"}
{"word": "grow up", "english": "She grew up by the mountains.", "thai": "เธอโตมาใกล้ภูเขา"}
{"word": "grow up", "english": "I grew up listening to jazz music.", "thai": "ฉันโตมากับการฟังเพลงแจ๊ส"}
{"word": "grow up", "english": "He’s acting childish, he needs to grow up.", "thai": "เขาทำตัวเหมือนเด็ก ต้องโตขึ้น"}
{"word": "grow up", "english": "She wants to grow up to be a scientist.", "thai": "เธออยากโตขึ้นเป็นนักวิทยาศาสตร์"}
{"word": "grow up", "english": "They grew up without a TV.", "thai": "พวกเขาโตมาโดยไม่มีทีวี"}
{"word": "grow up", "english": "Grow up and stop being so lazy!", "thai": "โตขึ้นหน่อย เลิกขี้เกียจ!"}
{"word": "grow up", "english": "I grew up in a big family.", "thai": "ฉันโตมาในครอบครัวใหญ่"}
{"word": "grow up", "english": "She grew up loving to read.", "thai": "เธอโตมาพร้อมความรักในการอ่าน"}
{"word": "grow up", "english": "He needs to grow up and move out.", "thai": "เขาต้องโตขึ้นและย้ายออก"}
{"word": "grow up", "english": "We grew up exploring the woods.", "thai": "เราโตมากับการสำรวจป่า"}
{"word": "grow up", "english": "I hope my kids grow up brave.", "thai": "ฉันหวังว่าลูกๆ จะโตขึ้นอย่างกล้าหาญ"}
{"word": "grow up", "english": "She grew up in a coastal town.", "thai": "เธอโตมาในเมืองชายฝั่ง"}
{"word": "grow up", "english": "Grow up, you can’t always win!", "thai": "โตขึ้นหน่อย คุณชนะตลอดไม่ได้!"}
{"word": "grow up", "english": "He grew up with a single mom.", "thai": "เขาโตมากับแม่เลี้ยงเดี่ยว"}
{"word": "grow up", "english": "I want to grow up to be a musician.", "thai": "ฉันอยากโตขึ้นเป็นนักดนตรี"}
{"word": "grow up", "english": "They grew up in a tight-knit community.", "thai": "พวกเขาโตมาในชุมชนที่แน่นแฟ้น"}
{"word": "grow up", "english": "You need to grow up and help out.", "thai": "คุณต้องโตขึ้นและช่วยเหลือ"}
{"word": "grow up", "english": "She grew up near a big lake.", "thai": "เธอโตมาใกล้ทะเลสาบใหญ่"}
{"word": "grow up", "english": "I grew up playing video games.", "thai": "ฉันโตมากับการเล่นวิดีโอเกม"}
{"word": "grow up", "english": "He’s too silly, he needs to grow up.", "thai": "เขาขี้เล่นเกินไป ต้องโตขึ้น"}
{"word": "grow up", "english": "She wants to grow up to be a lawyer.", "thai": "เธออยากโตขึ้นเป็นทนาย"}
{"word": "grow up", "english": "They grew up with old traditions.", "thai": "พวกเขาโตมากับประเพณีเก่า"}
{"word": "grow up", "english": "Grow up and stop arguing!", "thai": "โตขึ้นหน่อย เลิกเถียง!"}
{"word": "grow up", "english": "I grew up in a crowded city.", "thai": "ฉันโตมาในเมืองที่แออัด"}
{"word": "grow up", "english": "She grew up wanting to travel.", "thai": "เธอโตมาพร้อมความอยากท่องเที่ยว"}
{"word": "grow up", "english": "He needs to grow up and save money.", "thai": "เขาต้องโตขึ้นและเก็บเงิน"}
{"word": "grow up", "english": "We grew up swimming in the river.", "thai": "เราโตมากับการว่ายน้ำในแม่น้ำ"}
{"word": "grow up", "english": "I hope my kids grow up honest.", "thai": "ฉันหวังว่าลูกๆ จะโตขึ้นอย่างซื่อสัตย์"}
{"word": "grow up", "english": "She grew up in a religious family.", "thai": "เธอโตมาในครอบครัวที่นับถือศาสนา"}
{"word": "grow up", "english": "Grow up, you can’t keep joking!", "thai": "โตขึ้นหน่อย คุณล้อเล่นตลอดไม่ได้!"}
{"word": "grow up", "english": "He grew up with his cousins nearby.", "thai": "เขาโตมากับญาติพี่น้องอยู่ใกล้ๆ"}
{"word": "grow up", "english": "I want to grow up to be an engineer.", "thai": "ฉันอยากโตขึ้นเป็นวิศวกร"}
{"word": "grow up", "english": "They grew up in a small apartment.", "thai": "พวกเขาโตมาในอพาร์ตเมนต์เล็กๆ"}
{"word": "grow up", "english": "You need to grow up and plan ahead.", "thai": "คุณต้องโตขึ้นและวางแผนล่วงหน้า"}
{"word": "grow up", "english": "She grew up in a farming community.", "thai": "เธอโตมาในชุมชนเกษตร"}
{"word": "grow up", "english": "I grew up loving outdoor adventures.", "thai": "ฉันโตมากับการรักการผจญภัยกลางแจ้ง"}
{"word": "grow up", "english": "He needs to grow up and be reliable.", "thai": "เขาต้องโตขึ้นและน่าเชื่อถือ"}
{"word": "grow up", "english": "We grew up chasing fireflies.", "thai": "เราโตมากับการวิ่งจับหิ่งห้อย"}
{"word": "hang out", "english": "Let’s hang out at the mall later.", "thai": "ไปเที่ยวห้างกันทีหลังดีกว่า"}
{"word": "hang out", "english": "I usually hang out with my friends on weekends.", "thai": "ฉันมักจะไปเที่ยวกับเพื่อนในวันหยุดสุดสัปดาห์"}
{"word": "hang out", "english": "She wants to hang out at the new cafe.", "thai": "เธออยากไปนั่งเล่นที่ร้านกาแฟใหม่"}
{"word": "hang out", "english": "We hung out at the park all day.", "thai": "เราไปเที่ยวที่สวนสาธารณะทั้งวัน"}
{"word": "hang out", "english": "He’s hanging out with his cousins tonight.", "thai": "คืนนี้เขาไปเที่ยวกับลูกพี่ลูกน้อง"}
{"word": "hang out", "english": "Do you want to hang out after school?", "thai": "อยากไปนั่งเล่นด้วยกันหลังเลิกเรียนไหม?"}
{"word": "hang out", "english": "They love to hang out by the beach.", "thai": "พวกเขาชอบไปนั่งเล่นที่ชายหาด"}
{"word": "hang out", "english": "I’m just gonna hang out at home today.", "thai": "วันนี้ฉันจะนั่งเล่นอยู่บ้าน"}
{"word": "hang out", "english": "She hung out with her coworkers last night.", "thai": "เมื่อคืนเธอไปเที่ยวกับเพื่อนร่วมงาน"}
{"word": "hang out", "english": "Let’s hang out and watch a movie.", "thai": "ไปนั่งดูหนังด้วยกันดีกว่า"}
{"word": "hang out", "english": "He always hangs out at the arcade.", "thai": "เขามักจะไปนั่งเล่นที่ตู้เกม"}
{"word": "hang out", "english": "We should hang out at the new bar.", "thai": "เราควรไปนั่งเล่นที่บาร์ใหม่"}
{"word": "hang out", "english": "They hung out at the festival all weekend.", "thai": "พวกเขาไปเที่ยวที่งานเทศกาลทั้งสุดสัปดาห์"}
{"word": "hang out", "english": "I don’t feel like hanging out tonight.", "thai": "คืนนี้ฉันไม่อยากไปนั่งเล่น"}
{"word": "hang out", "english": "She’s hanging out with her book club.", "thai": "เธอกำลังไปเที่ยวกับชมรมหนังสือ"}
{"word": "hang out", "english": "Let’s hang out and grab some food.", "thai": "ไปนั่งกินอะไรด้วยกันดีกว่า"}
{"word": "hang out", "english": "He hung out at the skate park yesterday.", "thai": "เมื่อวานเขาไปนั่งเล่นที่สวนสเก็ต"}
{"word": "hang out", "english": "Do you want to hang out at my place?", "thai": "อยากมานั่งเล่นที่บ้านฉันไหม?"}
{"word": "hang out", "english": "They’re hanging out by the pool today.", "thai": "วันนี้พวกเขาไปนั่งเล่นที่สระว่ายน้ำ"}
{"word": "hang out", "english": "I usually hang out at the coffee shop.", "thai": "ฉันมักจะไปนั่งเล่นที่ร้านกาแฟ"}
{"word": "hang out", "english": "She wants to hang out with her old friends.", "thai": "เธออยากไปเที่ยวกับเพื่อนเก่า"}
{"word": "hang out", "english": "We hung out at the concert last night.", "thai": "เมื่อคืนเราไปเที่ยวที่คอนเสิร์ต"}
{"word": "hang out", "english": "Let’s hang out and play some games.", "thai": "ไปเล่นเกมด้วยกันดีกว่า"}
{"word": "hang out", "english": "He’s hanging out at the library today.", "thai": "วันนี้เขาไปนั่งเล่นที่ห้องสมุด"}
{"word": "hang out", "english": "They love to hang out at the lake.", "thai": "พวกเขาชอบไปนั่งเล่นที่ทะเลสาบ"}
{"word": "hang out", "english": "I’m too tired to hang out after work.", "thai": "ฉันเหนื่อยเกินกว่าจะไปนั่งเล่นหลังเลิกงาน"}
{"word": "hang out", "english": "She hung out with her sister all day.", "thai": "เธอไปเที่ยวกับน้องสาวทั้งวัน"}
{"word": "hang out", "english": "Let’s hang out at the new pizza place.", "thai": "ไปนั่งเล่นที่ร้านพิซซ่าใหม่กัน"}
{"word": "hang out", "english": "He’s hanging out with his band tonight.", "thai": "คืนนี้เขาไปเที่ยวกับวงดนตรี"}
{"word": "hang out", "english": "Do you want to hang out this weekend?", "thai": "อยากไปนั่งเล่นด้วยกันสุดสัปดาห์นี้ไหม?"}
{"word": "hang out", "english": "They hung out at the bowling alley.", "thai": "พวกเขาไปนั่งเล่นที่ลานโบว์ลิ่ง"}
{"word": "hang out", "english": "I like to hang out at the bookstore.", "thai": "ฉันชอบไปนั่งเล่นที่ร้านหนังสือ"}
{"word": "hang out", "english": "She wants to hang out at the art gallery.", "thai": "เธออยากไปนั่งเล่นที่หอศิลป์"}
{"word": "hang out", "english": "We hung out by the river yesterday.", "thai": "เมื่อวานเราไปนั่งเล่นที่ริมแม่น้ำ"}
{"word": "hang out", "english": "Let’s hang out and listen to music.", "thai": "ไปนั่งฟังเพลงด้วยกันดีกว่า"}
{"word": "hang out", "english": "He’s hanging out at the gym today.", "thai": "วันนี้เขาไปนั่งเล่นที่ยิม"}
{"word": "hang out", "english": "They love to hang out at the rooftop bar.", "thai": "พวกเขาชอบไปนั่งเล่นที่บาร์บนดาดฟ้า"}
{"word": "hang out", "english": "I don’t hang out much during the week.", "thai": "ฉันไม่ค่อยไปนั่งเล่นในวันทำงาน"}
{"word": "hang out", "english": "She hung out with her classmates after school.", "thai": "เธอไปเที่ยวกับเพื่อนร่วมชั้นหลังเลิกเรียน"}
{"word": "hang out", "english": "Let’s hang out at the arcade tonight.", "thai": "ไปนั่งเล่นที่ตู้เกมคืนนี้ดีกว่า"}
{"word": "hang out", "english": "He’s hanging out with his teammates.", "thai": "เขากำลังไปเที่ยวกับเพื่อนร่วมทีม"}
{"word": "hang out", "english": "Do you want to hang out at the beach?", "thai": "อยากไปนั่งเล่นที่ชายหาดไหม?"}
{"word": "hang out", "english": "They hung out at the local diner.", "thai": "พวกเขาไปนั่งเล่นที่ร้านอาหารท้องถิ่น"}
{"word": "hang out", "english": "I usually hang out at my friend’s house.", "thai": "ฉันมักจะไปนั่งเล่นที่บ้านเพื่อน"}
{"word": "hang out", "english": "She wants to hang out at the park.", "thai": "เธออยากไปนั่งเล่นที่สวนสาธารณะ"}
{"word": "hang out", "english": "We hung out at the karaoke bar last night.", "thai": "เมื่อคืนเราไปนั่งเล่นที่บาร์คาราโอเกะ"}
{"word": "hang out", "english": "Let’s hang out and catch up soon.", "thai": "ไปนั่งคุยอัปเดตกันเร็วๆ นี้ดีกว่า"}
{"word": "hang out", "english": "He’s hanging out at the skate shop.", "thai": "เขากำลังไปนั่งเล่นที่ร้านสเก็ต"}
{"word": "hang out", "english": "They love to hang out at the mall.", "thai": "พวกเขาชอบไปนั่งเล่นที่ห้าง"}
{"word": "hang out", "english": "I’m not in the mood to hang out today.", "thai": "วันนี้ฉันไม่อยากไปนั่งเล่น"}
{"word": "hang out", "english": "She hung out with her cousins yesterday.", "thai": "เมื่อวานเธอไปเที่ยวกับลูกพี่ลูกน้อง"}
{"word": "hang out", "english": "Let’s hang out at the ice cream shop.", "thai": "ไปนั่งเล่นที่ร้านไอศกรีมกัน"}
{"word": "hang out", "english": "He’s hanging out with his old buddies.", "thai": "เขากำลังไปเที่ยวกับเพื่อนเก่า"}
{"word": "hang out", "english": "Do you want to hang out after work?", "thai": "อยากไปนั่งเล่นด้วยกันหลังเลิกงานไหม?"}
{"word": "hang out", "english": "They hung out at the music festival.", "thai": "พวกเขาไปนั่งเล่นที่งานเทศกาลดนตรี"}
{"word": "hang out", "english": "I like to hang out at the local cafe.", "thai": "ฉันชอบไปนั่งเล่นที่ร้านกาแฟท้องถิ่น"}
{"word": "hang out", "english": "She wants to hang out at the library.", "thai": "เธออยากไปนั่งเล่นที่ห้องสมุด"}
{"word": "hang out", "english": "We hung out by the campfire last night.", "thai": "เมื่อคืนเราไปนั่งเล่นที่กองไฟ"}
{"word": "hang out", "english": "Let’s hang out and play cards.", "thai": "ไปนั่งเล่นไพ่ด้วยกันดีกว่า"}
{"word": "hang out", "english": "He’s hanging out at the comic shop.", "thai": "เขากำลังไปนั่งเล่นที่ร้านการ์ตูน"}
{"word": "hang out", "english": "They love to hang out at the pier.", "thai": "พวกเขาชอบไปนั่งเล่นที่ท่าเรือ"}
{"word": "hang out", "english": "I don’t hang out much these days.", "thai": "ช่วงนี้ฉันไม่ค่อยไปนั่งเล่น"}
{"word": "hang out", "english": "She hung out with her neighbors yesterday.", "thai": "เมื่อวานเธอไปเที่ยวกับเพื่อนบ้าน"}
{"word": "hang out", "english": "Let’s hang out at the new sushi place.", "thai": "ไปนั่งเล่นที่ร้านซูชิใหม่กัน"}
{"word": "hang out", "english": "He’s hanging out with his gaming friends.", "thai": "เขากำลังไปเที่ยวกับเพื่อนที่เล่นเกมด้วยกัน"}
{"word": "hang out", "english": "Do you want to hang out at the zoo?", "thai": "อยากไปนั่งเล่นที่สวนสัตว์ไหม?"}
{"word": "hang out", "english": "They hung out at the farmers’ market.", "thai": "พวกเขาไปนั่งเล่นที่ตลาดเกษตรกร"}
{"word": "hang out", "english": "I usually hang out at the record store.", "thai": "ฉันมักจะไปนั่งเล่นที่ร้านแผ่นเสียง"}
{"word": "hang out", "english": "She wants to hang out at the museum.", "thai": "เธออยากไปนั่งเล่นที่พิพิธภัณฑ์"}
{"word": "hang out", "english": "We hung out at the boardwalk last weekend.", "thai": "สุดสัปดาห์ที่แล้วเราไปนั่งเล่นที่ทางเดินริมทะเล"}
{"word": "hang out", "english": "Let’s hang out and watch the sunset.", "thai": "ไปนั่งดูพระอาทิตย์ตกด้วยกันดีกว่า"}
{"word": "hang out", "english": "He’s hanging out at the bike shop.", "thai": "เขากำลังไปนั่งเล่นที่ร้านจักรยาน"}
{"word": "hang out", "english": "They love to hang out at the arcade.", "thai": "พวกเขาชอบไปนั่งเล่นที่ตู้เกม"}
{"word": "hang out", "english": "I’m too busy to hang out this week.", "thai": "สัปดาห์นี้ฉันยุ่งเกินกว่าจะไปนั่งเล่น"}
{"word": "hang out", "english": "She hung out with her dance team.", "thai": "เธอไปเที่ยวกับทีมเต้น"}
{"word": "hang out", "english": "Let’s hang out at the taco stand.", "thai": "ไปนั่งเล่นที่ร้านทาโก้กัน"}
{"word": "hang out", "english": "He’s hanging out with his study group.", "thai": "เขากำลังไปนั่งเล่นกับกลุ่มเรียน"}
{"word": "hang out", "english": "Do you want to hang out at the lake?", "thai": "อยากไปนั่งเล่นที่ทะเลสาบไหม?"}
{"word": "hang out", "english": "They hung out at the street fair.", "thai": "พวกเขาไปนั่งเล่นที่งานเทศกาลถนน"}
{"word": "hang out", "english": "I like to hang out at the juice bar.", "thai": "ฉันชอบไปนั่งเล่นที่ร้านน้ำผลไม้"}
{"word": "hang out", "english": "She wants to hang out at the bakery.", "thai": "เธออยากไปนั่งเล่นที่ร้านเบเกอรี่"}
{"word": "hang out", "english": "We hung out at the rooftop lounge.", "thai": "เราไปนั่งเล่นที่เลานจ์บนดาดฟ้า"}
{"word": "hang out", "english": "Let’s hang out and do some karaoke.", "thai": "ไปร้องคาราโอเกะด้วยกันดีกว่า"}
{"word": "hang out", "english": "He’s hanging out at the sports bar.", "thai": "เขากำลังไปนั่งเล่นที่บาร์กีฬา"}
{"word": "hang out", "english": "They love to hang out at the picnic spot.", "thai": "พวกเขาชอบไปนั่งเล่นที่จุดปิกนิก"}
{"word": "hang out", "english": "I don’t feel like hanging out right now.", "thai": "ตอนนี้ฉันไม่อยากไปนั่งเล่น"}
{"word": "hang out", "english": "She hung out with her art group.", "thai": "เธอไปเที่ยวกับกลุ่มศิลปะ"}
{"word": "hang out", "english": "Let’s hang out at the new burger joint.", "thai": "ไปนั่งเล่นที่ร้านเบอร์เกอร์ใหม่กัน"}
{"word": "hang out", "english": "He’s hanging out with his hiking buddies.", "thai": "เขากำลังไปเที่ยวกับเพื่อนเดินป่า"}
{"word": "hang out", "english": "Do you want to hang out at the pier?", "thai": "อยากไปนั่งเล่นที่ท่าเรือไหม?"}
{"word": "hang out", "english": "They hung out at the comedy club.", "thai": "พวกเขาไปนั่งเล่นที่คลับตลก"}
{"word": "hang out", "english": "I usually hang out at the smoothie shop.", "thai": "ฉันมักจะไปนั่งเล่นที่ร้านสมูทตี้"}
{"word": "hang out", "english": "She wants to hang out at the tea house.", "thai": "เธออยากไปนั่งเล่นที่ร้านชา"}
{"word": "hang out", "english": "We hung out at the flea market yesterday.", "thai": "เมื่อวานเราไปนั่งเล่นที่ตลาดนัด"}
{"word": "hang out", "english": "Let’s hang out and paint something.", "thai": "ไปนั่งวาดรูปด้วยกันดีกว่า"}
{"word": "hang out", "english": "He’s hanging out at the record store.", "thai": "เขากำลังไปนั่งเล่นที่ร้านแผ่นเสียง"}
{"word": "hang out", "english": "They love to hang out at the campfire.", "thai": "พวกเขาชอบไปนั่งเล่นที่กองไฟ"}
{"word": "hang out", "english": "I’m not up for hanging out tonight.", "thai": "คืนนี้ฉันไม่พร้อมไปนั่งเล่น"}
{"word": "hang out", "english": "She hung out with her yoga group.", "thai": "เธอไปเที่ยวกับกลุ่มโยคะ"}
{"word": "hang out", "english": "Let’s hang out at the food truck park.", "thai": "ไปนั่งเล่นที่สวนรถขายอาหารกัน"}
{"word": "hang out", "english": "He’s hanging out with his chess club.", "thai": "เขากำลังไปเที่ยวกับชมรมหมากรุก"}
{"word": "hang out", "english": "Do you want to hang out at the river?", "thai": "อยากไปนั่งเล่นที่ริมแม่น้ำไหม?"}
{"word": "hang out", "english": "They hung out at the outdoor cinema.", "thai": "พวกเขาไปนั่งเล่นที่โรงหนังกลางแจ้ง"}
{"word": "hold on", "english": "Hold on, I need to grab my phone.", "thai": "รอแป๊บ ฉันต้องไปหยิบโทรศัพท์"}
{"word": "hold on", "english": "Can you hold on for a minute?", "thai": "รอสักครู่ได้ไหม?"}
{"word": "hold on", "english": "Hold on tight, it’s a bumpy ride!", "thai": "จับให้แน่น ทางมันขรุขระ!"}
{"word": "hold on", "english": "She told me to hold on while she checked.", "thai": "เธอบอกให้ฉันรอเดี๋ยวตอนเธอเช็ค"}
{"word": "hold on", "english": "Hold on, I’m not ready yet!", "thai": "รอหน่อย ฉันยังไม่พร้อม!"}
{"word": "hold on", "english": "He’s holding on to his old jacket.", "thai": "เขายังยึดแจ็คเก็ตเก่าอยู่"}
{"word": "hold on", "english": "Hold on, let me finish my sentence.", "thai": "รอแป๊บ ขอฉันพูดให้จบก่อน"}
{"word": "hold on", "english": "They told us to hold on during the storm.", "thai": "พวกเขาบอกให้เราจับให้แน่นตอนพายุ"}
{"word": "hold on", "english": "Hold on, I’ll be right back.", "thai": "รอเดี๋ยว ฉันกลับมาเลย"}
{"word": "hold on", "english": "Can you hold on to this bag for me?", "thai": "ช่วยถือกระเป๋านี้ให้ฉันหน่อยได้ไหม?"}
{"word": "hold on", "english": "Hold on, I need to check my email.", "thai": "รอแป๊บ ฉันต้องเช็คอีเมล"}
{"word": "hold on", "english": "She’s holding on to her childhood toys.", "thai": "เธอยังเก็บของเล่นวัยเด็กไว้"}
{"word": "hold on", "english": "Hold on tight to the railing!", "thai": "จับราวให้แน่น!"	SDL
{"word": "hold on", "english": "Hold on, I’m on the phone right now.", "thai": "รอหน่อย ฉันกำลังคุยโทรศัพท์"}
{"word": "hold on", "english": "He told me to hold on for a second.", "thai": "เขาบอกให้ฉันรอสักครู่"}
{"word": "hold on", "english": "Hold on to your dreams, don’t give up.", "thai": "ยึดมั่นในความฝัน อย่ายอมแพ้"}
{"word": "hold on", "english": "Hold on, let me find my keys.", "thai": "รอแป๊บ ขอฉันหากุญแจก่อน"}
{"word": "hold on", "english": "She’s holding on to her old letters.", "thai": "เธอยังเก็บจดหมายเก่าๆ ไว้"}
{"word": "hold on", "english": "Hold on, I need to tie my shoe.", "thai": "รอหน่อย ฉันต้องผูกเชือกรองเท้า"}
{"word": "hold on", "english": "Can you hold on to this book for me?", "thai": "ช่วยถือหนังสือเล่มนี้ให้ฉันหน่อยได้ไหม?"}
{"word": "hold on", "english": "Hold on, I’m not done talking!", "thai": "รอแป๊บ ฉันยังพูดไม่จบ!"}
{"word": "hold on", "english": "He’s holding on to his old habits.", "thai": "เขายังยึดติดกับนิสัยเก่า"}
{"word": "hold on", "english": "Hold on tight, we’re going fast!", "thai": "จับให้แน่น เราไปเร็วแล้ว!"}
{"word": "hold on", "english": "Hold on, I’ll get the door.", "thai": "รอเดี๋ยว ฉันจะไปเปิดประตู"}
{"word": "hold on", "english": "She told him to hold on to the rope.", "thai": "เธอบอกให้เขาจับเชือกให้แน่น"}
{"word": "hold on", "english": "Hold on, let me check the schedule.", "thai": "รอแป๊บ ขอฉันเช็คตารางก่อน"}
{"word": "hold on", "english": "He’s holding on to his family photos.", "thai": "เขายังเก็บรูปครอบครัวไว้"}
{"word": "hold on", "english": "Hold on, I need to grab a pen.", "thai": "รอหน่อย ฉันต้องหยิบปากกา"}
{"word": "hold on", "english": "Can you hold on for a few minutes?", "thai": "รอสักสองสามนาทีได้ไหม?"}
{"word": "hold on", "english": "Hold on tight to the handlebars!", "thai": "จับแฮนด์ให้แน่น!"}
{"word": "hold on", "english": "She’s holding on to her old diary.", "thai": "เธอยังเก็บไดอารี่เก่าไว้"}
{"word": "hold on", "english": "Hold on, I’m coming with you.", "thai": "รอเดี๋ยว ฉันจะไปด้วย"}
{"word": "hold on", "english": "He told me to hold on to this ticket.", "thai": "เขาบอกให้ฉันถือตั๋วนี้ไว้"}
{"word": "hold on", "english": "Hold on, let me finish my coffee.", "thai": "รอแป๊บ ขอฉันดื่มกาแฟให้จบก่อน"}
{"word": "hold on", "english": "She’s holding on to her memories.", "thai": "เธอยังยึดติดกับความทรงจำ"}
{"word": "hold on", "english": "Hold on, I need to lock the door.", "thai": "รอหน่อย ฉันต้องล็อกประตู"}
{"word": "hold on", "english": "Can you hold on to my jacket?", "thai": "ช่วยถือแจ็คเก็ตให้ฉันหน่อยได้ไหม?"}
{"word": "hold on", "english": "Hold on, I’m almost ready.", "thai": "รอเดี๋ยว ฉันใกล้พร้อมแล้ว"}
{"word": "hold on", "english": "He’s holding on to his old car.", "thai": "เขายังเก็บรถเก่าไว้"}
{"word": "hold on", "english": "Hold on tight, it’s a wild ride!", "thai": "จับให้แน่น มันเป็นการขี่ที่ดุเดือด!"}
{"word": "hold on", "english": "Hold on, let me check my notes.", "thai": "รอแป๊บ ขอฉันเช็คบันทึกก่อน"}
{"word": "hold on", "english": "She’s holding on to her favorite book.", "thai": "เธอยังเก็บหนังสือเล่มโปรดไว้"}
{"word": "hold on", "english": "Hold on, I’ll grab some water.", "thai": "รอเดี๋ยว ฉันจะไปหยิบน้ำ"}
{"word": "hold on", "english": "Can you hold on to this package?", "thai": "ช่วยถือพัสดุนี้ให้หน่อยได้ไหม?"}
{"word": "hold on", "english": "Hold on, I’m looking for my wallet.", "thai": "รอหน่อย ฉันกำลังหากระเป๋าเงิน"}
{"word": "hold on", "english": "He’s holding on to his old dreams.", "thai": "เขายังยึดมั่นในความฝันเก่า"}
{"word": "hold on", "english": "Hold on tight, we’re almost there!", "thai": "จับให้แน่น เราใกล้ถึงแล้ว!"}
{"word": "hold on", "english": "Hold on, let me answer this call.", "thai": "รอแป๊บ ขอฉันรับโทรศัพท์ก่อน"}
{"word": "hold on", "english": "She’s holding on to her childhood blanket.", "thai": "เธอยังเก็บผ้าห่มวัยเด็กไว้"}
{"word": "hold on", "english": "Hold on, I need to find my glasses.", "thai": "รอหน่อย ฉันต้องหาแว่นตา"}
{"word": "hold on", "english": "Can you hold on to my keys?", "thai": "ช่วยถือกุญแจให้ฉันหน่อยได้ไหม?"}
{"word": "hold on", "english": "Hold on, I’m tying my shoes.", "thai": "รอเดี๋ยว ฉันกำลังผูกเชือกรองเท้า"}
{"word": "hold on", "english": "He’s holding on to his old guitar.", "thai": "เขายังเก็บกีตาร์เก่าไว้"}
{"word": "hold on", "english": "Hold on tight, the boat’s moving!", "thai": "จับให้แน่น เรือกำลังเคลื่อน!"}
{"word": "hold on", "english": "Hold on, let me grab my coat.", "thai": "รอแป๊บ ขอฉันหยิบโค้ตก่อน"}
{"word": "hold on", "english": "She’s holding on to her old phone.", "thai": "เธอยังเก็บโทรศัพท์เก่าไว้"}
{"word": "hold on", "english": "Hold on, I’ll check the time.", "thai": "รอเดี๋ยว ฉันจะเช็คเวลา"}
{"word": "hold on", "english": "Can you hold on to this letter?", "thai": "ช่วยถือจดหมายนี้ให้หน่อยได้ไหม?"}
{"word": "hold on", "english": "Hold on, I’m not sure about that.", "thai": "รอหน่อย ฉันไม่แน่ใจเรื่องนั้น"}
{"word": "hold on", "english": "He’s holding on to his old trophies.", "thai": "เขายังเก็บถ้วยรางวัลเก่าไว้"}
{"word": "hold on", "english": "Hold on tight, we’re going up!", "thai": "จับให้แน่น เราไปด้านบน!"}
{"word": "hold on", "english": "Hold on, let me write that down.", "thai": "รอแป๊บ ขอฉันจดก่อน"}
{"word": "hold on", "english": "She’s holding on to her old necklace.", "thai": "เธอยังเก็บสร้อยคอเก่าไว้"}
{"word": "hold on", "english": "Hold on, I need to close the window.", "thai": "รอหน่อย ฉันต้องปิดหน้าต่าง"}
{"word": "hold on", "english": "Can you hold on to my drink?", "thai": "ช่วยถือเครื่องดื่มให้ฉันหน่อยได้ไหม?"}
{"word": "hold on", "english": "Hold on, I’m almost done.", "thai": "รอเดี๋ยว ฉันใกล้เสร็จแล้ว"}
{"word": "hold on", "english": "He’s holding on to his old records.", "thai": "เขายังเก็บแผ่นเสียงเก่าไว้"}
{"word": "hold on", "english": "Hold on tight, it’s a sharp turn!", "thai": "จับให้แน่น โค้งนี้แรง!"}
{"word": "hold on", "english": "Hold on, let me check my bag.", "thai": "รอแป๊บ ขอฉันเช็คกระเป๋าก่อน"}
{"word": "hold on", "english": "She’s holding on to her old drawings.", "thai": "เธอยังเก็บภาพวาดเก่าไว้"}
{"word": "hold on", "english": "Hold on, I’ll get my laptop.", "thai": "รอเดี๋ยว ฉันจะไปหยิบแล็ปท็อป"}
{"word": "hold on", "english": "Can you hold on to this box?", "thai": "ช่วยถือกล่องนี้ให้หน่อยได้ไหม?"}
{"word": "hold on", "english": "Hold on, I need to think about this.", "thai": "รอหน่อย ฉันต้องคิดเรื่องนี้"}
{"word": "hold on", "english": "He’s holding on to his old bike.", "thai": "เขายังเก็บจักรยานเก่าไว้"}
{"word": "hold on", "english": "Hold on tight, we’re landing soon!", "thai": "จับให้แน่น เราใกล้ลงจอดแล้ว!"}
{"word": "hold on", "english": "Hold on, let me grab a tissue.", "thai": "รอแป๊บ ขอฉันหยิบทิชชู่"}
{"word": "hold on", "english": "She’s holding on to her old clothes.", "thai": "เธอยังเก็บเสื้อผ้าเก่าไว้"}
{"word": "hold on", "english": "Hold on, I’ll turn off the light.", "thai": "รอเดี๋ยว ฉันจะปิดไฟ"}
{"word": "hold on", "english": "Can you hold on to my hat?", "thai": "ช่วยถือหมวกให้ฉันหน่อยได้ไหม?"}
{"word": "hold on", "english": "Hold on, I’m checking the map.", "thai": "รอหน่อย ฉันกำลังเช็คแผนที่"}
{"word": "hold on", "english": "He’s holding on to his old watch.", "thai": "เขายังเก็บนาฬิกาเก่าไว้"}
{"word": "hold on", "english": "Hold on tight, the wind is strong!", "thai": "จับให้แน่น ลมแรง!"}
{"word": "hold on", "english": "Hold on, let me save my work.", "thai": "รอแป๊บ ขอฉันบันทึกงานก่อน"}
{"word": "hold on", "english": "She’s holding on to her old shoes.", "thai": "เธอยังเก็บรองเท้าเก่าไว้"}
{"word": "hold on", "english": "Hold on, I need to charge my phone.", "thai": "รอหน่อย ฉันต้องชาร์จโทรศัพท์"}
{"word": "hold on", "english": "Can you hold on to this pen?", "thai": "ช่วยถือปากกานี้ให้หน่อยได้ไหม?"}
{"word": "hold on", "english": "Hold on, I’m looking for my book.", "thai": "รอเดี๋ยว ฉันกำลังหาหนังสือ"}
{"word": "hold on", "english": "He’s holding on to his old camera.", "thai": "เขายังเก็บกล้องเก่าไว้"}
{"word": "hold on", "english": "Hold on tight, we’re taking off!", "thai": "จับให้แน่น เราเริ่มบินแล้ว!"}
{"word": "hold on", "english": "Hold on, let me grab my bag.", "thai": "รอแป๊บ ขอฉันหยิบกระเป๋าก่อน"}
{"word": "hold on", "english": "She’s holding on to her old ring.", "thai": "เธอยังเก็บแหวนเก่าไว้"}
{"word": "hold on", "english": "Hold on, I’ll open the window.", "thai": "รอเดี๋ยว ฉันจะเปิดหน้าต่าง"}
{"word": "hold on", "english": "Can you hold on to my notebook?", "thai": "ช่วยถือสมุดบันทึกให้ฉันหน่อยได้ไหม?"}
{"word": "hold on", "english": "Hold on, I need to text someone.", "thai": "รอหน่อย ฉันต้องส่งข้อความหาคน"}
{"word": "hold on", "english": "He’s holding on to his old posters.", "thai": "เขายังเก็บโปสเตอร์เก่าไว้"}
{"word": "hold on", "english": "Hold on tight, it’s a rough landing!", "thai": "จับให้แน่น การลงจอดนี้ยาก!"}
{"word": "hold on", "english": "Hold on, let me check my calendar.", "thai": "รอแป๊บ ขอฉันเช็คปฏิทินก่อน"}
{"word": "hold on", "english": "She’s holding on to her old journal.", "thai": "เธอยังเก็บสมุดบันทึกเก่าไว้"}
{"word": "hold on", "english": "Hold on, I’ll get my charger.", "thai": "รอเดี๋ยว ฉันจะไปหยิบที่ชาร์จ"}
{"word": "hold up", "english": "Hold up, I need to tie my shoes.", "thai": "รอแป๊บ ฉันต้องผูกเชือกรองเท้า"}
{"word": "hold up", "english": "Can you hold up for a second?", "thai": "รอสักครู่ได้ไหม?"}
{"word": "hold up", "english": "Hold up, that doesn’t make sense!", "thai": "เดี๋ยวก่อน มันไม่สมเหตุสมผล!"}
{"word": "hold up", "english": "The project is being held up by delays.", "thai": "โปรเจกต์ถูกชะงักเพราะความล่าช้า"}
{"word": "hold up", "english": "Hold up, I forgot my phone!", "thai": "รอหน่อย ฉันลืมโทรศัพท์!"}
{"word": "hold up", "english": "They held up the bank last night.", "thai": "เมื่อคืนพวกเขาปล้นธนาคาร"}
{"word": "hold up", "english": "Hold up, let me check my email.", "thai": "รอแป๊บ ขอฉันเช็คอีเมลก่อน"}
{"word": "hold up", "english": "This old car still holds up well.", "thai": "รถเก่านี่ยังทนดีอยู่"}
{"word": "hold up", "english": "Hold up, I’m not ready yet!", "thai": "รอหน่อย ฉันยังไม่พร้อม!"}
{"word": "hold up", "english": "The traffic is holding up our plans.", "thai": "รถติดทำให้แผนเราชะงัก"}
{"word": "hold up", "english": "Hold up, did you just say that?", "thai": "เดี๋ยวก่อน คุณเพิ่งพูดแบบนั้นเหรอ?"}
{"word": "hold up", "english": "She held up the line at the store.", "thai": "เธอทำให้แถวที่ร้านชะงัก"}
{"word": "hold up", "english": "Hold up, I need to grab my jacket.", "thai": "รอแป๊บ ฉันต้องหยิบแจ็คเก็ต"}
{"word": "hold up", "english": "His argument doesn’t hold up under scrutiny.", "thai": "ข้อโต้แย้งของเขาไม่สมเหตุสมผลเมื่อตรวจสอบ"}
{"word": "hold up", "english": "Hold up, I’ll be right back.", "thai": "รอเดี๋ยว ฉันกลับมาเลย"}
{"word": "hold up", "english": "They held up the convenience store.", "thai": "พวกเขาปล้นร้านสะดวกซื้อ"}
{"word": "hold up", "english": "Hold up, let me finish my coffee.", "thai": "รอแป๊บ ขอฉันดื่มกาแฟให้จบก่อน"}
{"word": "hold up", "english": "The deal was held up by negotiations.", "thai": "ข้อตกลงถูกชะงักเพราะการเจรจา"}
{"word": "hold up", "english": "Hold up, that’s not what we agreed!", "thai": "เดี๋ยวก่อน นั่นไม่ใช่สิ่งที่เราตกลง!"}
{"word": "hold up", "english": "This jacket holds up in the rain.", "thai": "แจ็คเก็ตนี้ทนฝนได้ดี"}
{"word": "hold up", "english": "Hold up, I need to answer this call.", "thai": "รอหน่อย ฉันต้องรับโทรศัพท์"}
{"word": "hold up", "english": "They held up traffic with their parade.", "thai": "พวกเขาทำให้รถติดด้วยขบวนพาเหรด"}
{"word": "hold up", "english": "Hold up, I’m looking for my keys.", "thai": "รอแป๊บ ฉันกำลังหากุญแจ"}
{"word": "hold up", "english": "Her story doesn’t hold up in court.", "thai": "เรื่องของเธอไม่สมเหตุสมผลในศาล"}
{"word": "hold up", "english": "Hold up, I need to check the time.", "thai": "รอหน่อย ฉันต้องเช็คเวลา"}
{"word": "hold up", "english": "The robbers held up the gas station.", "thai": "โจรปล้นปั๊มน้ำมัน"}
{"word": "hold up", "english": "Hold up, let me grab a pen.", "thai": "รอแป๊บ ขอฉันหยิบปากกา"}
{"word": "hold up", "english": "The repairs are holding up the schedule.", "thai": "การซ่อมทำให้ตารางชะงัก"}
{"word": "hold up", "english": "Hold up, you’re going too fast!", "thai": "เดี๋ยวก่อน คุณเร็วเกินไป!"}
{"word": "hold up", "english": "This old phone still holds up.", "thai": "โทรศัพท์เก่านี่ยังใช้ได้ดี"}
{"word": "hold up", "english": "Hold up, I need to lock the door.", "thai": "รอหน่อย ฉันต้องล็อกประตู"}
{"word": "hold up", "english": "They held up the meeting with questions.", "thai": "พวกเขาทำให้การประชุมชะงักด้วยคำถาม"}
{"word": "hold up", "english": "Hold up, I’m not following you.", "thai": "รอแป๊บ ฉันตามคุณไม่ทัน"}
{"word": "hold up", "english": "The tent held up during the storm.", "thai": "เต็นท์ทนได้ในพายุ"}
{"word": "hold up", "english": "Hold up, I’ll get the door.", "thai": "รอเดี๋ยว ฉันจะไปเปิดประตู"}
{"word": "hold up", "english": "They held up a jewelry store yesterday.", "thai": "เมื่อวานพวกเขาปล้นร้านจิวเวลรี่"}
{"word": "hold up", "english": "Hold up, let me check my bag.", "thai": "รอแป๊บ ขอฉันเช็คกระเป๋าก่อน"}
{"word": "hold up", "english": "The construction is holding up traffic.", "thai": "การก่อสร้างทำให้รถติด"}
{"word": "hold up", "english": "Hold up, that’s not what I meant!", "thai": "เดี๋ยวก่อน นั่นไม่ใช่สิ่งที่ฉันหมายถึง!"}
{"word": "hold up", "english": "This chair holds up after years of use.", "thai": "เก้าอี้นี่ยังทนหลังใช้มาหลายปี"}
{"word": "hold up", "english": "Hold up, I need to grab my wallet.", "thai": "รอหน่อย ฉันต้องหยิบกระเป๋าเงิน"}
{"word": "hold up", "english": "They held up the vote with debates.", "thai": "พวกเขาทำให้การลงคะแนนชะงักด้วยการถกเถียง"}
{"word": "hold up", "english": "Hold up, let me finish my sentence.", "thai": "รอแป๊บ ขอฉันพูดให้จบก่อน"}
{"word": "hold up", "english": "Her excuse doesn’t hold up at all.", "thai": "ข้อแก้ตัวของเธอไม่สมเหตุสมผลเลย"}
{"word": "hold up", "english": "Hold up, I’m checking the map.", "thai": "รอหน่อย ฉันกำลังเช็คแผนที่"}
{"word": "hold up", "english": "They held up a truck on the highway.", "thai": "พวกเขาปล้นรถบรรทุกบนทางหลวง"}
{"word": "hold up", "english": "Hold up, I need to find my glasses.", "thai": "รอแป๊บ ฉันต้องหาแว่นตา"}
{"word": "hold up", "english": "The weather is holding up our flight.", "thai": "สภาพอากาศทำให้เที่ยวบินเราชะงัก"}
{"word": "hold up", "english": "Hold up, you’re skipping a step!", "thai": "เดี๋ยวก่อน คุณข้ามขั้นตอน!"}
{"word": "hold up", "english": "This old couch still holds up.", "thai": "โซฟาเก่านี่ยังทนดี"}
{"word": "hold up", "english": "Hold up, I’ll grab some water.", "thai": "รอเดี๋ยว ฉันจะไปหยิบน้ำ"}
{"word": "hold up", "english": "They held up the store with a toy gun.", "thai": "พวกเขาปล้นร้านด้วยปืนของเล่น"}
{"word": "hold up", "english": "Hold up, let me save my work.", "thai": "รอแป๊บ ขอฉันบันทึกงานก่อน"}
{"word": "hold up", "english": "The budget issues are holding up progress.", "thai": "ปัญหางบประมาณทำให้ความคืบหน้าชะงัก"}
{"word": "hold up", "english": "Hold up, that’s not the right answer!", "thai": "เดี๋ยวก่อน นั่นไม่ใช่คำตอบที่ถูก!"}
{"word": "hold up", "english": "This watch holds up in the rain.", "thai": "นาฬิกานี่ทนฝนได้"}
{"word": "hold up", "english": "Hold up, I need to text someone.", "thai": "รอหน่อย ฉันต้องส่งข้อความหาคน"}
{"word": "hold up", "english": "They held up the delivery truck.", "thai": "พวกเขาปล้นรถส่งของ"}
{"word": "hold up", "english": "Hold up, let me check my notes.", "thai": "รอแป๊บ ขอฉันเช็คบันทึกก่อน"}
{"word": "hold up", "english": "The plan is holding up so far.", "thai": "แผนนี้ยังไปได้ดีอยู่"}
{"word": "hold up", "english": "Hold up, I’m not done yet!", "thai": "รอหน่อย ฉันยังไม่เสร็จ!"}
{"word": "hold up", "english": "They held up the line at the airport.", "thai": "พวกเขาทำให้แถวที่สนามบินชะงัก"}
{"word": "hold up", "english": "Hold up, I need to close the window.", "thai": "รอแป๊บ ฉันต้องปิดหน้าต่าง"}
{"word": "hold up", "english": "The old bridge still holds up.", "thai": "สะพานเก่ายังทนดี"}
{"word": "hold up", "english": "Hold up, let me grab my bag.", "thai": "รอหน่อย ขอฉันหยิบกระเป๋าก่อน"}
{"word": "hold up", "english": "They held up a casino last week.", "thai": "สัปดาห์ที่แล้วพวกเขาปล้นคาสิโน"}
{"word": "hold up", "english": "Hold up, that’s not what I said!", "thai": "เดี๋ยวก่อน ฉันไม่ได้พูดแบบนั้น!"}
{"word": "hold up", "english": "The shipment is being held up by customs.", "thai": "การขนส่งถูกชะงักโดยศุลกากร"}
{"word": "hold up", "english": "Hold up, I need to charge my phone.", "thai": "รอแป๊บ ฉันต้องชาร์จโทรศัพท์"}
{"word": "hold up", "english": "This tent holds up in strong winds.", "thai": "เต็นท์นี้ทนลมแรงได้"}
{"word": "hold up", "english": "Hold up, let me write that down.", "thai": "รอหน่อย ขอฉันจดก่อน"}
{"word": "hold up", "english": "They held up the bus on the road.", "thai": "พวกเขาปล้นรถบัสบนถนน"}
{"word": "hold up", "english": "Hold up, I’m checking my calendar.", "thai": "รอแป๊บ ขอฉันเช็คปฏิทินก่อน"}
{"word": "hold up", "english": "The evidence doesn’t hold up in court.", "thai": "หลักฐานไม่สมเหตุสมผลในศาล"}
{"word": "hold up", "english": "Hold up, I need to find my pen.", "thai": "รอหน่อย ฉันต้องหาปากกา"}
{"word": "hold up", "english": "They held up the meeting with complaints.", "thai": "พวกเขาทำให้การประชุมชะงักด้วยคำบ่น"}
{"word": "hold up", "english": "Hold up, you’re going too quick!", "thai": "เดี๋ยวก่อน คุณเร็วเกินไป!"}
{"word": "hold up", "english": "This old bike still holds up.", "thai": "จักรยานเก่านี่ยังทนดี"}
{"word": "hold up", "english": "Hold up, let me open the door.", "thai": "รอแป๊บ ขอฉันเปิดประตู"}
{"word": "hold up", "english": "They held up a grocery store.", "thai": "พวกเขาปล้นร้านขายของชำ"}
{"word": "hold up", "english": "Hold up, I need to grab a drink.", "thai": "รอหน่อย ฉันต้องหยิบเครื่องดื่ม"}
{"word": "hold up", "english": "The approval is holding up production.", "thai": "การอนุมัติทำให้การผลิตชะงัก"}
{"word": "hold up", "english": "Hold up, that’s not the right price!", "thai": "เดี๋ยวก่อน ราคานั้นไม่ถูกต้อง!"}
{"word": "hold up", "english": "This bag holds up in tough conditions.", "thai": "กระเป๋านี้ทนในสภาพที่ยากลำบาก"}
{"word": "hold up", "english": "Hold up, I’m looking for my glasses.", "thai": "รอแป๊บ ฉันกำลังหาแว่นตา"}
{"word": "hold up", "english": "They held up the train last night.", "thai": "เมื่อคืนพวกเขาปล้นรถไฟ"}
{"word": "hold up", "english": "Hold up, let me check my schedule.", "thai": "รอหน่อย ขอฉันเช็คตารางก่อน"}
{"word": "hold up", "english": "Her theory doesn’t hold up with facts.", "thai": "ทฤษฎีของเธอไม่สมเหตุสมผลกับข้อเท็จจริง"}
{"word": "hold up", "english": "Hold up, I need to find my wallet.", "thai": "รอแป๊บ ฉันต้องหากระเป๋าเงิน"}
{"word": "hold up", "english": "The protest is holding up the road.", "thai": "การประท้วงทำให้ถนนชะงัก"}
{"word": "hold up", "english": "Hold up, you missed a step!", "thai": "เดี๋ยวก่อน คุณข้ามขั้นตอน!"}
{"word": "hold up", "english": "This table holds up after years.", "thai": "โต๊ะนี้ยังทนหลังจากหลายปี"}
{"word": "hold up", "english": "Hold up, let me grab my coat.", "thai": "รอหน่อย ขอฉันหยิบโค้ตก่อน"}
{"word": "hold up", "english": "They held up a pawn shop yesterday.", "thai": "เมื่อวานพวกเขาปล้นร้านรับจำนำ"}
{"word": "hold up", "english": "Hold up, I need to close my laptop.", "thai": "รอแป๊บ ฉันต้องปิดแล็ปท็อป"}
{"word": "hold up", "english": "The paperwork is holding up the deal.", "thai": "เอกสารทำให้ข้อตกลงชะงัก"}
{"word": "hold up", "english": "Hold up, that’s not what happened!", "thai": "เดี๋ยวก่อน มันไม่ใช่แบบนั้น!"}
{"word": "hold up", "english": "This backpack holds up in the rain.", "thai": "เป้นี้ทนฝนได้"}
{"word": "hold up", "english": "Hold up, let me answer this text.", "thai": "รอหน่อย ขอฉันตอบข้อความก่อน"}
{"word": "keep on", "english": "Just keep on studying, you’ll get it!", "thai": "เรียนต่อไปเรื่อยๆ เดี๋ยวก็เข้าใจ!"}
{"word": "keep on", "english": "She kept on talking despite the noise.", "thai": "เธอพูดต่อไปเรื่อยๆ ทั้งๆ ที่มีเสียงดัง"}
{"word": "keep on", "english": "Keep on trying, don’t give up!", "thai": "พยายามต่อไป อย่ายอมแพ้!"}
{"word": "keep on", "english": "He keeps on forgetting his lines.", "thai": "เขาลืมบทพูดต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "I’ll keep on working until it’s done.", "thai": "ฉันจะทำงานต่อไปเรื่อยๆ จนเสร็จ"}
{"word": "keep on", "english": "They kept on hiking despite the rain.", "thai": "พวกเขาเดินป่าต่อไปเรื่อยๆ ทั้งๆ ที่ฝนตก"}
{"word": "keep on", "english": "Keep on running, you’re almost there!", "thai": "วิ่งต่อไป ใกล้ถึงแล้ว!"}
{"word": "keep on", "english": "She keeps on asking the same question.", "thai": "เธอถามคำถามเดิมต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Let’s keep on going to the next town.", "thai": "ไปต่อเรื่อยๆ ถึงเมืองถัดไปกันเถอะ"}
{"word": "keep on", "english": "He kept on painting until midnight.", "thai": "เขาวาดภาพต่อไปเรื่อยๆ จนถึงเที่ยงคืน"}
{"word": "keep on", "english": "Keep on practicing your guitar!", "thai": "ฝึกกีตาร์ต่อไปเรื่อยๆ!"}
{"word": "keep on", "english": "They keep on arguing about politics.", "thai": "พวกเขาเถียงเรื่องการเมืองต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "I’ll keep on calling until he answers.", "thai": "ฉันจะโทรต่อไปเรื่อyๆ จนกว่าเขาจะรับ"}
{"word": "keep on", "english": "She kept on reading despite the noise.", "thai": "เธออ่านต่อไปเรื่อยๆ ทั้งๆ ที่มีเสียงดัง"}
{"word": "keep on", "english": "Keep on walking, we’re almost home!", "thai": "เดินต่อไป ใกล้ถึงบ้านแล้ว!"}
{"word": "keep on", "english": "He keeps on losing his keys.", "thai": "เขาทำกุญแจหายต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Let’s keep on dancing all night!", "thai": "เต้นต่อไปเรื่อยๆ ทั้งคืนเลย!"}
{"word": "keep on", "english": "They kept on working through the storm.", "thai": "พวกเขาทำงานต่อไปเรื่อยๆ ผ่านพายุ"}
{"word": "keep on", "english": "Keep on trying, you’ll succeed!", "thai": "พยายามต่อไป คุณจะสำเร็จ!"}
{"word": "keep on", "english": "She keeps on singing in the shower.", "thai": "เธอร้องเพลงในห้องน้ำต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "I’ll keep on writing until it’s perfect.", "thai": "ฉันจะเขียนต่อไปเรื่อยๆ จนกว่ามันจะสมบูรณ์"}
{"word": "keep on", "english": "He kept on running despite the pain.", "thai": "เขาวิ่งต่อไปเรื่อยๆ ทั้งๆ ที่เจ็บ"}
{"word": "keep on", "english": "Keep on smiling, it looks good on you!", "thai": "ยิ้มต่อไป มันดูดีสำหรับคุณ!"}
{"word": "keep on", "english": "They keep on complaining about the food.", "thai": "พวกเขาบ่นเรื่องอาหารต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Let’s keep on moving forward.", "thai": "ไปต่อเรื่อยๆ ข้างหน้า"}
{"word": "keep on", "english": "She kept on knitting all afternoon.", "thai": "เธอถักนิตติ้งต่อไปเรื่อยๆ ทั้งบ่าย"}
{"word": "keep on", "english": "Keep on studying for the exam!", "thai": "เรียนต่อไปเพื่อสอบ!"}
{"word": "keep on", "english": "He keeps on texting during class.", "thai": "เขาส่งข้อความต่อไปเรื่อยๆ ระหว่างเรียน"}
{"word": "keep on", "english": "I’ll keep on searching for the answer.", "thai": "ฉันจะค้นหาคำตอบต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "They kept on playing despite the cold.", "thai": "พวกเขาเล่นต่อไปเรื่อยๆ ทั้งๆ ที่หนาว"}
{"word": "keep on", "english": "Keep on pushing, you’re doing great!", "thai": "พยายามต่อไป คุณทำได้ดี!"}
{"word": "keep on", "english": "She keeps on forgetting her lines.", "thai": "เธอลืมบทต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Let’s keep on cooking until it’s done.", "thai": "ทำอาหารต่อไปเรื่อยๆ จนเสร็จ"}
{"word": "keep on", "english": "He kept on joking during the meeting.", "thai": "เขาล้อเล่นต่อไปเรื่อยๆ ระหว่างประชุม"}
{"word": "keep on", "english": "Keep on walking, don’t stop now!", "thai": "เดินต่อไป อย่าหยุดตอนนี้!"}
{"word": "keep on", "english": "They keep on fighting over small things.", "thai": "พวกเขาทะเลาะกันเรื่องเล็กๆ ต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "I’ll keep on trying to fix this.", "thai": "ฉันจะพยายามซ่อมต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "She kept on dancing in the rain.", "thai": "เธอเต้นต่อไปเรื่อยๆ ในฝน"}
{"word": "keep on", "english": "Keep on reading, it’s a great book!", "thai": "อ่านต่อไป หนังสือเล่มนี้ดี!"}
{"word": "keep on", "english": "He keeps on calling at odd hours.", "thai": "เขาโทรมาตอนเวลาคี่ๆ ต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Let’s keep on exploring the city.", "thai": "สำรวจเมืองต่อไปเรื่อยๆ กันเถอะ"}
{"word": "keep on", "english": "They kept on laughing at the joke.", "thai": "พวกเขาหัวเราะต่อไปเรื่อยๆ กับมุกนั้น"}
{"word": "keep on", "english": "Keep on practicing, you’ll get better!", "thai": "ฝึกต่อไป คุณจะเก่งขึ้น!"}
{"word": "keep on", "english": "She keeps on buying new clothes.", "thai": "เธอซื้อเสื้อผ้าใหม่ต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "I’ll keep on running every morning.", "thai": "ฉันจะวิ่งทุกเช้าต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "He kept on working late into the night.", "thai": "เขาทำงานต่อไปเรื่อยๆ จนดึก"}
{"word": "keep on", "english": "Keep on singing, you sound amazing!", "thai": "ร้องต่อไป คุณร้องเพลงเก่งมาก!"}
{"word": "keep on", "english": "They keep on arguing about the plan.", "thai": "พวกเขาเถียงเรื่องแผนต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Let’s keep on hiking to the top.", "thai": "เดินป่าต่อไปถึงยอดเขาเลย"}
{"word": "keep on", "english": "She kept on writing her novel.", "thai": "เธอเขียนนิยายต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Keep on trying, you’re almost there!", "thai": "พยายามต่อไป ใกล้ถึงแล้ว!"}
{"word": "keep on", "english": "He keeps on forgetting his homework.", "thai": "เขาลืมการบ้านต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "I’ll keep on cleaning until it’s spotless.", "thai": "ฉันจะทำความสะอาดต่อไปเรื่อยๆ จนสะอาดเอี่ยม"}
{"word": "keep on", "english": "They kept on dancing at the party.", "thai": "พวกเขาเต้นต่อไปเรื่อยๆ ในงานปาร์ตี้"}
{"word": "keep on", "english": "Keep on moving, don’t slow down!", "thai": "เคลื่อนไหวต่อไป อย่าช้าลง!"}
{"word": "keep on", "english": "She keeps on calling her old friend.", "thai": "เธอโทรหาเพื่อนเก่าต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Let’s keep on playing this game.", "thai": "เล่นเกมนี้ต่อไปเรื่อยๆ กันเถอะ"}
{"word": "keep on", "english": "He kept on fixing the old car.", "thai": "เขาซ่อมรถเก่าต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Keep on writing, it’s a great story!", "thai": "เขียนต่อไป เรื่องนี้ดี!"}
{"word": "keep on", "english": "They keep on talking about the movie.", "thai": "พวกเขาคุยเรื่องหนังต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "I’ll keep on exercising every day.", "thai": "ฉันจะออกกำลังกายทุกวันต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "She kept on gardening in the rain.", "thai": "เธอทำสวนต่อไปเรื่อยๆ ในฝน"}
{"word": "keep on", "english": "Keep on learning, you’re doing well!", "thai": "เรียนต่อไป คุณทำได้ดี!"}
{"word": "keep on", "english": "He keeps on missing the bus.", "thai": "เขาตกรถบัสต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Let’s keep on driving to the coast.", "thai": "ขับรถต่อไปถึงชายฝั่งกันเถอะ"}
{"word": "keep on", "english": "They kept on cheering for their team.", "thai": "พวกเขาเชียร์ทีมต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Keep on painting, it looks amazing!", "thai": "วาดต่อไป มันดูดีมาก!"}
{"word": "keep on", "english": "She keeps on trying new recipes.", "thai": "เธอลองสูตรอาหารใหม่ต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "I’ll keep on reading this book.", "thai": "ฉันจะอ่านหนังสือเล่มนี้ต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "He kept on jogging despite the heat.", "thai": "เขาวิ่งจ๊อกกิ้งต่อไปเรื่อยๆ ทั้งๆ ที่ร้อน"}
{"word": "keep on", "english": "Keep on working, you’re almost done!", "thai": "ทำงานต่อไป ใกล้เสร็จแล้ว!"}
{"word": "keep on", "english": "They keep on debating the same topic.", "thai": "พวกเขาถกเถียงหัวข้อเดิมต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Let’s keep on exploring the forest.", "thai": "สำรวจป่าต่อไปเรื่อยๆ กันเถอะ"}
{"word": "keep on", "english": "She kept on singing at the concert.", "thai": "เธอร้องเพลงต่อไปเรื่อยๆ ในคอนเสิร์ต"}
{"word": "keep on", "english": "Keep on trying, you’ll figure it out!", "thai": "พยายามต่อไป คุณจะเข้าใจเอง!"}
{"word": "keep on", "english": "He keeps on losing his glasses.", "thai": "เขาทำแว่นตาหายต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "I’ll keep on knitting this scarf.", "thai": "ฉันจะถักผ้าพันคอนี้ต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "They kept on swimming in the lake.", "thai": "พวกเขาว่ายน้ำในทะเลสาบต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Keep on dancing, you look great!", "thai": "เต้นต่อไป คุณดูดี!"}
{"word": "keep on", "english": "She keeps on texting during dinner.", "thai": "เธอส่งข้อความต่อไปเรื่อยๆ ระหว่างมื้อเย็น"}
{"word": "keep on", "english": "Let’s keep on walking to the park.", "thai": "เดินต่อไปถึงสวนสาธารณะกันเถอะ"}
{"word": "keep on", "english": "He kept on building the model.", "thai": "เขาสร้างโมเดลต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Keep on studying, you’ll ace the test!", "thai": "เรียนต่อไป คุณจะสอบได้ดี!"}
{"word": "keep on", "english": "They keep on laughing at old jokes.", "thai": "พวกเขาหัวเราะมุกเก่าต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "I’ll keep on cooking this recipe.", "thai": "ฉันจะทำอาหารตามสูตรนี้ต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "She kept on running in the race.", "thai": "เธอวิ่งต่อไปเรื่อยๆ ในแข่งขัน"}
{"word": "keep on", "english": "Keep on smiling, it’s contagious!", "thai": "ยิ้มต่อไป มันติดต่อได้!"}
{"word": "keep on", "english": "He keeps on forgetting his wallet.", "thai": "เขาลืมกระเป๋าเงินต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Let’s keep on watching this show.", "thai": "ดูรายการนี้ต่อไปเรื่อยๆ กันเถอะ"}
{"word": "keep on", "english": "They kept on talking all night.", "thai": "พวกเขาคุยกันต่อไปเรื่อยๆ ทั้งคืน"}
{"word": "keep on", "english": "Keep on pushing, you’re so close!", "thai": "พยายามต่อไป คุณใกล้แล้ว!"}
{"word": "keep on", "english": "She keeps on drawing every day.", "thai": "เธอวาดรูปต่อไปเรื่อยๆ ทุกวัน"}
{"word": "keep on", "english": "I’ll keep on searching for my keys.", "thai": "ฉันจะค้นหากุญแจต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "He kept on climbing despite the wind.", "thai": "เขาปีนต่อไปเรื่อยๆ ทั้งๆ ที่ลมแรง"}
{"word": "keep on", "english": "Keep on working, it’s looking good!", "thai": "ทำงานต่อไป มันดูดี!"}
{"word": "keep on", "english": "They keep on joking about the game.", "thai": "พวกเขาล้อเล่นเรื่องเกมต่อไปเรื่อยๆ"}
{"word": "keep on", "english": "Let’s keep on biking to the lake.", "thai": "ปั่นจักรยานต่อไปถึงทะเลสาบกันเถอะ"}
{"word": "keep on", "english": "She kept on gardening all morning.", "thai": "เธอทำสวนต่อไปเรื่อยๆ ทั้งเช้า"}
{"word": "keep up", "english": "You need to keep up with the team!", "thai": "คุณต้องตามทีมให้ทัน!"}
{"word": "keep up", "english": "She’s struggling to keep up in class.", "thai": "เธอกำลังพยายามตามให้ทันในชั้นเรียน"}
{"word": "keep up", "english": "Keep up the good work, you’re doing great!", "thai": "รักษาผลงานดีๆ ไว้ คุณทำได้ดี!"}
{"word": "keep up", "english": "I can’t keep up with all these emails.", "thai": "ฉันตามอีเมลทั้งหมดนี้ไม่ทัน"}
{"word": "keep up", "english": "He keeps up with the latest news.", "thai": "เขาตามข่าวล่าสุดอยู่เสมอ"}
{"word": "keep up", "english": "Try to keep up with the fast pace.", "thai": "พยายามตามจังหวะเร็วๆ นี้ให้ทัน"}
{"word": "keep up", "english": "She’s keeping up with her fitness routine.", "thai": "เธอกำลังรักษาตารางออกกำลังกายไว้"}
{"word": "keep up", "english": "Keep up with your studies, don’t fall behind!", "thai": "ตามการเรียนให้ทัน อย่าตามหลัง!"}
{"word": "keep up", "english": "I’m trying to keep up with my bills.", "thai": "ฉันพยายามจัดการบิลให้ทัน"}
{"word": "keep up", "english": "He kept up with the group during the hike.", "thai": "เขาเดินตามกลุ่มให้ทันตอนเดินป่า"}
{"word": "keep up", "english": "Keep up the effort, you’re almost there!", "thai": "รักษาความพยายามไว้ ใกล้ถึงแล้ว!"}
{"word": "keep up", "english": "She can’t keep up with the new trends.", "thai": "เธอตามเทรนด์ใหม่ๆ ไม่ทัน"}
{"word": "keep up", "english": "I need to keep up with my reading.", "thai": "ฉันต้องตามการอ่านให้ทัน"}
{"word": "keep up", "english": "They kept up the house really well.", "thai": "พวกเขาดูแลบ้านได้ดีมาก"}
{"word": "keep up", "english": "Keep up with the traffic, don’t slow down!", "thai": "ตามการจราจรให้ทัน อย่าช้าลง!"}
{"word": "keep up", "english": "He’s keeping up with his old friends.", "thai": "เขายังติดต่อกับเพื่อนเก่าอยู่"}
{"word": "keep up", "english": "She kept up her grades all semester.", "thai": "เธอรักษาเกรดไว้ได้ทั้งเทอม"}
{"word": "keep up", "english": "I can’t keep up with all these changes.", "thai": "ฉันตามการเปลี่ยนแปลงทั้งหมดนี้ไม่ทัน"}
{"word": "keep up", "english": "Keep up the pace, we’re almost done!", "thai": "รักษาจังหวะไว้ เราใกล้เสร็จแล้ว!"}
{"word": "keep up", "english": "He’s trying to keep up with technology.", "thai": "เขาพยายามตามเทคโนโลยีให้ทัน"}
{"word": "keep up", "english": "She keeps up with her yoga practice.", "thai": "เธอรักษาการฝึกโยคะไว้"}
{"word": "keep up", "english": "Keep up with the group, don’t get lost!", "thai": "ตามกลุ่มให้ทัน อย่าหลง!"}
{"word": "keep up", "english": "I’m struggling to keep up with work.", "thai": "ฉันกำลังพยายามตามงานให้ทัน"}
{"word": "keep up", "english": "They kept up the garden beautifully.", "thai": "พวกเขาดูแลสวนได้สวยงาม"}
{"word": "keep up", "english": "Keep up the energy, you’re killing it!", "thai": "รักษาพลังไว้ คุณทำได้เยี่ยม!"}
{"word": "keep up", "english": "She can’t keep up with social media.", "thai": "เธอตามโซเชียลมีเดียไม่ทัน"}
{"word": "keep up", "english": "He kept up with the race until the end.", "thai": "เขาวิ่งตามการแข่งขันให้ทันจนจบ"}
{"word": "keep up", "english": "I need to keep up with my chores.", "thai": "ฉันต้องจัดการงานบ้านให้ทัน"}
{"word": "keep up", "english": "Keep up with the class, don’t lag behind!", "thai": "ตามชั้นเรียนให้ทัน อย่าตามหลัง!"}
{"word": "keep up", "english": "They’re keeping up with their neighbors.", "thai": "พวกเขาติดตามเพื่อนบ้านอยู่"}
{"word": "keep up", "english": "She kept up her blog all year.", "thai": "เธอรักษาบล็อกไว้ทั้งปี"}
{"word": "keep up", "english": "I can’t keep up with these deadlines.", "thai": "ฉันตามกำหนดเวลานี้ไม่ทัน"}
{"word": "keep up", "english": "Keep up the momentum, you’re doing awesome!", "thai": "รักษาความต่อเนื่อง คุณทำได้ดีมาก!"}
{"word": "keep up", "english": "He’s keeping up with his workout routine.", "thai": "เขารักษาตารางออกกำลังกายไว้"}
{"word": "keep up", "english": "She kept up with the fast conversation.", "thai": "เธอตามบทสนทนาที่เร็วให้ทัน"}
{"word": "keep up", "english": "I’m trying to keep up with the news.", "thai": "ฉันพยายามตามข่าวให้ทัน"}
{"word": "keep up", "english": "Keep up with the leader, don’t fall back!", "thai": "ตามผู้นำให้ทัน อย่าตามหลัง!"}
{"word": "keep up", "english": "They kept up the car’s maintenance.", "thai": "พวกเขาดูแลรักษารถยนต์"}
{"word": "keep up", "english": "She’s keeping up with her pen pals.", "thai": "เธอยังติดต่อกับเพื่อนทางจดหมาย"}
{"word": "keep up", "english": "Keep up the effort, it’s paying off!", "thai": "รักษาความพยายามไว้ มันเริ่มเห็นผล!"}
{"word": "keep up", "english": "I can’t keep up with all these updates.", "thai": "ฉันตามการอัปเดตทั้งหมดนี้ไม่ทัน"}
{"word": "keep up", "english": "He kept up with the team’s pace.", "thai": "เขาตามจังหวะของทีมให้ทัน"}
{"word": "keep up", "english": "She’s keeping up her piano practice.", "thai": "เธอรักษาการฝึกเปียโนไว้"}
{"word": "keep up", "english": "Keep up with the project, we’re on track!", "thai": "ตามโปรเจกต์ให้ทัน เรายังอยู่ในร่อง!"}
{"word": "keep up", "english": "I’m struggling to keep up with emails.", "thai": "ฉันกำลังพยายามตามอีเมลให้ทัน"}
{"word": "keep up", "english": "They kept up the old house nicely.", "thai": "พวกเขาดูแลบ้านเก่าได้ดี"}
{"word": "keep up", "english": "Keep up the good vibes, you’re awesome!", "thai": "รักษาบรรยากาศดีๆ ไว้ คุณเจ๋งมาก!"}
{"word": "keep up", "english": "She can’t keep up with fashion trends.", "thai": "เธอตามเทรนด์แฟชันไม่ทัน"}
{"word": "keep up", "english": "He kept up with the runners ahead.", "thai": "เขาวิ่งตามคนข้างหน้าให้ทัน"}
{"word": "keep up", "english": "I need to keep up with my taxes.", "thai": "ฉันต้องจัดการภาษีให้ทัน"}
{"word": "keep up", "english": "Keep up with the group, don’t get left!", "thai": "ตามกลุ่มให้ทัน อย่าถูกทิ้ง!"}
{"word": "keep up", "english": "She’s keeping up with her journal.", "thai": "เธอรักษาการเขียนสมุดบันทึกไว้"}
{"word": "keep up", "english": "I can’t keep up with these new apps.", "thai": "ฉันตามแอปใหม่ๆ เหล่านี้ไม่ทัน"}
{"word": "keep up", "english": "They kept up their farm perfectly.", "thai": "พวกเขาดูแลฟาร์มได้สมบูรณ์แบบ"}
{"word": "keep up", "english": "Keep up the progress, you’re killing it!", "thai": "รักษาความคืบหน้าไว้ คุณทำได้เยี่ยม!"}
{"word": "keep up", "english": "He’s keeping up with his old classmates.", "thai": "เขายังติดต่อกับเพื่อนร่วมชั้นเก่า"}
{"word": "keep up", "english": "She kept up with her dance lessons.", "thai": "เธอรักษาการเรียนเต้นไว้"}
{"word": "keep up", "english": "I’m trying to keep up with my schedule.", "thai": "ฉันพยายามตามตารางให้ทัน"}
{"word": "keep up", "english": "Keep up with the class, you can do it!", "thai": "ตามชั้นเรียนให้ทัน คุณทำได้!"}
{"word": "keep up", "english": "They kept up the boat’s maintenance.", "thai": "พวกเขาดูแลรักษาเรือ"}
{"word": "keep up", "english": "She’s keeping up with her book club.", "thai": "เธอยังติดตามชมรมหนังสือ"}
{"word": "keep up", "english": "Keep up the hard work, it’s worth it!", "thai": "รักษาความพยายามไว้ มันคุ้มค่า!"}
{"word": "keep up", "english": "I can’t keep up with these new games.", "thai": "ฉันตามเกมใหม่ๆ เหล่านี้ไม่ทัน"}
{"word": "keep up", "english": "He kept up with the cycling group.", "thai": "เขาปั่นจักรยานตามกลุ่มให้ทัน"}
{"word": "keep up", "english": "She’s keeping up her art projects.", "thai": "เธอรักษาโปรเจกต์ศิลปะไว้"}
{"word": "keep up", "english": "Keep up with the team, don’t slow down!", "thai": "ตามทีมให้ทัน อย่าช้าลง!"}
{"word": "keep up", "english": "I’m struggling to keep up with chores.", "thai": "ฉันกำลังพยายามตามงานบ้านให้ทัน"}
{"word": "keep up", "english": "They kept up their old car well.", "thai": "พวกเขาดูแลรถเก่าได้ดี"}
{"word": "keep up", "english": "Keep up the enthusiasm, it’s contagious!", "thai": "รักษาความกระตือรือร้นไว้ มันติดต่อได้!"}
{"word": "keep up", "english": "She can’t keep up with the gossip.", "thai": "เธอตามเรื่องซุบซิบไม่ทัน"}
{"word": "keep up", "english": "He kept up with the fast walkers.", "thai": "เขาเดินตามคนเดินเร็วให้ทัน"}
{"word": "keep up", "english": "I need to keep up with my emails.", "thai": "ฉันต้องตามอีเมลให้ทัน"}
{"word": "keep up", "english": "Keep up with the project, we’re close!", "thai": "ตามโปรเจกต์ให้ทัน เราใกล้แล้ว!"}
{"word": "keep up", "english": "She’s keeping up with her cooking skills.", "thai": "เธอรักษาทักษะการทำอาหารไว้"}
{"word": "keep up", "english": "I can’t keep up with all these shows.", "thai": "ฉันตามรายการทั้งหมดนี้ไม่ทัน"}
{"word": "keep up", "english": "They kept up their yard nicely.", "thai": "พวกเขาดูแลสนามหญ้าได้ดี"}
{"word": "keep up", "english": "Keep up the great job, you’re awesome!", "thai": "รักษางานดีๆ ไว้ คุณเจ๋งมาก!"}
{"word": "keep up", "english": "He’s keeping up with his old teammates.", "thai": "เขายังติดต่อกับเพื่อนร่วมทีมเก่า"}
{"word": "keep up", "english": "She kept up with her knitting projects.", "thai": "เธอรักษาโปรเจกต์ถักนิตติ้งไว้"}
{"word": "keep up", "english": "I’m trying to keep up with my workouts.", "thai": "ฉันพยายามตามการออกกำลังกายให้ทัน"}
{"word": "keep up", "english": "Keep up with the runners, you can do it!", "thai": "ตามนักวิ่งให้ทัน คุณทำได้!"}
{"word": "keep up", "english": "They kept up their old bike well.", "thai": "พวกเขาดูแลจักรยานเก่าได้ดี"}
{"word": "keep up", "english": "She’s keeping up with her studies.", "thai": "เธอรักษาการเรียนไว้"}
{"word": "keep up", "english": "Keep up the pace, we’re doing great!", "thai": "รักษาจังหวะไว้ เราทำได้ดี!"}
{"word": "keep up", "english": "I can’t keep up with these new rules.", "thai": "ฉันตามกฎใหม่ๆ เหล่านี้ไม่ทัน"}
{"word": "keep up", "english": "He kept up with the dance moves.", "thai": "เขาตามท่าเต้นให้ทัน"}
{"word": "keep up", "english": "She’s keeping up her gardening hobby.", "thai": "เธอรักษางานอดิเรกทำสวนไว้"}
{"word": "keep up", "english": "Keep up with the leader, don’t fall behind!", "thai": "ตามผู้นำให้ทัน อย่าตามหลัง!"}
{"word": "keep up", "english": "I’m struggling to keep up with my tasks.", "thai": "ฉันกำลังพยายามตามงานให้ทัน"}
{"word": "keep up", "english": "They kept up their old furniture well.", "thai": "พวกเขาดูแลเฟอร์นิเจอร์เก่าได้ดี"}
{"word": "keep up", "english": "Keep up the spirit, you’re amazing!", "thai": "รักษาจิตวิญญาณไว้ คุณสุดยอด!"}
{"word": "keep up", "english": "She can’t keep up with the new music.", "thai": "เธอตามเพลงใหม่ๆ ไม่ทัน"}
{"word": "keep up", "english": "He kept up with the swimmers ahead.", "thai": "เขาว่ายน้ำตามคนข้างหน้าให้ทัน"}
{"word": "keep up", "english": "I need to keep up with my budget.", "thai": "ฉันต้องจัดการงบประมาณให้ทัน"}
{"word": "keep up", "english": "Keep up with the plan, we’re on schedule!", "thai": "ตามแผนให้ทัน เรายังอยู่ในกำหนด!"}
{"word": "keep up", "english": "She’s keeping up with her painting.", "thai": "เธอรักษาการวาดภาพไว้"}
{"word": "keep up", "english": "I can’t keep up with these new gadgets.", "thai": "ฉันตามแกดเจ็ตใหม่ๆ เหล่านี้ไม่ทัน"}
{"word": "keep up", "english": "They kept up their old cabin well.", "thai": "พวกเขาดูแลกระท่อมเก่าได้ดี"}
{"word": "kick back", "english": "Let’s kick back and watch a movie tonight.", "thai": "พักผ่อนดูหนังกันคืนนี้ดีกว่า"}
{"word": "kick back", "english": "I just want to kick back this weekend.", "thai": "สุดสัปดาห์นี้ฉันแค่อยากพักผ่อน"}
{"word": "kick back", "english": "She’s kicking back at the beach today.", "thai": "วันนี้เธอพักผ่อนที่ชายหาด"}
{"word": "kick back", "english": "He kicked back with a cold drink.", "thai": "เขานั่งพักผ่อนพร้อมเครื่องดื่มเย็นๆ"}
{"word": "kick back", "english": "We should kick back after work.", "thai": "หลังเลิกงานเราควรพักผ่อน"}
{"word": "kick back", "english": "They’re kicking back by the pool.", "thai": "พวกเขากำลังพักผ่อนที่สระว่ายน้ำ"}
{"word": "kick back", "english": "I’m gonna kick back and read a book.", "thai": "ฉันจะพักผ่อนและอ่านหนังสือ"}
{"word": "kick back", "english": "She kicked back on the couch all day.", "thai": "เธอนอนพักผ่อนบนโซฟาทั้งวัน"}
{"word": "kick back", "english": "Let’s kick back with some music.", "thai": "พักผ่อนฟังเพลงกันดีกว่า"}
{"word": "kick back", "english": "He’s kicking back at his cabin.", "thai": "เขากำลังพักผ่อนที่กระท่อม"}
{"word": "kick back", "english": "I just need to kick back for a bit.", "thai": "ฉันแค่อยากพักผ่อนสักหน่อย"}
{"word": "kick back", "english": "They kicked back at the park yesterday.", "thai": "เมื่อวานพวกเขาพักผ่อนที่สวนสาธารณะ"}
{"word": "kick back", "english": "Let’s kick back and enjoy the sunset.", "thai": "พักผ่อนดูพระอาทิตย์ตกกันดีกว่า"}
{"word": "kick back", "english": "She’s kicking back with her friends.", "thai": "เธอกำลังพักผ่อนกับเพื่อนๆ"}
{"word": "kick back", "english": "He kicked back after a long day.", "thai": "เขาพักผ่อนหลังจากวันที่ยาวนาน"}
{"word": "kick back", "english": "I’m kicking back with some coffee.", "thai": "ฉันกำลังพักผ่อนจิบกาแฟ"}
{"word": "kick back", "english": "They’re kicking back at the lake house.", "thai": "พวกเขากำลังพักผ่อนที่บ้านริมทะเลสาบ"}
{"word": "kick back", "english": "Let’s kick back and play some games.", "thai": "พักผ่อนเล่นเกมกันดีกว่า"}
{"word": "kick back", "english": "She kicked back with a good book.", "thai": "เธอพักผ่อนพร้อมหนังสือดีๆ"}
{"word": "kick back", "english": "He’s kicking back on the porch.", "thai": "เขากำลังพักผ่อนที่ระเบียง"}
{"word": "kick back", "english": "I just want to kick back tonight.", "thai": "คืนนี้ฉันแค่อยากพักผ่อน"}
{"word": "kick back", "english": "They kicked back at the barbecue.", "thai": "พวกเขาพักผ่อนที่งานปิ้งย่าง"}
{"word": "kick back", "english": "Let’s kick back and listen to a podcast.", "thai": "พักผ่อนฟังพอดแคสต์กันดีกว่า"}
{"word": "kick back", "english": "She’s kicking back in her backyard.", "thai": "เธอกำลังพักผ่อนในสวนหลังบ้าน"}
{"word": "kick back", "english": "He kicked back with his favorite show.", "thai": "เขานั่งพักผ่อนดูรายการโปรด"}
{"word": "kick back", "english": "I’m gonna kick back at the cafe.", "thai": "ฉันจะไปพักผ่อนที่ร้านกาแฟ"}
{"word": "kick back", "english": "They’re kicking back at the campsite.", "thai": "พวกเขากำลังพักผ่อนที่แคมป์"}
{"word": "kick back", "english": "Let’s kick back with some snacks.", "thai": "พักผ่อนกินของว่างกันดีกว่า"}
{"word": "kick back", "english": "She kicked back by the fireplace.", "thai": "เธอพักผ่อนข้างเตาผิง"}
{"word": "kick back", "english": "He’s kicking back with his guitar.", "thai": "เขากำลังพักผ่อนพร้อมกีตาร์"}
{"word": "kick back", "english": "I just need to kick back and relax.", "thai": "ฉันแค่อยากพักผ่อนและผ่อนคลาย"}
{"word": "kick back", "english": "They kicked back at the rooftop bar.", "thai": "พวกเขาพักผ่อนที่บาร์บนดาดฟ้า"}
{"word": "kick back", "english": "Let’s kick back and watch the stars.", "thai": "พักผ่อนดูดาวกันดีกว่า"}
{"word": "kick back", "english": "She’s kicking back with her family.", "thai": "เธอกำลังพักผ่อนกับครอบครัว"}
{"word": "kick back", "english": "He kicked back after finishing work.", "thai": "เขาพักผ่อนหลังทำงานเสร็จ"}
{"word": "kick back", "english": "I’m kicking back with some ice cream.", "thai": "ฉันกำลังพักผ่อนกินไอศกรีม"}
{"word": "kick back", "english": "They’re kicking back at the picnic.", "thai": "พวกเขากำลังพักผ่อนที่ปิกนิก"}
{"word": "kick back", "english": "Let’s kick back and play some music.", "thai": "พักผ่อนเล่นดนตรีกันดีกว่า"}
{"word": "kick back", "english": "She kicked back on the hammock.", "thai": "เธอนอนพักผ่อนบนเปลญวน"}
{"word": "kick back", "english": "He’s kicking back at the coffee shop.", "thai": "เขากำลังพักผ่อนที่ร้านกาแฟ"}
{"word": "kick back", "english": "I just want to kick back this evening.", "thai": "เย็นนี้ฉันแค่อยากพักผ่อน"}
{"word": "kick back", "english": "They kicked back at the beach house.", "thai": "พวกเขาพักผ่อนที่บ้านริมชายหาด"}
{"word": "kick back", "english": "Let’s kick back with a board game.", "thai": "พักผ่อนเล่นบอร์ดเกมกันดีกว่า"}
{"word": "kick back", "english": "She’s kicking back with her roommates.", "thai": "เธอกำลังพักผ่อนกับเพื่อนร่วมห้อง"}
{"word": "kick back", "english": "He kicked back with a good podcast.", "thai": "เขานั่งพักผ่อนฟังพอดแคสต์ดีๆ"}
{"word": "kick back", "english": "I’m gonna kick back by the pool.", "thai": "ฉันจะไปพักผ่อนที่สระว่ายน้ำ"}
{"word": "kick back", "english": "They’re kicking back at the lake.", "thai": "พวกเขากำลังพักผ่อนที่ทะเลสาบ"}
{"word": "kick back", "english": "Let’s kick back and have some pizza.", "thai": "พักผ่อนกินพิซซ่ากันดีกว่า"}
{"word": "kick back", "english": "She kicked back in her favorite chair.", "thai": "เธอนั่งพักผ่อนบนเก้าอี้ตัวโปรด"}
{"word": "kick back", "english": "He’s kicking back with a new book.", "thai": "เขากำลังพักผ่อนกับหนังสือเล่มใหม่"}
{"word": "kick back", "english": "I just need to kick back after class.", "thai": "หลังเรียนฉันแค่อยากพักผ่อน"}
{"word": "kick back", "english": "They kicked back at the music festival.", "thai": "พวกเขาพักผ่อนที่งานเทศกาลดนตรี"}
{"word": "kick back", "english": "Let’s kick back and watch some TV.", "thai": "พักผ่อนดูทีวีกันดีกว่า"}
{"word": "kick back", "english": "She’s kicking back at the park.", "thai": "เธอกำลังพักผ่อนที่สวนสาธารณะ"}
{"word": "kick back", "english": "He kicked back with his headphones on.", "thai": "เขานั่งพักผ่อนใส่หูฟัง"}
{"word": "kick back", "english": "I’m kicking back with some snacks.", "thai": "ฉันกำลังพักผ่อนกินของว่าง"}
{"word": "kick back", "english": "They’re kicking back by the campfire.", "thai": "พวกเขากำลังพักผ่อนข้างกองไฟ"}
{"word": "kick back", "english": "Let’s kick back and chat for a while.", "thai": "พักผ่อนคุยกันสักพักดีกว่า"}
{"word": "kick back", "english": "She kicked back on the balcony.", "thai": "เธอนั่งพักผ่อนที่ระเบียง"}
{"word": "kick back", "english": "He’s kicking back with his video games.", "thai": "เขากำลังพักผ่อนเล่นวิดีโอเกม"}
{"word": "kick back", "english": "I just want to kick back by the river.", "thai": "ฉันแค่อยากพักผ่อนที่ริมแม่น้ำ"}
{"word": "kick back", "english": "They kicked back at the rooftop lounge.", "thai": "พวกเขาพักผ่อนที่เลานจ์บนดาดฟ้า"}
{"word": "kick back", "english": "Let’s kick back with some smoothies.", "thai": "พักผ่อนดื่มสมูทตี้กันดีกว่า"}
{"word": "kick back", "english": "She’s kicking back with her cousins.", "thai": "เธอกำลังพักผ่อนกับลูกพี่ลูกน้อง"}
{"word": "kick back", "english": "He kicked back after a tough workout.", "thai": "เขาพักผ่อนหลังออกกำลังกายหนัก"}
{"word": "kick back", "english": "I’m gonna kick back with a cold soda.", "thai": "ฉันจะพักผ่อนพร้อมโซดาเย็นๆ"}
{"word": "kick back", "english": "They’re kicking back at the arcade.", "thai": "พวกเขากำลังพักผ่อนที่ตู้เกม"}
{"word": "kick back", "english": "Let’s kick back and enjoy the breeze.", "thai": "พักผ่อนรับลมเย็นๆ กันดีกว่า"}
{"word": "kick back", "english": "She kicked back with her sketchbook.", "thai": "เธอนั่งพักผ่อนพร้อมสมุดสเก็ตช์"}
{"word": "kick back", "english": "He’s kicking back at the local diner.", "thai": "เขากำลังพักผ่อนที่ร้านอาหารท้องถิ่น"}
{"word": "kick back", "english": "I just need to kick back this afternoon.", "thai": "บ่ายนี้ฉันแค่อยากพักผ่อน"}
{"word": "kick back", "english": "They kicked back at the street fair.", "thai": "พวกเขาพักผ่อนที่งานเทศกาลถนน"}
{"word": "kick back", "english": "Let’s kick back with some iced tea.", "thai": "พักผ่อนดื่มชาเย็นกันดีกว่า"}
{"word": "kick back", "english": "She’s kicking back with her coworkers.", "thai": "เธอกำลังพักผ่อนกับเพื่อนร่วมงาน"}
{"word": "kick back", "english": "He kicked back with his favorite playlist.", "thai": "เขานั่งพักผ่อนกับเพลย์ลิสต์โปรด"}
{"word": "kick back", "english": "I’m kicking back at the bookstore.", "thai": "ฉันกำลังพักผ่อนที่ร้านหนังสือ"}
{"word": "kick back", "english": "They’re kicking back at the boardwalk.", "thai": "พวกเขากำลังพักผ่อนที่ทางเดินริมทะเล"}
{"word": "kick back", "english": "Let’s kick back and play some cards.", "thai": "พักผ่อนเล่นไพ่กันดีกว่า"}
{"word": "kick back", "english": "She kicked back with a cup of coffee.", "thai": "เธอนั่งพักผ่อนจิบกาแฟ"}
{"word": "kick back", "english": "He’s kicking back on the patio.", "thai": "เขากำลังพักผ่อนที่ลานบ้าน"}
{"word": "kick back", "english": "I just want to kick back at home.", "thai": "ฉันแค่อยากพักผ่อนที่บ้าน"}
{"word": "kick back", "english": "They kicked back at the jazz club.", "thai": "พวกเขาพักผ่อนที่คลับแจ๊ส"}
{"word": "kick back", "english": "Let’s kick back with some popcorn.", "thai": "พักผ่อนกินป๊อปคอร์นกันดีกว่า"}
{"word": "kick back", "english": "She’s kicking back with her neighbors.", "thai": "เธอกำลังพักผ่อนกับเพื่อนบ้าน"}
{"word": "kick back", "english": "He kicked back after mowing the lawn.", "thai": "เขาพักผ่อนหลังตัดหญ้า"}
{"word": "kick back", "english": "I’m gonna kick back with a magazine.", "thai": "ฉันจะพักผ่อนอ่านนิตยสาร"}
{"word": "kick back", "english": "They’re kicking back at the brewery.", "thai": "พวกเขากำลังพักผ่อนที่โรงเบียร์"}
{"word": "kick back", "english": "Let’s kick back and watch the game.", "thai": "พักผ่อนดูเกมกันดีกว่า"}
{"word": "kick back", "english": "She kicked back by the lake.", "thai": "เธอนั่งพักผ่อนริมทะเลสาบ"}
{"word": "kick back", "english": "He’s kicking back with his sketchpad.", "thai": "เขากำลังพักผ่อนพร้อมสมุดวาดเขียน"}
{"word": "kick back", "english": "I just need to kick back after studying.", "thai": "หลังเรียนฉันแค่อยากพักผ่อน"}
{"word": "kick back", "english": "They kicked back at the farmers’ market.", "thai": "พวกเขาพักผ่อนที่ตลาดเกษตรกร"}
{"word": "kick back", "english": "Let’s kick back with some lemonade.", "thai": "พักผ่อนดื่มเลมอนเนดกันดีกว่า"}
{"word": "kick back", "english": "She’s kicking back with her book club.", "thai": "เธอกำลังพักผ่อนกับชมรมหนังสือ"}
{"word": "kick back", "english": "He kicked back with his old records.", "thai": "เขานั่งพักผ่อนฟังแผ่นเสียงเก่า"}
{"word": "kick back", "english": "I’m kicking back at the tea house.", "thai": "ฉันกำลังพักผ่อนที่ร้านชา"}
{"word": "kick back", "english": "They’re kicking back at the outdoor cinema.", "thai": "พวกเขากำลังพักผ่อนที่โรงหนังกลางแจ้ง"}
{"word": "kick back", "english": "Let’s kick back and enjoy the view.", "thai": "พักผ่อนชมวิวกันดีกว่า"}
{"word": "kick back", "english": "She kicked back with a glass of wine.", "thai": "เธอนั่งพักผ่อนพร้อมแก้วไวน์"}
{"word": "kick back", "english": "He’s kicking back at the smoothie shop.", "thai": "เขากำลังพักผ่อนที่ร้านสมูทตี้"}
{"word": "look after", "english": "Can you look after my dog this weekend?", "thai": "ช่วยดูแลสุนัขของฉันสุดสัปดาห์นี้ได้ไหม?"}
{"word": "look after", "english": "She’s looking after her little brother today.", "thai": "วันนี้เธอกำลังดูแลน้องชาย"}
{"word": "look after", "english": "I need to look after the house while they’re gone.", "thai": "ฉันต้องดูแลบ้านตอนพวกเขาไม่อยู่"}
{"word": "look after", "english": "He looked after the kids during the party.", "thai": "เขาดูแลเด็กๆ ระหว่างงานปาร์ตี้"}
{"word": "look after", "english": "Who’s going to look after the garden?", "thai": "ใครจะดูแลสวน?"}
{"word": "look after", "english": "She looks after her elderly parents.", "thai": "เธอดูแลพ่อแม่ที่สูงวัย"}
{"word": "look after", "english": "I’ll look after your bag while you shop.", "thai": "ฉันจะดูแลกระเป๋าให้ตอนคุณไปช้อปปิ้ง"}
{"word": "look after", "english": "He’s looking after the store this afternoon.", "thai": "บ่ายนี้เขากำลังดูแลร้าน"}
{"word": "look after", "english": "Can you look after my cat while I’m away?", "thai": "ช่วยดูแลแมวของฉันตอนฉันไม่อยู่ได้ไหม?"}
{"word": "look after", "english": "They looked after the farm during the storm.", "thai": "พวกเขาดูแลฟาร์มระหว่างพายุ"}
{"word": "look after", "english": "I’m looking after my neighbor’s plants.", "thai": "ฉันกำลังดูแลต้นไม้ของเพื่อนบ้าน"}
{"word": "look after", "english": "She looked after her sick friend.", "thai": "เธอดูแลเพื่อนที่ป่วย"}
{"word": "look after", "english": "Who will look after the kids tonight?", "thai": "คืนนี้ใครจะดูแลเด็กๆ?"}
{"word": "look after", "english": "He looks after his younger siblings.", "thai": "เขาดูแลน้องๆ ของเขา"}
{"word": "look after", "english": "I need to look after my car’s maintenance.", "thai": "ฉันต้องดูแลการบำรุงรักษารถ"}
{"word": "look after", "english": "She’s looking after the office while he’s gone.", "thai": "เธอกำลังดูแลสำนักงานตอนเขาไม่อยู่"}
{"word": "look after", "english": "Can you look after my laptop for a bit?", "thai": "ช่วยดูแลแล็ปท็อปของฉันสักครู่ได้ไหม?"}
{"word": "look after", "english": "They looked after the campsite overnight.", "thai": "พวกเขาดูแลที่ตั้งแคมป์ตลอดคืน"}
{"word": "look after", "english": "I’ll look after the dishes after dinner.", "thai": "ฉันจะดูแลจานชามหลังมื้อเย็น"}
{"word": "look after", "english": "He’s looking after his grandfather today.", "thai": "วันนี้เขากำลังดูแลคุณตา"}
{"word": "look after", "english": "She looked after the baby during the meeting.", "thai": "เธอดูแลทารกระหว่างการประชุม"}
{"word": "look after", "english": "Can you look after my bike while I’m inside?", "thai": "ช่วยดูแลจักรยานของฉันตอนฉันอยู่ในอาคารได้ไหม?"}
{"word": "look after", "english": "They’re looking after the community garden.", "thai": "พวกเขากำลังดูแลสวนชุมชน"}
{"word": "look after", "english": "I need to look after my health more.", "thai": "ฉันต้องดูแลสุขภาพให้มากขึ้น"}
{"word": "look after", "english": "He looked after the dog during the trip.", "thai": "เขาดูแลสุนัขระหว่างทริป"}
{"word": "look after", "english": "She’s looking after her cousin’s apartment.", "thai": "เธอกำลังดูแลอพาร์ตเมนต์ของลูกพี่ลูกน้อง"}
{"word": "look after", "english": "Can you look after my keys for me?", "thai": "ช่วยดูแลกุญแจให้ฉันหน่อยได้ไหม?"}
{"word": "look after", "english": "They looked after the classroom after school.", "thai": "พวกเขาดูแลห้องเรียนหลังเลิกเรียน"}
{"word": "look after", "english": "I’ll look after the laundry this evening.", "thai": "เย็นนี้ฉันจะดูแลเรื่องซักผ้า"}
{"word": "look after", "english": "He’s looking after his little sister.", "thai": "เขากำลังดูแลน้องสาว"}
{"word": "look after", "english": "She looked after the store during the sale.", "thai": "เธอดูแลร้านระหว่างการลดราคา"}
{"word": "look after", "english": "Can you look after my backpack?", "thai": "ช่วยดูแลเป้ของฉันหน่อยได้ไหม?"}
{"word": "look after", "english": "They’re looking after the park’s cleanup.", "thai": "พวกเขากำลังดูแลการทำความสะอาดสวนสาธารณะ"}
{"word": "look after", "english": "I need to look after my plants this week.", "thai": "สัปดาห์นี้ฉันต้องดูแลต้นไม้"}
{"word": "look after", "english": "He looked after his friend’s car.", "thai": "เขาดูแลรถของเพื่อน"}
{"word": "look after", "english": "She’s looking after her sick grandmother.", "thai": "เธอกำลังดูแลคุณยายที่ป่วย"}
{"word": "look after", "english": "Can you look after my phone for a minute?", "thai": "ช่วยดูแลโทรศัพท์ของฉันสักครู่ได้ไหม?"}
{"word": "look after", "english": "They looked after the animals at the shelter.", "thai": "พวกเขาดูแลสัตว์ที่ศูนย์พักพิง"}
{"word": "look after", "english": "I’ll look after the groceries today.", "thai": "วันนี้ฉันจะดูแลเรื่องของชำ"}
{"word": "look after", "english": "He’s looking after his neighbor’s house.", "thai": "เขากำลังดูแลบ้านของเพื่อนบ้าน"}
{"word": "look after", "english": "She looked after her friend’s kids.", "thai": "เธอดูแลลูกของเพื่อน"}
{"word": "look after", "english": "Can you look after my jacket?", "thai": "ช่วยดูแลแจ็คเก็ตของฉันหน่อยได้ไหม?"}
{"word": "look after", "english": "They’re looking after the community center.", "thai": "พวกเขากำลังดูแลศูนย์ชุมชน"}
{"word": "look after", "english": "I need to look after my schedule.", "thai": "ฉันต้องดูแลตารางของตัวเอง"}
{"word": "look after", "english": "He looked after the equipment at the gym.", "thai": "เขาดูแลอุปกรณ์ที่ยิม"}
{"word": "look after", "english": "She’s looking after her younger cousin.", "thai": "เธอกำลังดูแลลูกพี่ลูกน้องที่เด็กกว่า"}
{"word": "look after", "english": "Can you look after my books for me?", "thai": "ช่วยดูแลหนังสือของฉันหน่อยได้ไหม?"}
{"word": "look after", "english": "They looked after the library during summer.", "thai": "พวกเขาดูแลห้องสมุดในช่วงฤดูร้อน"}
{"word": "look after", "english": "I’ll look after the cleaning today.", "thai": "วันนี้ฉันจะดูแลเรื่องทำความสะอาด"}
{"word": "look after", "english": "He’s looking after his aunt’s garden.", "thai": "เขากำลังดูแลสวนของป้า"}
{"word": "look after", "english": "She looked after the baby all morning.", "thai": "เธอดูแลทารกทั้งเช้า"}
{"word": "look after", "english": "Can you look after my wallet?", "thai": "ช่วยดูแลกระเป๋าเงินของฉันหน่อยได้ไหม?"}
{"word": "look after", "english": "They’re looking after the school’s pets.", "thai": "พวกเขากำลังดูแลสัตว์เลี้ยงของโรงเรียน"}
{"word": "look after", "english": "I need to look after my bike’s repairs.", "thai": "ฉันต้องดูแลการซ่อมจักรยาน"}
{"word": "look after", "english": "He looked after the office plants.", "thai": "เขาดูแลต้นไม้ในสำนักงาน"}
{"word": "look after", "english": "She’s looking after her sick dog.", "thai": "เธอกำลังดูแลสุนัขที่ป่วย"}
{"word": "look after", "english": "Can you look after my shoes?", "thai": "ช่วยดูแลรองเท้าของฉันหน่อยได้ไหม?"}
{"word": "look after", "english": "They looked after the park’s maintenance.", "thai": "พวกเขาดูแลการบำรุงรักษาสวนสาธารณะ"}
{"word": "look after", "english": "I’ll look after the cooking tonight.", "thai": "คืนนี้ฉันจะดูแลเรื่องทำอาหาร"}
{"word": "look after", "english": "He’s looking after his friend’s apartment.", "thai": "เขากำลังดูแลอพาร์ตเมนต์ของเพื่อน"}
{"word": "look after", "english": "She looked after the kids at the picnic.", "thai": "เธอดูแลเด็กๆ ที่ปิกนิก"}
{"word": "look after", "english": "Can you look after my camera?", "thai": "ช่วยดูแลกล้องของฉันหน่อยได้ไหม?"}
{"word": "look after", "english": "They’re looking after the charity event.", "thai": "พวกเขากำลังดูแลงานการกุศล"}
{"word": "look after", "english": "I need to look after my finances.", "thai": "ฉันต้องดูแลการเงินของตัวเอง"}
{"word": "look after", "english": "He looked after the team’s equipment.", "thai": "เขาดูแลอุปกรณ์ของทีม"}
{"word": "look after", "english": "She’s looking after her sick cat.", "thai": "เธอกำลังดูแลแมวที่ป่วย"}
{"word": "look after", "english": "Can you look after my glasses?", "thai": "ช่วยดูแลแว่นตาของฉันหน่อยได้ไหม?"}
{"word": "look after", "english": "They looked after the community pool.", "thai": "พวกเขาดูแลสระว่ายน้ำชุมชน"}
{"word": "look after", "english": "I’ll look after the yard this weekend.", "thai": "สุดสัปดาห์นี้ฉันจะดูแลสนามหญ้า"}
{"word": "look after", "english": "He’s looking after his parents’ house.", "thai": "เขากำลังดูแลบ้านของพ่อแม่"}
{"word": "look after", "english": "She looked after her friend’s dog.", "thai": "เธอดูแลสุนัขของเพื่อน"}
{"word": "look after", "english": "Can you look after my notebook?", "thai": "ช่วยดูแลสมุดบันทึกของฉันหน่อยได้ไหม?"}
{"word": "look after", "english": "They’re looking after the school garden.", "thai": "พวกเขากำลังดูแลสวนของโรงเรียน"}
{"word": "look after", "english": "I need to look after my car’s tires.", "thai": "ฉันต้องดูแลยางรถยนต์"}
{"word": "look after", "english": "He looked after the shop during lunch.", "thai": "เขาดูแลร้านตอนพักเที่ยง"}
{"word": "look after", "english": "She’s looking after her neighbor’s kids.", "thai": "เธอกำลังดูแลลูกของเพื่อนบ้าน"}
{"word": "look after", "english": "Can you look after my hat?", "thai": "ช่วยดูแลหมวกของฉันหน่อยได้ไหม?"}
{"word": "look after", "english": "They looked after the event’s setup.", "thai": "พวกเขาดูแลการจัดงาน"}
{"word": "look after", "english": "I’ll look after the pets this week.", "thai": "สัปดาห์นี้ฉันจะดูแลสัตว์เลี้ยง"}
{"word": "look after", "english": "He’s looking after his sister’s car.", "thai": "เขากำลังดูแลรถของน้องสาว"}
{"word": "look after", "english": "She looked after the classroom decorations.", "thai": "เธอดูแลการตกแต่งห้องเรียน"}
{"word": "look after", "english": "Can you look after my coat?", "thai": "ช่วยดูแลโค้ตของฉันหน่อยได้ไหม?"}
{"word": "look after", "english": "They’re looking after the local library.", "thai": "พวกเขากำลังดูแลห้องสมุดท้องถิ่น"}
{"word": "look after", "english": "I need to look after my diet.", "thai": "ฉันต้องดูแลเรื่องอาหารการกิน"}
{"word": "look after", "english": "He looked after the team’s schedule.", "thai": "เขาดูแลตารางของทีม"}
{"word": "look after", "english": "She’s looking after her sick aunt.", "thai": "เธอกำลังดูแลป้าที่ป่วย"}
{"word": "look after", "english": "Can you look after my laptop bag?", "thai": "ช่วยดูแลกระเป๋าแล็ปท็อปของฉันหน่อยได้ไหม?"}
{"word": "look after", "english": "They looked after the festival’s cleanup.", "thai": "พวกเขาดูแลการทำความสะอาดงานเทศกาล"}
{"word": "look after", "english": "I’ll look after the houseplants today.", "thai": "วันนี้ฉันจะดูแลต้นไม้ในบ้าน"}
{"word": "look after", "english": "He’s looking after his friend’s bike.", "thai": "เขากำลังดูแลจักรยานของเพื่อน"}
{"word": "look after", "english": "She looked after the kids’ homework.", "thai": "เธอดูแลการบ้านของเด็กๆ"}
{"word": "look after", "english": "Can you look after my scarf?", "thai": "ช่วยดูแลผ้าพันคอของฉันหน่อยได้ไหม?"}
{"word": "look after", "english": "They’re looking after the neighborhood park.", "thai": "พวกเขากำลังดูแลสวนสาธารณะในละแวก"}
{"word": "look after", "english": "I need to look after my work schedule.", "thai": "ฉันต้องดูแลตารางงาน"}
{"word": "look after", "english": "He looked after the team’s uniforms.", "thai": "เขาดูแลชุดของทีม"}
{"word": "look after", "english": "She’s looking after her sick uncle.", "thai": "เธอกำลังดูแลลุงที่ป่วย"}
{"word": "look after", "english": "Can you look after my headphones?", "thai": "ช่วยดูแลหูฟังของฉันหน่อยได้ไหม?"}
{"word": "look after", "english": "They looked after the school’s library.", "thai": "พวกเขาดูแลห้องสมุดของโรงเรียน"}
{"word": "look after", "english": "I’ll look after the kitchen cleanup.", "thai": "ฉันจะดูแลการทำความสะอาดครัว"}
{"word": "look after", "english": "He’s looking after his cousin’s dog.", "thai": "เขากำลังดูแลสุนัขของลูกพี่ลูกน้อง"}
{"word": "look forward", "english": "I look forward to seeing you tomorrow.", "thai": "ฉันตั้งตารอเจอคุณพรุ่งนี้"}
{"word": "look forward", "english": "She looks forward to the concert this weekend.", "thai": "เธอตั้งตารอคอนเสิร์ตสุดสัปดาห์นี้"}
{"word": "look forward", "english": "We look forward to trying the new restaurant.", "thai": "เราตั้งตารอลองร้านอาหารใหม่"}
{"word": "look forward", "english": "He looks forward to starting his new job.", "thai": "เขาตั้งตารอเริ่มงานใหม่"}
{"word": "look forward", "english": "I’m looking forward to our vacation next month.", "thai": "ฉันตั้งตารอวันหยุดของเราเดือนหน้า"}
{"word": "look forward", "english": "They look forward to meeting their new neighbor.", "thai": "พวกเขาตั้งตารอเจอเพื่อนบ้านใหม่"}
{"word": "look forward", "english": "She’s looking forward to her birthday party.", "thai": "เธอตั้งตารอปาร์ตี้วันเกิด"}
{"word": "look forward", "english": "I look forward to hearing your feedback.", "thai": "ฉันตั้งตารอฟังความคิดเห็นของคุณ"}
{"word": "look forward", "english": "He looks forward to playing soccer this weekend.", "thai": "เขาตั้งตารอเล่นฟุตบอลสุดสัปดาห์นี้"}
{"word": "look forward", "english": "We’re looking forward to the family reunion.", "thai": "เราตั้งตารองานรวมญาติ"}
{"word": "look forward", "english": "I look forward to trying your new recipe.", "thai": "ฉันตั้งตารอลองสูตรอาหารใหม่ของคุณ"}
{"word": "look forward", "english": "She looks forward to visiting the museum.", "thai": "เธอตั้งตารอไปพิพิธภัณฑ์"}
{"word": "look forward", "english": "They look forward to their hiking trip.", "thai": "พวกเขาตั้งตารอทริปเดินป่า"}
{"word": "look forward", "english": "I’m looking forward to the new movie release.", "thai": "ฉันตั้งตารอหนังใหม่ที่ออกฉาย"}
{"word": "look forward", "english": "He looks forward to meeting his new boss.", "thai": "เขาตั้งตารอเจอเจ้านายใหม่"}
{"word": "look forward", "english": "We look forward to celebrating with you.", "thai": "เราตั้งตารอฉลองกับคุณ"}
{"word": "look forward", "english": "She’s looking forward to her art class.", "thai": "เธอตั้งตารอชั้นเรียนศิลปะ"}
{"word": "look forward", "english": "I look forward to catching up soon.", "thai": "ฉันตั้งตารอคุยอัปเดตกันเร็วๆ นี้"}
{"word": "look forward", "english": "They look forward to the beach vacation.", "thai": "พวกเขาตั้งตารอวันหยุดที่ชายหาด"}
{"word": "look forward", "english": "He looks forward to finishing his project.", "thai": "เขาตั้งตารอทำโปรเจกต์ให้เสร็จ"}
{"word": "look forward", "english": "I’m looking forward to the holiday season.", "thai": "ฉันตั้งตารอช่วงเทศกาลวันหยุด"}
{"word": "look forward", "english": "She looks forward to learning guitar.", "thai": "เธอตั้งตารอเรียนกีตาร์"}
{"word": "look forward", "english": "We look forward to your visit next week.", "thai": "เราตั้งตารอการมาเยือนของคุณสัปดาห์หน้า"}
{"word": "look forward", "english": "I look forward to trying the new cafe.", "thai": "ฉันตั้งตารอลองร้านกาแฟใหม่"}
{"word": "look forward", "english": "He’s looking forward to the game tonight.", "thai": "เขาตั้งตารอเกมคืนนี้"}
{"word": "look forward", "english": "They look forward to their camping trip.", "thai": "พวกเขาตั้งตารอทริปแคมปิ้ง"}
{"word": "look forward", "english": "She’s looking forward to her new book.", "thai": "เธอตั้งตารอหนังสือเล่มใหม่"}
{"word": "look forward", "english": "I look forward to seeing the fireworks.", "thai": "ฉันตั้งตารอดูดอกไม้ไฟ"}
{"word": "look forward", "english": "We look forward to working with you.", "thai": "เราตั้งตารอทำงานกับคุณ"}
{"word": "look forward", "english": "He looks forward to his dance class.", "thai": "เขาตั้งตารอชั้นเรียนเต้น"}
{"word": "look forward", "english": "I’m looking forward to the picnic tomorrow.", "thai": "ฉันตั้งตารอปิกนิกพรุ่งนี้"}
{"word": "look forward", "english": "She looks forward to meeting her cousin.", "thai": "เธอตั้งตารอเจอลูกพี่ลูกน้อง"}
{"word": "look forward", "english": "They look forward to the music festival.", "thai": "พวกเขาตั้งตารองานเทศกาลดนตรี"}
{"word": "look forward", "english": "I look forward to your email response.", "thai": "ฉันตั้งตารอการตอบอีเมลของคุณ"}
{"word": "look forward", "english": "He’s looking forward to his new school.", "thai": "เขาตั้งตารอโรงเรียนใหม่"}
{"word": "look forward", "english": "We look forward to the wedding next month.", "thai": "เราตั้งตารองานแต่งงานเดือนหน้า"}
{"word": "look forward", "english": "She looks forward to her yoga retreat.", "thai": "เธอตั้งตารอรีทรีตโยคะ"}
{"word": "look forward", "english": "I’m looking forward to the new exhibit.", "thai": "ฉันตั้งตารอนิทรรศการใหม่"}
{"word": "look forward", "english": "They look forward to their ski trip.", "thai": "พวกเขาตั้งตารอทริปสกี"}
{"word": "look forward", "english": "He looks forward to cooking dinner tonight.", "thai": "เขาตั้งตารอทำอาหารเย็นคืนนี้"}
{"word": "look forward", "english": "I look forward to our next meeting.", "thai": "ฉันตั้งตารอการประชุมครั้งหน้า"}
{"word": "look forward", "english": "She’s looking forward to the book club.", "thai": "เธอตั้งตารอชมรมหนังสือ"}
{"word": "look forward", "english": "We look forward to your performance.", "thai": "เราตั้งตารอดูการแสดงของคุณ"}
{"word": "look forward", "english": "I’m looking forward to the beach day.", "thai": "ฉันตั้งตารอวันไปชายหาด"}
{"word": "look forward", "english": "He looks forward to his new project.", "thai": "เขาตั้งตารอโปรเจกต์ใหม่"}
{"word": "look forward", "english": "They look forward to the charity event.", "thai": "พวกเขาตั้งตารองานการกุศล"}
{"word": "look forward", "english": "She looks forward to her cooking class.", "thai": "เธอตั้งตารอชั้นเรียนทำอาหาร"}
{"word": "look forward", "english": "I look forward to hearing your story.", "thai": "ฉันตั้งตารอฟังเรื่องราวของคุณ"}
{"word": "look forward", "english": "We’re looking forward to the festival.", "thai": "เราตั้งตารองานเทศกาล"}
{"word": "look forward", "english": "He’s looking forward to his vacation.", "thai": "เขาตั้งตารอวันหยุด"}
{"word": "look forward", "english": "I’m looking forward to the new season.", "thai": "ฉันตั้งตารอฤดูกาลใหม่"}
{"word": "look forward", "english": "She looks forward to her dance recital.", "thai": "เธอตั้งตารอการแสดงเต้น"}
{"word": "look forward", "english": "They look forward to their road trip.", "thai": "พวกเขาตั้งตารอทริปขับรถ"}
{"word": "look forward", "english": "I look forward to trying new foods.", "thai": "ฉันตั้งตารอลองอาหารใหม่ๆ"}
{"word": "look forward", "english": "He looks forward to his gym session.", "thai": "เขาตั้งตารอเซสชันยิม"}
{"word": "look forward", "english": "We look forward to your next visit.", "thai": "เราตั้งตารอการมาเยือนครั้งหน้าของคุณ"}
{"word": "look forward", "english": "She’s looking forward to her art exhibit.", "thai": "เธอตั้งตารอนิทรรศการศิลปะ"}
{"word": "look forward", "english": "I’m looking forward to the game night.", "thai": "ฉันตั้งตารอคืนเล่นเกม"}
{"word": "look forward", "english": "They look forward to their new home.", "thai": "พวกเขาตั้งตารอบ้านใหม่"}
{"word": "look forward", "english": "He looks forward to his fishing trip.", "thai": "เขาตั้งตารอทริปตกปลา"}
{"word": "look forward", "english": "I look forward to your presentation.", "thai": "ฉันตั้งตารอดูการนำเสนอของคุณ"}
{"word": "look forward", "english": "She’s looking forward to her new puppy.", "thai": "เธอตั้งตารอลูกสุนัขตัวใหม่"}
{"word": "look forward", "english": "We look forward to the barbecue.", "thai": "เราตั้งตารองานปิ้งย่าง"}
{"word": "look forward", "english": "I’m looking forward to the book release.", "thai": "ฉันตั้งตารอการออกหนังสือ"}
{"word": "look forward", "english": "He looks forward to his photography class.", "thai": "เขาตั้งตารอชั้นเรียนถ่ายภาพ"}
{"word": "look forward", "english": "They look forward to their anniversary.", "thai": "พวกเขาตั้งตารอวันครบรอบ"}
{"word": "look forward", "english": "She looks forward to her piano recital.", "thai": "เธอตั้งตารอการแสดงเปียโน"}
{"word": "look forward", "english": "I look forward to meeting your family.", "thai": "ฉันตั้งตารอเจอครอบครัวของคุณ"}
{"word": "look forward", "english": "We’re looking forward to the ski season.", "thai": "เราตั้งตารอฤดูสกี"}
{"word": "look forward", "english": "He’s looking forward to his new car.", "thai": "เขาตั้งตารอรถใหม่"}
{"word": "look forward", "english": "I’m looking forward to the art festival.", "thai": "ฉันตั้งตารองานเทศกาลศิลปะ"}
{"word": "look forward", "english": "She looks forward to her hiking club.", "thai": "เธอตั้งตารอชมรมเดินป่า"}
{"word": "look forward", "english": "They look forward to their movie night.", "thai": "พวกเขาตั้งตารอคืนดูหนัง"}
{"word": "look forward", "english": "I look forward to your next email.", "thai": "ฉันตั้งตารออีเมลถัดไปของคุณ"}
{"word": "look forward", "english": "He looks forward to his cooking show.", "thai": "เขาตั้งตารอรายการทำอาหาร"}
{"word": "look forward", "english": "We look forward to the holiday party.", "thai": "เราตั้งตารอปาร์ตี้วันหยุด"}
{"word": "look forward", "english": "She’s looking forward to her new job.", "thai": "เธอตั้งตารองานใหม่"}
{"word": "look forward", "english": "I’m looking forward to the comedy show.", "thai": "ฉันตั้งตารอโชว์ตลก"}
{"word": "look forward", "english": "They look forward to their beach day.", "thai": "พวกเขาตั้งตารอวันไปชายหาด"}
{"word": "look forward", "english": "He looks forward to his bike ride.", "thai": "เขาตั้งตารอการปั่นจักรยาน"}
{"word": "look forward", "english": "I look forward to our coffee date.", "thai": "ฉันตั้งตารอเดตจิบกาแฟของเรา"}
{"word": "look forward", "english": "She’s looking forward to her dance team.", "thai": "เธอตั้งตารอทีมเต้น"}
{"word": "look forward", "english": "We look forward to the new exhibit.", "thai": "เราตั้งตารอนิทรรศการใหม่"}
{"word": "look forward", "english": "I’m looking forward to the food festival.", "thai": "ฉันตั้งตารองานเทศกาลอาหาร"}
{"word": "look forward", "english": "He looks forward to his art project.", "thai": "เขาตั้งตารอโปรเจกต์ศิลปะ"}
{"word": "look forward", "english": "They look forward to their game night.", "thai": "พวกเขาตั้งตารอคืนเล่นเกม"}
{"word": "look forward", "english": "She looks forward to her writing class.", "thai": "เธอตั้งตารอชั้นเรียนเขียน"}
{"word": "look forward", "english": "I look forward to visiting the zoo.", "thai": "ฉันตั้งตารอไปสวนสัตว์"}
{"word": "look forward", "english": "We’re looking forward to the concert tour.", "thai": "เราตั้งตารอทัวร์คอนเสิร์ต"}
{"word": "look forward", "english": "He’s looking forward to his new guitar.", "thai": "เขาตั้งตารอกีตาร์ใหม่"}
{"word": "look forward", "english": "I’m looking forward to the farmers’ market.", "thai": "ฉันตั้งตารอตลาดเกษตรกร"}
{"word": "look forward", "english": "She looks forward to her book signing.", "thai": "เธอตั้งตารองานเซ็นหนังสือ"}
{"word": "look forward", "english": "They look forward to their picnic.", "thai": "พวกเขาตั้งตารอปิกนิก"}
{"word": "look forward", "english": "I look forward to your new recipe.", "thai": "ฉันตั้งตารอสูตรอาหารใหม่ของคุณ"}
{"word": "look forward", "english": "He looks forward to his soccer game.", "thai": "เขาตั้งตารอเกมฟุตบอล"}
{"word": "look forward", "english": "We look forward to the team meeting.", "thai": "เราตั้งตารองานประชุมทีม"}
{"word": "look forward", "english": "She’s looking forward to her vacation.", "thai": "เธอตั้งตารอวันหยุด"}
{"word": "look forward", "english": "I’m looking forward to the new park.", "thai": "ฉันตั้งตารอสวนสาธารณะใหม่"}
{"word": "look forward", "english": "They look forward to their art show.", "thai": "พวกเขาตั้งตารองานแสดงศิลปะ"}
{"word": "look into", "english": "I’ll look into the issue tomorrow.", "thai": "ฉันจะตรวจสอบปัญหานี้พรุ่งนี้"}
{"word": "look into", "english": "She’s looking into new job opportunities.", "thai": "เธอกำลังมองหาโอกาสงานใหม่"}
{"word": "look into", "english": "Can you look into the flight details?", "thai": "ช่วยตรวจสอบรายละเอียดเที่ยวบินได้ไหม?"}
{"word": "look into", "english": "He’s looking into buying a new car.", "thai": "เขากำลังพิจารณาซื้อรถใหม่"}
{"word": "look into", "english": "We need to look into this complaint.", "thai": "เราต้องตรวจสอบคำร้องเรียนนี้"}
{"word": "look into", "english": "They’re looking into the cause of the delay.", "thai": "พวกเขากำลังตรวจสอบสาเหตุของความล่าช้า"}
{"word": "look into", "english": "I’m looking into a new phone plan.", "thai": "ฉันกำลังมองหาแผนโทรศัพท์ใหม่"}
{"word": "look into", "english": "She looked into the history of the building.", "thai": "เธอตรวจสอบประวัติของอาคาร"}
{"word": "look into", "english": "Can you look into this bug in the app?", "thai": "ช่วยตรวจสอบข้อบกพร่องในแอปนี้ได้ไหม?"}
{"word": "look into", "english": "He looked into the investment options.", "thai": "เขาพิจารณาตัวเลือกการลงทุน"}
{"word": "look into", "english": "I’ll look into the details of the contract.", "thai": "ฉันจะตรวจสอบรายละเอียดของสัญญา"}
{"word": "look into", "english": "They’re looking into the new school policy.", "thai": "พวกเขากำลังตรวจสอบนโยบายโรงเรียนใหม่"}
{"word": "look into", "english": "She’s looking into moving to a new city.", "thai": "เธอกำลังพิจารณาย้ายไปเมืองใหม่"}
{"word": "look into", "english": "Can you look into the price of tickets?", "thai": "ช่วยตรวจสอบราคาตั๋วได้ไหม?"}
{"word": "look into", "english": "He’s looking into fixing the old bike.", "thai": "เขากำลังมองหาวิธีซ่อมจักรยานเก่า"}
{"word": "look into", "english": "We need to look into this error message.", "thai": "เราต้องตรวจสอบข้อความข้อผิดพลาดนี้"}
{"word": "look into", "english": "I’m looking into new vacation spots.", "thai": "ฉันกำลังมองหาสถานที่พักผ่อนใหม่ๆ"}
{"word": "look into", "english": "She looked into the company’s background.", "thai": "เธอตรวจสอบประวัติของบริษัท"}
{"word": "look into", "english": "Can you look into the schedule changes?", "thai": "ช่วยตรวจสอบการเปลี่ยนแปลงตารางได้ไหม?"}
{"word": "look into", "english": "He’s looking into a new gym membership.", "thai": "เขากำลังพิจารณาสมาชิกยิมใหม่"}
{"word": "look into", "english": "I’ll look into the problem with the printer.", "thai": "ฉันจะตรวจสอบปัญหาเครื่องพิมพ์"}
{"word": "look into", "english": "They’re looking into the noise complaints.", "thai": "พวกเขากำลังตรวจสอบเรื่องร้องเรียนเรื่องเสียง"}
{"word": "look into", "english": "She’s looking into online courses.", "thai": "เธอกำลังมองหาคอร์สออนไลน์"}
{"word": "look into", "english": "Can you look into the warranty details?", "thai": "ช่วยตรวจสอบรายละเอียดการรับประกันได้ไหม?"}
{"word": "look into", "english": "He looked into the rules of the game.", "thai": "เขาตรวจสอบกฎของเกม"}
{"word": "look into", "english": "I’m looking into renting an apartment.", "thai": "ฉันกำลังพิจารณาเช่าอพาร์ตเมนต์"}
{"word": "look into", "english": "We need to look into the budget issues.", "thai": "เราต้องตรวจสอบปัญหางบประมาณ"}
{"word": "look into", "english": "She looked into the new diet plan.", "thai": "เธอพิจารณาแผนอาหารใหม่"}
{"word": "look into", "english": "Can you look into the delivery status?", "thai": "ช่วยตรวจสอบสถานะการจัดส่งได้ไหม?"}
{"word": "look into", "english": "He’s looking into starting a business.", "thai": "เขากำลังพิจารณาเริ่มธุรกิจ"}
{"word": "look into", "english": "I’ll look into the software update.", "thai": "ฉันจะตรวจสอบการอัปเดตซอฟต์แวร์"}
{"word": "look into", "english": "They’re looking into the safety concerns.", "thai": "พวกเขากำลังตรวจสอบเรื่องความปลอดภัย"}
{"word": "look into", "english": "She’s looking into a new laptop.", "thai": "เธอกำลังมองหาแล็ปท็อปใหม่"}
{"word": "look into", "english": "Can you look into the refund policy?", "thai": "ช่วยตรวจสอบนโยบายการคืนเงินได้ไหม?"}
{"word": "look into", "english": "He looked into the history of the town.", "thai": "เขาตรวจสอบประวัติของเมือง"}
{"word": "look into", "english": "I’m looking into new hiking trails.", "thai": "ฉันกำลังมองหาเส้นทางเดินป่าใหม่"}
{"word": "look into", "english": "We need to look into the project delays.", "thai": "เราต้องตรวจสอบความล่าช้าของโปรเจกต์"}
{"word": "look into", "english": "She looked into the new book club.", "thai": "เธอพิจารณาชมรมหนังสือใหม่"}
{"word": "look into", "english": "Can you look into the event details?", "thai": "ช่วยตรวจสอบรายละเอียดงานได้ไหม?"}
{"word": "look into", "english": "He’s looking into a new camera.", "thai": "เขากำลังมองหากล้องใหม่"}
{"word": "look into", "english": "I’ll look into the car repair costs.", "thai": "ฉันจะตรวจสอบค่าใช้จ่ายซ่อมรถ"}
{"word": "look into", "english": "They’re looking into the customer feedback.", "thai": "พวกเขากำลังตรวจสอบความคิดเห็นของลูกค้า"}
{"word": "look into", "english": "She’s looking into a new fitness class.", "thai": "เธอกำลังมองหาคลาสออกกำลังกายใหม่"}
{"word": "look into", "english": "Can you look into the hotel availability?", "thai": "ช่วยตรวจสอบที่ว่างของโรงแรมได้ไหม?"}
{"word": "look into", "english": "He looked into the science behind it.", "thai": "เขาตรวจสอบวิทยาศาสตร์เบื้องหลัง"}
{"word": "look into", "english": "I’m looking into new recipe ideas.", "thai": "ฉันกำลังมองหาไอเดียสูตรอาหารใหม่"}
{"word": "look into", "english": "We need to look into the system errors.", "thai": "เราต้องตรวจสอบข้อผิดพลาดของระบบ"}
{"word": "look into", "english": "She looked into the new art exhibit.", "thai": "เธอพิจารณานิทรรศการศิลปะใหม่"}
{"word": "look into", "english": "Can you look into the train schedule?", "thai": "ช่วยตรวจสอบตารางรถไฟได้ไหม?"}
{"word": "look into", "english": "He’s looking into a new phone.", "thai": "เขากำลังมองหาโทรศัพท์ใหม่"}
{"word": "look into", "english": "I’ll look into the insurance options.", "thai": "ฉันจะตรวจสอบตัวเลือกประกัน"}
{"word": "look into", "english": "They’re looking into the traffic issue.", "thai": "พวกเขากำลังตรวจสอบปัญหาการจราจร"}
{"word": "look into", "english": "She’s looking into a new yoga class.", "thai": "เธอกำลังมองหาคลาสโยคะใหม่"}
{"word": "look into", "english": "Can you look into the payment issue?", "thai": "ช่วยตรวจสอบปัญหาการชำระเงินได้ไหม?"}
{"word": "look into", "english": "He looked into the new tax laws.", "thai": "เขาตรวจสอบกฎหมายภาษีใหม่"}
{"word": "look into", "english": "I’m looking into new travel destinations.", "thai": "ฉันกำลังมองหาจุดหมายการเดินทางใหม่"}
{"word": "look into", "english": "We need to look into the website crash.", "thai": "เราต้องตรวจสอบการล่มของเว็บไซต์"}
{"word": "look into", "english": "She looked into the cooking class.", "thai": "เธอพิจารณาคลาสทำอาหาร"}
{"word": "look into", "english": "Can you look into the shipping costs?", "thai": "ช่วยตรวจสอบค่าขนส่งได้ไหม?"}
{"word": "look into", "english": "He’s looking into a new computer.", "thai": "เขากำลังมองหาคอมพิวเตอร์ใหม่"}
{"word": "look into", "english": "I’ll look into the meeting schedule.", "thai": "ฉันจะตรวจสอบตารางการประชุม"}
{"word": "look into", "english": "They’re looking into the power outage.", "thai": "พวกเขากำลังตรวจสอบไฟดับ"}
{"word": "look into", "english": "She’s looking into a new book series.", "thai": "เธอกำลังมองหาชุดหนังสือใหม่"}
{"word": "look into", "english": "Can you look into the store hours?", "thai": "ช่วยตรวจสอบเวลาทำการของร้านได้ไหม?"}
{"word": "look into", "english": "He looked into the festival details.", "thai": "เขาตรวจสอบรายละเอียดงานเทศกาล"}
{"word": "look into", "english": "I’m looking into new bike trails.", "thai": "ฉันกำลังมองหาเส้นทางปั่นจักรยานใหม่"}
{"word": "look into", "english": "We need to look into the refund issue.", "thai": "เราต้องตรวจสอบปัญหาการคืนเงิน"}
{"word": "look into", "english": "She looked into the new dance class.", "thai": "เธอพิจารณาคลาสเต้นใหม่"}
{"word": "look into", "english": "Can you look into the event pricing?", "thai": "ช่วยตรวจสอบราคางานได้ไหม?"}
{"word": "look into", "english": "He’s looking into a new apartment.", "thai": "เขากำลังมองหาอพาร์ตเมนต์ใหม่"}
{"word": "look into", "english": "I’ll look into the software glitch.", "thai": "ฉันจะตรวจสอบข้อผิดพลาดของซอฟต์แวร์"}
{"word": "look into", "english": "They’re looking into the noise issue.", "thai": "พวกเขากำลังตรวจสอบปัญหาเสียงรบกวน"}
{"word": "look into", "english": "She’s looking into a new hobby.", "thai": "เธอกำลังมองหางานอดิเรกใหม่"}
{"word": "look into", "english": "Can you look into the hotel reviews?", "thai": "ช่วยตรวจสอบรีวิวโรงแรมได้ไหม?"}
{"word": "look into", "english": "He looked into the new game rules.", "thai": "เขาตรวจสอบกฎเกมใหม่"}
{"word": "look into", "english": "I’m looking into new job listings.", "thai": "ฉันกำลังมองหาตำแหน่งงานใหม่"}
{"word": "look into", "english": "We need to look into the system crash.", "thai": "เราต้องตรวจสอบการล่มของระบบ"}
{"word": "look into", "english": "She looked into the new art program.", "thai": "เธอพิจารณาโปรแกรมศิลปะใหม่"}
{"word": "look into", "english": "Can you look into the product reviews?", "thai": "ช่วยตรวจสอบรีวิวผลิตภัณฑ์ได้ไหม?"}
{"word": "look into", "english": "He’s looking into a new TV model.", "thai": "เขากำลังมองหาทีวีรุ่นใหม่"}
{"word": "look into", "english": "I’ll look into the budget concerns.", "thai": "ฉันจะตรวจสอบปัญหางบประมาณ"}
{"word": "look into", "english": "They’re looking into the event logistics.", "thai": "พวกเขากำลังตรวจสอบการจัดการงาน"}
{"word": "look into", "english": "She’s looking into a new gym.", "thai": "เธอกำลังมองหายิมใหม่"}
{"word": "look into", "english": "Can you look into the car rental options?", "thai": "ช่วยตรวจสอบตัวเลือกเช่ารถได้ไหม?"}
{"word": "look into", "english": "He looked into the new hiking gear.", "thai": "เขาตรวจสอบอุปกรณ์เดินป่าใหม่"}
{"word": "look into", "english": "I’m looking into new cooking classes.", "thai": "ฉันกำลังมองหาคลาสทำอาหารใหม่"}
{"word": "look into", "english": "We need to look into the app crashes.", "thai": "เราต้องตรวจสอบการล่มของแอป"}
{"word": "look into", "english": "She looked into the new book release.", "thai": "เธอพิจารณาการออกหนังสือใหม่"}
{"word": "look into", "english": "Can you look into the concert tickets?", "thai": "ช่วยตรวจสอบตั๋วคอนเสิร์ตได้ไหม?"}
{"word": "look into", "english": "He’s looking into a new laptop.", "thai": "เขากำลังมองหาแล็ปท็อปใหม่"}
{"word": "look into", "english": "I’ll look into the website issues.", "thai": "ฉันจะตรวจสอบปัญหาเว็บไซต์"}
{"word": "look into", "english": "They’re looking into the new regulations.", "thai": "พวกเขากำลังตรวจสอบกฎระเบียบใหม่"}
{"word": "look into", "english": "She’s looking into a new dance studio.", "thai": "เธอกำลังมองหาสตูดิโอเต้นใหม่"}
{"word": "look into", "english": "Can you look into the flight prices?", "thai": "ช่วยตรวจสอบราคาเที่ยวบินได้ไหม?"}
{"word": "look into", "english": "He looked into the new camera gear.", "thai": "เขาตรวจสอบอุปกรณ์กล้องใหม่"}
{"word": "look into", "english": "I’m looking into new fitness apps.", "thai": "ฉันกำลังมองหาแอปฟิตเนสใหม่"}
{"word": "look into", "english": "We need to look into the server issues.", "thai": "เราต้องตรวจสอบปัญหาเซิร์ฟเวอร์"}
{"word": "look into", "english": "She looked into the new yoga retreat.", "thai": "เธอพิจารณารีทรีตโยคะใหม่"}
{"word": "look into", "english": "Can you look into the store’s hours?", "thai": "ช่วยตรวจสอบเวลาทำการของร้านได้ไหม?"}
{"word": "look into", "english": "He’s looking into a new bike.", "thai": "เขากำลังมองหาจักรยานใหม่"}
{"word": "look out", "english": "Look out, there’s a car coming!", "thai": "ระวัง รถกำลังมา!"}
{"word": "look out", "english": "Look out for that falling branch!", "thai": "ระวังกิ่งไม้ที่กำลังตก!"}
{"word": "look out", "english": "You need to look out when crossing the street.", "thai": "คุณต้องระวังตอนข้ามถนน"}
{"word": "look out", "english": "Look out, the floor is wet!", "thai": "ระวัง พื้นเปียก!"}
{"word": "look out", "english": "She looked out for her little brother.", "thai": "เธอคอยดูแลน้องชาย"}
{"word": "look out", "english": "Look out for the dog in the yard!", "thai": "ระวังสุนัขในสนาม!"}
{"word": "look out", "english": "He’s looking out for a new job.", "thai": "เขากำลังมองหางานใหม่"}
{"word": "look out", "english": "Look out, that ladder is shaky!", "thai": "ระวัง บันไดนั้นโยกเยก!"}
{"word": "look out", "english": "They looked out for each other on the hike.", "thai": "พวกเขาคอยดูแลกันตอนเดินป่า"}
{"word": "look out", "english": "Look out for that pothole!", "thai": "ระวังหลุมบนถนน!"}
{"word": "look out", "english": "I’m looking out for a good deal.", "thai": "ฉันกำลังมองหาดีลดีๆ"}
{"word": "look out", "english": "Look out, the ball is coming your way!", "thai": "ระวัง ลูกบอลกำลังมา!"}
{"word": "look out", "english": "She looked out the window at the rain.", "thai": "เธอมองออกไปนอกหน้าต่างดูฝน"}
{"word": "look out", "english": "Look out for snakes in the grass!", "thai": "ระวังงูในหญ้า!"}
{"word": "look out", "english": "He looked out for his team during the game.", "thai": "เขาคอยดูแลทีมตอนแข่ง"}
{"word": "look out", "english": "Look out, that shelf is loose!", "thai": "ระวัง ชั้นวางนั้นหลวม!"}
{"word": "look out", "english": "I’m looking out for a new apartment.", "thai": "ฉันกำลังมองหาอพาร์ตเมนต์ใหม่"}
{"word": "look out", "english": "Look out for the ice on the steps!", "thai": "ระวังน้ำแข็งบนบันได!"}
{"word": "look out", "english": "They looked out for their neighbors.", "thai": "พวกเขาคอยดูแลเพื่อนบ้าน"}
{"word": "look out", "english": "Look out, the door is swinging open!", "thai": "ระวัง ประตูกำลังเปิด!"}
{"word": "look out", "english": "She’s looking out for a new phone.", "thai": "เธอกำลังมองหาโทรศัพท์ใหม่"}
{"word": "look out", "english": "Look out for that low branch!", "thai": "ระวังกิ่งไม้ต่ำนั้น!"}
{"word": "look out", "english": "He looked out the car window.", "thai": "เขามองออกไปนอกหน้าต่างรถ"}
{"word": "look out", "english": "Look out, there’s a bee near you!", "thai": "ระวัง มีผึ้งอยู่ใกล้คุณ!"}
{"word": "look out", "english": "I’m looking out for a cheap flight.", "thai": "ฉันกำลังมองหาเที่ยวบินราคาถูก"}
{"word": "look out", "english": "Look out for the broken glass!", "thai": "ระวังแก้วแตก!"}
{"word": "look out", "english": "They looked out for the lost dog.", "thai": "พวกเขาคอยมองหาสุนัขที่หาย"}
{"word": "look out", "english": "Look out, that bike is speeding!", "thai": "ระวัง จักรยานนั้นเร็วมาก!"}
{"word": "look out", "english": "She looked out for her friend’s kids.", "thai": "เธอคอยดูแลลูกของเพื่อน"}
{"word": "look out", "english": "Look out for the sharp turn ahead!", "thai": "ระวังโค้งหักศอกข้างหน้า!"}
{"word": "look out", "english": "He’s looking out for a new laptop.", "thai": "เขากำลังมองหาแล็ปท็อปใหม่"}
{"word": "look out", "english": "Look out, the paint is still wet!", "thai": "ระวัง สีนั้นยังเปียก!"}
{"word": "look out", "english": "I looked out at the sunset.", "thai": "ฉันมองออกไปดูพระอาทิตย์ตก"}
{"word": "look out", "english": "Look out for that slippery spot!", "thai": "ระวังจุดลื่นนั้น!"}
{"word": "look out", "english": "They’re looking out for their teammates.", "thai": "พวกเขาคอยดูแลเพื่อนร่วมทีม"}
{"word": "look out", "english": "Look out, the dog is running loose!", "thai": "ระวัง สุนัขวิ่งพล่าน!"}
{"word": "look out", "english": "She’s looking out for a good book.", "thai": "เธอกำลังมองหาหนังสือดีๆ"}
{"word": "look out", "english": "Look out for the hole in the ground!", "thai": "ระวังหลุมบนพื้น!"}
{"word": "look out", "english": "He looked out for his younger cousin.", "thai": "เขาคอยดูแลลูกพี่ลูกน้องที่เด็กกว่า"}
{"word": "look out", "english": "Look out, that chair is wobbly!", "thai": "ระวัง เก้าอี้นั้นโยกเยก!"}
{"word": "look out", "english": "I’m looking out for a new car.", "thai": "ฉันกำลังมองหารถใหม่"}
{"word": "look out", "english": "Look out for the traffic ahead!", "thai": "ระวังรถข้างหน้า!"}
{"word": "look out", "english": "She looked out the balcony at the view.", "thai": "เธอมองออกไปจากระเบียงดูวิว"}
{"word": "look out", "english": "Look out, there’s a spider on the wall!", "thai": "ระวัง มีแมงมุมบนผนัง!"}
{"word": "look out", "english": "They looked out for the missing keys.", "thai": "พวกเขาคอยมองหากุญแจที่หาย"}
{"word": "look out", "english": "Look out for that fast-moving truck!", "thai": "ระวังรถบรรทุกที่วิ่งเร็ว!"}
{"word": "look out", "english": "He’s looking out for a new bike.", "thai": "เขากำลังมองหาจักรยานใหม่"}
{"word": "look out", "english": "Look out, the stove is hot!", "thai": "ระวัง เตาร้อน!"}
{"word": "look out", "english": "I looked out at the snowy mountains.", "thai": "ฉันมองออกไปดูภูเขาหิมะ"}
{"word": "look out", "english": "Look out for the glass on the floor!", "thai": "ระวังแก้วบนพื้น!"}
{"word": "look out", "english": "She looked out for her friend’s cat.", "thai": "เธอคอยดูแลแมวของเพื่อน"}
{"word": "look out", "english": "Look out, that branch is falling!", "thai": "ระวัง กิ่งไม้กำลังตก!"}
{"word": "look out", "english": "He’s looking out for a new camera.", "thai": "เขากำลังมองหากล้องใหม่"}
{"word": "look out", "english": "Look out for the wet paint!", "thai": "ระวัง สีเปียก!"}
{"word": "look out", "english": "They looked out for their classmates.", "thai": "พวกเขาคอยดูแลเพื่อนร่วมชั้น"}
{"word": "look out", "english": "Look out, the road is slippery!", "thai": "ระวัง ถนนลื่น!"}
{"word": "look out", "english": "I’m looking out for a good deal on flights.", "thai": "ฉันกำลังมองหาดีลดีๆ สำหรับเที่ยวบิน"}
{"word": "look out", "english": "Look out for that speeding car!", "thai": "ระวังรถที่วิ่งเร็ว!"}
{"word": "look out", "english": "She looked out the window at the stars.", "thai": "เธอมองออกไปนอกหน้าต่างดูดาว"}
{"word": "look out", "english": "Look out, there’s a wasp nearby!", "thai": "ระวัง มีตัวต่ออยู่ใกล้ๆ!"}
{"word": "look out", "english": "He looked out for his team’s safety.", "thai": "เขาคอยดูแลความปลอดภัยของทีม"}
{"word": "look out", "english": "Look out for the mud on the path!", "thai": "ระวังโคลนบนทาง!"}
{"word": "look out", "english": "I’m looking out for a new phone plan.", "thai": "ฉันกำลังมองหาแผนโทรศัพท์ใหม่"}
{"word": "look out", "english": "Look out, that table is unstable!", "thai": "ระวัง โต๊ะนั้นไม่มั่นคง!"}
{"word": "look out", "english": "They looked out for the lost wallet.", "thai": "พวกเขาคอยมองหากระเป๋าเงินที่หาย"}
{"word": "look out", "english": "Look out for the low ceiling!", "thai": "ระวังเพดานต่ำ!"}
{"word": "look out", "english": "She’s looking out for a new book.", "thai": "เธอกำลังมองหาหนังสือใหม่"}
{"word": "look out", "english": "Look out, the gate is swinging!", "thai": "ระวัง ประตูกำลังแกว่ง!"}
{"word": "look out", "english": "He looked out for his younger sister.", "thai": "เขาคอยดูแลน้องสาว"}
{"word": "look out", "english": "Look out for that loose step!", "thai": "ระวังบันไดหลวม!"}
{"word": "look out", "english": "I’m looking out for a new gym.", "thai": "ฉันกำลังมองหายิมใหม่"}
{"word": "look out", "english": "Look out, the ball is flying over!", "thai": "ระวัง ลูกบอลกำลังลอยมา!"}
{"word": "look out", "english": "She looked out at the ocean view.", "thai": "เธอมองออกไปดูวิวทะเล"}
{"word": "look out", "english": "Look out for the broken fence!", "thai": "ระวังรั้วที่พัง!"}
{"word": "look out", "english": "They looked out for their friend’s dog.", "thai": "พวกเขาคอยดูแลสุนัขของเพื่อน"}
{"word": "look out", "english": "Look out, that car is swerving!", "thai": "ระวัง รถนั้นกำลังส่าย!"}
{"word": "look out", "english": "He’s looking out for a new laptop deal.", "thai": "เขากำลังมองหาดีลแล็ปท็อปใหม่"}
{"word": "look out", "english": "Look out for the glass shards!", "thai": "ระวังเศษแก้ว!"}
{"word": "look out", "english": "I looked out at the city lights.", "thai": "ฉันมองออกไปดูแสงเมือง"}
{"word": "look out", "english": "Look out, that rope is frayed!", "thai": "ระวัง เชือกนั้นขาด!"}
{"word": "look out", "english": "She looked out for her classmates.", "thai": "เธอคอยดูแลเพื่อนร่วมชั้น"}
{"word": "look out", "english": "Look out for the traffic jam!", "thai": "ระวังรถติด!"}
{"word": "look out", "english": "I’m looking out for a new camera.", "thai": "ฉันกำลังมองหากล้องใหม่"}
{"word": "look out", "english": "Look out, the branch is snapping!", "thai": "ระวัง กิ่งไม้กำลังหัก!"}
{"word": "look out", "english": "They looked out for the missing phone.", "thai": "พวกเขาคอยมองหาโทรศัพท์ที่หาย"}
{"word": "look out", "english": "Look out for that sharp edge!", "thai": "ระวังขอบคมนั้น!"}
{"word": "look out", "english": "He’s looking out for a good deal.", "thai": "เขากำลังมองหาดีลดีๆ"}
{"word": "look out", "english": "Look out, the bike is wobbling!", "thai": "ระวัง จักรยานนั้นโงนเงน!"}
{"word": "look out", "english": "She looked out at the festival lights.", "thai": "เธอมองออกไปดูแสงงานเทศกาล"}
{"word": "look out", "english": "Look out for the wet floor!", "thai": "ระวังพื้นเปียก!"}
{"word": "look out", "english": "They looked out for their friend’s safety.", "thai": "พวกเขาคอยดูแลความปลอดภัยของเพื่อน"}
{"word": "look out", "english": "Look out, that sign is falling!", "thai": "ระวัง ป้ายนั้นกำลังตก!"}
{"word": "look out", "english": "I’m looking out for a new bike trail.", "thai": "ฉันกำลังมองหาเส้นทางปั่นจักรยานใหม่"}
{"word": "look out", "english": "Look out for the loose railing!", "thai": "ระวังราวที่หลวม!"}
{"word": "look out", "english": "He looked out for his team’s gear.", "thai": "เขาคอยดูแลอุปกรณ์ของทีม"}
{"word": "look out", "english": "Look out, the ball is bouncing back!", "thai": "ระวัง ลูกบอลกำลังเด้งกลับ!"}
{"word": "look out", "english": "She’s looking out for a new book club.", "thai": "เธอกำลังมองหาชมรมหนังสือใหม่"}
{"word": "look up", "english": "Can you look up the phone number for me?", "thai": "ช่วยค้นหาเบอร์โทรให้ฉันหน่อยได้ไหม?"}
{"word": "look up", "english": "I looked up at the stars last night.", "thai": "เมื่อคืนฉันแหงนมองดาว"}
{"word": "look up", "english": "Things are starting to look up for her.", "thai": "สิ่งต่างๆ เริ่มดีขึ้นสำหรับเธอ"}
{"word": "look up", "english": "He’s looking up a recipe online.", "thai": "เขากำลังค้นหาสูตรอาหารออนไลน์"}
{"word": "look up", "english": "Look up, there’s a bird flying overhead!", "thai": "เงยหน้าขึ้น มีนกบินอยู่ด้านบน!"}
{"word": "look up", "english": "I need to look up the train schedule.", "thai": "ฉันต้องค้นหาตารางรถไฟ"}
{"word": "look up", "english": "She looked up from her book to smile.", "thai": "เธอเงยหน้าจากหนังสือเพื่อยิ้ม"}
{"word": "look up", "english": "The economy is finally looking up.", "thai": "เศรษฐกิจเริ่มดีขึ้นในที่สุด"}
{"word": "look up", "english": "Can you look up the movie times?", "thai": "ช่วยค้นหาเวลาฉายหนังได้ไหม?"}
{"word": "look up", "english": "He looked up at the tall building.", "thai": "เขาเงยมองตึกสูง"}
{"word": "look up", "english": "I’m looking up flights for our trip.", "thai": "ฉันกำลังค้นหาเที่ยวบินสำหรับทริปของเรา"}
{"word": "look up", "english": "She’s looking up her old friend’s address.", "thai": "เธอกำลังค้นหาที่อยู่ของเพื่อนเก่า"}
{"word": "look up", "english": "Look up, there’s a plane in the sky!", "thai": "เงยหน้าขึ้น มีเครื่องบินบนท้องฟ้า!"}
{"word": "look up", "english": "His grades are starting to look up.", "thai": "เกรดของเขาเริ่มดีขึ้น"}
{"word": "look up", "english": "I’ll look up the definition of that word.", "thai": "ฉันจะค้นหาความหมายของคำนั้น"}
{"word": "look up", "english": "She looked up from her phone to wave.", "thai": "เธอเงยหน้าจากโทรศัพท์เพื่อโบกมือ"}
{"word": "look up", "english": "Can you look up the restaurant’s menu?", "thai": "ช่วยค้นหาเมนูของร้านอาหารได้ไหม?"}
{"word": "look up", "english": "He looked up at the fireworks display.", "thai": "เขาเงยมองการแสดงดอกไม้ไฟ"}
{"word": "look up", "english": "Things are looking up after the tough year.", "thai": "สิ่งต่างๆ เริ่มดีขึ้นหลังจากปีที่ยากลำบาก"}
{"word": "look up", "english": "I’m looking up a new book to read.", "thai": "ฉันกำลังค้นหาหนังสือใหม่เพื่ออ่าน"}
{"word": "look up", "english": "Look up, there’s a rainbow!", "thai": "เงยหน้าขึ้น มีรุ้งกินน้ำ!"}
{"word": "look up", "english": "She’s looking up job listings online.", "thai": "เธอกำลังค้นหาตำแหน่งงานออนไลน์"}
{"word": "look up", "english": "His mood is starting to look up.", "thai": "อารมณ์ของเขาเริ่มดีขึ้น"}
{"word": "look up", "english": "Can you look up the weather forecast?", "thai": "ช่วยค้นหาพยากรณ์อากาศได้ไหม?"}
{"word": "look up", "english": "He looked up at the passing clouds.", "thai": "เขาเงยมองเมฆที่ลอยผ่าน"}
{"word": "look up", "english": "I’ll look up the directions to the park.", "thai": "ฉันจะค้นหาเส้นทางไปสวนสาธารณะ"}
{"word": "look up", "english": "She looked up from her work to listen.", "thai": "เธอเงยหน้าจากงานเพื่อฟัง"}
{"word": "look up", "english": "Business is looking up this quarter.", "thai": "ธุรกิจเริ่มดีขึ้นในไตรมาสนี้"}
{"word": "look up", "english": "I’m looking up a new gym membership.", "thai": "ฉันกำลังค้นหาสมาชิกยิมใหม่"}
{"word": "look up", "english": "Look up, there’s a hot air balloon!", "thai": "เงยหน้าขึ้น มีบอลลูนลมร้อน!"}
{"word": "look up", "english": "She’s looking up her family history.", "thai": "เธอกำลังค้นหาประวัติครอบครัว"}
{"word": "look up", "english": "Can you look up the store’s hours?", "thai": "ช่วยค้นหาเวลาทำการของร้านได้ไหม?"}
{"word": "look up", "english": "He looked up at the tall trees.", "thai": "เขาเงยมองต้นไม้สูง"}
{"word": "look up", "english": "Things are looking up for the team.", "thai": "สิ่งต่างๆ เริ่มดีขึ้นสำหรับทีม"}
{"word": "look up", "english": "I’ll look up the price of that camera.", "thai": "ฉันจะค้นหาราคาของกล้องนั้น"}
{"word": "look up", "english": "She looked up from her laptop to talk.", "thai": "เธอเงยหน้าจากแล็ปท็อปเพื่อพูด"}
{"word": "look up", "english": "I’m looking up a new hiking trail.", "thai": "ฉันกำลังค้นหาเส้นทางเดินป่าใหม่"}
{"word": "look up", "english": "Look up, there’s a shooting star!", "thai": "เงยหน้าขึ้น มีดาวตก!"}
{"word": "look up", "english": "He’s looking up a new recipe for dinner.", "thai": "เขากำลังค้นหาสูตรอาหารเย็นใหม่"}
{"word": "look up", "english": "The job market is starting to look up.", "thai": "ตลาดงานเริ่มดีขึ้น"}
{"word": "look up", "english": "Can you look up the concert details?", "thai": "ช่วยค้นหารายละเอียดคอนเสิร์ตได้ไหม?"}
{"word": "look up", "english": "She looked up at the colorful kites.", "thai": "เธอเงยมองว่าวสีสัน"}
{"word": "look up", "english": "I’ll look up the hotel reviews.", "thai": "ฉันจะค้นหารีวิวโรงแรม"}
{"word": "look up", "english": "Things are looking up after the move.", "thai": "สิ่งต่างๆ เริ่มดีขึ้นหลังย้าย"}
{"word": "look up", "english": "He’s looking up a new car model.", "thai": "เขากำลังค้นหารุ่นรถใหม่"}
{"word": "look up", "english": "Look up, there’s a drone flying!", "thai": "เงยหน้าขึ้น มีโดรนบิน!"}
{"word": "look up", "english": "She’s looking up a new book club.", "thai": "เธอกำลังค้นหาชมรมหนังสือใหม่"}
{"word": "look up", "english": "Can you look up the bus schedule?", "thai": "ช่วยค้นหาตารางรถบัสได้ไหม?"}
{"word": "look up", "english": "He looked up at the bright moon.", "thai": "เขาเงยมองพระจันทร์สว่าง"}
{"word": "look up", "english": "I’m looking up a new fitness app.", "thai": "ฉันกำลังค้นหาแอปฟิตเนสใหม่"}
{"word": "look up", "english": "The project is starting to look up.", "thai": "โปรเจกต์เริ่มดีขึ้น"}
{"word": "look up", "english": "She looked up from her drawing to smile.", "thai": "เธอเงยหน้าจากภาพวาดเพื่อยิ้ม"}
{"word": "look up", "english": "I’ll look up the event location.", "thai": "ฉันจะค้นหาสถานที่จัดงาน"}
{"word": "look up", "english": "Look up, there’s a helicopter!", "thai": "เงยหน้าขึ้น มีเฮลิคอปเตอร์!"}
{"word": "look up", "english": "He’s looking up a new laptop.", "thai": "เขากำลังค้นหาแล็ปท็อปใหม่"}
{"word": "look up", "english": "Can you look up the restaurant reviews?", "thai": "ช่วยค้นหารีวิวร้านอาหารได้ไหม?"}
{"word": "look up", "english": "She looked up at the festival lights.", "thai": "เธอเงยมองแสงงานเทศกาล"}
{"word": "look up", "english": "Things are looking up for the business.", "thai": "สิ่งต่างๆ เริ่มดีขึ้นสำหรับธุรกิจ"}
{"word": "look up", "english": "I’m looking up a new bike trail.", "thai": "ฉันกำลังค้นหาเส้นทางปั่นจักรยานใหม่"}
{"word": "look up", "english": "Look up, there’s a flock of birds!", "thai": "เงยหน้าขึ้น มีฝูงนก!"}
{"word": "look up", "english": "He’s looking up a new camera.", "thai": "เขากำลังค้นหากล้องใหม่"}
{"word": "look up", "english": "Can you look up the flight prices?", "thai": "ช่วยค้นหาราคาเที่ยวบินได้ไหม?"}
{"word": "look up", "english": "She looked up from her knitting.", "thai": "เธอเงยหน้าจากการถักนิตติ้ง"}
{"word": "look up", "english": "I’ll look up the history of that place.", "thai": "ฉันจะค้นหาประวัติของสถานที่นั้น"}
{"word": "look up", "english": "The team’s performance is looking up.", "thai": "ผลงานของทีมเริ่มดีขึ้น"}
{"word": "look up", "english": "Look up, there’s a kite in the sky!", "thai": "เงยหน้าขึ้น มีว่าวบนท้องฟ้า!"}
{"word": "look up", "english": "She’s looking up a new yoga class.", "thai": "เธอกำลังค้นหาคลาสโยคะใหม่"}
{"word": "look up", "english": "Can you look up the game rules?", "thai": "ช่วยค้นหากฎเกมได้ไหม?"}
{"word": "look up", "english": "He looked up at the tall tower.", "thai": "เขาเงยมองหอคอยสูง"}
{"word": "look up", "english": "I’m looking up a new phone plan.", "thai": "ฉันกำลังค้นหาแผนโทรศัพท์ใหม่"}
{"word": "look up", "english": "Things are looking up after the rain.", "thai": "สิ่งต่างๆ เริ่มดีขึ้นหลังฝนตก"}
{"word": "look up", "english": "She looked up from her sketchbook.", "thai": "เธอเงยหน้าจากสมุดสเก็ตช์"}
{"word": "look up", "english": "I’ll look up the concert tickets.", "thai": "ฉันจะค้นหาตั๋วคอนเสิร์ต"}
{"word": "look up", "english": "Look up, there’s a balloon floating!", "thai": "เงยหน้าขึ้น มีบอลลูนลอย!"}
{"word": "look up", "english": "He’s looking up a new book to read.", "thai": "เขากำลังค้นหาหนังสือใหม่เพื่ออ่าน"}
{"word": "look up", "english": "Can you look up the hotel address?", "thai": "ช่วยค้นหาที่อยู่โรงแรมได้ไหม?"}
{"word": "look up", "english": "She looked up at the bright sun.", "thai": "เธอเงยมองดวงอาทิตย์สว่าง"}
{"word": "look up", "english": "The company’s profits are looking up.", "thai": "กำไรของบริษัทเริ่มดีขึ้น"}
{"word": "look up", "english": "I’m looking up a new hiking spot.", "thai": "ฉันกำลังค้นหาจุดเดินป่าใหม่"}
{"word": "look up", "english": "Look up, there’s a plane flying low!", "thai": "เงยหน้าขึ้น มีเครื่องบินบินต่ำ!"}
{"word": "look up", "english": "She’s looking up a new dance class.", "thai": "เธอกำลังค้นหาคลาสเต้นใหม่"}
{"word": "look up", "english": "Can you look up the event details?", "thai": "ช่วยค้นหารายละเอียดงานได้ไหม?"}
{"word": "look up", "english": "He looked up at the snowy peaks.", "thai": "เขาเงยมองยอดเขาหิมะ"}
{"word": "look up", "english": "I’ll look up the price of that bike.", "thai": "ฉันจะค้นหาราคาของจักรยานนั้น"}
{"word": "look up", "english": "Things are looking up for the project.", "thai": "สิ่งต่างๆ เริ่มดีขึ้นสำหรับโปรเจกต์"}
{"word": "look up", "english": "She looked up from her journal.", "thai": "เธอเงยหน้าจากสมุดบันทึก"}
{"word": "look up", "english": "I’m looking up a new cooking class.", "thai": "ฉันกำลังค้นหาคลาสทำอาหารใหม่"}
{"word": "look up", "english": "Look up, there’s a meteor shower!", "thai": "เงยหน้าขึ้น มีฝนดาวตก!"}
{"word": "look up", "english": "He’s looking up a new TV show.", "thai": "เขากำลังค้นหารายการทีวีใหม่"}
{"word": "look up", "english": "Can you look up the museum hours?", "thai": "ช่วยค้นหาเวลาทำการของพิพิธภัณฑ์ได้ไหม?"}
{"word": "look up", "english": "She looked up at the colorful sky.", "thai": "เธอเงยมองท้องฟ้าสีสัน"}
{"word": "look up", "english": "The team’s morale is looking up.", "thai": "ขวัญกำลังใจของทีมเริ่มดีขึ้น"}
{"word": "look up", "english": "I’ll look up the new restaurant’s menu.", "thai": "ฉันจะค้นหาเมนูของร้านอาหารใหม่"}
{"word": "look up", "english": "Look up, there’s a hawk circling!", "thai": "เงยหน้าขึ้น มีเหยี่ยวบินวน!"}
{"word": "look up", "english": "She’s looking up a new art class.", "thai": "เธอกำลังค้นหาคลาสศิลปะใหม่"}
{"word": "look up", "english": "Can you look up the game score?", "thai": "ช่วยค้นหาคะแนนเกมได้ไหม?"}
{"word": "look up", "english": "He looked up at the tall cliffs.", "thai": "เขาเงยมองหน้าผาสูง"}
{"word": "look up", "english": "I’m looking up a new phone model.", "thai": "ฉันกำลังค้นหารุ่นโทรศัพท์ใหม่"}
{"word": "make up", "english": "She loves to make up stories for her kids.", "thai": "เธอชอบแต่งเรื่องให้ลูกๆ ฟัง"}
{"word": "make up", "english": "Can we make up after our argument?", "thai": "เราคืนดีกันหลังจากทะเลาะได้ไหม?"}
{"word": "make up", "english": "I need to make up for missing the deadline.", "thai": "ฉันต้องชดเชยที่พลาดกำหนดเวลา"}
{"word": "make up", "english": "He made up an excuse for being late.", "thai": "เขาแต่งข้อแก้ตัวที่มาสาย"}
{"word": "make up", "english": "She’s making up her face for the party.", "thai": "เธอกำลังแต่งหน้าไปงานปาร์ตี้"}
{"word": "make up", "english": "They made up after a week of silence.", "thai": "พวกเขาคืนดีกันหลังจากเงียบไปหนึ่งสัปดาห์"}
{"word": "make up", "english": "I’ll make up the time I missed at work.", "thai": "ฉันจะชดเชยเวลาที่ขาดไปจากงาน"}
{"word": "make up", "english": "He made up a song on the spot.", "thai": "เขาแต่งเพลงขึ้นมาทันที"}
{"word": "make up", "english": "The team makes up half the class.", "thai": "ทีมนี้ประกอบด้วยครึ่งหนึ่งของชั้นเรียน"}
{"word": "make up", "english": "She made up a funny nickname for him.", "thai": "เธอตั้งชื่อเล่นตลกๆ ให้เขา"}
{"word": "make up", "english": "Can you make up the guest bed?", "thai": "ช่วยจัดเตียงสำหรับแขกได้ไหม?"}
{"word": "make up", "english": "They need to make up before the trip.", "thai": "พวกเขาต้องคืนดีกันก่อนทริป"}
{"word": "make up", "english": "I’m making up for lost study time.", "thai": "ฉันกำลังชดเชยเวลาเรียนที่เสียไป"}
{"word": "make up", "english": "He made up a story about his adventure.", "thai": "เขาแต่งเรื่องเกี่ยวกับการผจญภัยของเขา"}
{"word": "make up", "english": "She’s making up her eyes with mascara.", "thai": "เธอกำลังแต่งตาด้วยมาสคาร่า"}
{"word": "make up", "english": "The kids made up after their fight.", "thai": "เด็กๆ คืนดีกันหลังจากทะเลาะ"}
{"word": "make up", "english": "I’ll make up the hours I missed.", "thai": "ฉันจะชดเชยชั่วโมงที่ขาดไป"}
{"word": "make up", "english": "He made up a joke to cheer her up.", "thai": "เขาแต่งมุกเพื่อทำให้เธอร่าเริง"}
{"word": "make up", "english": "The group makes up the majority of voters.", "thai": "กลุ่มนี้ประกอบด้วยผู้มีสิทธิเลือกตั้งส่วนใหญ่"}
{"word": "make up", "english": "She made up a new dance routine.", "thai": "เธอสร้างท่าเต้นใหม่"}
{"word": "make up", "english": "Can you make up the sofa bed?", "thai": "ช่วยจัดโซฟาเป็นเตียงได้ไหม?"}
{"word": "make up", "english": "They made up and hugged it out.", "thai": "พวกเขาคืนดีและกอดกัน"}
{"word": "make up", "english": "I need to make up for skipping practice.", "thai": "ฉันต้องชดเชยที่ข้ามการฝึกซ้อม"}
{"word": "make up", "english": "He made up a reason for missing class.", "thai": "เขาแต่งเหตุผลที่ขาดเรียน"}
{"word": "make up", "english": "She’s making up her lips with gloss.", "thai": "เธอกำลังแต่งปากด้วยลิปกลอส"}
{"word": "make up", "english": "They made up after the disagreement.", "thai": "พวกเขาคืนดีกันหลังจากขัดแย้ง"}
{"word": "make up", "english": "I’ll make up for the late delivery.", "thai": "ฉันจะชดเชยสำหรับการจัดส่งล่าช้า"}
{"word": "make up", "english": "He made up a poem for the event.", "thai": "เขาแต่งบทกวีสำหรับงาน"}
{"word": "make up", "english": "The class makes up a diverse group.", "thai": "ชั้นเรียนนี้ประกอบด้วยกลุ่มที่หลากหลาย"}
{"word": "make up", "english": "She made up a game for the kids.", "thai": "เธอสร้างเกมให้เด็กๆ"}
{"word": "make up", "english": "Can you make up the extra bed?", "thai": "ช่วยจัดเตียงเสริมได้ไหม?"}
{"word": "make up", "english": "They need to make up soon.", "thai": "พวกเขาควรคืนดีกันเร็วๆ นี้"}
{"word": "make up", "english": "I’m making up for missing the meeting.", "thai": "ฉันกำลังชดเชยที่พลาดการประชุม"}
{"word": "make up", "english": "He made up a story about a dragon.", "thai": "เขาแต่งเรื่องเกี่ยวกับมังกร"}
{"word": "make up", "english": "She’s making up her face for the date.", "thai": "เธอกำลังแต่งหน้าเพื่อไปเดต"}
{"word": "make up", "english": "They made up after a long talk.", "thai": "พวกเขาคืนดีกันหลังคุยกันยาว"}
{"word": "make up", "english": "I’ll make up the work I missed.", "thai": "ฉันจะชดเชยงานที่ขาดไป"}
{"word": "make up", "english": "He made up a riddle for the party.", "thai": "เขาแต่งปริศนาสำหรับงานปาร์ตี้"}
{"word": "make up", "english": "The team makes up the core of the project.", "thai": "ทีมนี้ประกอบด้วยแกนหลักของโปรเจกต์"}
{"word": "make up", "english": "She made up a new recipe for dinner.", "thai": "เธอสร้างสูตรอาหารเย็นใหม่"}
{"word": "make up", "english": "Can you make up the guest room?", "thai": "ช่วยจัดห้องพักแขกได้ไหม?"}
{"word": "make up", "english": "They made up and went to dinner.", "thai": "พวกเขาคืนดีและไปกินข้าวเย็น"}
{"word": "make up", "english": "I need to make up for forgetting her birthday.", "thai": "ฉันต้องชดเชยที่ลืมวันเกิดเธอ"}
{"word": "make up", "english": "He made up a tale about pirates.", "thai": "เขาแต่งเรื่องเกี่ยวกับโจรสลัด"}
{"word": "make up", "english": "She’s making up her eyes for the show.", "thai": "เธอกำลังแต่งตาเพื่อการแสดง"}
{"word": "make up", "english": "They made up after the big fight.", "thai": "พวกเขาคืนดีกันหลังจากทะเลาะใหญ่"}
{"word": "make up", "english": "I’ll make up for the missed deadline.", "thai": "ฉันจะชดเชยสำหรับกำหนดเวลาที่พลาด"}
{"word": "make up", "english": "He made up a skit for the talent show.", "thai": "เขาแต่งละครสั้นสำหรับการแสดงความสามารถ"}
{"word": "make up", "english": "The group makes up the entire choir.", "thai": "กลุ่มนี้ประกอบด้วยคณะนักร้องประสานเสียงทั้งหมด"}
{"word": "make up", "english": "She made up a fun activity for the kids.", "thai": "เธอสร้างกิจกรรมสนุกๆ ให้เด็กๆ"}
{"word": "make up", "english": "Can you make up the spare room?", "thai": "ช่วยจัดห้องว่างได้ไหม?"}
{"word": "make up", "english": "They need to make up before the event.", "thai": "พวกเขาควรคืนดีกันก่อนงาน"}
{"word": "make up", "english": "I’m making up for the late assignment.", "thai": "ฉันกำลังชดเชยงานที่ส่งช้า"}
{"word": "make up", "english": "He made up a story about a ghost.", "thai": "เขาแต่งเรื่องเกี่ยวกับผี"}
{"word": "make up", "english": "She’s making up her lips for the wedding.", "thai": "เธอกำลังแต่งปากเพื่องานแต่ง"}
{"word": "make up", "english": "They made up and planned a trip.", "thai": "พวกเขาคืนดีและวางแผนทริป"}
{"word": "make up", "english": "I’ll make up for the broken promise.", "thai": "ฉันจะชดเชยสำหรับคำสัญญาที่ผิด"}
{"word": "make up", "english": "He made up a joke about the dog.", "thai": "เขาแต่งมุกเกี่ยวกับสุนัข"}
{"word": "make up", "english": "The panel makes up the jury.", "thai": "คณะนี้ประกอบด้วยคณะลูกขุน"}
{"word": "make up", "english": "She made up a new board game.", "thai": "เธอสร้างบอร์ดเกมใหม่"}
{"word": "make up", "english": "Can you make up the kids’ beds?", "thai": "ช่วยจัดเตียงเด็กๆ ได้ไหม?"}
{"word": "make up", "english": "They made up after the misunderstanding.", "thai": "พวกเขาคืนดีกันหลังความเข้าใจผิด"}
{"word": "make up", "english": "I need to make up for missing practice.", "thai": "ฉันต้องชดเชยที่ข้ามการฝึก"}
{"word": "make up", "english": "He made up a story about a hero.", "thai": "เขาแต่งเรื่องเกี่ยวกับวีรบุรุษ"}
{"word": "make up", "english": "She’s making up her face for the gala.", "thai": "เธอกำลังแต่งหน้าเพื่องานกาล่า"}
{"word": "make up", "english": "They made up and laughed it off.", "thai": "พวกเขาคืนดีและหัวเราะกัน"}
{"word": "make up", "english": "I’ll make up for the lost time.", "thai": "ฉันจะชดเชยเวลาที่เสียไป"}
{"word": "make up", "english": "He made up a rhyme for the kids.", "thai": "เขาแต่งคำคล้องจองให้เด็กๆ"}
{"word": "make up", "english": "The students make up the debate team.", "thai": "นักเรียนกลุ่มนี้ประกอบด้วยทีมโต้วาที"}
{"word": "make up", "english": "She made up a puzzle for the class.", "thai": "เธอสร้างปริศนาให้ชั้นเรียน"}
{"word": "make up", "english": "Can you make up the guest cot?", "thai": "ช่วยจัดเตียงพับสำหรับแขกได้ไหม?"}
{"word": "make up", "english": "They need to make up before dinner.", "thai": "พวกเขาควรคืนดีกันก่อนมื้อเย็น"}
{"word": "make up", "english": "I’m making up for the missed class.", "thai": "ฉันกำลังชดเชยชั้นเรียนที่ขาด"}
{"word": "make up", "english": "He made up a tale about a wizard.", "thai": "เขาแต่งเรื่องเกี่ยวกับพ่อมด"}
{"word": "make up", "english": "She’s making up her eyes for the dance.", "thai": "เธอกำลังแต่งตาเพื่องานเต้น"}
{"word": "make up", "english": "They made up after the long feud.", "thai": "พวกเขาคืนดีกันหลังการทะเลาะยาวนาน"}
{"word": "make up", "english": "I’ll make up for the canceled plans.", "thai": "ฉันจะชดเชยสำหรับแผนที่ถูกยกเลิก"}
{"word": "make up", "english": "He made up a song about the beach.", "thai": "เขาแต่งเพลงเกี่ยวกับชายหาด"}
{"word": "make up", "english": "The cast makes up the entire show.", "thai": "นักแสดงกลุ่มนี้ประกอบด้วยทั้งการแสดง"}
{"word": "make up", "english": "She made up a quiz for the students.", "thai": "เธอสร้างแบบทดสอบให้เด็กนักเรียน"}
{"word": "make up", "english": "Can you make up the spare bed?", "thai": "ช่วยจัดเตียงสำรองได้ไหม?"}
{"word": "make up", "english": "They made up and shared a meal.", "thai": "พวกเขาคืนดีและกินข้าวด้วยกัน"}
{"word": "make up", "english": "I need to make up for the bad review.", "thai": "ฉันต้องชดเชยสำหรับรีวิวแย่ๆ"}
{"word": "make up", "english": "He made up a story about a castle.", "thai": "เขาแต่งเรื่องเกี่ยวกับปราสาท"}
{"word": "make up", "english": "She’s making up her face for the prom.", "thai": "เธอกำลังแต่งหน้าเพื่องานพรอม"}
{"word": "make up", "english": "They made up after the argument.", "thai": "พวกเขาคืนดีกันหลังการโต้เถียง"}
{"word": "make up", "english": "I’ll make up for the missed workout.", "thai": "ฉันจะชดเชยการออกกำลังกายที่ขาดไป"}
{"word": "make up", "english": "He made up a joke about the cat.", "thai": "เขาแต่งมุกเกี่ยวกับแมว"}
{"word": "make up", "english": "The volunteers make up the cleanup crew.", "thai": "อาสาสมัครกลุ่มนี้ประกอบด้วยทีมทำความสะอาด"}
{"word": "make up", "english": "She made up a new art project.", "thai": "เธอสร้างโปรเจกต์ศิลปะใหม่"}
{"word": "make up", "english": "Can you make up the kids’ room?", "thai": "ช่วยจัดห้องเด็กๆ ได้ไหม?"}
{"word": "make up", "english": "They need to make up after the fight.", "thai": "พวกเขาควรคืนดีกันหลังการทะเลาะ"}
{"word": "make up", "english": "I’m making up for the late project.", "thai": "ฉันกำลังชดเชยสำหรับโปรเจกต์ที่ล่าช้า"}
{"word": "make up", "english": "He made up a story about a spaceship.", "thai": "เขาแต่งเรื่องเกี่ยวกับยานอวกาศ"}
{"word": "make up", "english": "She’s making up her lips for the event.", "thai": "เธอกำลังแต่งปากเพื่องาน"}
{"word": "make up", "english": "They made up and watched a movie.", "thai": "พวกเขาคืนดีและดูหนังด้วยกัน"}
{"word": "make up", "english": "I’ll make up for the broken dish.", "thai": "ฉันจะชดเชยสำหรับจานที่แตก"}
{"word": "mess up", "english": "I don’t want to mess up this project.", "thai": "ฉันไม่อยากทำให้โปรเจกต์นี้พัง"}
{"word": "mess up", "english": "She messed up her lines in the play.", "thai": "เธอพูดผิดบทในละคร"}
{"word": "mess up", "english": "He’s afraid he’ll mess up the presentation.", "thai": "เขากลัวว่าจะทำให้การนำเสนอพัง"}
{"word": "mess up", "english": "Don’t mess up the kitchen while cooking!", "thai": "อย่าทำครัวเลอะตอนทำอาหาร!"}
{"word": "mess up", "english": "They messed up the order at the restaurant.", "thai": "พวกเขาทำออเดอร์ที่ร้านอาหารผิด"}
{"word": "mess up", "english": "I messed up my homework last night.", "thai": "เมื่อคืนฉันทำการบ้านผิด"}
{"word": "mess up", "english": "She’s worried she’ll mess up the exam.", "thai": "เธอกังวลว่าจะสอบพัง"}
{"word": "mess up", "english": "He messed up the paint job on the wall.", "thai": "เขาทำงานทาสีผนังพัง"}
{"word": "mess up", "english": "Don’t mess up my desk while I’m gone!", "thai": "อย่าทำโต๊ะฉันเลอะตอนฉันไม่อยู่!"}
{"word": "mess up", "english": "They messed up the schedule for the event.", "thai": "พวกเขาทำตารางงานผิด"}
{"word": "mess up", "english": "I hope I don’t mess up this recipe.", "thai": "หวังว่าฉันจะไม่ทำให้สูตรนี้พัง"}
{"word": "mess up", "english": "She messed up her hair trying to dye it.", "thai": "เธอทำผมพังตอนพยายามย้อม"}
{"word": "mess up", "english": "He messed up the game with one mistake.", "thai": "เขาทำเกมพังด้วยความผิดพลาดครั้งเดียว"}
{"word": "mess up", "english": "Don’t mess up the living room!", "thai": "อย่าทำห้องนั่งเล่นเลอะ!"}
{"word": "mess up", "english": "They messed up the delivery address.", "thai": "พวกเขาทำที่อยู่จัดส่งผิด"}
{"word": "mess up", "english": "I messed up the math problem again.", "thai": "ฉันทำโจทย์คณิตผิดอีกแล้ว"}
{"word": "mess up", "english": "She’s scared she’ll mess up her speech.", "thai": "เธอกลัวว่าจะพูดผิดในสุนทรพจน์"}
{"word": "mess up", "english": "He messed up the repair on the car.", "thai": "เขาทำการซ่อมรถพัง"}
{"word": "mess up", "english": "Don’t mess up my notes, please!", "thai": "อย่าทำบันทึกของฉันเลอะนะ!"}
{"word": "mess up", "english": "They messed up the hotel reservation.", "thai": "พวกเขาทำการจองโรงแรมผิด"}
{"word": "mess up", "english": "I don’t want to mess up this opportunity.", "thai": "ฉันไม่อยากทำให้โอกาสนี้พัง"}
{"word": "mess up", "english": "She messed up the dance routine.", "thai": "เธอทำท่าเต้นผิด"}
{"word": "mess up", "english": "He’s worried he’ll mess up the interview.", "thai": "เขากังวลว่าจะทำให้การสัมภาษณ์พัง"}
{"word": "mess up", "english": "Don’t mess up the garden with your tools!", "thai": "อย่าทำสวนเลอะด้วยเครื่องมือ!"}
{"word": "mess up", "english": "They messed up the seating arrangement.", "thai": "พวกเขาทำการจัดที่นั่งผิด"}
{"word": "mess up", "english": "I messed up the directions to the park.", "thai": "ฉันทำเส้นทางไปสวนสาธารณะผิด"}
{"word": "mess up", "english": "She messed up her makeup before the party.", "thai": "เธอทำเครื่องสำอางพังก่อนงานปาร์ตี้"}
{"word": "mess up", "english": "He messed up the code in the program.", "thai": "เขาทำโค้ดในโปรแกรมพัง"}
{"word": "mess up", "english": "Don’t mess up the clean laundry!", "thai": "อย่าทำผ้าสะอาดเลอะ!"}
{"word": "mess up", "english": "They messed up the flight bookings.", "thai": "พวกเขาทำการจองเที่ยวบินผิด"}
{"word": "mess up", "english": "I hope I don’t mess up this painting.", "thai": "หวังว่าฉันจะไม่ทำให้ภาพวาดนี้พัง"}
{"word": "mess up", "english": "She messed up the song during rehearsal.", "thai": "เธอร้องเพลงผิดตอนซ้อม"}
{"word": "mess up", "english": "He’s afraid he’ll mess up the deal.", "thai": "เขากลัวว่าจะทำให้ข้อตกลงพัง"}
{"word": "mess up", "english": "Don’t mess up the table setting!", "thai": "อย่าทำการจัดโต๊ะเลอะ!"}
{"word": "mess up", "english": "They messed up the event planning.", "thai": "พวกเขาทำการวางแผนงานผิด"}
{"word": "mess up", "english": "I messed up the quiz yesterday.", "thai": "เมื่อวานฉันทำแบบทดสอบผิด"}
{"word": "mess up", "english": "She’s worried she’ll mess up her lines.", "thai": "เธอกังวลว่าจะพูดบทผิด"}
{"word": "mess up", "english": "He messed up the wiring in the house.", "thai": "เขาทำระบบไฟในบ้านพัง"}
{"word": "mess up", "english": "Don’t mess up my room while I’m out!", "thai": "อย่าทำห้องฉันเลอะตอนฉันไม่อยู่!"}
{"word": "mess up", "english": "They messed up the customer’s order.", "thai": "พวกเขาทำออเดอร์ของลูกค้าผิด"}
{"word": "mess up", "english": "I don’t want to mess up this chance.", "thai": "ฉันไม่อยากทำให้โอกาสนี้พัง"}
{"word": "mess up", "english": "She messed up her knitting project.", "thai": "เธอทำโปรเจกต์ถักนิตติ้งพัง"}
{"word": "mess up", "english": "He messed up the game with a bad move.", "thai": "เขาทำเกมพังด้วยการเดินหมากแย่"}
{"word": "mess up", "english": "Don’t mess up the new carpet!", "thai": "อย่าทำพรมใหม่เลอะ!"}
{"word": "mess up", "english": "They messed up the party decorations.", "thai": "พวกเขาทำของตกแต่งงานปาร์ตี้พัง"}
{"word": "mess up", "english": "I messed up the recipe for the cake.", "thai": "ฉันทำสูตรเค้กผิด"}
{"word": "mess up", "english": "She’s scared she’ll mess up the audition.", "thai": "เธอกลัวว่าจะทำให้การออดิชันพัง"}
{"word": "mess up", "english": "He messed up the repair on the bike.", "thai": "เขาทำการซ่อมจักรยานพัง"}
{"word": "mess up", "english": "Don’t mess up the clean dishes!", "thai": "อย่าทำจานสะอาดเลอะ!"}
{"word": "mess up", "english": "They messed up the meeting schedule.", "thai": "พวกเขาทำตารางประชุมผิด"}
{"word": "mess up", "english": "I hope I don’t mess up this speech.", "thai": "หวังว่าฉันจะไม่ทำให้สุนทรพจน์นี้พัง"}
{"word": "mess up", "english": "She messed up her outfit with a stain.", "thai": "เธอทำชุดเปื้อนจนพัง"}
{"word": "mess up", "english": "He’s worried he’ll mess up the project.", "thai": "เขากังวลว่าจะทำให้โปรเจกต์พัง"}
{"word": "mess up", "english": "Don’t mess up the garden beds!", "thai": "อย่าทำแปลงสวนเลอะ!"}
{"word": "mess up", "english": "They messed up the concert tickets.", "thai": "พวกเขาทำตั๋วคอนเสิร์ตผิด"}
{"word": "mess up", "english": "I messed up the directions to the store.", "thai": "ฉันทำเส้นทางไปร้านผิด"}
{"word": "mess up", "english": "She messed up her drawing with a smudge.", "thai": "เธอทำภาพวาดพังด้วยรอยเปื้อน"}
{"word": "mess up", "english": "He messed up the software installation.", "thai": "เขาทำการติดตั้งซอฟต์แวร์พัง"}
{"word": "mess up", "english": "Don’t mess up the guest room!", "thai": "อย่าทำห้องพักแขกเลอะ!"}
{"word": "mess up", "english": "They messed up the catering order.", "thai": "พวกเขาทำออเดอร์จัดเลี้ยงผิด"}
{"word": "mess up", "english": "I don’t want to mess up this interview.", "thai": "ฉันไม่อยากทำให้การสัมภาษณ์นี้พัง"}
{"word": "mess up", "english": "She messed up her lines in rehearsal.", "thai": "เธอพูดบทผิดตอนซ้อม"}
{"word": "mess up", "english": "He’s afraid he’ll mess up the deal.", "thai": "เขากลัวว่าจะทำให้ข้อตกลงพัง"}
{"word": "mess up", "english": "Don’t mess up the clean tablecloth!", "thai": "อย่าทำผ้าปูโต๊ะสะอาดเลอะ!"}
{"word": "mess up", "english": "They messed up the seating chart.", "thai": "พวกเขาทำผังที่นั่งผิด"}
{"word": "mess up", "english": "I messed up the math test today.", "thai": "วันนี้ฉันทำข้อสอบคณิตผิด"}
{"word": "mess up", "english": "She’s worried she’ll mess up her performance.", "thai": "เธอกังวลว่าจะทำให้การแสดงพัง"}
{"word": "mess up", "english": "He messed up the repair on the phone.", "thai": "เขาทำการซ่อมโทรศัพท์พัง"}
{"word": "mess up", "english": "Don’t mess up the fresh paint!", "thai": "อย่าทำสีใหม่เลอะ!"}
{"word": "mess up", "english": "They messed up the delivery schedule.", "thai": "พวกเขาทำตารางจัดส่งผิด"}
{"word": "mess up", "english": "I hope I don’t mess up this drawing.", "thai": "หวังว่าฉันจะไม่ทำให้ภาพวาดนี้พัง"}
{"word": "mess up", "english": "She messed up her hair with a bad cut.", "thai": "เธอทำผมพังด้วยการตัดแย่ๆ"}
{"word": "mess up", "english": "He messed up the game with a penalty.", "thai": "เขาทำเกมพังด้วยการฟาวล์"}
{"word": "mess up", "english": "Don’t mess up the new rug!", "thai": "อย่าทำพรมใหม่เลอะ!"}
{"word": "mess up", "english": "They messed up the event invitations.", "thai": "พวกเขาทำบัตรเชิญงานผิด"}
{"word": "mess up", "english": "I messed up the recipe for the soup.", "thai": "ฉันทำสูตรซุปผิด"}
{"word": "mess up", "english": "She’s scared she’ll mess up the dance.", "thai": "เธอกลัวว่าจะทำให้การเต้นพัง"}
{"word": "mess up", "english": "He messed up the wiring دوباره
System: The repair on the computer.", "thai": "เขาทำการซ่อมคอมพิวเตอร์พัง"}
{"word": "mess up", "english": "Don’t mess up the clean sheets!", "thai": "อย่าทำผ้าปูที่นอนสะอาดเลอะ!"}
{"word": "mess up", "english": "They messed up the reservation dates.", "thai": "พวกเขาทำวันที่จองผิด"}
{"word": "mess up", "english": "I don’t want to mess up this chance.", "thai": "ฉันไม่อยากทำให้โอกาสนี้พัง"}
{"word": "mess up", "english": "She messed up her speech at the event.", "thai": "เธอพูดผิดในสุนทรพจน์ที่งาน"}
{"word": "mess up", "english": "He’s worried he’ll mess up the audition.", "thai": "เขากังวลว่าจะทำให้การออดิชันพัง"}
{"word": "mess up", "english": "Don’t mess up the kitchen counter!", "thai": "อย่าทำเคาน์เตอร์ครัวเลอะ!"}
{"word": "mess up", "english": "They messed up the team’s strategy.", "thai": "พวกเขาทำกลยุทธ์ของทีมผิด"}
{"word": "mess up", "english": "I messed up the knitting pattern.", "thai": "ฉันทำแพทเทิร์นถักนิตติ้งผิด"}
{"word": "mess up", "english": "She messed up her makeup with tears.", "thai": "เธอทำเครื่องสำอางพังด้วยน้ำตา"}
{"word": "mess up", "english": "He messed up the project timeline.", "thai": "เขาทำไทม์ไลน์โปรเจกต์พัง"}
{"word": "mess up", "english": "Don’t mess up the new couch!", "thai": "อย่าทำโซฟาใหม่เลอะ!"}
{"word": "mess up", "english": "They messed up the wedding plans.", "thai": "พวกเขาทำแผนงานแต่งงานผิด"}
{"word": "mess up", "english": "I hope I don’t mess up this test.", "thai": "หวังว่าฉันจะไม่ทำให้ข้อสอบนี้พัง"}
{"word": "mess up", "english": "She messed up her lines in the show.", "thai": "เธอพูดบทผิดในรายการ"}
{"word": "mess up", "english": "He’s afraid he’ll mess up the recipe.", "thai": "เขากลัวว่าจะทำให้สูตรอาหารพัง"}
{"word": "mess up", "english": "Don’t mess up the clean floor!", "thai": "อย่าทำพื้นสะอาดเลอะ!"}
{"word": "mess up", "english": "They messed up the group project.", "thai": "พวกเขาทำโปรเจกต์กลุ่มพัง"}
{"word": "mess up", "english": "I messed up the dance steps.", "thai": "ฉันทำท่าเต้นผิด"}
{"word": "move on", "english": "Let’s move on to the next topic.", "thai": "ไปต่อที่หัวข้อถัดไปกันเถอะ"}
{"word": "move on", "english": "She’s trying to move on after the breakup.", "thai": "เธอกำลังพยายามเดินหน้าต่อหลังจากเลิกกัน"}
{"word": "move on", "english": "We need to move on with the project.", "thai": "เราต้องเดินหน้าโปรเจกต์ต่อไป"}
{"word": "move on", "english": "He moved on from his old job quickly.", "thai": "เขาเดินหน้าจากงานเก่าอย่างรวดเร็ว"}
{"word": "move on", "english": "Can we move on from this argument?", "thai": "เราจะผ่านเรื่องการโต้แย้งนี้ไปได้ไหม?"}
{"word": "move on", "english": "They moved on to a new city last month.", "thai": "พวกเขาย้ายไปเมืองใหม่เมื่อเดือนที่แล้ว"}
{"word": "move on", "english": "I’m ready to move on to the next chapter.", "thai": "ฉันพร้อมที่จะเดินหน้าสู่บทต่อไป"}
{"word": "move on", "english": "She moved on from her past mistakes.", "thai": "เธอเดินหน้าจากความผิดพลาดในอดีต"}
{"word": "move on", "english": "Let’s move on to the final question.", "thai": "ไปต่อที่คำถามสุดท้ายกันเถอะ"}
{"word": "move on", "english": "He’s struggling to move on after the loss.", "thai": "เขากำลังพยายามเดินหน้าต่อหลังจากการสูญเสีย"}
{"word": "move on", "english": "We should move on with the meeting.", "thai": "เราควรเดินหน้าต่อกับการประชุม"}
{"word": "move on", "english": "She moved on to a better opportunity.", "thai": "เธอเดินหน้าสู่โอกาสที่ดีกว่า"}
{"word": "move on", "english": "Can you move on from that old grudge?", "thai": "คุณจะปล่อยวางความแค้นเก่านั้นได้ไหม?"}
{"word": "move on", "english": "They moved on to the next level of the game.", "thai": "พวกเขาผ่านไปยังเลเวลต่อไปของเกม"}
{"word": "move on", "english": "I need to move on from this bad day.", "thai": "ฉันต้องเดินหน้าจากวันที่แย่นี้"}
{"word": "move on", "english": "He moved on to a new school this year.", "thai": "เขาย้ายไปโรงเรียนใหม่ปีนี้"}
{"word": "move on", "english": "Let’s move on to the dessert menu.", "thai": "ไปต่อที่เมนูของหวานกันเถอะ"}
{"word": "move on", "english": "She’s trying to move on from the drama.", "thai": "เธอกำลังพยายามเดินหน้าจากเรื่องดราม่า"}
{"word": "move on", "english": "We need to move on with our plans.", "thai": "เราต้องเดินหน้าต่อกับแผนของเรา"}
{"word": "move on", "english": "He moved on after the tough breakup.", "thai": "เขาเดินหน้าต่อหลังจากการเลิกที่ยากลำบาก"}
{"word": "move on", "english": "Can we move on to the next exercise?", "thai": "เราจะไปต่อที่แบบฝึกหัดถัดไปได้ไหม?"}
{"word": "move on", "english": "They moved on to a bigger apartment.", "thai": "พวกเขาย้ายไปอพาร์ตเมนต์ที่ใหญ่กว่า"}
{"word": "move on", "english": "I’m ready to move on from this job.", "thai": "ฉันพร้อมที่จะเดินหน้าจากงานนี้"}
{"word": "move on", "english": "She moved on from her old hobbies.", "thai": "เธอเดินหน้าจากงานอดิเรกเก่าๆ"}
{"word": "move on", "english": "Let’s move on to the main presentation.", "thai": "ไปต่อที่การนำเสนอหลักกันเถอะ"}
{"word": "move on", "english": "He’s trying to move on after the rejection.", "thai": "เขากำลังพยายามเดินหน้าต่อหลังถูกปฏิเสธ"}
{"word": "move on", "english": "We should move on with the renovation.", "thai": "เราควรเดินหน้าต่อกับการปรับปรุง"}
{"word": "move on", "english": "She moved on to a new career path.", "thai": "เธอเดินหน้าสู่อาชีพใหม่"}
{"word": "move on", "english": "Can you move on from that mistake?", "thai": "คุณจะปล่อยวางความผิดพลาดนั้นได้ไหม?"}
{"word": "move on", "english": "They moved on to the next round of the competition.", "thai": "พวกเขาผ่านไปยังรอบต่อไปของการแข่งขัน"}
{"word": "move on", "english": "I need to move on from this argument.", "thai": "ฉันต้องเดินหน้าจากการโต้แย้งนี้"}
{"word": "move on", "english": "He moved on to a different city.", "thai": "เขาย้ายไปเมืองอื่น"}
{"word": "move on", "english": "Let’s move on to the next activity.", "thai": "ไปต่อที่กิจกรรมถัดไปกันเถอะ"}
{"word": "move on", "english": "She’s struggling to move on from her ex.", "thai": "เธอกำลังพยายามเดินหน้าจากแฟนเก่า"}
{"word": "move on", "english": "We need to move on with the schedule.", "thai": "เราต้องเดินหน้าต่อตามตาราง"}
{"word": "move on", "english": "He moved on from his old friends.", "thai": "เขาเดินหน้าจากเพื่อนเก่าๆ"}
{"word": "move on", "english": "Can we move on to the next chapter?", "thai": "เราจะไปต่อที่บทถัดไปได้ไหม?"}
{"word": "move on", "english": "They moved on to a new restaurant.", "thai": "พวกเขาย้ายไปร้านอาหารใหม่"}
{"word": "move on", "english": "I’m ready to move on from this place.", "thai": "ฉันพร้อมที่จะเดินหน้าจากสถานที่นี้"}
{"word": "move on", "english": "She moved on from her past regrets.", "thai": "เธอเดินหน้าจากความเสียใจในอดีต"}
{"word": "move on", "english": "Let’s move on to the group discussion.", "thai": "ไปต่อที่การอภิปรายกลุ่มกันเถอะ"}
{"word": "move on", "english": "He’s trying to move on after the failure.", "thai": "เขากำลังพยายามเดินหน้าต่อหลังความล้มเหลว"}
{"word": "move on", "english": "We should move on with the event plans.", "thai": "เราควรเดินหน้าต่อกับแผนงาน"}
{"word": "move on", "english": "She moved on to a new hobby.", "thai": "เธอเดินหน้าสู่งานอดิเรกใหม่"}
{"word": "move on", "english": "Can you move on from that bad memory?", "thai": "คุณจะปล่อยวางความทรงจำแย่นั้นได้ไหม?"}
{"word": "move on", "english": "They moved on to the next stage of training.", "thai": "พวกเขาผ่านไปยังขั้นตอนต่อไปของการฝึก"}
{"word": "move on", "english": "I need to move on from this disappointment.", "thai": "ฉันต้องเดินหน้าจากความผิดหวังนี้"}
{"word": "move on", "english": "He moved on to a new department.", "thai": "เขาย้ายไปแผนกใหม่"}
{"word": "move on", "english": "Let’s move on to the final task.", "thai": "ไปต่อที่งานสุดท้ายกันเถอะ"}
{"word": "move on", "english": "She’s struggling to move on from the past.", "thai": "เธอกำลังพยายามเดินหน้าจากอดีต"}
{"word": "move on", "english": "We need to move on with the budget plan.", "thai": "เราต้องเดินหน้าต่อกับแผนงบประมาณ"}
{"word": "move on", "english": "He moved on to a new gym.", "thai": "เขาย้ายไปยิมใหม่"}
{"word": "move on", "english": "Can we move on to the next item?", "thai": "เราจะไปต่อที่รายการถัดไปได้ไหม?"}
{"word": "move on", "english": "They moved on to a new book club.", "thai": "พวกเขาย้ายไปชมรมหนังสือใหม่"}
{"word": "move on", "english": "I’m ready to move on from this chapter.", "thai": "ฉันพร้อมที่จะเดินหน้าจากบทนี้"}
{"word": "move on", "english": "She moved on from her old routine.", "thai": "เธอเดินหน้าจากกิจวัตรเก่า"}
{"word": "move on", "english": "Let’s move on to the next exercise.", "thai": "ไปต่อที่แบบฝึกหัดถัดไปกันเถอะ"}
{"word": "move on", "english": "He’s trying to move on after the setback.", "thai": "เขากำลังพยายามเดินหน้าต่อหลังจากอุปสรรค"}
{"word": "move on", "english": "We should move on with the renovation plans.", "thai": "เราควรเดินหน้าต่อกับแผนปรับปรุง"}
{"word": "move on", "english": "She moved on to a new yoga class.", "thai": "เธอเดินหน้าสู่คลาสโยคะใหม่"}
{"word": "move on", "english": "Can you move on from that old fight?", "thai": "คุณจะปล่อยวางการทะเลาะเก่านั้นได้ไหม?"}
{"word": "move on", "english": "They moved on to the next phase of the project.", "thai": "พวกเขาผ่านไปยังระยะต่อไปของโปรเจกต์"}
{"word": "move on", "english": "I need to move on from this bad experience.", "thai": "ฉันต้องเดินหน้าจากประสบการณ์แย่นี้"}
{"word": "move on", "english": "He moved on to a new neighborhood.", "thai": "เขาย้ายไปย่านใหม่"}
{"word": "move on", "english": "Let’s move on to the dessert options.", "thai": "ไปต่อที่ตัวเลือกของหวานกันเถอะ"}
{"word": "move on", "english": "She’s struggling to move on from her loss.", "thai": "เธอกำลังพยายามเดินหน้าจากการสูญเสีย"}
{"word": "move on", "english": "We need to move on with the training.", "thai": "เราต้องเดินหน้าต่อกับการฝึก"}
{"word": "move on", "english": "He moved on to a new team.", "thai": "เขาย้ายไปทีมใหม่"}
{"word": "move on", "english": "Can we move on to the next topic?", "thai": "เราจะไปต่อที่หัวข้อถัดไปได้ไหม?"}
{"word": "move on", "english": "They moved on to a new coffee shop.", "thai": "พวกเขาย้ายไปร้านกาแฟใหม่"}
{"word": "move on", "english": "I’m ready to move on from this argument.", "thai": "ฉันพร้อมที่จะเดินหน้าจากการโต้แย้งนี้"}
{"word": "move on", "english": "She moved on from her old habits.", "thai": "เธอเดินหน้าจากนิสัยเก่าๆ"}
{"word": "move on", "english": "Let’s move on to the final round.", "thai": "ไปต่อที่รอบสุดท้ายกันเถอะ"}
{"word": "move on", "english": "He’s trying to move on after the divorce.", "thai": "เขากำลังพยายามเดินหน้าต่อหลังการหย่าร้าง"}
{"word": "move on", "english": "We should move on with the party plans.", "thai": "เราควรเดินหน้าต่อกับแผนงานปาร์ตี้"}
{"word": "move on", "english": "She moved on to a new dance studio.", "thai": "เธอเดินหน้าสู่สตูดิโอเต้นใหม่"}
{"word": "move on", "english": "Can you move on from that bad review?", "thai": "คุณจะปล่อยวางรีวิวแย่นั้นได้ไหม?"}
{"word": "move on", "english": "They moved on to the next book in the series.", "thai": "พวกเขาผ่านไปยังเล่มต่อไปในชุด"}
{"word": "move on", "english": "I need to move on from this failure.", "thai": "ฉันต้องเดินหน้าจากความล้มเหลวนี้"}
{"word": "move on", "english": "He moved on to a new apartment complex.", "thai": "เขาย้ายไปคอมเพล็กซ์อพาร์ตเมนต์ใหม่"}
{"word": "move on", "english": "Let’s move on to the next agenda item.", "thai": "ไปต่อที่วาระถัดไปกันเถอะ"}
{"word": "move on", "english": "She’s struggling to move on from the betrayal.", "thai": "เธอกำลังพยายามเดินหน้าจากการทรยศ"}
{"word": "move on", "english": "We need to move on with the campaign.", "thai": "เราต้องเดินหน้าต่อกับแคมเปญ"}
{"word": "move on", "english": "He moved on to a new fitness routine.", "thai": "เขาย้ายไปสู่วิธีออกกำลังกายใหม่"}
{"word": "move on", "english": "Can we move on to the next question?", "thai": "เราจะไปต่อที่คำถามถัดไปได้ไหม?"}
{"word": "move on", "english": "They moved on to a new hiking trail.", "thai": "พวกเขาย้ายไปเส้นทางเดินป่าใหม่"}
{"word": "move on", "english": "I’m ready to move on from this town.", "thai": "ฉันพร้อมที่จะเดินหน้าจากเมืองนี้"}
{"word": "move on", "english": "She moved on from her old project.", "thai": "เธอเดินหน้าจากโปรเจกต์เก่า"}
{"word": "move on", "english": "Let’s move on to the final plan.", "thai": "ไปต่อที่แผนสุดท้ายกันเถอะ"}
{"word": "move on", "english": "He’s trying to move on after the injury.", "thai": "เขากำลังพยายามเดินหน้าต่อหลังบาดเจ็บ"}
{"word": "move on", "english": "We should move on with the class.", "thai": "เราควรเดินหน้าต่อกับชั้นเรียน"}
{"word": "move on", "english": "She moved on to a new art class.", "thai": "เธอเดินหน้าสู่คลาสศิลปะใหม่"}
{"word": "move on", "english": "Can you move on from that old plan?", "thai": "คุณจะปล่อยวางแผนเก่านั้นได้ไหม?"}
{"word": "move on", "english": "They moved on to the next city on the tour.", "thai": "พวกเขาผ่านไปยังเมืองถัดไปในทัวร์"}
{"word": "move on", "english": "I need to move on from this bad habit.", "thai": "ฉันต้องเดินหน้าจากนิสัยแย่นี้"}
{"word": "move on", "english": "He moved on to a new book series.", "thai": "เขาย้ายไปชุดหนังสือใหม่"}
{"word": "move on", "english": "Let’s move on to the next lesson.", "thai": "ไปต่อที่บทเรียนถัดไปกันเถอะ"}
{"word": "move on", "english": "She’s struggling to move on from the argument.", "thai": "เธอกำลังพยายามเดินหน้าจากการโต้แย้ง"}
