{"word": "move", "english": "I need to move to a new apartment soon.", "thai": "ฉันต้องย้ายไปอพาร์ตเมนต์ใหม่เร็วๆ นี้"}
{"word": "move", "english": "Can you move your car from the driveway?", "thai": "คุณช่วยย้ายรถออกจากทางเข้าบ้านได้ไหม?"}
{"word": "move", "english": "She moves with such grace on the dance floor.", "thai": "เธอเคลื่อนไหวอย่างสง่างามบนฟลอร์เต้นรำ"}
{"word": "move", "english": "We should move the meeting to next week.", "thai": "เราควรเลื่อนการประชุมไปสัปดาห์หน้า"}
{"word": "move", "english": "That movie didn’t move me at all.", "thai": "หนังเรื่องนั้นไม่ได้ทำให้ฉันรู้สึกอะไรเลย"}
{"word": "move", "english": "He decided to move back to his hometown.", "thai": "เขาตัดสินใจย้ายกลับไปบ้านเกิด"}
{"word": "move", "english": "Let’s move this table to the other room.", "thai": "มาจัดย้ายโต๊ะนี้ไปห้องอื่นกัน"}
{"word": "move", "english": "The story moves at a fast pace.", "thai": "เรื่องราวดำเนินไปอย่างรวดเร็ว"}
{"word": "move", "english": "I can’t move my arm after that workout.", "thai": "ฉันขยับแขนไม่ได้เลยหลังจากออกกำลังกาย"}
{"word": "move", "english": "They plan to move abroad next year.", "thai": "พวกเขาวางแผนจะย้ายไปต่างประเทศปีหน้า"}
{"word": "move", "english": "Please move over so I can sit down.", "thai": "กรุณาขยับไปหน่อยเพื่อฉันจะได้นั่ง"}
{"word": "move", "english": "The game piece moves three spaces forward.", "thai": "ตัวหมากเดินไปข้างหน้าสามช่อง"}
{"word": "move", "english": "We need to move quickly to catch the bus.", "thai": "เราต้องรีบเคลื่อนไหวเพื่อขึ้นรถบัส"}
{"word": "move", "english": "Her speech really moves the audience.", "thai": "คำปราศรัยของเธอทำให้ผู้ฟังประทับใจมาก"}
{"word": "move", "english": "I’m trying to move on from the past.", "thai": "ฉันพยายามก้าวต่อไปจากอดีต"}
{"word": "move", "english": "Can you move the couch to the left?", "thai": "คุณช่วยย้ายโซฟาไปทางซ้ายได้ไหม?"}
{"word": "move", "english": "The plot moves slowly in the first half.", "thai": "โครงเรื่องดำเนินไปช้าๆ ในครึ่งแรก"}
{"word": "move", "english": "He moves silently through the house.", "thai": "เขาเคลื่อนไหวเงียบๆ ในบ้าน"}
{"word": "move", "english": "Let’s move this project forward.", "thai": "มาเดินหน้าโปรเจกต์นี้กัน"}
{"word": "move", "english": "I don’t want to move away from my friends.", "thai": "ฉันไม่อยากย้ายห่างจากเพื่อนๆ"}
{"word": "move", "english": "The cat moves so fast when scared.", "thai": "แมวเคลื่อนไหวเร็วมากเมื่อตกใจ"}
{"word": "move", "english": "We need to move the boxes to storage.", "thai": "เราต้องย้ายกล่องไปที่เก็บของ"}
{"word": "move", "english": "His decision to move surprised everyone.", "thai": "การตัดสินใจย้ายของเขาทำให้ทุกคนแปลกใจ"}
{"word": "move", "english": "The dancer moves to the rhythm perfectly.", "thai": "นักเต้นเคลื่อนไหวตามจังหวะได้อย่างสมบูรณ์แบบ"}
{"word": "move", "english": "Can we move this conversation outside?", "thai": "เราย้ายการสนทนานี้ออกไปข้างนอกได้ไหม?"}
{"word": "move", "english": "The team moves the ball down the field.", "thai": "ทีมเคลื่อนบอลลงสนาม"}
{"word": "move", "english": "I’ll move the chair closer to the table.", "thai": "ฉันจะย้ายเก้าอี้เข้าใกล้โต๊ะ"}
{"word": "move", "english": "She moves confidently in public.", "thai": "เธอเคลื่อนไหวอย่างมั่นใจในที่สาธารณะ"}
{"word": "move", "english": "We should move before the storm hits.", "thai": "เราควรย้ายก่อนพายุจะมา"}
{"word": "move", "english": "The clock’s hands move steadily.", "thai": "เข็มนาฬิกาเคลื่อนไหวอย่างสม่ำเสมอ"}
{"word": "move", "english": "I’m ready to move to the next chapter.", "thai": "ฉันพร้อมที่จะก้าวไปสู่บทต่อไป"}
{"word": "move", "english": "He didn’t move during the entire movie.", "thai": "เขาไม่ได้ขยับเลยตลอดทั้งเรื่อง"}
{"word": "move", "english": "Let’s move the party to the backyard.", "thai": "ย้ายปาร์ตี้ไปที่สวนหลังบ้านกัน"}
{"word": "move", "english": "The snake moves silently through the grass.", "thai": "งูเคลื่อนไหวเงียบๆ ผ่านหญ้า"}
{"word": "move", "english": "I need to move some money to savings.", "thai": "ฉันต้องโอนเงินไปบัญชีออมทรัพย์"}
{"word": "move", "english": "She moves her pawn to block the attack.", "thai": "เธอเคลื่อนเบี้ยเพื่อป้องกันการโจมตี"}
{"word": "move", "english": "We can’t move forward without a plan.", "thai": "เราไม่สามารถก้าวหน้าได้หากไม่มีแผน"}
{"word": "move", "english": "The crowd moves toward the stage.", "thai": "ฝูงชนเคลื่อนไปทางเวที"}
{"word": "move", "english": "I’ll move my stuff out by tomorrow.", "thai": "ฉันจะย้ายของออกไปภายในพรุ่งนี้"}
{"word": "move", "english": "The wind moves the leaves gently.", "thai": "ลมพัดใบไม้เคลื่อนไหวเบาๆ"}
{"word": "move", "english": "He moves quickly to avoid the rain.", "thai": "เขารีบเคลื่อนไหวเพื่อหลบฝน"}
{"word": "move", "english": "Can you move the lamp to the corner?", "thai": "คุณช่วยย้ายโคมไฟไปที่มุมได้ไหม?"}
{"word": "move", "english": "The story moves me to tears.", "thai": "เรื่องราวทำให้ฉันน้ำตาคลอ"}
{"word": "move", "english": "They move in sync during the performance.", "thai": "พวกเขาเคลื่อนไหวพร้อมกันในระหว่างการแสดง"}
{"word": "move", "english": "I want to move closer to the city.", "thai": "ฉันอยากย้ายเข้าไปใกล้เมือง"}
{"word": "move", "english": "The robot moves on its own.", "thai": "หุ่นยนต์เคลื่อนไหวด้วยตัวเอง"}
{"word": "move", "english": "Let’s move the books to the shelf.", "thai": "ย้ายหนังสือไปที่ชั้นวางกัน"}
{"word": "move", "english": "She moves her hair out of her face.", "thai": "เธอปัดผมออกจากหน้า"}
{"word": "move", "english": "We need to move this plan into action.", "thai": "เราต้องทำให้แผนนี้เป็นจริง"}
{"word": "move", "english": "The kids move around a lot during class.", "thai": "เด็กๆ ขยับไปมาเยอะระหว่างเรียน"}
{"word": "move", "english": "I can’t move this heavy box alone.", "thai": "ฉันย้ายกล่องหนักนี้คนเดียวไม่ได้"}
{"word": "move", "english": "The song moves at a lively tempo.", "thai": "เพลงนี้ดำเนินไปด้วยจังหวะที่คึกคัก"}
{"word": "move", "english": "He moves to the beat of the music.", "thai": "เขาเคลื่อนไหวตามจังหวะดนตรี"}
{"word": "move", "english": "We should move the event to Saturday.", "thai": "เราควรเลื่อนงานไปวันเสาร์"}
{"word": "move", "english": "The dog moves its tail when happy.", "thai": "สุนัขขยับหางเมื่อมีความสุข"}
{"word": "move", "english": "I’m planning to move to California.", "thai": "ฉันวางแผนจะย้ายไปแคลิฟอร์เนีย"}
{"word": "move", "english": "Can you move a bit faster, please?", "thai": "คุณช่วยขยับเร็วขึ้นหน่อยได้ไหม?"}
{"word": "move", "english": "The chess player moves the knight first.", "thai": "ผู้เล่นหมากรุกเคลื่อนม้าเป็นตัวแรก"}
{"word": "move", "english": "Let’s move the discussion to the main topic.", "thai": "ย้ายการสนทนาไปที่หัวข้อหลักกัน"}
{"word": "move", "english": "The car moves smoothly on the highway.", "thai": "รถเคลื่อนไหวราบรื่นบนทางหลวง"}
{"word": "move", "english": "I need to move my appointment to tomorrow.", "thai": "ฉันต้องเลื่อนนัดไปเป็นพรุ่งนี้"}
{"word": "move", "english": "She moves carefully on the icy path.", "thai": "เธอเคลื่อนไหวอย่างระวังบนทางน้ำแข็ง"}
{"word": "move", "english": "We can move the deadline if needed.", "thai": "เราสามารถเลื่อนกำหนดเวลาได้ถ้าจำเป็น"}
{"word": "move", "english": "The actor moves the audience with his performance.", "thai": "นักแสดงทำให้ผู้ชมประทับใจด้วยการแสดง"}
{"word": "move", "english": "I’ll move the plants to the balcony.", "thai": "ฉันจะย้ายต้นไม้ไปที่ระเบียง"}
{"word": "move", "english": "The story moves forward with a twist.", "thai": "เรื่องราวดำเนินไปพร้อมกับการหักมุม"}
{"word": "move", "english": "He moves his family to a safer neighborhood.", "thai": "เขาย้ายครอบครัวไปย่านที่ปลอดภัยกว่า"}
{"word": "move", "english": "Can you move the picture frame higher?", "thai": "คุณช่วยย้ายกรอบรูปให้สูงขึ้นได้ไหม?"}
{"word": "move", "english": "The dancer moves like nobody’s watching.", "thai": "นักเต้นเคลื่อนไหวเหมือนไม่มีใครดู"}
{"word": "move", "english": "We need to move the equipment before dark.", "thai": "เราต้องย้ายอุปกรณ์ก่อนมืด"}
{"word": "move", "english": "The plot moves toward a happy ending.", "thai": "โครงเรื่องเคลื่อนไปสู่ตอนจบที่มีความสุข"}
{"word": "move", "english": "I can’t move my legs after running.", "thai": "ฉันขยับขาไม่ได้หลังจากวิ่ง"}
{"word": "move", "english": "Let’s move the barbecue to the park.", "thai": "ย้ายงานปิ้งย่างไปที่สวนสาธารณะกัน"}
{"word": "move", "english": "The horse moves gracefully in the field.", "thai": "ม้าเคลื่อนไหวอย่างสง่างามในทุ่ง"}
{"word": "move", "english": "I want to move this rug to the bedroom.", "thai": "ฉันอยากย้ายพรมนี้ไปห้องนอน"}
{"word": "move", "english": "The team moves in formation during the drill.", "thai": "ทีมเคลื่อนไหวเป็นแถวระหว่างการฝึก"}
{"word": "move", "english": "She moves her fingers across the piano keys.", "thai": "เธอเคลื่อนนิ้วไปบนคีย์เปียโน"}
{"word": "move", "english": "We need to move the files to the new system.", "thai": "เราต้องย้ายไฟล์ไปที่ระบบใหม่"}
{"word": "move", "english": "The traffic barely moves during rush hour.", "thai": "การจราจรแทบไม่ขยับในชั่วโมงเร่งด่วน"}
{"word": "move", "english": "I’ll move the groceries to the kitchen.", "thai": "ฉันจะย้ายของชำไปที่ครัว"}
{"word": "move", "english": "The movie moves too slowly for me.", "thai": "หนังเรื่องนี้ดำเนินไปช้าเกินไปสำหรับฉัน"}
{"word": "move", "english": "He moves his head to the music.", "thai": "เขาโยกหัวตามจังหวะดนตรี"}
{"word": "move", "english": "Let’s move the sofa against the wall.", "thai": "ย้ายโซฟาไปชิดผนังกัน"}
{"word": "move", "english": "The team moves to the next round.", "thai": "ทีมผ่านเข้ารอบต่อไป"}
{"word": "move", "english": "I need to move my schedule around.", "thai": "ฉันต้องจัดตารางใหม่"}
{"word": "move", "english": "The boat moves gently on the water.", "thai": "เรือเคลื่อนไหวเบาๆ บนน้ำ"}
{"word": "move", "english": "Can you move the boxes to the garage?", "thai": "คุณช่วยย้ายกล่องไปที่โรงรถได้ไหม?"}
{"word": "move", "english": "She moves through the crowd easily.", "thai": "เธอเคลื่อนผ่านฝูงชนได้อย่างง่ายดาย"}
{"word": "move", "english": "We should move the focus to marketing.", "thai": "เราควรย้ายจุดสนใจไปที่การตลาด"}
{"word": "move", "english": "The clock moves faster than I expected.", "thai": "นาฬิกาเดินเร็วกว่าที่ฉันคาด"}
{"word": "move", "english": "I’ll move the meeting to the afternoon.", "thai": "ฉันจะเลื่อนประชุมไปตอนบ่าย"}
{"word": "move", "english": "The kids move excitedly around the park.", "thai": "เด็กๆ ขยับไปมาด้วยความตื่นเต้นในสวน"}
{"word": "move", "english": "He moves his bishop to checkmate.", "thai": "เขาเคลื่อนบิชอปเพื่อรุกฆาต"}
{"word": "move", "english": "Let’s move the decorations to the hall.", "thai": "ย้ายของตกแต่งไปที่โถงกัน"}
{"word": "move", "english": "The wind moves the branches wildly.", "thai": "ลมพัดกิ่งไม้เคลื่อนไหวอย่างรุนแรง"}
{"word": "move", "english": "I want to move forward with the deal.", "thai": "ฉันอยากเดินหน้าต่อกับข้อตกลง"}
{"word": "move", "english": "The dancer moves to the spotlight.", "thai": "นักเต้นเคลื่อนไปยังจุดที่มีสปอตไลต์"}
{"word": "move", "english": "We need to move the supplies before winter.", "thai": "เราต้องย้ายเสบียงก่อนหน้าหนาว"}
{"word": "move", "english": "She moves her gaze to the horizon.", "thai": "เธอเคลื่อนสายตาไปยังเส้นขอบฟ้า"}
