{"word": "journal", "english": "I keep a journal to track my daily thoughts.", "thai": "ฉันเก็บสมุดบันทึกเพื่อติดตามความคิดประจำวันของฉัน"}
{"word": "journal", "english": "She wrote in her journal every night before bed.", "thai": "เธอเขียนในสมุดบันทึกทุกคืนก่อนนอน"}
{"word": "journal", "english": "Have you read the latest issue of that scientific journal?", "thai": "คุณอ่านฉบับล่าสุดของวารสารวิทยาศาสตร์นั้นหรือยัง"}
{"word": "journal", "english": "My therapist suggested I start a gratitude journal.", "thai": "นักบำบัดของฉันแนะนำให้ฉันเริ่มเขียนสมุดบันทึกความกตัญญู"}
{"word": "journal", "english": "The journal article was peer-reviewed and very credible.", "thai": "บทความในวารสารนั้นได้รับการตรวจสอบโดยผู้เชี่ยวชาญและน่าเชื่อถือมาก"}
{"word": "journal", "english": "He published his findings in a prestigious journal.", "thai": "เขาเผยแพร่ผลการวิจัยของเขาในวารสารที่มีชื่อเสียง"}
{"word": "journal", "english": "I forgot where I placed my travel journal.", "thai": "ฉันลืมว่าวางสมุดบันทึกการเดินทางไว้ที่ไหน"}
{"word": "journal", "english": "The professor asked us to maintain a lab journal.", "thai": "ศาสตราจารย์ขอให้เราดูแลสมุดบันทึกห้องปฏิบัติการ"}
{"word": "journal", "english": "Her journal was filled with sketches and poems.", "thai": "สมุดบันทึกของเธอเต็มไปด้วยภาพร่างและบทกวี"}
{"word": "journal", "english": "I need to submit my paper to an academic journal.", "thai": "ฉันต้องส่งบทความของฉันไปยังวารสารวิชาการ"}
{"word": "journal", "english": "The journal entry for today was about my goals.", "thai": "บันทึกในสมุดบันทึกสำหรับวันนี้เกี่ยวกับเป้าหมายของฉัน"}
{"word": "journal", "english": "This journal has been in my family for generations.", "thai": "สมุดบันทึกนี้อยู่ในครอบครัวของฉันมาหลายชั่วอายุคน"}
{"word": "journal", "english": "I read a journal about environmental conservation.", "thai": "ฉันอ่านวารสารเกี่ยวกับการอนุรักษ์สิ่งแวดล้อม"}
{"word": "journal", "english": "She uses a digital journal on her tablet.", "thai": "เธอใช้สมุดบันทึกดิจิทัลบนแท็บเล็ตของเธอ"}
{"word": "journal", "english": "The journal published a study on climate change.", "thai": "วารสารเผยแพร่งานวิจัยเกี่ยวกับการเปลี่ยนแปลงสภาพภูมิอากาศ"}
{"word": "journal", "english": "I bought a new leather-bound journal yesterday.", "thai": "ฉันซื้อสมุดบันทึกปกหนังใหม่เมื่อวานนี้"}
{"word": "journal", "english": "His journal entries were raw and emotional.", "thai": "บันทึกในสมุดบันทึกของเขาดิบและเต็มไปด้วยอารมณ์"}
{"word": "journal", "english": "The library subscribes to that medical journal.", "thai": "ห้องสมุดสมัครรับวารสารการแพทย์นั้น"}
{"word": "journal", "english": "I use my journal to plan my weekly tasks.", "thai": "ฉันใช้สมุดบันทึกเพื่อวางแผนงานประจำสัปดาห์ของฉัน"}
{"word": "journal", "english": "The journal was cited in her research paper.", "thai": "วารสารนั้นถูกอ้างถึงในบทความวิจัยของเธอ"}
{"word": "journal", "english": "I found an old journal in the attic.", "thai": "ฉันพบสมุดบันทึกเก่าในห้องใต้หลังคา"}
{"word": "journal", "english": "The journal editor rejected my submission.", "thai": "บรรณาธิการวารสารปฏิเสธการส่งผลงานของฉัน"}
{"word": "journal", "english": "She gifted me a journal with a floral cover.", "thai": "เธอมอบสมุดบันทึกที่มีปกเป็นลายดอกไม้ให้ฉัน"}
{"word": "journal", "english": "The journal article explained the experiment clearly.", "thai": "บทความในวารสารอธิบายการทดลองอย่างชัดเจน"}
{"word": "journal", "english": "I write in my journal to relieve stress.", "thai": "ฉันเขียนในสมุดบันทึกเพื่อคลายความเครียด"}
{"word": "journal", "english": "The journal is published monthly online.", "thai": "วารสารนี้ตีพิมพ์รายเดือนทางออนไลน์"}
{"word": "journal", "english": "My dream journal helps me remember my dreams.", "thai": "สมุดบันทึกความฝันของฉันช่วยให้ฉันจำความฝันได้"}
{"word": "journal", "english": "The journal covered the latest tech innovations.", "thai": "วารสารครอบคลุมนวัตกรรมเทคโนโลยีล่าสุด"}
{"word": "journal", "english": "I carry my journal everywhere I go.", "thai": "ฉันพกสมุดบันทึกไปทุกที่ที่ฉันไป"}
{"word": "journal", "english": "The journal was full of inspirational quotes.", "thai": "สมุดบันทึกนั้นเต็มไปด้วยคำพูดสร้างแรงบันดาลใจ"}
{"word": "journal", "english": "He submitted his work to a literary journal.", "thai": "เขาส่งผลงานของเขาไปยังวารสารวรรณกรรม"}
{"word": "journal", "english": "The journal is a great resource for scholars.", "thai": "วารสารนี้เป็นแหล่งข้อมูลที่ดีสำหรับนักวิชาการ"}
{"word": "journal", "english": "I started a bullet journal to stay organized.", "thai": "ฉันเริ่มใช้สมุดบันทึกแบบบูลเล็ตเพื่อจัดระเบียบ"}
{"word": "journal", "english": "The journal entry described her trip vividly.", "thai": "บันทึกในสมุดบันทึกอธิบายการเดินทางของเธออย่างชัดเจน"}
{"word": "journal", "english": "I subscribed to a psychology journal last week.", "thai": "ฉันสมัครรับวารสารจิตวิทยาเมื่อสัปดาห์ที่แล้ว"}
{"word": "journal", "english": "Her journal was locked with a small padlock.", "thai": "สมุดบันทึกของเธอถูกล็อกด้วยกุญแจเล็กๆ"}
{"word": "journal", "english": "The journal published controversial research.", "thai": "วารสารเผยแพร่งานวิจัยที่เป็นที่ถกเถียง"}
{"word": "journal", "english": "I use a journal to track my fitness progress.", "thai": "ฉันใช้สมุดบันทึกเพื่อติดตามความก้าวหน้าทางฟิตเนส"}
{"word": "journal", "english": "The journal was referenced in the lecture.", "thai": "วารสารนั้นถูกอ้างถึงในบทบรรยาย"}
{"word": "journal", "english": "My journal is where I express my true feelings.", "thai": "สมุดบันทึกของฉันคือที่ที่ฉันแสดงความรู้สึกที่แท้จริง"}
{"word": "journal", "english": "The journal article was hard to understand.", "thai": "บทความในวารสารนั้นเข้าใจยาก"}
{"word": "journal", "english": "I decorated my journal with stickers.", "thai": "ฉันตกแต่งสมุดบันทึกของฉันด้วยสติกเกอร์"}
{"word": "journal", "english": "The journal is available in the campus library.", "thai": "วารสารนี้มีอยู่ในห้องสมุดของมหาวิทยาลัย"}
{"word": "journal", "english": "She wrote a heartfelt journal entry today.", "thai": "เธอเขียนบันทึกในสมุดบันทึกที่เต็มไปด้วยความรู้สึกวันนี้"}
{"word": "journal", "english": "The journal focuses on renewable energy.", "thai": "วารสารนี้เน้นเรื่องพลังงานหมุนเวียน"}
{"word": "journal", "english": "I lost my journal during the trip.", "thai": "ฉันทำสมุดบันทึกหายระหว่างการเดินทาง"}
{"word": "journal", "english": "The journal published my letter to the editor.", "thai": "วารสารตีพิมพ์จดหมายของฉันถึงบรรณาธิการ"}
{"word": "journal", "english": "I write in my journal during lunch breaks.", "thai": "ฉันเขียนในสมุดบันทึกระหว่างพักเที่ยง"}
{"word": "journal", "english": "The journal is indexed in major databases.", "thai": "วารสารนี้ถูกจัดทำดัชนีในฐานข้อมูลหลัก"}
{"word": "journal", "english": "My journal is almost completely filled.", "thai": "สมุดบันทึกของฉันเกือบเต็มแล้ว"}
{"word": "journal", "english": "The journal explores cultural anthropology.", "thai": "วารสารนี้สำรวจมานุษยวิทยาวัฒนธรรม"}
{"word": "journal", "english": "I use my journal to brainstorm ideas.", "thai": "ฉันใช้สมุดบันทึกเพื่อระดมความคิด"}
{"word": "journal", "english": "The journal article inspired my project.", "thai": "บทความในวารสารเป็นแรงบันดาลใจให้กับโครงการของฉัน"}
{"word": "journal", "english": "Her journal was a mix of prose and doodles.", "thai": "สมุดบันทึกของเธอเป็นส่วนผสมของร้อยแก้วและภาพวาด"}
{"word": "journal", "english": "I cited a journal in my thesis.", "thai": "ฉันอ้างวารสารในวิทยานิพนธ์ของฉัน"}
{"word": "journal", "english": "The journal is peer-reviewed and open-access.", "thai": "วารสารนี้ได้รับการตรวจสอบโดยผู้เชี่ยวชาญและเป็นแบบเปิด"}
{"word": "journal", "english": "I started journaling to improve my mental health.", "thai": "ฉันเริ่มเขียนสมุดบันทึกเพื่อปรับปรุงสุขภาพจิต"}
{"word": "journal", "english": "The journal was founded over a century ago.", "thai": "วารสารนี้ก่อตั้งมานานกว่าศตวรรษ"}
{"word": "journal", "english": "I keep my journal in a secret drawer.", "thai": "ฉันเก็บสมุดบันทึกของฉันไว้ในลิ้นชักลับ"}
{"word": "journal", "english": "The journal article was groundbreaking.", "thai": "บทความในวารสารนั้นเป็นการปฏิวัติวงการ"}
{"word": "journal", "english": "I use a journal to document my experiments.", "thai": "ฉันใช้สมุดบันทึกเพื่อบันทึกการทดลองของฉัน"}
{"word": "journal", "english": "The journal subscription is quite expensive.", "thai": "การสมัครรับวารสารนี้ค่อนข้างแพง"}
{"word": "journal", "english": "My journal is a safe space for my thoughts.", "thai": "สมุดบันทึกของฉันเป็นพื้นที่ปลอดภัยสำหรับความคิดของฉัน"}
{"word": "journal", "english": "The journal published a special edition.", "thai": "วารสารตีพิมพ์ฉบับพิเศษ"}
{"word": "journal", "english": "I wrote a journal entry about the sunset.", "thai": "ฉันเขียนบันทึกในสมุดบันทึกเกี่ยวกับพระอาทิตย์ตก"}
{"word": "journal", "english": "The journal is popular among researchers.", "thai": "วารสารนี้ได้รับความนิยมในหมู่นักวิจัย"}
{"word": "journal", "english": "I shared my journal with my best friend.", "thai": "ฉันแบ่งปันสมุดบันทึกของฉันกับเพื่อนสนิท"}
{"word": "journal", "english": "The journal article was well-written.", "thai": "บทความในวารสารนั้นเขียนได้ดี"}
{"word": "journal", "english": "I use my journal to reflect on my day.", "thai": "ฉันใช้สมุดบันทึกเพื่อสะท้อนถึงวันของฉัน"}
{"word": "journal", "english": "The journal is part of my morning routine.", "thai": "สมุดบันทึกเป็นส่วนหนึ่งของกิจวัตรยามเช้าของฉัน"}
{"word": "journal", "english": "The journal covers global economic trends.", "thai": "วารสารนี้ครอบคลุมแนวโน้มเศรษฐกิจโลก"}
{"word": "journal", "english": "I found a journal at the thrift store.", "thai": "ฉันพบสมุดบันทึกที่ร้านขายของมือสอง"}
{"word": "journal", "english": "The journal article included detailed charts.", "thai": "บทความในวารสารมีแผนภูมิโดยละเอียด"}
{"word": "journal", "english": "I use a journal to track my reading list.", "thai": "ฉันใช้สมุดบันทึกเพื่อติดตามรายการหนังสือที่อ่าน"}
{"word": "journal", "english": "The journal is highly respected in the field.", "thai": "วารสารนี้ได้รับการยอมรับอย่างสูงในสาขานี้"}
{"word": "journal", "english": "My journal helps me process my emotions.", "thai": "สมุดบันทึกของฉันช่วยให้ฉันจัดการกับอารมณ์"}
{"word": "journal", "english": "The journal published an interview with her.", "thai": "วารสารตีพิมพ์บทสัมภาษณ์ของเธอ"}
{"word": "journal", "english": "I left my journal on the train.", "thai": "ฉันลืมสมุดบันทึกไว้บนรถไฟ"}
{"word": "journal", "english": "The journal is available online for free.", "thai": "วารสารนี้มีให้ออนไลน์ฟรี"}
{"word": "journal", "english": "I wrote in my journal about my new job.", "thai": "ฉันเขียนในสมุดบันทึกเกี่ยวกับงานใหม่ของฉัน"}
{"word": "journal", "english": "The journal article sparked a debate.", "thai": "บทความในวารสารจุดประกายการถกเถียง"}
{"word": "journal", "english": "My journal is filled with travel memories.", "thai": "สมุดบันทึกของฉันเต็มไปด้วยความทรงจำจากการเดินทาง"}
{"word": "journal", "english": "The journal is edited by a renowned scholar.", "thai": "วารสารนี้แก้ไขโดยนักวิชาการที่มีชื่อเสียง"}
{"word": "journal", "english": "I use my journal to write short stories.", "thai": "ฉันใช้สมุดบันทึกเพื่อเขียนเรื่องสั้น"}
{"word": "journal", "english": "The journal was mentioned in the news.", "thai": "วารสารนี้ถูกพูดถึงในข่าว"}
{"word": "journal", "english": "I keep a journal to practice mindfulness.", "thai": "ฉันเก็บสมุดบันทึกเพื่อฝึกสติ"}
{"word": "journal", "english": "The journal article was translated into Thai.", "thai": "บทความในวารสารนั้นถูกแปลเป็นภาษาไทย"}
{"word": "journal", "english": "My journal is a gift from my sister.", "thai": "สมุดบันทึกของฉันเป็นของขวัญจากพี่สาว"}
{"word": "journal", "english": "The journal focuses on urban planning.", "thai": "วารสารนี้เน้นการวางผังเมือง"}
{"word": "journal", "english": "I use my journal to set monthly goals.", "thai": "ฉันใช้สมุดบันทึกเพื่อตั้งเป้าหมายรายเดือน"}
{"word": "journal", "english": "The journal is a must-read for professionals.", "thai": "วารสารนี้เป็นสิ่งที่มืออาชีพต้องอ่าน"}
{"word": "journal", "english": "I wrote a journal entry about the concert.", "thai": "ฉันเขียนบันทึกในสมุดบันทึกเกี่ยวกับคอนเสิร์ต"}
{"word": "journal", "english": "The journal is known for its rigorous standards.", "thai": "วารสารนี้ขึ้นชื่อเรื่องมาตรฐานที่เข้มงวด"}
{"word": "journal", "english": "My journal is where I plan my future.", "thai": "สมุดบันทึกของฉันคือที่ที่ฉันวางแผนอนาคต"}
{"word": "journal", "english": "The journal article was widely shared online.", "thai": "บทความในวารสารนั้นถูกแชร์อย่างกว้างขวางทางออนไลน์"}
{"word": "journal", "english": "I use a journal to record my recipes.", "thai": "ฉันใช้สมุดบันทึกเพื่อบันทึกสูตรอาหารของฉัน"}
{"word": "journal", "english": "The journal published a retraction notice.", "thai": "วารสารตีพิมพ์ประกาศถอนบทความ"}
{"word": "journal", "english": "My journal is my most treasured possession.", "thai": "สมุดบันทึกของฉันเป็นสมบัติที่มีค่าที่สุดของฉัน"}
