{"word": "brother", "english": "My brother is coming over for dinner tonight.", "thai": "พี่ชายของฉันจะมาทานอาหารเย็นคืนนี้"}
{"word": "brother", "english": "I haven’t seen my brother in years.", "thai": "ฉันไม่ได้เจอพี่ชายของฉันมาหลายปีแล้ว"}
{"word": "brother", "english": "Hey, brother, can you help me with this?", "thai": "เฮ้ พี่ชาย ช่วยฉันหน่อยได้ไหม?"}
{"word": "brother", "english": "My little brother broke my favorite mug.", "thai": "น้องชายของฉันทำถ้วยโปรดของฉันแตก"}
{"word": "brother", "english": "I’m so proud of my brother’s new job.", "thai": "ฉันภูมิใจในงานใหม่ของพี่ชายของฉันมาก"}
{"word": "brother", "english": "My brother always forgets his keys.", "thai": "พี่ชายของฉันมักจะลืมกุญแจ"}
{"word": "brother", "english": "Can you call your brother to join us?", "thai": "คุณโทรหาพี่ชายของคุณให้มาร่วมกับเราได้ไหม?"}
{"word": "brother", "english": "My brother and I used to fight a lot.", "thai": "พี่ชายของฉันกับฉันเคยทะเลาะกันบ่อย"}
{"word": "brother", "english": "I bought a gift for my brother’s birthday.", "thai": "ฉันซื้อของขวัญให้วันเกิดของพี่ชาย"}
{"word": "brother", "english": "My brother is really good at basketball.", "thai": "พี่ชายของฉันเก่งบาสเก็ตบอลมาก"}
{"word": "brother", "english": "I wish my brother would call more often.", "thai": "ฉันหวังว่าพี่ชายของฉันจะโทรมาบ่อยกว่านี้"}
{"word": "brother", "english": "My brother just got a new car.", "thai": "พี่ชายของฉันเพิ่งได้รถใหม่"}
{"word": "brother", "english": "Your brother seems like a cool guy.", "thai": "พี่ชายของดูเหมือนเป็นคนเจ๋ง"}
{"word": "brother", "english": "I’m going to the game with my brother.", "thai": "ฉันจะไปดูเกมกับพี่ชายของฉัน"}
{"word": "brother", "english": "My brother helped me move last weekend.", "thai": "พี่ชายของฉันช่วยฉันย้ายบ้านเมื่อสุดสัปดาห์ที่ผ่านมา"}
{"word": "brother", "english": "I can’t believe my brother ate all the pizza.", "thai": "ฉันไม่อยากเชื่อว่าน้องชายของฉันกินพิซซ่าหมด"}
{"word": "brother", "english": "My brother is studying to be a doctor.", "thai": "พี่ชายของฉันกำลังเรียนเพื่อเป็นหมอ"}
{"word": "brother", "english": "I need to borrow money from my brother.", "thai": "ฉันต้องยืมเงินจากพี่ชายของฉัน"}
{"word": "brother", "english": "My brother always teases me about my cooking.", "thai": "พี่ชายของฉันมักจะแซวฉันเรื่องทำอาหาร"}
{"word": "brother", "english": "I’m meeting my brother at the mall later.", "thai": "ฉันจะไปเจอพี่ชายที่ห้างตอนบ่าย"}
{"word": "brother", "english": "My brother got a puppy last month.", "thai": "พี่ชายของฉันได้ลูกสุนัขมาเมื่อเดือนที่แล้ว"}
{"word": "brother", "english": "I think my brother is hiding something.", "thai": "ฉันคิดว่าพี่ชายของฉันกำลังปิดบังอะไรบางอย่าง"}
{"word": "brother", "english": "My brother and I share the same room.", "thai": "พี่ชายของฉันกับฉันใช้ห้องเดียวกัน"}
{"word": "brother", "english": "I told my brother to clean his mess.", "thai": "ฉันบอกพี่ชายของฉันให้เก็บกวาดความรกของเขา"}
{"word": "brother", "english": "My brother is always late for everything.", "thai": "พี่ชายของฉันมักจะมาสายทุกเรื่อง"}
{"word": "brother", "english": "I’m so annoyed with my brother right now.", "thai": "ฉันกำลังโมโหพี่ชายของฉันมากตอนนี้"}
{"word": "brother", "english": "My brother loves playing video games.", "thai": "พี่ชายของฉันชอบเล่นวิดีโอเกม"}
{"word": "brother", "english": "I can always count on my brother.", "thai": "ฉันพึ่งพี่ชายของฉันได้เสมอ"}
{"word": "brother", "english": "My brother is moving to another state.", "thai": "พี่ชายของฉันกำลังจะย้ายไปอยู่อีกรัฐ"}
{"word": "brother", "english": "I saw your brother at the gym yesterday.", "thai": "ฉันเห็นพี่ชายของที่ยิมเมื่อวาน"}
{"word": "brother", "english": "My brother taught me how to ride a bike.", "thai": "พี่ชายของฉันสอนฉันขี่จักรยาน"}
{"word": "brother", "english": "I’m throwing a party for my brother.", "thai": "ฉันกำลังจัดงานเลี้ยงให้พี่ชายของฉัน"}
{"word": "brother", "english": "My brother is terrible at keeping secrets.", "thai": "พี่ชายของฉันแย่มากเรื่องเก็บความลับ"}
{"word": "brother", "english": "I need to talk to my brother about something.", "thai": "ฉันต้องคุยกับพี่ชายของฉันเรื่องอะไรบางอย่าง"}
{"word": "brother", "english": "My brother always borrows my clothes.", "thai": "พี่ชายของฉันมักจะยืมเสื้อผ้าของฉัน"}
{"word": "brother", "english": "I’m worried about my brother’s health.", "thai": "ฉันกังวลเรื่องสุขภาพของพี่ชาย"}
{"word": "brother", "english": "My brother is the best at fixing things.", "thai": "พี่ชายของฉันเก่งที่สุดเรื่องซ่อมของ"}
{"word": "brother", "english": "I got a call from my brother last night.", "thai": "ฉันได้รับโทรศัพท์จากพี่ชายเมื่อคืน"}
{"word": "brother", "english": "My brother is obsessed with cars.", "thai": "พี่ชายของฉันหมกมุ่นกับรถยนต์"}
{"word": "brother", "english": "I’m taking my brother to the airport tomorrow.", "thai": "ฉันจะพาพี่ชายไปสนามบินพรุ่งนี้"}
{"word": "brother", "english": "My brother never listens to me.", "thai": "พี่ชายของฉันไม่เคยฟังฉัน"}
{"word": "brother", "english": "I’m so grateful for my brother’s support.", "thai": "ฉันรู้สึกขอบคุณสำหรับการสนับสนุนของพี่ชาย"}
{"word": "brother", "english": "My brother just graduated from college.", "thai": "พี่ชายของฉันเพิ่งจบจากมหาวิทยาลัย"}
{"word": "brother", "english": "I can’t stand my brother’s loud music.", "thai": "ฉันทนเพลงดังของพี่ชายไม่ได้"}
{"word": "brother", "english": "My brother is planning a big trip.", "thai": "พี่ชายของฉันกำลังวางแผนการเดินทางครั้งใหญ่"}
{"word": "brother", "english": "I’m helping my brother with his homework.", "thai": "ฉันกำลังช่วยพี่ชายทำการบ้าน"}
{"word": "brother", "english": "My brother always makes me laugh.", "thai": "พี่ชายของฉันทำให้ฉันหัวเราะได้เสมอ"}
{"word": "brother", "english": "I’m going hiking with my brother this weekend.", "thai": "ฉันจะไปเดินป่ากับพี่ชายสุดสัปดาห์นี้"}
{"word": "brother", "english": "My brother forgot our mom’s birthday.", "thai": "พี่ชายของฉันลืมวันเกิดของแม่"}
{"word": "brother", "english": "I’m teaching my brother how to cook.", "thai": "ฉันกำลังสอนพี่ชายทำอาหาร"}
{"word": "brother", "english": "My brother is really into photography.", "thai": "พี่ชายของฉันชอบถ่ายภาพมาก"}
{"word": "brother", "english": "I need my brother to fix my computer.", "thai": "ฉันต้องการให้พี่ชายซ่อมคอมพิวเตอร์ให้"}
{"word": "brother", "english": "My brother is always on his phone.", "thai": "พี่ชายของฉันติดโทรศัพท์ตลอด"}
{"word": "brother", "english": "I’m picking up my brother from school.", "thai": "ฉันกำลังไปรับพี่ชายจากโรงเรียน"}
{"word": "brother", "english": "My brother got a new tattoo.", "thai": "พี่ชายของฉันได้รอยสักใหม่"}
{"word": "brother", "english": "I’m so tired of my brother’s excuses.", "thai": "ฉันเหนื่อยกับข้อแก้ตัวของพี่ชายมาก"}
{"word": "brother", "english": "My brother is training for a marathon.", "thai": "พี่ชายของฉันกำลังฝึกซ้อมเพื่อวิ่งมาราธอน"}
{"word": "brother", "english": "I love hanging out with my brother.", "thai": "ฉันชอบใช้เวลากับพี่ชายของฉัน"}
{"word": "brother", "english": "My brother is allergic to cats.", "thai": "พี่ชายของฉันแพ้แมว"}
{"word": "brother", "english": "I’m borrowing my brother’s jacket.", "thai": "ฉันกำลังยืมแจ็คเก็ตของพี่ชาย"}
{"word": "brother", "english": "My brother is starting a new business.", "thai": "พี่ชายของฉันกำลังเริ่มธุรกิจใหม่"}
{"word": "brother", "english": "I need to apologize to my brother.", "thai": "ฉันต้องขอโทษพี่ชายของฉัน"}
{"word": "brother", "english": "My brother is great at telling stories.", "thai": "พี่ชายของฉันเก่งเรื่องเล่าเรื่อง"}
{"word": "brother", "english": "I’m visiting my brother next month.", "thai": "ฉันจะไปเยี่ยมพี่ชายเดือนหน้า"}
{"word": "brother", "english": "My brother always wins at chess.", "thai": "พี่ชายของฉันชนะหมากรุกทุกครั้ง"}
{"word": "brother", "english": "I’m mad at my brother for lying.", "thai": "ฉันโกรธพี่ชายที่โกหก"}
{"word": "brother", "english": "My brother is learning to play the guitar.", "thai": "พี่ชายของฉันกำลังเรียนเล่นกีตาร์"}
{"word": "brother", "english": "I’m going to surprise my brother.", "thai": "ฉันจะเซอร์ไพรส์พี่ชายของฉัน"}
{"word": "brother", "english": "My brother is terrible at directions.", "thai": "พี่ชายของฉันแย่มากเรื่องการบอกทาง"}
{"word": "brother", "english": "I’m helping my brother paint his house.", "thai": "ฉันกำลังช่วยพี่ชายทาสีบ้าน"}
{"word": "brother", "english": "My brother always cheers me up.", "thai": "พี่ชายของฉันทำให้ฉันรู้สึกดีขึ้นเสมอ"}
{"word": "brother", "english": "I’m arguing with my brother again.", "thai": "ฉันกำลังทะเลาะกับพี่ชายอีกครั้ง"}
{"word": "brother", "english": "My brother just got engaged.", "thai": "พี่ชายของฉันเพิ่งหมั้น"}
{"word": "brother", "english": "I’m driving my brother to the doctor.", "thai": "ฉันกำลังขับรถพาพี่ชายไปหาหมอ"}
{"word": "brother", "english": "My brother loves spicy food.", "thai": "พี่ชายของฉันชอบอาหารรสเผ็ด"}
{"word": "brother", "english": "I’m so jealous of my brother’s new phone.", "thai": "ฉันอิจฉาโทรศัพท์ใหม่ของพี่ชายมาก"}
{"word": "brother", "english": "My brother is always losing his wallet.", "thai": "พี่ชายของฉันมักจะทำกระเป๋าเงินหาย"}
{"word": "brother", "english": "I’m planning a trip with my brother.", "thai": "ฉันกำลังวางแผนการเดินทางกับพี่ชาย"}
{"word": "brother", "english": "My brother is really good at math.", "thai": "พี่ชายของฉันเก่งคณิตศาสตร์มาก"}
{"word": "brother", "english": "I need my brother’s advice on this.", "thai": "ฉันต้องการคำแนะนำจากพี่ชายเรื่องนี้"}
{"word": "brother", "english": "My brother is moving back home.", "thai": "พี่ชายของฉันกำลังย้ายกลับบ้าน"}
{"word": "brother", "english": "I’m cooking dinner for my brother tonight.", "thai": "ฉันกำลังทำอาหารเย็นให้พี่ชายคืนนี้"}
{"word": "brother", "english": "My brother always forgets to text back.", "thai": "พี่ชายของฉันมักจะลืมตอบข้อความ"}
{"word": "brother", "english": "I’m so excited for my brother’s wedding.", "thai": "ฉันตื่นเต้นมากกับงานแต่งงานของพี่ชาย"}
{"word": "brother", "english": "My brother is working on a new project.", "thai": "พี่ชายของฉันกำลังทำงานในโปรเจกต์ใหม่"}
{"word": "brother", "english": "I’m going to the movies with my brother.", "thai": "ฉันจะไปดูหนังกับพี่ชาย"}
{"word": "brother", "english": "My brother is always so competitive.", "thai": "พี่ชายของฉันมักจะแข่งขันอยู่เสมอ"}
{"word": "brother", "english": "I need to call my brother back.", "thai": "ฉันต้องโทรกลับหาพี่ชาย"}
{"word": "brother", "english": "My brother is really good at drawing.", "thai": "พี่ชายของฉันวาดรูปเก่งมาก"}
{"word": "brother", "english": "I’m so proud of my brother’s achievements.", "thai": "ฉันภูมิใจในความสำเร็จของพี่ชายมาก"}
{"word": "brother", "english": "My brother is always borrowing my car.", "thai": "พี่ชายของฉันมักจะยืมรถของฉัน"}
{"word": "brother", "english": "I’m helping my brother plan his party.", "thai": "ฉันกำลังช่วยพี่ชายวางแผนงานเลี้ยง"}
{"word": "brother", "english": "My brother is terrible at singing.", "thai": "พี่ชายของฉันร้องเพลงแย่มาก"}
{"word": "brother", "english": "I’m going shopping with my brother.", "thai": "ฉันจะไปช้อปปิ้งกับพี่ชาย"}
{"word": "brother", "english": "My brother always makes the best coffee.", "thai": "พี่ชายของฉันชงกาแฟได้ดีที่สุด"}
{"word": "brother", "english": "I’m so glad my brother is back in town.", "thai": "ฉันดีใจมากที่พี่ชายของฉันกลับมาที่เมือง"}
{"word": "brother", "english": "My brother is always up for an adventure.", "thai": "พี่ชายของฉันพร้อมสำหรับการผจญภัยเสมอ"}
{"word": "brother", "english": "I need to check on my brother later.", "thai": "ฉันต้องไปดูพี่ชายของฉันทีหลัง"}
{"word": "brother", "english": "My brother is the funniest person I know.", "thai": "พี่ชายของฉันเป็นคนที่ตลกที่สุดที่ฉันรู้จัก"}
{"word": "brother", "english": "I’m giving my brother a ride home.", "thai": "ฉันกำลังจะไปส่งพี่ชายกลับบ้าน"}
{"word": "sister", "english": "My sister is coming to visit tomorrow.", "thai": "พี่สาวของฉันจะมาเยี่ยมพรุ่งนี้"}
{"word": "sister", "english": "I have an older sister who lives in Chicago.", "thai": "ฉันมีพี่สาวที่อาศัยอยู่ในชิคาโก"}
{"word": "sister", "english": "Can you call your sister for dinner?", "thai": "คุณช่วยเรียกน้องสาวมาทานข้าวเย็นได้ไหม"}
{"word": "sister", "english": "Her sister is really good at playing the piano.", "thai": "น้องสาวของเธอเก่งมากในการเล่นเปียโน"}
{"word": "sister", "english": "I borrowed my sister's car for the weekend.", "thai": "ฉันยืมรถของพี่สาวมาใช้สุดสัปดาห์นี้"}
{"word": "sister", "english": "My sister and I used to fight all the time.", "thai": "ฉันกับพี่สาวเคยทะเลาะกันตลอดเวลา"}
{"word": "sister", "english": "Is your sister still working at the hospital?", "thai": "น้องสาวของคุณยังทำงานที่โรงพยาบาลอยู่ไหม"}
{"word": "sister", "english": "I need to buy a gift for my sister's birthday.", "thai": "ฉันต้องซื้อของขวัญให้พี่สาวสำหรับวันเกิดของเธอ"}
{"word": "sister", "english": "My sister just got a new job!", "thai": "พี่สาวของฉันเพิ่งได้งานใหม่!"}
{"word": "sister", "english": "Her sister looks just like her.", "thai": "น้องสาวของเธอหน้าตาเหมือนเธอมาก"}
{"word": "sister", "english": "I’m meeting my sister for lunch today.", "thai": "ฉันจะไปเจอพี่สาวเพื่อทานข้าวเที่ยงวันนี้"}
{"word": "sister", "english": "My sister always knows how to make me laugh.", "thai": "พี่สาวของฉันรู้วิธีทำให้ฉันหัวเราะเสมอ"}
{"word": "sister", "english": "Do you and your sister get along well?", "thai": "คุณกับน้องสาวเข้ากันได้ดีไหม"}
{"word": "sister", "english": "My sister is studying abroad this year.", "thai": "พี่สาวของฉันกำลังเรียนอยู่ต่างประเทศปีนี้"}
{"word": "sister", "english": "I can’t believe my sister ate all the cookies!", "thai": "ฉันไม่อยากเชื่อว่าน้องสาวของฉันกินคุกกี้หมดเลย!"}
{"word": "sister", "english": "Her sister is a talented artist.", "thai": "น้องสาวของเธอเป็นศิลปินที่มีความสามารถ"}
{"word": "sister", "english": "I’m so proud of my sister for graduating.", "thai": "ฉันภูมิใจในพี่สาวของฉันมากที่จบการศึกษา"}
{"word": "sister", "english": "My sister helped me with my homework last night.", "thai": "เมื่อคืนพี่สาวของฉันช่วยฉันทำการบ้าน"}
{"word": "sister", "english": "Your sister seems really nice.", "thai": "น้องสาวของคุณดูเป็นคนดีมาก"}
{"word": "sister", "english": "I haven’t seen my sister in months.", "thai": "ฉันไม่ได้เจอพี่สาวของฉันมาหลายเดือนแล้ว"}
{"word": "sister", "english": "My sister is obsessed with that new TV show.", "thai": "พี่สาวของฉันหมกมุ่นกับรายการทีวีใหม่นั้น"}
{"word": "sister", "english": "I’m going shopping with my sister later.", "thai": "ฉันจะไปช็อปปิ้งกับน้องสาวทีหลัง"}
{"word": "sister", "english": "Her sister is getting married next month.", "thai": "น้องสาวของเธอจะแต่งงานเดือนหน้า"}
{"word": "sister", "english": "My sister always gives the best advice.", "thai": "พี่สาวของฉันให้คำแนะนำที่ดีที่สุดเสมอ"}
{"word": "sister", "english": "I wish my sister lived closer to me.", "thai": "ฉันหวังว่าน้องสาวของฉันจะอยู่ใกล้ฉันมากกว่านี้"}
{"word": "sister", "english": "My sister and I share a room.", "thai": "ฉันกับพี่สาวใช้ห้องนอนร่วมกัน"}
{"word": "sister", "english": "Is your sister coming to the party?", "thai": "น้องสาวของคุณจะมาที่งานปาร์ตี้ไหม"}
{"word": "sister", "english": "My sister is the best cook in the family.", "thai": "พี่สาวของฉันเป็นพ่อครัวที่ดีที่สุดในครอบครัว"}
{"word": "sister", "english": "I’m helping my sister move to her new apartment.", "thai": "ฉันกำลังช่วยน้องสาวย้ายไปที่อพาร์ตเมนต์ใหม่"}
{"word": "sister", "english": "Her sister just adopted a puppy.", "thai": "น้องสาวของเธอเพิ่งรับเลี้ยงลูกสุนัข"}
{"word": "sister", "english": "My sister is learning how to surf.", "thai": "พี่สาวของฉันกำลังเรียนเล่นกระดานโต้คลื่น"}
{"word": "sister", "english": "I told my sister about my new project.", "thai": "ฉันบอกน้องสาวเกี่ยวกับโปรเจกต์ใหม่ของฉัน"}
{"word": "sister", "english": "My sister forgot her lines in the play.", "thai": "พี่สาวของฉันลืมบทในละคร"}
{"word": "sister", "english": "Her sister is a doctor in Seattle.", "thai": "น้องสาวของเธอเป็นหมอในซีแอตเทิล"}
{"word": "sister", "english": "I’m taking my sister to the airport tomorrow.", "thai": "ฉันจะพาพี่สาวไปสนามบินพรุ่งนี้"}
{"word": "sister", "english": "My sister loves hiking in the mountains.", "thai": "น้องสาวของฉันชอบเดินป่าในภูเขา"}
{"word": "sister", "english": "I got a text from my sister this morning.", "thai": "ฉันได้รับข้อความจากพี่สาวเมื่อเช้านี้"}
{"word": "sister", "english": "Her sister is throwing a big party tonight.", "thai": "น้องสาวของเธอกำลังจัดงานปาร์ตี้ใหญ่คืนนี้"}
{"word": "sister", "english": "My sister and I are planning a trip together.", "thai": "ฉันกับพี่สาวกำลังวางแผนทริปด้วยกัน"}
{"word": "sister", "english": "I can’t find my sister’s phone number.", "thai": "ฉันหาเบอร์โทรของน้องสาวไม่เจอ"}
{"word": "sister", "english": "My sister is really into yoga these days.", "thai": "พี่สาวของฉันกำลังหลงใหลโยคะในช่วงนี้"}
{"word": "sister", "english": "Her sister won a scholarship to college.", "thai": "น้องสาวของเธอได้ทุนการศึกษาไปมหาวิทยาลัย"}
{"word": "sister", "english": "I’m so annoyed with my sister right now.", "thai": "ฉันกำลังโมโหพี่สาวของฉันมากตอนนี้"}
{"word": "sister", "english": "My sister made me a birthday cake.", "thai": "น้องสาวของฉันทำเค้กวันเกิดให้ฉัน"}
{"word": "sister", "english": "I’m going to visit my sister in California.", "thai": "ฉันจะไปเยี่ยมพี่สาวที่แคลิฟอร์เนีย"}
{"word": "sister", "english": "Her sister is always borrowing her clothes.", "thai": "น้องสาวของเธอมักจะยืมเสื้อผ้าของเธอ"}
{"word": "sister", "english": "My sister just started a new business.", "thai": "พี่สาวของฉันเพิ่งเริ่มธุรกิจใหม่"}
{"word": "sister", "english": "I need to talk to my sister about something important.", "thai": "ฉันต้องคุยกับน้องสาวเกี่ยวกับเรื่องสำคัญ"}
{"word": "sister", "english": "My sister is allergic to cats.", "thai": "พี่สาวของฉันแพ้แมว"}
{"word": "sister", "english": "Her sister is training for a marathon.", "thai": "น้องสาวของเธอกำลังฝึกซ้อมเพื่อวิ่งมาราธอน"}
{"word": "sister", "english": "I’m picking up my sister from school today.", "thai": "ฉันจะไปรับพี่สาวที่โรงเรียนวันนี้"}
{"word": "sister", "english": "My sister loves reading mystery novels.", "thai": "น้องสาวของฉันชอบอ่านนิยายลึกลับ"}
{"word": "sister", "english": "I’m so glad my sister is back in town.", "thai": "ฉันดีใจมากที่พี่สาวของฉันกลับมาที่เมือง"}
{"word": "sister", "english": "Her sister is a professional dancer.", "thai": "น้องสาวของเธอเป็นนักเต้นมืออาชีพ"}
{"word": "sister", "english": "My sister helped organize the family reunion.", "thai": "พี่สาวของฉันช่วยจัดงานรวมญาติ"}
{"word": "sister", "english": "I’m watching a movie with my sister tonight.", "thai": "ฉันจะดูหนังกับน้องสาวคืนนี้"}
{"word": "sister", "english": "My sister is always late for everything.", "thai": "พี่สาวของฉันมักจะมาสายทุกอย่าง"}
{"word": "sister", "english": "Her sister wrote a book about her travels.", "thai": "น้องสาวของเธอเขียนหนังสือเกี่ยวกับการเดินทางของเธอ"}
{"word": "sister", "english": "I’m helping my sister with her math homework.", "thai": "ฉันกำลังช่วยพี่สาวทำการบ้านคณิตศาสตร์"}
{"word": "sister", "english": "My sister got a new haircut yesterday.", "thai": "น้องสาวของฉันตัดผมใหม่เมื่อวาน"}
{"word": "sister", "english": "Her sister is studying to be a lawyer.", "thai": "น้องสาวของเธอกำลังเรียนเพื่อเป็นทนาย"}
{"word": "sister", "english": "I’m so excited to see my sister this weekend.", "thai": "ฉันตื่นเต้นมากที่จะได้เจอพี่สาวสุดสัปดาห์นี้"}
{"word": "sister", "english": "My sister always forgets where she parked her car.", "thai": "น้องสาวของฉันมักจะลืมว่าเธอจอดรถไว้ที่ไหน"}
{"word": "sister", "english": "Her sister is really good at baking.", "thai": "พี่สาวของเธอเก่งมากในการอบขนม"}
{"word": "sister", "english": "I’m going to call my sister tonight.", "thai": "ฉันจะโทรหาน้องสาวคืนนี้"}
{"word": "sister", "english": "My sister is taking me to a concert.", "thai": "พี่สาวของฉันจะพาฉันไปคอนเสิร์ต"}
{"word": "sister", "english": "Her sister is moving to New York next week.", "thai": "น้องสาวของเธอจะย้ายไปนิวยอร์กสัปดาห์หน้า"}
{"word": "sister", "english": "I’m teaching my sister how to cook.", "thai": "ฉันกำลังสอนพี่สาวทำอาหาร"}
{"word": "sister", "english": "My sister just bought a new house.", "thai": "น้องสาวของฉันเพิ่งซื้อบ้านใหม่"}
{"word": "sister", "english": "Her sister is always so cheerful.", "thai": "พี่สาวของเธอร่าเริงเสมอ"}
{"word": "sister", "english": "I’m borrowing my sister’s jacket for the trip.", "thai": "ฉันจะยืมแจ็คเก็ตของน้องสาวสำหรับทริปนี้"}
{"word": "sister", "english": "My sister is really good at solving puzzles.", "thai": "พี่สาวของฉันเก่งมากในการแก้ปริศนา"}
{"word": "sister", "english": "Her sister is coming over for dinner.", "thai": "น้องสาวของเธอจะมาทานข้าวเย็น"}
{"word": "sister", "english": "I’m so grateful for my sister’s support.", "thai": "ฉันรู้สึกขอบคุณมากสำหรับการสนับสนุนของพี่สาว"}
{"word": "sister", "english": "My sister is always there when I need her.", "thai": "น้องสาวของฉันอยู่เคียงข้างฉันเสมอเมื่อฉันต้องการ"}
{"word": "sister", "english": "Her sister is a teacher at the local school.", "thai": "พี่สาวของเธอเป็นครูที่โรงเรียนท้องถิ่น"}
{"word": "sister", "english": "I’m planning a surprise for my sister.", "thai": "ฉันกำลังวางแผนเซอร์ไพรส์ให้กับน้องสาว"}
{"word": "sister", "english": "My sister loves going to the beach.", "thai": "พี่สาวของฉันชอบไปชายหาด"}
{"word": "sister", "english": "Her sister is really into photography.", "thai": "น้องสาวของเธอชอบถ่ายรูปมาก"}
{"word": "sister", "english": "I’m meeting my sister at the mall later.", "thai": "ฉันจะเจอน้องสาวที่ห้างทีหลัง"}
{"word": "sister", "english": "My sister helped me pick out a new phone.", "thai": "พี่สาวของฉันช่วยฉันเลือกโทรศัพท์ใหม่"}
{"word": "sister", "english": "Her sister is always so organized.", "thai": "น้องสาวของเธอเป็นคนที่เป็นระเบียบมาก"}
{"word": "sister", "english": "I’m so happy for my sister’s new promotion.", "thai": "ฉันดีใจมากกับการเลื่อนตำแหน่งใหม่ของพี่สาว"}
{"word": "sister", "english": "My sister is coming to the game with me.", "thai": "น้องสาวของฉันจะไปดูเกมกับฉัน"}
{"word": "sister", "english": "Her sister is learning to speak French.", "thai": "พี่สาวของเธอกำลังเรียนภาษาฝรั่งเศส"}
{"word": "sister", "english": "I’m giving my sister a ride to work.", "thai": "ฉันจะไปส่งน้องสาวไปทำงาน"}
{"word": "sister", "english": "My sister is great at telling stories.", "thai": "พี่สาวของฉันเก่งมากในการเล่าเรื่อง"}
{"word": "sister", "english": "Her sister is volunteering at the shelter.", "thai": "น้องสาวของเธอกำลังเป็นอาสาสมัครที่ศูนย์พักพิง"}
{"word": "sister", "english": "I’m going to my sister’s house for the holidays.", "thai": "ฉันจะไปบ้านพี่สาวในช่วงวันหยุด"}
{"word": "sister", "english": "My sister is always borrowing my charger.", "thai": "น้องสาวของฉันมักจะยืมที่ชาร์จของฉัน"}
{"word": "sister", "english": "Her sister is a fantastic singer.", "thai": "พี่สาวของเธอเป็นนักร้องที่ยอดเยี่ยม"}
{"word": "sister", "english": "I’m helping my sister plan her wedding.", "thai": "ฉันกำลังช่วยน้องสาววางแผนงานแต่งงาน"}
{"word": "sister", "english": "My sister is really excited about her new job.", "thai": "พี่สาวของฉันตื่นเต้นมากกับงานใหม่ของเธอ"}
{"word": "sister", "english": "Her sister is always up for an adventure.", "thai": "น้องสาวของเธอพร้อมสำหรับการผจญภัยเสมอ"}
{"word": "sister", "english": "I’m so lucky to have my sister in my life.", "thai": "ฉันโชคดีมากที่มีพี่สาวอยู่ในชีวิต"}
{"word": "sister", "english": "My sister is teaching me how to knit.", "thai": "น้องสาวของฉันกำลังสอนฉันถักนิตติ้ง"}
{"word": "sister", "english": "Her sister is starting a new blog.", "thai": "พี่สาวของเธอกำลังเริ่มเขียนบล็อกใหม่"}
{"word": "sister", "english": "I’m going hiking with my sister this weekend.", "thai": "ฉันจะไปเดินป่ากับน้องสาวสุดสัปดาห์นี้"}
{"word": "sister", "english": "My sister always knows what to say.", "thai": "พี่สาวของฉันรู้เสมอว่าต้องพูดอะไร"}
{"word": "baby", "english": "I love you, baby.", "thai": "ฉันรักคุณ ที่รัก"}
{"word": "baby", "english": "Come here, baby.", "thai": "มาที่นี่สิ ที่รัก"}
{"word": "baby", "english": "The baby is sleeping.", "thai": "ทารกกำลังนอนหลับ"}
{"word": "baby", "english": "You're my baby forever.", "thai": "คุณเป็นที่รักของฉันตลอดไป"}
{"word": "baby", "english": "Don't cry, baby.", "thai": "อย่าร้องไห้ ที่รัก"}
{"word": "baby", "english": "The baby needs a diaper change.", "thai": "ทารกต้องเปลี่ยนผ้าอ้อม"}
{"word": "baby", "english": "Look at that cute baby!", "thai": "ดูทารกที่น่ารักคนนั้นสิ!"}
{"word": "baby", "english": "Baby, you're so beautiful.", "thai": "ที่รัก คุณสวยมาก"}
{"word": "baby", "english": "The baby just smiled at me.", "thai": "ทารกเพิ่งยิ้มให้ฉัน"}
{"word": "baby", "english": "I bought a gift for the baby.", "thai": "ฉันซื้อของขวัญให้ทารก"}
{"word": "baby", "english": "Baby, let's go out tonight.", "thai": "ที่รัก ไปเที่ยวกันคืนนี้ไหม"}
{"word": "baby", "english": "The baby is so tiny!", "thai": "ทารกตัวเล็กมาก!"}
{"word": "baby", "english": "I miss you, baby.", "thai": "ฉันคิดถึงคุณ ที่รัก"}
{"word": "baby", "english": "The baby was born yesterday.", "thai": "ทารกเกิดเมื่อวานนี้"}
{"word": "baby", "english": "Baby, you make me happy.", "thai": "ที่รัก คุณทำให้ฉันมีความสุข"}
{"word": "baby", "english": "The baby’s bottle is empty.", "thai": "ขวดนมของทารกว่างเปล่า"}
{"word": "baby", "english": "You're my sweet baby.", "thai": "คุณเป็นที่รักที่น่ารักของฉัน"}
{"word": "baby", "english": "The baby is crawling now.", "thai": "ทารกกำลังคลานแล้ว"}
{"word": "baby", "english": "Baby, don't be mad.", "thai": "ที่รัก อย่าโกรธนะ"}
{"word": "baby", "english": "The baby loves music.", "thai": "ทารกรักดนตรี"}
{"word": "baby", "english": "I’m here for you, baby.", "thai": "ฉันอยู่ที่นี่เพื่อคุณ ที่รัก"}
{"word": "baby", "english": "The baby needs to eat.", "thai": "ทารกต้องกินอาหาร"}
{"word": "baby", "english": "Baby, you’re the best.", "thai": "ที่รัก คุณดีที่สุด"}
{"word": "baby", "english": "The baby has blue eyes.", "thai": "ทารกมีตาสีฟ้า"}
{"word": "baby", "english": "I’ll always love you, baby.", "thai": "ฉันจะรักคุณเสมอ ที่รัก"}
{"word": "baby", "english": "The baby is giggling.", "thai": "ทารกกำลังหัวเราะคิกคัก"}
{"word": "baby", "english": "Baby, let’s take a walk.", "thai": "ที่รัก ไปเดินเล่นกันเถอะ"}
{"word": "baby", "english": "The baby’s shoes are so small.", "thai": "รองเท้าของทารกเล็กมาก"}
{"word": "baby", "english": "You’re my baby girl.", "thai": "คุณเป็นสาวน้อยของฉัน"}
{"word": "baby", "english": "The baby is teething.", "thai": "ทารกกำลังขึ้นฟัน"}
{"word": "baby", "english": "Baby, you’re my world.", "thai": "ที่รัก คุณคือโลกของฉัน"}
{"word": "baby", "english": "The baby loves her teddy bear.", "thai": "ทารกรักตุ๊กตาหมีของเธอ"}
{"word": "baby", "english": "I got you, baby.", "thai": "ฉันเข้าใจคุณแล้ว ที่รัก"}
{"word": "baby", "english": "The baby’s crib is new.", "thai": "เปลของทารกเป็นของใหม่"}
{"word": "baby", "english": "Baby, you’re so funny.", "thai": "ที่รัก คุณตลกมาก"}
{"word": "baby", "english": "The baby is learning to walk.", "thai": "ทารกกำลังหัดเดิน"}
{"word": "baby", "english": "I need you, baby.", "thai": "ฉันต้องการคุณ ที่รัก"}
{"word": "baby", "english": "The baby’s blanket is soft.", "thai": "ผ้าห่มของทารกนุ่มมาก"}
{"word": "baby", "english": "Baby, let’s dance together.", "thai": "ที่รัก มาเต้นด้วยกันเถอะ"}
{"word": "baby", "english": "The baby is playing with toys.", "thai": "ทารกกำลังเล่นของเล่น"}
{"word": "baby", "english": "You’re my baby boy.", "thai": "คุณเป็นหนุ่มน้อยของฉัน"}
{"word": "baby", "english": "The baby just said ‘mama’!", "thai": "ทารกเพิ่งพูดว่า ‘มาม๊า’!"}
{"word": "baby", "english": "Baby, you’re so strong.", "thai": "ที่รัก คุณแข็งแรงมาก"}
{"word": "baby", "english": "The baby is six months old.", "thai": "ทารกอายุหกเดือน"}
{"word": "baby", "english": "I’ll protect you, baby.", "thai": "ฉันจะปกป้องคุณ ที่รัก"}
{"word": "baby", "english": "The baby loves bath time.", "thai": "ทารกรักเวลาอาบน้ำ"}
{"word": "baby", "english": "Baby, you’re my sunshine.", "thai": "ที่รัก คุณคือแสงแดดของฉัน"}
{"word": "baby", "english": "The baby’s laugh is adorable.", "thai": "เสียงหัวเราะของทารกน่ารักมาก"}
{"word": "baby", "english": "I’m proud of you, baby.", "thai": "ฉันภูมิใจในตัวคุณ ที่รัก"}
{"word": "baby", "english": "The baby is growing fast.", "thai": "ทารกโตเร็วมาก"}
{"word": "baby", "english": "Baby, let’s watch a movie.", "thai": "ที่รัก มาดูหนังกันเถอะ"}
{"word": "baby", "english": "The baby’s hair is so soft.", "thai": "ผมของทารกนุ่มมาก"}
{"word": "baby", "english": "You’re my everything, baby.", "thai": "คุณคือทุกสิ่งของฉัน ที่รัก"}
{"word": "baby", "english": "The baby loves storytime.", "thai": "ทารกรักเวลานิทาน"}
{"word": "baby", "english": "Baby, you’re so smart.", "thai": "ที่รัก คุณฉลาดมาก"}
{"word": "baby", "english": "The baby is waving at us.", "thai": "ทารกกำลังโบกมือให้เรา"}
{"word": "baby", "english": "I’ll always be here, baby.", "thai": "ฉันจะอยู่ที่นี่เสมอ ที่รัก"}
{"word": "baby", "english": "The baby’s eyes are sparkling.", "thai": "ดวงตาของทารกเป็นประกาย"}
{"word": "baby", "english": "Baby, you make me smile.", "thai": "ที่รัก คุณทำให้ฉันยิ้ม"}
{"word": "baby", "english": "The baby is so curious.", "thai": "ทารกอยากรู้อยากเห็นมาก"}
{"word": "baby", "english": "You’re my one and only, baby.", "thai": "คุณคือหนึ่งเดียวของฉัน ที่รัก"}
{"word": "baby", "english": "The baby loves to cuddle.", "thai": "ทารกรักการกอด"}
{"word": "baby", "english": "Baby, let’s have some fun.", "thai": "ที่รัก มาสนุกกันเถอะ"}
{"word": "baby", "english": "The baby is reaching for the toy.", "thai": "ทารกกำลังเอื้อมไปหยิบของเล่น"}
{"word": "baby", "english": "I adore you, baby.", "thai": "ฉันหลงรักคุณ ที่รัก"}
{"word": "baby", "english": "The baby’s smile is contagious.", "thai": "รอยยิ้มของทารกติดต่อได้"}
{"word": "baby", "english": "Baby, you’re my heart.", "thai": "ที่รัก คุณคือหัวใจของฉัน"}
{"word": "baby", "english": "The baby is clapping her hands.", "thai": "ทารกกำลังตบมือ"}
{"word": "baby", "english": "You’re so precious, baby.", "thai": "คุณมีค่ามาก ที่รัก"}
{"word": "baby", "english": "The baby loves her bottle.", "thai": "ทารกรักขวดนมของเธอ"}
{"word": "baby", "english": "Baby, let’s go to the park.", "thai": "ที่รัก ไปสวนสาธารณะกันเถอะ"}
{"word": "baby", "english": "The baby is starting to talk.", "thai": "ทารกเริ่มพูดแล้ว"}
{"word": "baby", "english": "I can’t live without you, baby.", "thai": "ฉันอยู่ไม่ได้ถ้าไม่มีคุณ ที่รัก"}
{"word": "baby", "english": "The baby’s clothes are adorable.", "thai": "เสื้อผ้าของทารกน่ารักมาก"}
{"word": "baby", "english": "Baby, you’re my dream come true.", "thai": "ที่รัก คุณคือความฝันที่เป็นจริง"}
{"word": "baby", "english": "The baby is splashing in the tub.", "thai": "ทารกกำลังเล่นน้ำในอ่าง"}
{"word": "baby", "english": "You’re my angel, baby.", "thai": "คุณคือเทวทูตของฉัน ที่รัก"}
{"word": "baby", "english": "The baby loves her rattle.", "thai": "ทารกรักของเล่นเขย่าของเธอ"}
{"word": "baby", "english": "Baby, you’re so kind.", "thai": "ที่รัก คุณใจดีมาก"}
{"word": "baby", "english": "The baby is napping now.", "thai": "ทารกกำลังงีบหลับ"}
{"word": "baby", "english": "I’ll take care of you, baby.", "thai": "ฉันจะดูแลคุณ ที่รัก"}
{"word": "baby", "english": "The baby’s cheeks are so chubby.", "thai": "แก้มของทารกอวบมาก"}
{"word": "baby", "english": "Baby, you’re my treasure.", "thai": "ที่รัก คุณคือสมบัติของฉัน"}
{"word": "baby", "english": "The baby is holding my finger.", "thai": "ทารกกำลังจับนิ้วของฉัน"}
{"word": "baby", "english": "You’re my love, baby.", "thai": "คุณคือความรักของฉัน ที่รัก"}
{"word": "baby", "english": "The baby loves her swing.", "thai": "ทารกรักชิงช้าของเธอ"}
{"word": "baby", "english": "Baby, you’re so talented.", "thai": "ที่รัก คุณมีพรสวรรค์มาก"}
{"word": "baby", "english": "The baby is looking at the stars.", "thai": "ทารกกำลังมองดวงดาว"}
{"word": "baby", "english": "I’ll never leave you, baby.", "thai": "ฉันจะไม่ทิ้งคุณ ที่รัก"}
{"word": "baby", "english": "The baby’s giggle is so sweet.", "thai": "เสียงหัวเราะของทารกหวานมาก"}
{"word": "baby", "english": "Baby, you light up my life.", "thai": "ที่รัก คุณทำให้ชีวิตฉันสว่างไสว"}
{"word": "baby", "english": "The baby is playing peekaboo.", "thai": "ทารกกำลังเล่นจ๊ะเอ๋"}
{"word": "baby", "english": "You’re my soulmate, baby.", "thai": "คุณคือเนื้อคู่ของฉัน ที่รัก"}
{"word": "baby", "english": "The baby loves her pacifier.", "thai": "ทารกรักจุกนมหลอกของเธอ"}
{"word": "baby", "english": "Baby, let’s make memories.", "thai": "ที่รัก มาสร้างความทรงจำกันเถอะ"}
{"word": "baby", "english": "The baby is so happy today.", "thai": "ทารกมีความสุขมากวันนี้"}
{"word": "baby", "english": "You’re my forever, baby.", "thai": "คุณคือตลอดไปของฉัน ที่รัก"}
{"word": "baby", "english": "The baby is reaching for the moon.", "thai": "ทารกกำลังเอื้อมไปจับดวงจันทร์"}
{"word": "baby", "english": "Baby, you’re my everything.", "thai": "ที่รัก คุณคือทุกสิ่งของฉัน"}
