{"word": "academic", "english": "Her academic achievements earned her a full scholarship.", "thai": "ความสำเร็จทางวิชาการของเธอทำให้เธอได้รับทุนการศึกษาเต็มจำนวน"}
{"word": "academic", "english": "The conference focused on academic research in climate change.", "thai": "การประชุมมุ่งเน้นไปที่การวิจัยทางวิชาการเกี่ยวกับการเปลี่ยนแปลงสภาพภูมิอากาศ"}
{"word": "academic", "english": "He’s an academic who spends most of his time in the library.", "thai": "เขาเป็นนักวิชาการที่ใช้เวลาส่วนใหญ่ในห้องสมุด"}
{"word": "academic", "english": "The academic year starts in September at our university.", "thai": "ปีการศึกษาเริ่มในเดือนกันยายนที่มหาวิทยาลัยของเรา"}
{"word": "academic", "english": "She’s worried about her academic performance this semester.", "thai": "เธอกังวลเกี่ยวกับผลการเรียนของเธอในภาคเรียนนี้"}
{"word": "academic", "english": "The professor gave an academic lecture on economic theory.", "thai": "ศาสตราจารย์ให้การบรรยายทางวิชาการเกี่ยวกับทฤษฎีเศรษฐศาสตร์"}
{"word": "academic", "english": "His academic record was spotless, with straight A’s.", "thai": "ผลการเรียนของเขาสะอาดหมดจด ได้เกรด A ทั้งหมด"}
{"word": "academic", "english": "The journal publishes academic articles on sociology.", "thai": "วารสารตีพิมพ์บทความทางวิชาการเกี่ยวกับสังคมวิทยา"}
{"word": "academic", "english": "They discussed academic policies at the faculty meeting.", "thai": "พวกเขาหารือเกี่ยวกับนโยบายทางวิชาการในการประชุมคณาจารย์"}
{"word": "academic", "english": "She pursued an academic career in biology.", "thai": "เธอใฝ่หาอาชีพทางวิชาการในสาขาชีววิทยา"}
{"word": "academic", "english": "The academic environment here is very competitive.", "thai": "สภาพแวดล้อมทางวิชาการที่นี่มีการแข่งขันสูงมาก"}
{"word": "academic", "english": "He’s known for his academic rigor in teaching.", "thai": "เขาเป็นที่รู้จักในเรื่องความเข้มงวดทางวิชาการในการสอน"}
{"word": "academic", "english": "The academic community welcomed the new research center.", "thai": "ชุมชนนักวิชาการต้อนรับศูนย์วิจัยแห่งใหม่"}
{"word": "academic", "english": "Her academic interests include medieval literature.", "thai": "ความสนใจทางวิชาการของเธอรวมถึงวรรณคดีสมัยกลาง"}
{"word": "academic", "english": "The university hosts academic events every month.", "thai": "มหาวิทยาลัยจัดงานทางวิชาการทุกเดือน"}
{"word": "academic", "english": "He wrote an academic paper on artificial intelligence.", "thai": "เขาเขียนบทความทางวิชาการเกี่ยวกับปัญญาประดิษฐ์"}
{"word": "academic", "english": "The academic advisor helped me choose my courses.", "thai": "ที่ปรึกษาทางวิชาการช่วยฉันเลือกวิชาเรียน"}
{"word": "academic", "english": "She’s on the academic committee for curriculum reform.", "thai": "เธออยู่ในคณะกรรมการวิชาการเพื่อการปฏิรูปหลักสูตร"}
{"word": "academic", "english": "His academic background is in chemical engineering.", "thai": "พื้นฐานทางวิชาการของเขาคือวิศวกรรมเคมี"}
{"word": "academic", "english": "The academic standards at this school are very high.", "thai": "มาตรฐานทางวิชาการที่โรงเรียนนี้สูงมาก"}
{"word": "academic", "english": "I’m taking a break from academic studies to work.", "thai": "ฉันกำลังหยุดพักจากการเรียนทางวิชาการเพื่อทำงาน"}
{"word": "academic", "english": "The academic journal rejected his submission.", "thai": "วารสารวิชาการปฏิเสธบทความที่เขาส่งมา"}
{"word": "academic", "english": "She’s an academic star in the physics department.", "thai": "เธอเป็นดาวเด่นทางวิชาการในภาควิชาฟิสิกส์"}
{"word": "academic", "english": "The academic debate was lively and engaging.", "thai": "การถกเถียงทางวิชาการมีชีวิตชีวาและน่าสนใจ"}
{"word": "academic", "english": "He’s struggling with the academic workload this year.", "thai": "เขากำลังมีปัญหากับภาระงานทางวิชาการในปีนี้"}
{"word": "academic", "english": "The academic program includes hands-on training.", "thai": "โปรแกรมวิชาการรวมถึงการฝึกปฏิบัติ"}
{"word": "academic", "english": "Her academic focus is on environmental science.", "thai": "จุดเน้นทางวิชาการของเธอคือวิทยาศาสตร์สิ่งแวดล้อม"}
{"word": "academic", "english": "The academic calendar lists all important deadlines.", "thai": "ปฏิทินการศึกษาระบุวันครบกำหนดที่สำคัญทั้งหมด"}
{"word": "academic", "english": "He received an academic award for his thesis.", "thai": "เขาได้รับรางวัลทางวิชาการสำหรับวิทยานิพนธ์ของเขา"}
{"word": "academic", "english": "The academic conference attracted global scholars.", "thai": "การประชุมวิชาการดึงดูดนักวิชาการจากทั่วโลก"}
{"word": "academic", "english": "She’s taking academic courses to boost her GPA.", "thai": "เธอกำลังเรียนวิชาการเพื่อเพิ่มเกรดเฉลี่ย"}
{"word": "academic", "english": "The academic library has a vast collection of books.", "thai": "ห้องสมุดวิชาการมีคอลเลกชันหนังสือมากมาย"}
{"word": "academic", "english": "His academic success inspired his younger siblings.", "thai": "ความสำเร็จทางวิชาการของเขาสร้างแรงบันดาลใจให้พี่น้องที่อายุน้อยกว่า"}
{"word": "academic", "english": "The academic staff organized a seminar series.", "thai": "คณาจารย์วิชาการจัดชุดสัมมนา"}
{"word": "academic", "english": "She’s exploring academic opportunities abroad.", "thai": "เธอกำลังสำรวจโอกาสทางวิชาการในต่างประเทศ"}
{"word": "academic", "english": "The academic curriculum is updated every year.", "thai": "หลักสูตรวิชาการได้รับการอัปเดตทุกปี"}
{"word": "academic", "english": "He’s an academic mentor to first-year students.", "thai": "เขาเป็นที่ปรึกษาทางวิชาการสำหรับนักศึกษาชั้นปีแรก"}
{"word": "academic", "english": "The academic symposium covered AI advancements.", "thai": "การสัมมนาวิชาการครอบคลุมความก้าวหน้าด้าน AI"}
{"word": "academic", "english": "Her academic journey began in a small town.", "thai": "การเดินทางทางวิชาการของเธอเริ่มต้นในเมืองเล็กๆ"}
{"word": "academic", "english": "The academic culture here values collaboration.", "thai": "วัฒนธรรมวิชาการที่นี่ให้ความสำคัญกับการทำงานร่วมกัน"}
{"word": "academic", "english": "He published an academic book on history.", "thai": "เขาเผยแพร่หนังสือวิชาการเกี่ยวกับประวัติศาสตร์"}
{"word": "academic", "english": "The academic workshop improved my skills.", "thai": "การประชุมเชิงปฏิบัติการวิชาการช่วยพัฒนาทักษะของฉัน"}
{"word": "academic", "english": "She’s on an academic exchange program in Europe.", "thai": "เธออยู่ในโปรแกรมแลกเปลี่ยนทางวิชาการในยุโรป"}
{"word": "academic", "english": "His academic reputation is well-respected.", "thai": "ชื่อเสียงทางวิชาการของเขาได้รับการยอมรับอย่างดี"}
{"word": "academic", "english": "The academic team won the research grant.", "thai": "ทีมวิชาการได้รับทุนวิจัย"}
{"word": "academic", "english": "She’s taking an academic leave to travel.", "thai": "เธอกำลังลาพักการเรียนเพื่อเดินทาง"}
{"word": "academic", "english": "The academic discussion was thought-provoking.", "thai": "การสนทนาทางวิชาการกระตุ้นความคิด"}
{"word": "academic", "english": "He’s an academic expert in linguistics.", "thai": "เขาเป็นผู้เชี่ยวชาญทางวิชาการด้านภาษาศาสตร์"}
{"word": "academic", "english": "The academic resources online are very helpful.", "thai": "ทรัพยากรวิชาการออนไลน์มีประโยชน์มาก"}
{"word": "academic", "english": "She’s presenting at an academic panel tomorrow.", "thai": "เธอกำลังนำเสนอในคณะวิชาการพรุ่งนี้"}
{"word": "academic", "english": "The academic pressure can be overwhelming.", "thai": "ความกดดันทางวิชาการอาจหนักหน่วง"}
{"word": "academic", "english": "He’s pursuing academic excellence in math.", "thai": "เขากำลังใฝ่หาความเป็นเลิศทางวิชาการในคณิตศาสตร์"}
{"word": "academic", "english": "The academic department hired new faculty.", "thai": "ภาควิชาการจ้างคณาจารย์ใหม่"}
{"word": "academic", "english": "Her academic advisor recommended more electives.", "thai": "ที่ปรึกษาทางวิชาการของเธอแนะนำให้เรียนวิชาเลือกเพิ่ม"}
{"word": "academic", "english": "The academic study group meets every Friday.", "thai": "กลุ่มศึกษาวิชาการพบกันทุกวันศุกร์"}
{"word": "academic", "english": "He’s working on an academic project with peers.", "thai": "เขากำลังทำงานในโครงการวิชาการกับเพื่อน"}
{"word": "academic", "english": "The academic lecture hall was packed today.", "thai": "หอประชุมวิชาการเต็มไปด้วยผู้คนวันนี้"}
{"word": "academic", "english": "She’s an academic role model for her classmates.", "thai": "เธอเป็นแบบอย่างทางวิชาการสำหรับเพื่อนร่วมชั้น"}
{"word": "academic", "english": "The academic article was cited widely.", "thai": "บทความวิชาการได้รับการอ้างอิงอย่างกว้างขวาง"}
{"word": "academic", "english": "He’s attending an academic workshop on coding.", "thai": "เขากำลังเข้าร่วมการประชุมเชิงปฏิบัติการวิชาการเกี่ยวกับการเขียนโค้ด"}
{"word": "academic", "english": "The academic environment fosters creativity.", "thai": "สภาพแวดล้อมวิชาการส่งเสริมความคิดสร้างสรรค์"}
{"word": "academic", "english": "She’s writing an academic essay for class.", "thai": "เธอกำลังเขียนเรียงความวิชาการสำหรับชั้นเรียน"}
{"word": "academic", "english": "The academic board approved the new course.", "thai": "คณะกรรมการวิชาการอนุมัติวิชาใหม่"}
{"word": "academic", "english": "His academic progress is impressive.", "thai": "ความก้าวหน้าทางวิชาการของเขาน่าประทับใจ"}
{"word": "academic", "english": "The academic seminar was open to all students.", "thai": "สัมมนาวิชาการเปิดให้ทุกคนเข้าร่วม"}
{"word": "academic", "english": "She’s an academic leader in her field.", "thai": "เธอเป็นผู้นำทางวิชาการในสาขาของเธอ"}
{"word": "academic", "english": "The academic research lab is state-of-the-art.", "thai": "ห้องปฏิบัติการวิจัยวิชาการทันสมัย"}
{"word": "academic", "english": "He’s facing academic challenges this term.", "thai": "เขากำลังเผชิญกับความท้าทายทางวิชาการในเทอมนี้"}
{"word": "academic", "english": "The academic journal club meets monthly.", "thai": "ชมรมวารสารวิชาการพบกันทุกเดือน"}
{"word": "academic", "english": "Her academic presentation was well-received.", "thai": "การนำเสนอทางวิชาการของเธอได้รับการตอบรับที่ดี"}
{"word": "academic", "english": "The academic council reviewed the budget.", "thai": "สภาวิชาการตรวจสอบงบประมาณ"}
{"word": "academic", "english": "He’s taking academic courses online this year.", "thai": "เขากำลังเรียนวิชาการออนไลน์ในปีนี้"}
{"word": "academic", "english": "The academic workload is intense but rewarding.", "thai": "ภาระงานวิชาการหนักหน่วงแต่ให้ผลตอบแทนคุ้มค่า"}
{"word": "academic", "english": "She’s an academic tutor for struggling students.", "thai": "เธอเป็นติวเตอร์วิชาการสำหรับนักเรียนที่กำลังมีปัญหา"}
{"word": "academic", "english": "The academic event was a huge success.", "thai": "งานวิชาการประสบความสำเร็จอย่างมาก"}
{"word": "academic", "english": "His academic goals include a PhD.", "thai": "เป้าหมายทางวิชาการของเขารวมถึงการได้รับปริญญาเอก"}
{"word": "academic", "english": "The academic paper took months to complete.", "thai": "บทความวิชาการใช้เวลาหลายเดือนกว่าจะเสร็จสมบูรณ์"}
{"word": "academic", "english": "She’s involved in academic outreach programs.", "thai": "เธอมีส่วนร่วมในโปรแกรมการเผยแพร่วิชาการ"}
{"word": "academic", "english": "The academic year ends with a big ceremony.", "thai": "ปีการศึกษาสิ้นสุดด้วยพิธีใหญ่"}
{"word": "academic", "english": "He’s an academic consultant for the university.", "thai": "เขาเป็นที่ปรึกษาทางวิชาการสำหรับมหาวิทยาลัย"}
{"word": "academic", "english": "The academic competition was fierce this year.", "thai": "การแข่งขันทางวิชาการดุเดือดในปีนี้"}
{"word": "academic", "english": "She’s writing an academic book on psychology.", "thai": "เธอกำลังเขียนหนังสือวิชาการเกี่ยวกับจิตวิทยา"}
{"word": "academic", "english": "The academic review process is thorough.", "thai": "กระบวนการทบทวนวิชาการละเอียดถี่ถ้วน"}
{"word": "academic", "english": "He’s an academic writer for a major journal.", "thai": "เขาเป็นนักเขียนวิชาการสำหรับวารสารชั้นนำ"}
{"word": "academic", "english": "The academic setting encourages innovation.", "thai": "สภาพแวดล้อมวิชาการส่งเสริมการสร้างนวัตกรรม"}
{"word": "academic", "english": "She’s taking an academic break to volunteer.", "thai": "เธอกำลังหยุดพักทางการศึกษาเพื่อเป็นอาสาสมัคร"}
{"word": "academic", "english": "The academic workshop focused on data analysis.", "thai": "การประชุมเชิงปฏิบัติการวิชาการเน้นการวิเคราะห์ข้อมูล"}
{"word": "academic", "english": "His academic achievements were celebrated widely.", "thai": "ความสำเร็จทางวิชาการของเขาได้รับการเฉลิมฉลองอย่างกว้างขวาง"}
{"word": "academic", "english": "The academic program offers diverse courses.", "thai": "โปรแกรมวิชาการมีวิชาที่หลากหลาย"}
{"word": "academic", "english": "She’s an academic researcher in neuroscience.", "thai": "เธอเป็นนักวิจัยวิชาการด้านประสาทวิทยา"}
{"word": "academic", "english": "The academic community supports new talent.", "thai": "ชุมชนวิชาการสนับสนุนผู้มีความสามารถใหม่"}
{"word": "academic", "english": "He’s presenting his academic findings next week.", "thai": "เขาจะนำเสนอผลการวิจัยวิชาการในสัปดาห์หน้า"}
{"word": "academic", "english": "The academic advisor was very supportive.", "thai": "ที่ปรึกษาทางวิชาการให้การสนับสนุนอย่างมาก"}
{"word": "academic", "english": "She’s organizing an academic panel discussion.", "thai": "เธอกำลังจัดการอภิปรายคณะวิชาการ"}
{"word": "academic", "english": "The academic course load is manageable.", "thai": "ภาระวิชาการสามารถจัดการได้"}
{"word": "academic", "english": "He’s an academic enthusiast for literature.", "thai": "เขาเป็นผู้หลงใหลในวิชาการด้านวรรณคดี"}
{"word": "academic", "english": "The academic journal is peer-reviewed.", "thai": "วารสารวิชาการได้รับการทบทวนโดยเพื่อน"}
{"word": "academic", "english": "She’s building an academic career in history.", "thai": "เธอกำลังสร้างอาชีพทางวิชาการในประวัติศาสตร์"}
{"word": "academic", "english": "The academic environment is very supportive.", "thai": "สภาพแวดล้อมวิชาการให้การสนับสนุนอย่างมาก"}
{"word": "academic", "english": "He’s working on an academic grant proposal.", "thai": "เขากำลังทำงานในข้อเสนอขอทุนวิชาการ"}
{"word": "academic", "english": "The academic lecture was inspiring.", "thai": "การบรรยายวิชาการสร้างแรงบันดาลใจ"}
{"word": "advisor", "english": "My academic advisor helped me plan my semester.", "thai": "ที่ปรึกษาทางวิชาการของฉันช่วยฉันวางแผนภาคเรียน"}
{"word": "advisor", "english": "She met with her advisor to discuss her major.", "thai": "เธอพบที่ปรึกษาเพื่อหารือเกี่ยวกับสาขาวิชาเอกของเธอ"}
{"word": "advisor", "english": "The financial advisor recommended investing in stocks.", "thai": "ที่ปรึกษาการเงินแนะนำให้ลงทุนในหุ้น"}
{"word": "advisor", "english": "He’s the advisor for the student council.", "thai": "เขาเป็นที่ปรึกษาของสภานักเรียน"}
{"word": "advisor", "english": "Her advisor suggested taking an extra course.", "thai": "ที่ปรึกษาของเธอแนะนำให้เรียนวิชาเพิ่ม"}
{"word": "advisor", "english": "The career advisor gave me great job tips.", "thai": "ที่ปรึกษาด้านอาชีพให้คำแนะนำดีๆ เกี่ยวกับงาน"}
{"word": "advisor", "english": "I’m meeting my advisor to go over my schedule.", "thai": "ฉันจะพบที่ปรึกษาเพื่อตรวจสอบตารางเรียนของฉัน"}
{"word": "advisor", "english": "The advisor warned about missing deadlines.", "thai": "ที่ปรึกษาเตือนเกี่ยวกับการพลาดกำหนดเวลา"}
{"word": "advisor", "english": "She’s the advisor for the debate club.", "thai": "เธอเป็นที่ปรึกษาของชมรมโต้วาที"}
{"word": "advisor", "english": "My advisor thinks I should apply for a scholarship.", "thai": "ที่ปรึกษาคิดว่าฉันควรสมัครทุนการศึกษา"}
{"word": "advisor", "english": "He works as an advisor for graduate students.", "thai": "เขาทำงานเป็นที่ปรึกษาสำหรับนักศึกษาระดับบัณฑิตศึกษา"}
{"word": "advisor", "english": "The advisor helped me choose my electives.", "thai": "ที่ปรึกษาช่วยฉันเลือกวิชาเลือก"}
{"word": "advisor", "english": "She’s an advisor for the environmental club.", "thai": "เธอเป็นที่ปรึกษาของชมรมสิ่งแวดล้อม"}
{"word": "advisor", "english": "My advisor recommended a study abroad program.", "thai": "ที่ปรึกษาแนะนำโปรแกรมการศึกษาต่อต่างประเทศ"}
{"word": "advisor", "english": "The advisor was very supportive during my thesis.", "thai": "ที่ปรึกษาให้การสนับสนุนอย่างมากระหว่างการทำวิทยานิพนธ์"}
{"word": "advisor", "english": "He’s meeting his advisor to discuss internships.", "thai": "เขากำลังพบที่ปรึกษาเพื่อหารือเกี่ยวกับการฝึกงาน"}
{"word": "advisor", "english": "The advisor suggested revising my research topic.", "thai": "ที่ปรึกษาแนะนำให้ปรับหัวข้อวิจัยของฉัน"}
{"word": "advisor", "english": "She’s an advisor to the university’s honor society.", "thai": "เธอเป็นที่ปรึกษาของสมาคมเกียรตินิยมของมหาวิทยาลัย"}
{"word": "advisor", "english": "My advisor encouraged me to pursue a minor.", "thai": "ที่ปรึกษาสนับสนุนให้ฉันเรียนวิชาโท"}
{"word": "advisor", "english": "The advisor reviewed my application essay.", "thai": "ที่ปรึกษาตรวจสอบเรียงความสมัครของฉัน"}
{"word": "advisor", "english": "He’s the advisor for the engineering club.", "thai": "เขาเป็นที่ปรึกษาของชมรมวิศวกรรม"}
{"word": "advisor", "english": "The advisor helped me navigate the transfer process.", "thai": "ที่ปรึกษาช่วยฉันจัดการกระบวนการโอนย้าย"}
{"word": "advisor", "english": "She consulted her advisor about graduate school.", "thai": "เธอปรึกษาที่ปรึกษาเกี่ยวกับการเรียนบัณฑิตศึกษา"}
{"word": "advisor", "english": "The advisor is available for appointments on Fridays.", "thai": "ที่ปรึกษาว่างสำหรับการนัดหมายในวันศุกร์"}
{"word": "advisor", "english": "My advisor suggested I take a lighter course load.", "thai": "ที่ปรึกษาแนะนำให้ฉันเรียนวิชาน้อยลง"}
{"word": "advisor", "english": "He’s an advisor for international students.", "thai": "เขาเป็นที่ปรึกษาสำหรับนักศึกษาต่างชาติ"}
{"word": "advisor", "english": "The advisor gave me feedback on my project proposal.", "thai": "ที่ปรึกษาให้คำแนะนำเกี่ยวกับข้อเสนอโครงการของฉัน"}
{"word": "advisor", "english": "She’s the advisor for the drama club.", "thai": "เธอเป็นที่ปรึกษาของชมรมละคร"}
{"word": "advisor", "english": "My advisor helped me with my graduation plan.", "thai": "ที่ปรึกษาช่วยฉันวางแผนการสำเร็จการศึกษา"}
{"word": "advisor", "english": "The advisor was key in securing my internship.", "thai": "ที่ปรึกษามีบทบาทสำคัญในการช่วยฉันได้ฝึกงาน"}
{"word": "advisor", "english": "He consulted his advisor about changing majors.", "thai": "เขาปรึกษาที่ปรึกษาเกี่ยวกับการเปลี่ยนสาขาวิชาเอก"}
{"word": "advisor", "english": "The advisor organized a career workshop.", "thai": "ที่ปรึกษาจัดการประชุมเชิงปฏิบัติการด้านอาชีพ"}
{"word": "advisor", "english": "She’s an advisor for the science fair team.", "thai": "เธอเป็นที่ปรึกษาของทีมงานนิทรรศการวิทยาศาสตร์"}
{"word": "advisor", "english": "My advisor recommended a summer research program.", "thai": "ที่ปรึกษาแนะนำโปรแกรมวิจัยช่วงฤดูร้อน"}
{"word": "advisor", "english": "The advisor is very approachable and helpful.", "thai": "ที่ปรึกษาเป็นคนที่เข้าถึงได้ง่ายและช่วยเหลือดี"}
{"word": "advisor", "english": "He’s the advisor for the chess club.", "thai": "เขาเป็นที่ปรึกษาของชมรมหมากรุก"}
{"word": "advisor", "english": "The advisor helped me resolve a scheduling conflict.", "thai": "ที่ปรึกษาช่วยฉันแก้ไขปัญหาการชนกันของตารางเรียน"}
{"word": "advisor", "english": "She met her advisor to discuss her thesis topic.", "thai": "เธอพบที่ปรึกษาเพื่อหารือเกี่ยวกับหัวข้อวิทยานิพนธ์"}
{"word": "advisor", "english": "The advisor provided guidance on course selection.", "thai": "ที่ปรึกษาให้คำแนะนำเกี่ยวกับการเลือกวิชา"}
{"word": "advisor", "english": "He’s an advisor for the pre-med program.", "thai": "เขาเป็นที่ปรึกษาสำหรับโปรแกรมเตรียมแพทย์"}
{"word": "advisor", "english": "My advisor suggested I join a study group.", "thai": "ที่ปรึกษาแนะนำให้ฉันเข้าร่วมกลุ่มศึกษา"}
{"word": "advisor", "english": "The advisor reviewed my academic progress.", "thai": "ที่ปรึกษาตรวจสอบความก้าวหน้าทางวิชาการของฉัน"}
{"word": "advisor", "english": "She’s the advisor for the literary magazine.", "thai": "เธอเป็นที่ปรึกษาของนิตยสารวรรณกรรม"}
{"word": "advisor", "english": "The advisor helped me apply for a grant.", "thai": "ที่ปรึกษาช่วยฉันสมัครขอทุน"}
{"word": "advisor", "english": "He’s an advisor to the student government.", "thai": "เขาเป็นที่ปรึกษาของรัฐบาลนักเรียน"}
{"word": "advisor", "english": "My advisor encouraged me to attend a conference.", "thai": "ที่ปรึกษาสนับสนุนให้ฉันเข้าร่วมการประชุม"}
{"word": "advisor", "english": "The advisor offered tips for exam preparation.", "thai": "ที่ปรึกษาให้เคล็ดลับสำหรับการเตรียมสอบ"}
{"word": "advisor", "english": "She’s an advisor for the robotics team.", "thai": "เธอเป็นที่ปรึกษาของทีมหุ่นยนต์"}
{"word": "advisor", "english": "The advisor helped me with my resume.", "thai": "ที่ปรึกษาช่วยฉันทำเรซูเม"}
{"word": "advisor", "english": "He’s meeting his advisor to plan his research.", "thai": "เขากำลังพบที่ปรึกษาเพื่อวางแผนการวิจัย"}
{"word": "advisor", "english": "The advisor suggested I take a gap year.", "thai": "ที่ปรึกษาแนะนำให้ฉันพักการเรียนหนึ่งปี"}
{"word": "advisor", "english": "She’s an advisor for the music club.", "thai": "เธอเป็นที่ปรึกษาของชมรมดนตรี"}
{"word": "advisor", "english": "My advisor helped me secure a fellowship.", "thai": "ที่ปรึกษาช่วยฉันได้รับทุนการศึกษา"}
{"word": "advisor", "english": "The advisor is an expert in academic planning.", "thai": "ที่ปรึกษาเป็นผู้เชี่ยวชาญด้านการวางแผนวิชาการ"}
{"word": "advisor", "english": "He’s the advisor for the volunteer organization.", "thai": "เขาเป็นที่ปรึกษาขององค์กรอาสาสมัคร"}
{"word": "advisor", "english": "The advisor gave me advice on time management.", "thai": "ที่ปรึกษาให้คำแนะนำเกี่ยวกับการจัดการเวลา"}
{"word": "advisor", "english": "She consulted her advisor about study abroad options.", "thai": "เธอปรึกษาที่ปรึกษาเกี่ยวกับตัวเลือกการศึกษาต่อต่างประเทศ"}
{"word": "advisor", "english": "The advisor is always available for questions.", "thai": "ที่ปรึกษาพร้อมตอบคำถามเสมอ"}
{"word": "advisor", "english": "He’s an advisor for the computer science program.", "thai": "เขาเป็นที่ปรึกษาสำหรับโปรแกรมวิทยาการคอมพิวเตอร์"}
{"word": "advisor", "english": "My advisor helped me pick a research topic.", "thai": "ที่ปรึกษาช่วยฉันเลือกหัวข้อวิจัย"}
{"word": "advisor", "english": "The advisor organized a mentoring session.", "thai": "ที่ปรึกษาจัดเซสชันการให้คำปรึกษา"}
{"word": "advisor", "english": "She’s the advisor for the art club.", "thai": "เธอเป็นที่ปรึกษาของชมรมศิลปะ"}
{"word": "advisor", "english": "The advisor reviewed my scholarship application.", "thai": "ที่ปรึกษาตรวจสอบใบสมัครทุนการศึกษาของฉัน"}
{"word": "advisor", "english": "He’s an advisor for the business school.", "thai": "เขาเป็นที่ปรึกษาของโรงเรียนธุรกิจ"}
{"word": "advisor", "english": "My advisor suggested I meet with a tutor.", "thai": "ที่ปรึกษาแนะนำให้ฉันพบกับติวเตอร์"}
{"word": "advisor", "english": "The advisor helped me with my transfer credits.", "thai": "ที่ปรึกษาช่วยฉันจัดการหน่วยกิตโอน"}
{"word": "advisor", "english": "She’s an advisor for the cultural society.", "thai": "เธอเป็นที่ปรึกษาของสมาคมวัฒนธรรม"}
{"word": "advisor", "english": "The advisor gave me tips for graduate school applications.", "thai": "ที่ปรึกษาให้เคล็ดลับสำหรับการสมัครบัณฑิตศึกษา"}
{"word": "advisor", "english": "He’s the advisor for the math club.", "thai": "เขาเป็นที่ปรึกษาของชมรมคณิตศาสตร์"}
{"word": "advisor", "english": "My advisor recommended a leadership program.", "thai": "ที่ปรึกษาแนะนำโปรแกรมผู้นำ"}
{"word": "advisor", "english": "The advisor helped me understand degree requirements.", "thai": "ที่ปรึกษาช่วยฉันเข้าใจข้อกำหนดปริญญา"}
{"word": "advisor", "english": "She’s an advisor for the journalism program.", "thai": "เธอเป็นที่ปรึกษาสำหรับโปรแกรมวารสารศาสตร์"}
{"word": "advisor", "english": "The advisor suggested I attend a career fair.", "thai": "ที่ปรึกษาแนะนำให้ฉันเข้าร่วมงานแสดงอาชีพ"}
{"word": "advisor", "english": "He’s an advisor for the international affairs club.", "thai": "เขาเป็นที่ปรึกษาของชมรมกิจการระหว่างประเทศ"}
{"word": "advisor", "english": "My advisor helped me plan for study abroad.", "thai": "ที่ปรึกษาช่วยฉันวางแผนการศึกษาต่อต่างประเทศ"}
{"word": "advisor", "english": "The advisor provided feedback on my essay draft.", "thai": "ที่ปรึกษาให้คำแนะนำเกี่ยวกับร่างเรียงความของฉัน"}
{"word": "advisor", "english": "She’s the advisor for the dance team.", "thai": "เธอเป็นที่ปรึกษาของทีมเต้นรำ"}
{"word": "advisor", "english": "The advisor helped me with my course registration.", "thai": "ที่ปรึกษาช่วยฉันลงทะเบียนวิชา"}
{"word": "advisor", "english": "He’s an advisor for the sustainability initiative.", "thai": "เขาเป็นที่ปรึกษาของโครงการความยั่งยืน"}
{"word": "advisor", "english": "My advisor encouraged me to pursue research.", "thai": "ที่ปรึกษาสนับสนุนให้ฉันทำวิจัย"}
{"word": "advisor", "english": "The advisor is very knowledgeable about scholarships.", "thai": "ที่ปรึกษามีความรู้มากเกี่ยวกับทุนการศึกษา"}
{"word": "advisor", "english": "She’s an advisor for the philosophy club.", "thai": "เธอเป็นที่ปรึกษาของชมรมปรัชญา"}
{"word": "advisor", "english": "The advisor helped me with my internship application.", "thai": "ที่ปรึกษาช่วยฉันสมัครฝึกงาน"}
{"word": "advisor", "english": "He’s the advisor for the chemistry program.", "thai": "เขาเป็นที่ปรึกษาสำหรับโปรแกรมเคมี"}
{"word": "advisor", "english": "My advisor suggested I take a public speaking class.", "thai": "ที่ปรึกษาแนะนำให้ฉันเรียนวิชาการพูดในที่สาธารณะ"}
{"word": "advisor", "english": "The advisor organized a study skills workshop.", "thai": "ที่ปรึกษาจัดการประชุมเชิงปฏิบัติการทักษะการเรียน"}
{"word": "advisor", "english": "She’s an advisor for the women’s leadership group.", "thai": "เธอเป็นที่ปรึกษาของกลุ่มผู้นำสตรี"}
{"word": "advisor", "english": "The advisor helped me with my financial aid forms.", "thai": "ที่ปรึกษาช่วยฉันกรอกแบบฟอร์มขอความช่วยเหลือทางการเงิน"}
{"word": "advisor", "english": "He’s an advisor for the history society.", "thai": "เขาเป็นที่ปรึกษาของสมาคมประวัติศาสตร์"}
{"word": "advisor", "english": "My advisor recommended a double major.", "thai": "ที่ปรึกษาแนะนำให้ฉันเรียนสองสาขาวิชาเอก"}
{"word": "advisor", "english": "The advisor is great at explaining degree options.", "thai": "ที่ปรึกษาเก่งในการอธิบายตัวเลือกปริญญา"}
{"word": "advisor", "english": "She’s the advisor for the coding bootcamp.", "thai": "เธอเป็นที่ปรึกษาของค่ายฝึกเขียนโค้ด"}
{"word": "advisor", "english": "The advisor helped me prepare for my exams.", "thai": "ที่ปรึกษาช่วยฉันเตรียมตัวสำหรับการสอบ"}
{"word": "advisor", "english": "He’s an advisor for the entrepreneurship club.", "thai": "เขาเป็นที่ปรึกษาของชมรมผู้ประกอบการ"}
{"word": "advisor", "english": "My advisor suggested I explore graduate programs.", "thai": "ที่ปรึกษาแนะนำให้ฉันสำรวจโปรแกรมบัณฑิตศึกษา"}
{"word": "advisor", "english": "The advisor helped me with my study plan.", "thai": "ที่ปรึกษาช่วยฉันวางแผนการเรียน"}
{"word": "advisor", "english": "She’s an advisor for the psychology department.", "thai": "เธอเป็นที่ปรึกษาของภาควิชาจิตวิทยา"}
{"word": "advisor", "english": "The advisor gave me advice on networking.", "thai": "ที่ปรึกษาให้คำแนะนำเกี่ยวกับการสร้างเครือข่าย"}
{"word": "assignment", "english": "I finished my math assignment last night.", "thai": "ฉันทำการบ้านคณิตศาสตร์เสร็จเมื่อคืนนี้"}
{"word": "assignment", "english": "The teacher gave us a tough writing assignment.", "thai": "ครูให้งานเขียนที่ยากมากกับเรา"}
{"word": "assignment", "english": "She’s working on a group assignment for history.", "thai": "เธอกำลังทำงานกลุ่มสำหรับวิชาประวัติศาสตร์"}
{"word": "assignment", "english": "I forgot to turn in my science assignment.", "thai": "ฉันลืมส่งการบ้านวิทยาศาสตร์"}
{"word": "assignment", "english": "The assignment is due by Friday morning.", "thai": "งานนี้ต้องส่งภายในเช้าวันศุกร์"}
{"word": "assignment", "english": "He’s struggling with his programming assignment.", "thai": "เขากำลังมีปัญหากับงานเขียนโปรแกรม"}
{"word": "assignment", "english": "The professor posted the assignment on the portal.", "thai": "ศาสตราจารย์โพสต์งานในพอร์ทัล"}
{"word": "assignment", "english": "This assignment requires a lot of research.", "thai": "งานนี้ต้องใช้การวิจัยเยอะมาก"}
{"word": "assignment", "english": "I need help with my English assignment.", "thai": "ฉันต้องการความช่วยเหลือกับงานภาษาอังกฤษ"}
{"word": "assignment", "english": "The assignment was to analyze a poem.", "thai": "งานคือการวิเคราะห์บทกวี"}
{"word": "assignment", "english": "She completed her art assignment early.", "thai": "เธอทำการบ้านศิลปะเสร็จก่อนกำหนด"}
{"word": "assignment", "english": "The group assignment took all weekend.", "thai": "งานกลุ่มใช้เวลาทั้งสุดสัปดาห์"}
{"word": "assignment", "english": "I got an A on my last assignment.", "thai": "ฉันได้ A ในงานล่าสุด"}
{"word": "assignment", "english": "The assignment instructions were unclear.", "thai": "คำแนะนำของงานไม่ชัดเจน"}
{"word": "assignment", "english": "He’s stressed about his final assignment.", "thai": "เขากังวลเกี่ยวกับงานสุดท้าย"}
{"word": "assignment", "english": "The assignment involves creating a presentation.", "thai": "งานนี้เกี่ยวข้องกับการทำพรีเซนเทชัน"}
{"word": "assignment", "english": "I’m halfway through my biology assignment.", "thai": "ฉันทำการบ้านชีววิทยาไปได้ครึ่งทางแล้ว"}
{"word": "assignment", "english": "The teacher extended the assignment deadline.", "thai": "ครูขยายกำหนดเวลาส่งงาน"}
{"word": "assignment", "english": "This assignment is worth 20% of our grade.", "thai": "งานนี้มีค่าน้ำหนัก 20% ของคะแนน"}
{"word": "assignment", "english": "She’s reviewing her assignment before submitting.", "thai": "เธอกำลังตรวจงานก่อนส่ง"}
{"word": "assignment", "english": "The assignment was to write a short story.", "thai": "งานคือการเขียนเรื่องสั้น"}
{"word": "assignment", "english": "I left my assignment at home by mistake.", "thai": "ฉันลืมงานไว้ที่บ้านโดยไม่ได้ตั้งใจ"}
{"word": "assignment", "english": "The chemistry assignment was really challenging.", "thai": "งานเคมีท้าทายมาก"}
{"word": "assignment", "english": "He’s working on an assignment for his coding class.", "thai": "เขากำลังทำงานสำหรับวิชาการเขียนโค้ด"}
{"word": "assignment", "english": "The assignment requires us to work in pairs.", "thai": "งานนี้กำหนดให้เราทำงานเป็นคู่"}
{"word": "assignment", "english": "I’m stuck on the last part of the assignment.", "thai": "ฉันติดอยู่ที่ส่วนสุดท้ายของงาน"}
{"word": "assignment", "english": "The professor gave feedback on our assignment.", "thai": "ศาสตราจารย์ให้คำแนะนำเกี่ยวกับงานของเรา"}
{"word": "assignment", "english": "She’s organizing her notes for the assignment.", "thai": "เธอกำลังจัดระเบียบโน้ตสำหรับงาน"}
{"word": "assignment", "english": "The assignment was to design a poster.", "thai": "งานคือการออกแบบโปสเตอร์"}
{"word": "assignment", "english": "I spent hours on my history assignment.", "thai": "ฉันใช้เวลาหลายชั่วโมงกับงานประวัติศาสตร์"}
{"word": "assignment", "english": "The assignment is posted on the class website.", "thai": "งานถูกโพสต์บนเว็บไซต์ของชั้นเรียน"}
{"word": "assignment", "english": "He’s rushing to finish his math assignment.", "thai": "เขากำลังเร่งทำการบ้านคณิตศาสตร์ให้เสร็จ"}
{"word": "assignment", "english": "The assignment was harder than I expected.", "thai": "งานนี้ยากกว่าที่ฉันคาดไว้"}
{"word": "assignment", "english": "I need to print my assignment before class.", "thai": "ฉันต้องพิมพ์งานก่อนเข้าชั้นเรียน"}
{"word": "assignment", "english": "The group assignment went really well.", "thai": "งานกลุ่มไปได้ดีมาก"}
{"word": "assignment", "english": "She’s discussing the assignment with her classmates.", "thai": "เธอกำลังคุยเกี่ยวกับงานกับเพื่อนร่วมชั้น"}
{"word": "assignment", "english": "The assignment is to read two chapters.", "thai": "งานคือการอ่านสองบท"}
{"word": "assignment", "english": "I’m starting my physics assignment tonight.", "thai": "ฉันจะเริ่มทำการบ้านฟิสิกส์คืนนี้"}
{"word": "assignment", "english": "The assignment took longer than planned.", "thai": "งานนี้ใช้เวลานานกว่าที่วางแผนไว้"}
{"word": "assignment", "english": "He got extra credit for his assignment.", "thai": "เขาได้คะแนนพิเศษจากงาน"}
{"word": "assignment", "english": "The assignment was to solve ten problems.", "thai": "งานคือการแก้โจทย์สิบข้อ"}
{"word": "assignment", "english": "I’m emailing my assignment to the professor.", "thai": "ฉันกำลังส่งงานทางอีเมลถึงศาสตราจารย์"}
{"word": "assignment", "english": "The assignment requires a bibliography.", "thai": "งานนี้ต้องมีบรรณานุกรม"}
{"word": "assignment", "english": "She’s proud of her creative writing assignment.", "thai": "เธอภูมิใจกับงานเขียนสร้างสรรค์"}
{"word": "assignment", "english": "The assignment is part of our final project.", "thai": "งานนี้เป็นส่วนหนึ่งของโปรเจกต์สุดท้าย"}
{"word": "assignment", "english": "I’m reviewing the assignment guidelines.", "thai": "ฉันกำลังตรวจสอบแนวทางการทำงาน"}
{"word": "assignment", "english": "The assignment was to create a model.", "thai": "งานคือการสร้างโมเดล"}
{"word": "assignment", "english": "He’s asking the teacher about the assignment.", "thai": "เขากำลังถามครูเกี่ยวกับงาน"}
{"word": "assignment", "english": "The assignment deadline is next week.", "thai": "กำหนดส่งงานคือสัปดาห์หน้า"}
{"word": "assignment", "english": "I’m collaborating on a group assignment.", "thai": "ฉันกำลังทำงานกลุ่มร่วมกัน"}
{"word": "assignment", "english": "The assignment was to write an essay.", "thai": "งานคือการเขียนเรียงความ"}
{"word": "assignment", "english": "She’s editing her assignment before submission.", "thai": "เธอกำลังแก้ไขงานก่อนส่ง"}
{"word": "assignment", "english": "The assignment involves a case study.", "thai": "งานนี้เกี่ยวข้องกับกรณีศึกษา"}
{"word": "assignment", "english": "I’m struggling with my literature assignment.", "thai": "ฉันกำลังมีปัญหากับงานวรรณคดี"}
{"word": "assignment", "english": "The assignment was surprisingly fun.", "thai": "งานนี้สนุกอย่างไม่คาดคิด"}
{"word": "assignment", "english": "He’s preparing for his oral assignment.", "thai": "เขากำลังเตรียมตัวสำหรับงานพูด"}
{"word": "assignment", "english": "The assignment requires a team effort.", "thai": "งานนี้ต้องใช้ความพยายามของทีม"}
{"word": "assignment", "english": "I’m double-checking my assignment answers.", "thai": "ฉันกำลังตรวจคำตอบของงานอีกครั้ง"}
{"word": "assignment", "english": "The assignment was to draw a diagram.", "thai": "งานคือการวาดแผนภาพ"}
{"word": "assignment", "english": "She’s stressed about her sociology assignment.", "thai": "เธอกังวลเกี่ยวกับงานสังคมวิทยา"}
{"word": "assignment", "english": "The assignment is to conduct an experiment.", "thai": "งานคือการทำการทดลอง"}
{"word": "assignment", "english": "I’m uploading my assignment to the portal.", "thai": "ฉันกำลังอัปโหลดงานไปยังพอร์ทัล"}
{"word": "assignment", "english": "The assignment took three hours to complete.", "thai": "งานนี้ใช้เวลาสามชั่วโมงกว่าจะเสร็จ"}
{"word": "assignment", "english": "He’s discussing the assignment with his tutor.", "thai": "เขากำลังคุยเกี่ยวกับงานกับติวเตอร์"}
{"word": "assignment", "english": "The assignment was to summarize an article.", "thai": "งานคือการสรุปบทความ"}
{"word": "assignment", "english": "I’m starting my economics assignment now.", "thai": "ฉันกำลังเริ่มทำการบ้านเศรษฐศาสตร์ตอนนี้"}
{"word": "assignment", "english": "The assignment is part of a larger project.", "thai": "งานนี้เป็นส่วนหนึ่งของโปรเจกต์ใหญ่"}
{"word": "assignment", "english": "She got feedback on her last assignment.", "thai": "เธอได้รับคำแนะนำจากงานล่าสุด"}
{"word": "assignment", "english": "The assignment was to compare two books.", "thai": "งานคือการเปรียบเทียบหนังสือสองเล่ม"}
{"word": "assignment", "english": "I’m working on my psychology assignment.", "thai": "ฉันกำลังทำงานจิตวิทยา"}
{"word": "assignment", "english": "The assignment requires a video submission.", "thai": "งานนี้ต้องส่งวิดีโอ"}
{"word": "assignment", "english": "He’s confused about the assignment prompt.", "thai": "เขาสับสนเกี่ยวกับโจทย์งาน"}
{"word": "assignment", "english": "The assignment was to build a prototype.", "thai": "งานคือการสร้างต้นแบบ"}
{"word": "assignment", "english": "I’m meeting my group for the assignment.", "thai": "ฉันกำลังพบกลุ่มเพื่อทำงาน"}
{"word": "assignment", "english": "The assignment is to write a lab report.", "thai": "งานคือการเขียนรายงานห้องปฏิบัติการ"}
{"word": "assignment", "english": "She’s researching for her geography assignment.", "thai": "เธอกำลังค้นคว้าสำหรับงานภูมิศาสตร์"}
{"word": "assignment", "english": "The assignment was graded fairly.", "thai": "งานนี้ได้รับการให้คะแนนอย่างยุติธรรม"}
{"word": "assignment", "english": "I’m brainstorming ideas for my assignment.", "thai": "ฉันกำลังระดมความคิดสำหรับงาน"}
{"word": "assignment", "english": "The assignment is to create a survey.", "thai": "งานคือการสร้างแบบสำรวจ"}
{"word": "assignment", "english": "He’s late on his philosophy assignment.", "thai": "เขาส่งงานปรัชญาล่าช้า"}
{"word": "assignment", "english": "The assignment was to analyze data.", "thai": "งานคือการวิเคราะห์ข้อมูล"}
{"word": "assignment", "english": "I’m outlining my assignment tonight.", "thai": "ฉันกำลังร่างโครงงานคืนนี้"}
{"word": "assignment", "english": "The assignment involves a debate prep.", "thai": "งานนี้เกี่ยวข้องกับการเตรียมโต้วาที"}
{"word": "assignment", "english": "She’s excited about her photography assignment.", "thai": "เธอตื่นเต้นกับงานถ่ายภาพ"}
{"word": "assignment", "english": "The assignment was to code an app.", "thai": "งานคือการเขียนโค้ดแอป"}
{"word": "assignment", "english": "I’m revising my assignment based on feedback.", "thai": "ฉันกำลังแก้ไขงานตามคำแนะนำ"}
{"word": "assignment", "english": "The assignment is to write a review.", "thai": "งานคือการเขียนบทวิจารณ์"}
{"word": "assignment", "english": "He’s working on his statistics assignment.", "thai": "เขากำลังทำงานสถิติ"}
{"word": "assignment", "english": "The assignment was to interview someone.", "thai": "งานคือการสัมภาษณ์ใครสักคน"}
{"word": "assignment", "english": "I’m submitting my assignment online.", "thai": "ฉันกำลังส่งงานออนไลน์"}
{"word": "assignment", "english": "The assignment requires a field trip.", "thai": "งานนี้ต้องไปทัศนศึกษา"}
{"word": "assignment", "english": "She’s presenting her assignment tomorrow.", "thai": "เธอกำลังนำเสนองานพรุ่งนี้"}
{"word": "assignment", "english": "The assignment was to map a process.", "thai": "งานคือการทำแผนที่กระบวนการ"}
{"word": "assignment", "english": "I’m asking for clarification on the assignment.", "thai": "ฉันกำลังขอคำชี้แจงเกี่ยวกับงาน"}
{"word": "assignment", "english": "The assignment is to design a website.", "thai": "งานคือการออกแบบเว็บไซต์"}
{"word": "assignment", "english": "He’s proud of his engineering assignment.", "thai": "เขาภูมิใจกับงานวิศวกรรม"}
{"word": "assignment", "english": "The assignment was to translate a text.", "thai": "งานคือการแปลข้อความ"}
{"word": "assignment", "english": "I’m finishing my anthropology assignment.", "thai": "ฉันกำลังทำการบ้านมานุษยวิทยาให้เสร็จ"}
{"word": "assignment", "english": "The assignment is to write a proposal.", "thai": "งานคือการเขียนข้อเสนอ"}
{"word": "assignment", "english": "She’s collaborating on her drama assignment.", "thai": "เธอกำลังทำงานกลุ่มวิชาละคร"}
{"word": "auditorium", "english": "The school play is happening in the auditorium tonight.", "thai": "การแสดงของโรงเรียนจะจัดขึ้นในหอประชุมคืนนี้"}
{"word": "auditorium", "english": "We gathered in the auditorium for the assembly.", "thai": "เรารวมตัวกันในหอประชุมเพื่อการชุมนุม"}
{"word": "auditorium", "english": "The lecture will take place in the main auditorium.", "thai": "การบรรยายจะจัดขึ้นในหอประชุมหลัก"}
{"word": "auditorium", "english": "The auditorium was packed for the concert.", "thai": "หอประชุมแน่นไปด้วยผู้คนสำหรับคอนเสิร์ต"}
{"word": "auditorium", "english": "She’s rehearsing her speech in the auditorium.", "thai": "เธอกำลังซ้อมการพูดในหอประชุม"}
{"word": "auditorium", "english": "The auditorium seats over 500 people.", "thai": "หอประชุมมีที่นั่งมากกว่า 500 ที่"}
{"word": "auditorium", "english": "They’re setting up the auditorium for the event.", "thai": "พวกเขากำลังจัดเตรียมหอประชุมสำหรับงาน"}
{"word": "auditorium", "english": "The debate team is practicing in the auditorium.", "thai": "ทีมโต้วาทีกำลังฝึกซ้อมในหอประชุม"}
{"word": "auditorium", "english": "The auditorium has great acoustics for music.", "thai": "หอประชุมมีอะคูสติกที่ดีสำหรับดนตรี"}
{"word": "auditorium", "english": "I left my jacket in the auditorium yesterday.", "thai": "ฉันลืมแจ็คเก็ตไว้ในหอประชุมเมื่อวาน"}
{"word": "auditorium", "english": "The guest speaker will present in the auditorium.", "thai": "วิทยากรรับเชิญจะนำเสนอในหอประชุม"}
{"word": "auditorium", "english": "The auditorium was decorated for the ceremony.", "thai": "หอประชุมถูกตกแต่งสำหรับพิธี"}
{"word": "auditorium", "english": "We’re meeting in the auditorium before the trip.", "thai": "เราจะพบกันในหอประชุมก่อนการเดินทาง"}
{"word": "auditorium", "english": "The auditorium is booked for a film screening.", "thai": "หอประชุมถูกจองสำหรับการฉายภาพยนตร์"}
{"word": "auditorium", "english": "The choir performed beautifully in the auditorium.", "thai": "คณะนักร้องประสานเสียงแสดงได้อย่างสวยงามในหอประชุม"}
{"word": "auditorium", "english": "The auditorium lights dimmed for the play.", "thai": "ไฟในหอประชุมถูกทำให้มืดลงสำหรับการแสดง"}
{"word": "auditorium", "english": "They’re upgrading the auditorium’s sound system.", "thai": "พวกเขากำลังอัปเกรดระบบเสียงของหอประชุม"}
{"word": "auditorium", "english": "The science fair is held in the auditorium.", "thai": "งานนิทรรศการวิทยาศาสตร์จัดขึ้นในหอประชุม"}
{"word": "auditorium", "english": "I got lost trying to find the auditorium.", "thai": "ฉันหลงทางขณะพยายามหาหอประชุม"}
{"word": "auditorium", "english": "The auditorium was too cold during the event.", "thai": "หอประชุมหนาวเกินไประหว่างงาน"}
{"word": "auditorium", "english": "The talent show is scheduled in the auditorium.", "thai": "การแสดงความสามารถถูกกำหนดให้จัดในหอประชุม"}
{"word": "auditorium", "english": "She’s directing a play in the auditorium.", "thai": "เธอกำลังกำกับการแสดงในหอประชุม"}
{"word": "auditorium", "english": "The auditorium is used for school assemblies.", "thai": "หอประชุมถูกใช้สำหรับการชุมนุมของโรงเรียน"}
{"word": "auditorium", "english": "We’re holding a workshop in the auditorium.", "thai": "เรากำลังจัดประชุมเชิงปฏิบัติการในหอประชุม"}
{"word": "auditorium", "english": "The auditorium was full for the graduation.", "thai": "หอประชุมเต็มไปด้วยผู้คนสำหรับงานรับปริญญา"}
{"word": "auditorium", "english": "They’re painting the auditorium this summer.", "thai": "พวกเขากำลังทาสีหอประชุมในช่วงฤดูร้อนนี้"}
{"word": "auditorium", "english": "The band practiced in the auditorium all week.", "thai": "วงดนตรีซ้อมในหอประชุมตลอดทั้งสัปดาห์"}
{"word": "auditorium", "english": "The auditorium has a new projector system.", "thai": "หอประชุมมีระบบโปรเจคเตอร์ใหม่"}
{"word": "auditorium", "english": "The keynote speech was in the auditorium.", "thai": "การปราศรัยหลักจัดขึ้นในหอประชุม"}
{"word": "auditorium", "english": "The auditorium doors open at 6 PM.", "thai": "ประตูหอประชุมเปิดตอน 6 โมงเย็น"}
{"word": "auditorium", "english": "We watched a documentary in the auditorium.", "thai": "เราดูสารคดีในหอประชุม"}
{"word": "auditorium", "english": "The auditorium is reserved for the conference.", "thai": "หอประชุมถูกจองสำหรับการประชุม"}
{"word": "auditorium", "english": "The drama club is performing in the auditorium.", "thai": "ชมรมละครกำลังแสดงในหอประชุม"}
{"word": "auditorium", "english": "The auditorium was renovated last year.", "thai": "หอประชุมได้รับการปรับปรุงเมื่อปีที่แล้ว"}
{"word": "auditorium", "english": "They’re testing the lights in the auditorium.", "thai": "พวกเขากำลังทดสอบไฟในหอประชุม"}
{"word": "auditorium", "english": "The auditorium is too big for small events.", "thai": "หอประชุมใหญ่เกินไปสำหรับงานเล็กๆ"}
{"word": "auditorium", "english": "I’m helping set up chairs in the auditorium.", "thai": "ฉันกำลังช่วยจัดเก้าอี้ในหอประชุม"}
{"word": "auditorium", "english": "The award ceremony is in the auditorium.", "thai": "พิธีมอบรางวัลจัดขึ้นในหอประชุม"}
{"word": "auditorium", "english": "The auditorium was quiet before the speech.", "thai": "หอประชุมเงียบก่อนการปราศรัย"}
{"word": "auditorium", "english": "We’re filming a video in the auditorium.", "thai": "เรากำลังถ่ายวิดีโอในหอประชุม"}
{"word": "auditorium", "english": "The auditorium stage needs repairs.", "thai": "เวทีหอประชุมต้องการการซ่อมแซม"}
{"word": "auditorium", "english": "The guest lecture is in the auditorium.", "thai": "การบรรยายจากวิทยากรรับเชิญจัดในหอประชุม"}
{"word": "auditorium", "english": "The auditorium was filled with excited students.", "thai": "หอประชุมเต็มไปด้วยนักเรียนที่ตื่นเต้น"}
{"word": "auditorium", "english": "They’re cleaning the auditorium after the event.", "thai": "พวกเขากำลังทำความสะอาดหอประชุมหลังงาน"}
{"word": "auditorium", "english": "The auditorium has a new soundboard.", "thai": "หอประชุมมีแผงควบคุมเสียงใหม่"}
{"word": "auditorium", "english": "The play rehearsal is in the auditorium.", "thai": "การซ์อมการแสดงจัดขึ้นในหอประชุม"}
{"word": "auditorium", "english": "The auditorium is perfect for large gatherings.", "thai": "หอประชุมเหมาะสำหรับการรวมตัวขนาดใหญ่"}
{"word": "auditorium", "english": "We’re decorating the auditorium for prom.", "thai": "เรากำลังตกแต่งหอประชุมสำหรับงานพรอม"}
{"word": "auditorium", "english": "The auditorium was used for a town hall.", "thai": "หอประชุมถูกใช้สำหรับการประชุมชุมชน"}
{"word": "auditorium", "english": "The orchestra performed in the auditorium.", "thai": "วงออร์เคสตราแสดงในหอประชุม"}
{"word": "auditorium", "english": "The auditorium is closed for maintenance.", "thai": "หอประชุมปิดเพื่อบำรุงรักษา"}
{"word": "auditorium", "english": "I’m giving a talk in the auditorium tomorrow.", "thai": "ฉันจะพูดในหอประชุมพรุ่งนี้"}
{"word": "auditorium", "english": "The auditorium was crowded for the recital.", "thai": "หอประชุมแน่นไปด้วยผู้คนสำหรับการแสดงเดี่ยว"}
{"word": "auditorium", "english": "They’re installing new seats in the auditorium.", "thai": "พวกเขากำลังติดตั้งเก้าอี้ใหม่ในหอประชุม"}
{"word": "auditorium", "english": "The auditorium is available for rent.", "thai": "หอประชุมสามารถเช่าได้"}
{"word": "auditorium", "english": "The speech class meets in the auditorium.", "thai": "ชั้นเรียนการพูดพบกันในหอประชุม"}
{"word": "auditorium", "english": "The auditorium has a large screen for presentations.", "thai": "หอประชุมมีหน้าจอขนาดใหญ่สำหรับการนำเสนอ"}
{"word": "auditorium", "english": "We’re holding a fundraiser in the auditorium.", "thai": "เรากำลังจัดงานระดมทุนในหอประชุม"}
{"word": "auditorium", "english": "The auditorium was noisy before the event.", "thai": "หอประชุมมีเสียงดังก่อนงาน"}
{"word": "auditorium", "english": "The dance recital is in the auditorium.", "thai": "การแสดงเต้นรำจัดในหอประชุม"}
{"word": "auditorium", "english": "The auditorium’s stage is huge.", "thai": "เวทีของหอประชุมใหญ่มาก"}
{"word": "auditorium", "english": "They’re testing the auditorium’s microphones.", "thai": "พวกเขากำลังทดสอบไมโครโฟนของหอประชุม"}
{"word": "auditorium", "english": "The auditorium is where we hold pep rallies.", "thai": "หอประชุมเป็นสถานที่จัดงานเชียร์"}
{"word": "auditorium", "english": "The club meeting is in the auditorium.", "thai": "การประชุมชมรมจัดในหอประชุม"}
{"word": "auditorium", "english": "The auditorium was too warm during the show.", "thai": "หอประชุมร้อนเกินไประหว่างการแสดง"}
{"word": "auditorium", "english": "We’re setting up a projector in the auditorium.", "thai": "เรากำลังติดตั้งโปรเจคเตอร์ในหอประชุม"}
{"word": "auditorium", "english": "The auditorium is used for community events.", "thai": "หอประชุมถูกใช้สำหรับงานชุมชน"}
{"word": "auditorium", "english": "The lecture series starts in the auditorium.", "thai": "ชุดการบรรยายเริ่มในหอประชุม"}
{"word": "auditorium", "english": "The auditorium was filled with applause.", "thai": "หอประชุมเต็มไปด้วยเสียงปรบมือ"}
{"word": "auditorium", "english": "They’re repairing the auditorium’s ceiling.", "thai": "พวกเขากำลังซ่อมเพดานของหอประชุม"}
{"word": "auditorium", "english": "The auditorium is booked all week.", "thai": "หอประชุมถูกจองตลอดทั้งสัปดาห์"}
{"word": "auditorium", "english": "The play was a hit in the auditorium.", "thai": "การแสดงได้รับความนิยมในหอประชุม"}
{"word": "auditorium", "english": "The auditorium has new curtains.", "thai": "หอประชุมมีผ้าม่านใหม่"}
{"word": "auditorium", "english": "We’re practicing our skit in the auditorium.", "thai": "เรากำลังซ้อมละครสั้นในห오ประชุม"}
{"word": "auditorium", "english": "The auditorium is perfect for large lectures.", "thai": "หอประชุมเหมาะสำหรับการบรรยายขนาดใหญ่"}
{"word": "auditorium", "english": "The talent show rehearsal is in the auditorium.", "thai": "การซ้อมแสดงความสามารถจัดในหอประชุม"}
{"word": "auditorium", "english":Coe "The auditorium was silent during the speech.", "thai": "หอประชุมเงียบสนิทระหว่างการปราศรัย"}
{"word": "auditorium", "english": "They’re hosting a panel in the auditorium.", "thai": "พวกเขากำลังจัดอภิปรายในหอประชุม"}
{"word": "auditorium", "english": "The auditorium is near the main entrance.", "thai": "หอประชุมอยู่ใกล้ทางเข้าหลัก"}
{"word": "auditorium", "english": "The school band performs in the auditorium.", "thai": "วงดนตรีโรงเรียนแสดงในหอประชุม"}
{"word": "auditorium", "english": "The auditorium was used for a charity event.", "thai": "หอประชุมถูกใช้สำหรับงานการกุศล"}
{"word": "auditorium", "english": "We’re setting up tables in the auditorium.", "thai": "เรากำลังจัดโต๊ะในหอประชุม"}
{"word": "auditorium", "english": "The auditorium is where the debate is held.", "thai": "หอประชุมเป็นสถานที่จัดโต้วาที"}
{"word": "auditorium", "english": "The auditorium’s floor was just polished.", "thai": "พื้นของหอประชุมเพิ่งถูกขัดเงา"}
{"word": "auditorium", "english": "The presentation is scheduled in the auditorium.", "thai": "การนำเสนอถูกกำหนดให้จัดในหอประชุม"}
{"word": "auditorium", "english": "The auditorium was too dark during the event.", "thai": "หอประชุมมืดเกินไประหว่างงาน"}
{"word": "auditorium", "english": "We’re holding a seminar in the auditorium.", "thai": "เรากำลังจัดสัมมนาในหอประชุม"}
{"word": "auditorium", "english": "The auditorium is equipped for live streaming.", "thai": "หอประชุมมีอุปกรณ์สำหรับการถ่ายทอดสด"}
{"word": "auditorium", "english": "The drama performance is in the auditorium.", "thai": "การแสดงละครจัดในหอประชุม"}
{"word": "auditorium", "english": "The auditorium was buzzing with excitement.", "thai": "หอประชุมเต็มไปด้วยความตื่นเต้น"}
{"word": "auditorium", "english": "They’re updating the auditorium’s lighting.", "thai": "พวกเขากำลังอัปเดตระบบไฟของหอประชุม"}
{"word": "auditorium", "english": "The auditorium is used for school plays.", "thai": "หอประชุมถูกใช้สำหรับการแสดงของโรงเรียน"}
{"word": "auditorium", "english": "The orientation session is in the auditorium.", "thai": "เซสชันปฐมนิเทศจัดในหอประชุม"}
{"word": "auditorium", "english": "The auditorium was packed for the talent show.", "thai": "หอประชุมแน่นไปด้วยผู้คนสำหรับการแสดงความสามารถ"}
{"word": "auditorium", "english": "We’re rehearsing our lines in the auditorium.", "thai": "เรากำลังซ้อมบทในหอประชุม"}
{"word": "auditorium", "english": "The auditorium is the heart of school events.", "thai": "หอประชุมเป็นหัวใจของงานโรงเรียน"}
{"word": "auditorium", "english": "The lecture hall and auditorium are connected.", "thai": "หอประชุมและห้องบรรยายเชื่อมต่อกัน"}
{"word": "auditorium", "english": "The auditorium was cleaned after the show.", "thai": "หอประชุมถูกทำความสะอาดหลังการแสดง"}
{"word": "auditorium", "english": "The auditorium is where we hold recitals.", "thai": "หอประชุมเป็นสถานที่จัดงานแสดงเดี่ยว"}
{"word": "bibliography", "english": "I need to finish the bibliography for my essay.", "thai": "ฉันต้องทำบรรณานุกรมสำหรับเรียงความให้เสร็จ"}
{"word": "bibliography", "english": "The professor asked for a detailed bibliography.", "thai": "ศาสตราจารย์ขอให้ทำบรรณานุกรมที่ละเอียด"}
{"word": "bibliography", "english": "She spent hours formatting her bibliography.", "thai": "เธอใช้เวลาหลายชั่วโมงในการจัดรูปแบบบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography is missing a few sources.", "thai": "บรรณานุกรมขาดแหล่งข้อมูลบางส่วน"}
{"word": "bibliography", "english": "I’m checking the bibliography for errors.", "thai": "ฉันกำลังตรวจสอบบรรณานุกรมหาข้อผิดพลาด"}
{"word": "bibliography", "english": "The assignment requires a full bibliography.", "thai": "งานนี้ต้องมีบรรณานุกรมครบถ้วน"}
{"word": "bibliography", "english": "He forgot to include a bibliography in his paper.", "thai": "เขาลืมใส่บรรณานุกรมในเอกสารของเขา"}
{"word": "bibliography", "english": "The bibliography helped me find more sources.", "thai": "บรรณานุกรมช่วยฉันหาแหล่งข้อมูลเพิ่มเติม"}
{"word": "bibliography", "english": "She’s compiling a bibliography for her thesis.", "thai": "เธอกำลังรวบรวมบรรณานุกรมสำหรับวิทยานิพนธ์"}
{"word": "bibliography", "english": "The bibliography must follow APA style.", "thai": "บรรณานุกรมต้องเป็นไปตามรูปแบบ APA"}
{"word": "bibliography", "english": "I added three books to my bibliography.", "thai": "ฉันเพิ่มหนังสือสามเล่มในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography is at the end of the report.", "thai": "บรรณานุกรมอยู่ท้ายรายงาน"}
{"word": "bibliography", "english": "He’s struggling with his bibliography citations.", "thai": "เขากำลังมีปัญหากับการอ้างอิงในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography needs to be alphabetized.", "thai": "บรรณานุกรมต้องจัดเรียงตามตัวอักษร"}
{"word": "bibliography", "english": "She reviewed the bibliography for accuracy.", "thai": "เธอตรวจสอบบรรณานุกรมเพื่อความถูกต้อง"}
{"word": "bibliography", "english": "The bibliography includes online articles.", "thai": "บรรณานุกรมรวมถึงบทความออนไลน์"}
{"word": "bibliography", "english": "I’m using a tool to generate my bibliography.", "thai": "ฉันใช้เครื่องมือในการสร้างบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography took longer than the essay.", "thai": "บรรณานุกรมใช้เวลานานกว่าเรียงความ"}
{"word": "bibliography", "english": "He submitted his paper without a bibliography.", "thai": "เขาส่งเอกสารโดยไม่มีบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography has ten scholarly sources.", "thai": "บรรณานุกรมมีแหล่งข้อมูลทางวิชาการสิบแหล่ง"}
{"word": "bibliography", "english": "She’s updating her bibliography with new sources.", "thai": "เธอกำลังอัปเดตบรรณานุกรมด้วยแหล่งข้อมูลใหม่"}
{"word": "bibliography", "english": "The bibliography is worth 10% of the grade.", "thai": "บรรณานุกรมมีค่าน้ำหนัก 10% ของคะแนน"}
{"word": "bibliography", "english": "I need help formatting my bibliography.", "thai": "ฉันต้องการความช่วยเหลือในการจัดรูปแบบบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography lists all my references.", "thai": "บรรณานุกรมระบุแหล่งอ้างอิงทั้งหมดของฉัน"}
{"word": "bibliography", "english": "He’s double-checking his bibliography entries.", "thai": "เขากำลังตรวจสอบรายการในบรรณานุกรมอีกครั้ง"}
{"word": "bibliography", "english": "The bibliography follows MLA guidelines.", "thai": "บรรณานุกรมเป็นไปตามแนวทาง MLA"}
{"word": "bibliography", "english": "She included a bibliography with her project.", "thai": "เธอใส่บรรณานุกรมในโปรเจกต์ของเธอ"}
{"word": "bibliography", "english": "The bibliography was the hardest part.", "thai": "บรรณานุกรมเป็นส่วนที่ยากที่สุด"}
{"word": "bibliography", "english": "I’m citing a website in my bibliography.", "thai": "ฉันกำลังอ้างอิงเว็บไซต์ในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography needs more primary sources.", "thai": "บรรณานุกรมต้องการแหล่งข้อมูลปฐมภูมิมากกว่านี้"}
{"word": "bibliography", "english": "He’s organizing his bibliography by author.", "thai": "เขากำลังจัดระเบียบบรรณานุกรมตามผู้เขียน"}
{"word": "bibliography", "english": "The bibliography is due with the final draft.", "thai": "บรรณานุกรมต้องส่งพร้อมร่างสุดท้าย"}
{"word": "bibliography", "english": "She’s adding journal articles to her bibliography.", "thai": "เธอกำลังเพิ่มบทความวารสารในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography helped me track my sources.", "thai": "บรรณานุกรมช่วยฉันติดตามแหล่งข้อมูล"}
{"word": "bibliography", "english": "I forgot how to cite a book in the bibliography.", "thai": "ฉันลืมวิธีอ้างอิงหนังสือในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography is formatted perfectly.", "thai": "บรรณานุกรมถูกจัดรูปแบบอย่างสมบูรณ์"}
{"word": "bibliography", "english": "He’s reviewing the bibliography for plagiarism.", "thai": "เขากำลังตรวจสอบบรรณานุกรมเพื่อหาการคัดลอก"}
{"word": "bibliography", "english": "The bibliography includes five academic books.", "thai": "บรรณานุกรมรวมถึงหนังสือวิชาการห้าเล่ม"}
{"word": "bibliography", "english": "She’s struggling with her bibliography software.", "thai": "เธอกำลังมีปัญหากับซอฟต์แวร์บรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography needs to be in Chicago style.", "thai": "บรรณานุกรมต้องเป็นรูปแบบ Chicago"}
{"word": "bibliography", "english": "I’m working on the bibliography tonight.", "thai": "ฉันกำลังทำงานบรรณานุกรมคืนนี้"}
{"word": "bibliography", "english": "The bibliography is longer than my paper!", "thai": "บรรณานุกรมยาวกว่าเอกสารของฉัน!"}
{"word": "bibliography", "english": "He’s adding a source to his bibliography.", "thai": "เขากำลังเพิ่มแหล่งข้อมูลในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography was checked by the professor.", "thai": "บรรณานุกรมถูกตรวจโดยศาสตราจารย์"}
{"word": "bibliography", "english": "She’s citing interviews in her bibliography.", "thai": "เธอกำลังอ้างอิงการสัมภาษณ์ในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography is part of the final project.", "thai": "บรรณานุกรมเป็นส่วนหนึ่งของโปรเจกต์สุดท้าย"}
{"word": "bibliography", "english": "I need to shorten my bibliography.", "thai": "ฉันต้องย่อบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography includes peer-reviewed articles.", "thai": "บรรณานุกรมรวมถึงบทความที่ผ่านการทบทวนโดยเพื่อน"}
{"word": "bibliography", "english": "He’s learning how to create a bibliography.", "thai": "เขากำลังเรียนรู้วิธีสร้างบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography is typed in a separate document.", "thai": "บรรณานุกรมถูกพิมพ์ในเอกสารแยก"}
{"word": "bibliography", "english": "She’s using a template for her bibliography.", "thai": "เธอกำลังใช้เทมเพลตสำหรับบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography cites historical documents.", "thai": "บรรณานุกรมอ้างอิงเอกสารประวัติศาสตร์"}
{"word": "bibliography", "english": "I’m revising my bibliography based on feedback.", "thai": "ฉันกำลังแก้ไขบรรณานุกรมตามคำแนะนำ"}
{"word": "bibliography", "english": "The bibliography is required for the presentation.", "thai": "บรรณานุกรมจำเป็นสำหรับการนำเสนอ"}
{"word": "bibliography", "english": "He’s formatting his bibliography in MLA style.", "thai": "เขากำลังจัดรูปแบบบรรณานุกรมในรูปแบบ MLA"}
{"word": "bibliography", "english": "The bibliography lists all the books I read.", "thai": "บรรณานุกรมระบุหนังสือทั้งหมดที่ฉันอ่าน"}
{"word": "bibliography", "english": "She’s checking her bibliography for missing details.", "thai": "เธอกำลังตรวจสอบบรรณานุกรมหาข้อมูลที่ขาดหาย"}
{"word": "bibliography", "english": "The bibliography was submitted with the essay.", "thai": "บรรณานุกรมถูกส่งพร้อมเรียงความ"}
{"word": "bibliography", "english": "I’m adding a journal to my bibliography.", "thai": "ฉันกำลังเพิ่มวารสารในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography needs to be double-spaced.", "thai": "บรรณานุกรมต้องเว้นวรรคสองเท่า"}
{"word": "bibliography", "english": "He’s proud of his detailed bibliography.", "thai": "เขาภูมิใจกับบรรณานุกรมที่ละเอียดของเขา"}
{"word": "bibliography", "english": "The bibliography includes primary and secondary sources.", "thai": "บรรณานุกรมรวมถึงแหล่งข้อมูลปฐมภูมิและทุติยภูมิ"}
{"word": "bibliography", "english": "She’s working on a bibliography for her research.", "thai": "เธอกำลังทำบรรณานุกรมสำหรับการวิจัยของเธอ"}
{"word": "bibliography", "english": "The bibliography is almost complete.", "thai": "บรรณานุกรมใกล้เสร็จสมบูรณ์"}
{"word": "bibliography", "english": "I need to cite a video in my bibliography.", "thai": "ฉันต้องอ้างอิงวิดีโอในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography was graded separately.", "thai": "บรรณานุกรมถูกให้คะแนนแยก"}
{"word": "bibliography", "english": "He’s using EndNote for his bibliography.", "thai": "เขากำลังใช้ EndNote สำหรับบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography includes ten journal articles.", "thai": "บรรณานุกรมรวมถึงบทความวารสารสิบบทความ"}
{"word": "bibliography", "english": "She’s organizing her bibliography by publication date.", "thai": "เธอกำลังจัดระเบียบบรรณานุกรมตามวันที่ตีพิมพ์"}
{"word": "bibliography", "english": "The bibliography is part of the research paper.", "thai": "บรรณานุกรมเป็นส่วนหนึ่งของเอกสารวิจัย"}
{"word": "bibliography", "english": "I’m checking the bibliography for proper citations.", "thai": "ฉันกำลังตรวจสอบบรรณานุกรมสำหรับการอ้างอิงที่ถูกต้อง"}
{"word": "bibliography", "english": "The bibliography needs more academic sources.", "thai": "บรรณานุกรมต้องการแหล่งข้อมูลวิชาการมากกว่านี้"}
{"word": "bibliography", "english": "He’s adding a website to his bibliography.", "thai": "เขากำลังเพิ่มเว็บไซต์ในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography is formatted in APA style.", "thai": "บรรณานุกรมถูกจัดรูปแบบในสไตล์ APA"}
{"word": "bibliography", "english": "She’s submitting her bibliography tomorrow.", "thai": "เธอกำลังจะส่งบรรณานุกรมพรุ่งนี้"}
{"word": "bibliography", "english": "The bibliography includes a rare manuscript.", "thai": "บรรณานุกรมรวมถึงต้นฉบับที่หายาก"}
{"word": "bibliography", "english": "I’m struggling with my bibliography entries.", "thai": "ฉันกำลังมีปัญหากับรายการในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography was praised by the teacher.", "thai": "บรรณานุกรมได้รับคำชมจากครู"}
{"word": "bibliography", "english": "He’s citing a podcast in his bibliography.", "thai": "เขากำลังอ้างอิงพอดแคสต์ในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography is required for the project.", "thai": "บรรณานุกรมจำเป็นสำหรับโปรเจกต์"}
{"word": "bibliography", "english": "She’s using Zotero for her bibliography.", "thai": "เธอกำลังใช้ Zotero สำหรับบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography lists all my research sources.", "thai": "บรรณานุกรมระบุแหล่งวิจัยทั้งหมดของฉัน"}
{"word": "bibliography", "english": "I’m finalizing my bibliography tonight.", "thai": "ฉันกำลังสรุปบรรณานุกรมคืนนี้"}
{"word": "bibliography", "english": "The bibliography includes government reports.", "thai": "บรรณานุกรมรวมถึงรายงานของรัฐบาล"}
{"word": "bibliography", "english": "He’s checking his bibliography for formatting.", "thai": "เขากำลังตรวจสอบบรรณานุกรมสำหรับการจัดรูปแบบ"}
{"word": "bibliography", "english": "The bibliography is part of the assignment.", "thai": "บรรณานุกรมเป็นส่วนหนึ่งของงาน"}
{"word": "bibliography", "english": "She’s adding an encyclopedia to her bibliography.", "thai": "เธอกำลังเพิ่มสารานุกรมในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography needs to be in Turabian style.", "thai": "บรรณานุกรมต้องเป็นรูปแบบ Turabian"}
{"word": "bibliography", "english": "I’m printing my bibliography for submission.", "thai": "ฉันกำลังพิมพ์บรรณานุกรมเพื่อส่ง"}
{"word": "bibliography", "english": "The bibliography was completed last night.", "thai": "บรรณานุกรมเสร็จสมบูรณ์เมื่อคืน"}
{"word": "bibliography", "english": "He’s citing a lecture in his bibliography.", "thai": "เขากำลังอ้างอิงการบรรยายในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography includes annotated sources.", "thai": "บรรณานุกรมรวมถึงแหล่งข้อมูลที่มีคำอธิบาย"}
{"word": "bibliography", "english": "She’s working on her bibliography citations.", "thai": "เธอกำลังทำงานเกี่ยวกับการอ้างอิงในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography is essential for the paper.", "thai": "บรรณานุกรมสำคัญสำหรับเอกสาร"}
{"word": "bibliography", "english": "I’m adding a newspaper article to my bibliography.", "thai": "ฉันกำลังเพิ่มบทความหนังสือพิมพ์ในบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography was well-organized.", "thai": "บรรณานุกรมถูกจัดระเบียบอย่างดี"}
{"word": "bibliography", "english": "He’s using a citation manager for his bibliography.", "thai": "เขากำลังใช้ตัวจัดการการอ้างอิงสำหรับบรรณานุกรม"}
{"word": "bibliography", "english": "The bibliography includes diverse sources.", "thai": "บรรณานุกรมรวมถึงแหล่งข้อมูลที่หลากหลาย"}
{"word": "bibliography", "english": "She’s finalizing her bibliography for the thesis.", "thai": "เธอกำลังสรุปบรรณานุกรมสำหรับวิทยานิพนธ์"}
{"word": "bibliography", "english": "The bibliography was a lot of work.", "thai": "บรรณานุกรมต้องใช้ความพยายามมาก"}
{"word": "campus", "english": "I’m meeting friends on campus after class.", "thai": "ฉันจะพบเพื่อนที่มหาวิทยาลัยหลังเลิกเรียน"}
{"word": "campus", "english": "The campus is beautiful in the fall.", "thai": "มหาวิทยาลัยสวยงามในฤดูใบไม้ร่วง"}
{"word": "campus", "english": "She lives in a dorm on campus.", "thai": "เธออาศัยอยู่ในหอพักในมหาวิทยาลัย"}
{"word": "campus", "english": "The library on campus is open late.", "thai": "ห้องสมุดในมหาวิทยาลัยเปิดถึงดึก"}
{"word": "campus", "english": "I got lost on campus during orientation.", "thai": "ฉันหลงทางในมหาวิทยาลัยตอนปฐมนิเทศ"}
{"word": "campus", "english": "The campus cafeteria has great food.", "thai": "โรงอาหารในมหาวิทยาลัยมีอาหารอร่อย"}
{"word": "campus", "english": "There’s a big event on campus this weekend.", "thai": "มีงานใหญ่ในมหาวิทยาลัยสุดสัปดาห์นี้"}
{"word": "campus", "english": "He’s giving a talk on campus tomorrow.", "thai": "เขาจะพูดในมหาวิทยาลัยพรุ่งนี้"}
{"word": "campus", "english": "The campus gym is always crowded.", "thai": "โรงยิมในมหาวิทยาลัยมักจะแออัด"}
{"word": "campus", "english": "I’m taking a shortcut through campus.", "thai": "ฉันกำลังใช้ทางลัดผ่านมหาวิทยาลัย"}
{"word": "campus", "english": "The campus bookstore sells cool merch.", "thai": "ร้านหนังสือในมหาวิทยาลัยขายของที่ระลึกเจ๋งๆ"}
{"word": "campus", "english": "She’s studying in the campus coffee shop.", "thai": "เธอกำลังเรียนอยู่ในร้านกาแฟในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is quiet during the summer.", "thai": "มหาวิทยาลัยเงียบสงบในช่วงฤดูร้อน"}
{"word": "campus", "english": "I parked my car on campus this morning.", "thai": "ฉันจอดรถในมหาวิทยาลัยเช้านี้"}
{"word": "campus", "english": "The club fair is happening on campus.", "thai": "งานแสดงชมรมจัดขึ้นในมหาวิทยาลัย"}
{"word": "campus", "english": "He’s running for student government on campus.", "thai": "เขากำลังลงสมัครสภานักเรียนในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus tour was really informative.", "thai": "ทัวร์มหาวิทยาลัยให้ข้อมูลมาก"}
{"word": "campus", "english": "I’m volunteering at the campus food drive.", "thai": "ฉันกำลังเป็นอาสาสมัครในงานบริจาคอาหารของมหาวิทยาลัย"}
{"word": "campus", "english": "The campus has free Wi-Fi everywhere.", "thai": "มหาวิทยาลัยมี Wi-Fi ฟรีทุกที่"}
{"word": "campus", "english": "She’s organizing an event on campus.", "thai": "เธอกำลังจัดงานในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is huge and easy to get lost in.", "thai": "มหาวิทยาลัยกว้างใหญ่และง่ายต่อการหลงทาง"}
{"word": "campus", "english": "I’m grabbing lunch at the campus dining hall.", "thai": "ฉันกำลังไปกินข้าวเที่ยงที่โรงอาหารในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus shuttle is always late.", "thai": "รถรับส่งในมหาวิทยาลัยมักจะมาสาย"}
{"word": "campus", "english": "They’re building a new dorm on campus.", "thai": "พวกเขากำลังสร้างหอพักใหม่ในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is lively during homecoming week.", "thai": "มหาวิทยาลัยคึกคักในสัปดาห์งานคืนสู่เหย้า"}
{"word": "campus", "english": "I’m studying in the campus library tonight.", "thai": "ฉันจะเรียนในห้องสมุดมหาวิทยาลัยคืนนี้"}
{"word": "campus", "english": "The campus has a great fitness center.", "thai": "มหาวิทยาลัยมีศูนย์ออกกำลังกายที่ยอดเยี่ยม"}
{"word": "campus", "english": "She’s performing in a play on campus.", "thai": "เธอกำลังแสดงละครในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is covered in snow today.", "thai": "มหาวิทยาลัยถูกปกคลุมด้วยหิมะวันนี้"}
{"word": "campus", "english": "I’m attending a lecture on campus later.", "thai": "ฉันจะไปฟังการบรรยายในมหาวิทยาลัยภายหลัง"}
{"word": "campus", "english": "The campus club meeting is after class.", "thai": "การประชุมชมรมในมหาวิทยาลัยจัดหลังเลิกเรียน"}
{"word": "campus", "english": "He’s biking across campus to his next class.", "thai": "เขากำลังปั่นจักรยานข้ามมหาวิทยาลัยไปเรียนวิชาต่อไป"}
{"word": "campus", "english": "The campus is hosting a career fair.", "thai": "มหาวิทยาลัยกำลังจัดงานแสดงอาชีพ"}
{"word": "campus", "english": "I love the green spaces on campus.", "thai": "ฉันชอบพื้นที่สีเขียวในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus security is pretty strict.", "thai": "การรักษาความปลอดภัยในมหาวิทยาลัยค่อนข้างเข้มงวด"}
{"word": "campus", "english": "She’s working at the campus bookstore.", "thai": "เธอกำลังทำงานที่ร้านหนังสือในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is buzzing with new students.", "thai": "มหาวิทยาลัยเต็มไปด้วยความคึกคักจากนักศึกษาใหม่"}
{"word": "campus", "english": "I’m joining a study group on campus.", "thai": "ฉันกำลังเข้าร่วมกลุ่มศึกษาในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus has a new art exhibit.", "thai": "มหาวิทยาลัยมีนิทรรศการศิลปะใหม่"}
{"word": "campus", "english": "He’s leading a workshop on campus.", "thai": "เขากำลังนำการประชุมเชิงปฏิบัติการในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is closed for the holiday.", "thai": "มหาวิทยาลัยปิดในช่วงวันหยุด"}
{"word": "campus", "english": "I’m attending a concert on campus tonight.", "thai": "ฉันจะไปคอนเสิร์ตในมหาวิทยาลัยคืนนี้"}
{"word": "campus", "english": "The campus quad is great for relaxing.", "thai": "ลานในมหาวิทยาลัยเหมาะสำหรับการพักผ่อน"}
{"word": "campus", "english": "She’s running a club event on campus.", "thai": "เธอกำลังจัดงานชมรมในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus has a lot of parking issues.", "thai": "มหาวิทยาลัยมีปัญหาที่จอดรถเยอะ"}
{"word": "campus", "english": "I’m taking a class on the east campus.", "thai": "ฉันกำลังเรียนวิชาที่วิทยาเขตตะวันออก"}
{"word": "campus", "english": "The campus is decorated for the festival.", "thai": "มหาวิทยาลัยถูกตกแต่งสำหรับเทศกาล"}
{"word": "campus", "english": "He’s volunteering at the campus health center.", "thai": "เขากำลังเป็นอาสาสมัครที่ศูนย์สุขภาพในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is hosting a guest speaker.", "thai": "มหาวิทยาลัยกำลังต้อนรับวิทยากรรับเชิญ"}
{"word": "campus", "english": "I’m grabbing coffee on campus before class.", "thai": "ฉันกำลังซื้อกาแฟในมหาวิทยาลัยก่อนเข้าชั้นเรียน"}
{"word": "campus", "english": "The campus is huge compared to my high school.", "thai": "มหาวิทยาลัยใหญ่เมื่อเทียบกับโรงเรียนมัธยมของฉัน"}
{"word": "campus", "english": "She’s presenting her research on campus.", "thai": "เธอกำลังนำเสนองานวิจัยในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus has a new science building.", "thai": "มหาวิทยาลัยมีอาคารวิทยาศาสตร์ใหม่"}
{"word": "campus", "english": "I’m meeting my advisor on campus.", "thai": "ฉันจะพบที่ปรึกษาในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is quiet during finals week.", "thai": "มหาวิทยาลัยเงียบสงบในช่วงสัปดาห์สอบปลายภาค"}
{"word": "campus", "english": "He’s organizing a rally on campus.", "thai": "เขากำลังจัดชุมนุมในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus has a cool student lounge.", "thai": "มหาวิทยาลัยมีเลานจ์นักศึกษาที่เจ๋ง"}
{"word": "campus", "english": "I’m attending a seminar on campus.", "thai": "ฉันจะเข้าร่วมสัมมนาในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is offering free flu shots.", "thai": "มหาวิทยาลัยกำลังให้วัคซีนไข้หวัดใหญ่ฟรี"}
{"word": "campus", "english": "She’s taking photos on campus for a project.", "thai": "เธอกำลังถ่ายรูปในมหาวิทยาลัยสำหรับโปรเจกต์"}
{"word": "campus", "english": "The campus is near a great hiking trail.", "thai": "มหาวิทยาลัยอยู่ใกล้เส้นทางเดินป่าที่ดี"}
{"word": "campus", "english": "I’m joining a club on campus this semester.", "thai": "ฉันจะเข้าร่วมชมรมในมหาวิทยาลัยภาคเรียนนี้"}
{"word": "campus", "english": "The campus has a new recycling program.", "thai": "มหาวิทยาลัยมีโปรแกรมรีไซเคิลใหม่"}
{"word": "campus", "english": "He’s teaching a class on campus.", "thai": "เขากำลังสอนวิชาในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is hosting a film screening.", "thai": "มหาวิทยาลัยกำลังจัดฉายภาพยนตร์"}
{"word": "campus", "english": "I’m studying outside on campus today.", "thai": "ฉันกำลังเรียนข้างนอกในมหาวิทยาลัยวันนี้"}
{"word": "campus", "english": "The campus has a great theater program.", "thai": "มหาวิทยาลัยมีโปรแกรมละครที่ยอดเยี่ยม"}
{"word": "campus", "english": "She’s running across campus to make it to class.", "thai": "เธอกำลังวิ่งข้ามมหาวิทยาลัยเพื่อไปเรียนทัน"}
{"word": "campus", "english": "The campus is packed during orientation week.", "thai": "มหาวิทยาลัยแน่นไปด้วยผู้คนในสัปดาห์ปฐมนิเทศ"}
{"word": "campus", "english": "I’m helping with a fundraiser on campus.", "thai": "ฉันกำลังช่วยงานระดมทุนในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus has a new student center.", "thai": "มหาวิทยาลัยมีศูนย์นักศึกษาใหม่"}
{"word": "campus", "english": "He’s setting up for an event on campus.", "thai": "เขากำลังจัดเตรียมงานในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is offering free tutoring.", "thai": "มหาวิทยาลัยมีบริการสอนพิเศษฟรี"}
{"word": "campus", "english": "I’m attending a workshop on campus.", "thai": "ฉันจะเข้าร่วมการประชุมเชิงปฏิบัติการในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is beautiful at night.", "thai": "มหาวิทยาลัยสวยงามในตอนกลางคืน"}
{"word": "campus", "english": "She’s leading a tour on campus.", "thai": "เธอกำลังนำทัวร์ในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus has a new bike-sharing program.", "thai": "มหาวิทยาลัยมีโปรแกรมแบ่งปันจักรยานใหม่"}
{"word": "campus", "english": "I’m meeting my professor on campus.", "thai": "ฉันจะพบอาจารย์ในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is hosting a charity run.", "thai": "มหาวิทยาลัยกำลังจัดงานวิ่งการกุศล"}
{"word": "campus", "english": "He’s working in the campus IT department.", "thai": "เขากำลังทำงานในแผนกไอทีของมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is decorated for graduation.", "thai": "มหาวิทยาลัยถูกตกแต่งสำหรับงานรับปริญญา"}
{"word": "campus", "english": "I’m attending a poetry reading on campus.", "thai": "ฉันจะไปฟังการอ่านบทกวีในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus has a new sustainability initiative.", "thai": "มหาวิทยาลัยมีโครงการความยั่งยืนใหม่"}
{"word": "campus", "english": "She’s practicing for a play on campus.", "thai": "เธอกำลังซ้อมละครในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is offering free yoga classes.", "thai": "มหาวิทยาลัยมีคลาสโยคะฟรี"}
{"word": "campus", "english": "I’m volunteering at the campus blood drive.", "thai": "ฉันกำลังเป็นอาสาสมัครในงานบริจาคเลือดของมหาวิทยาลัย"}
{"word": "campus", "english": "The campus has a new lecture hall.", "thai": "มหาวิทยาลัยมีหอประชุมใหม่"}
{"word": "campus", "english": "He’s hosting a debate on campus.", "thai": "เขากำลังจัดโต้วาทีในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is near downtown.", "thai": "มหาวิทยาลัยอยู่ใกล้ตัวเมือง"}
{"word": "campus", "english": "I’m grabbing a snack on campus.", "thai": "ฉันกำลังซื้อของว่างในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is hosting an art festival.", "thai": "มหาวิทยาลัยกำลังจัดเทศกาลศิลปะ"}
{"word": "campus", "english": "She’s working in the campus admissions office.", "thai": "เธอกำลังทำงานในสำนักงานรับสมัครของมหาวิทยาลัย"}
{"word": "campus", "english": "The campus is quiet during spring break.", "thai": "มหาวิทยาลัยเงียบสงบในช่วงปิดเทอมฤดูใบไม้ผลิ"}
{"word": "campus", "english": "I’m attending a panel discussion on campus.", "thai": "ฉันจะเข้าร่วมการอภิปรายในมหาวิทยาลัย"}
{"word": "campus", "english": "The campus has a new outdoor study area.", "thai": "มหาวิทยาลัยมีพื้นที่เรียนกลางแจ้งใหม่"}
{"word": "campus", "english": "He’s performing music on campus tonight.", "thai": "เขากำลังแสดงดนตรีในมหาวิทยาลัยคืนนี้"}
{"word": "campus", "english": "The campus is hosting a science fair.", "thai": "มหาวิทยาลัยกำลังจัดนิทรรศการวิทยาศาสตร์"}
{"word": "campus", "english": "I’m exploring the campus with new students.", "thai": "ฉันกำลังสำรวจมหาวิทยาลัยกับนักศึกษาใหม่"}
{"word": "campus", "english": "The campus has a great community vibe.", "thai": "มหาวิทยาลัยมีบรรยากาศชุมชนที่ยอดเยี่ยม"}
{"word": "campus", "english": "She’s setting up for a club event on campus.", "thai": "เธอกำลังจัดเตรียมงานชมรมในมหาวิทยาลัย"}
{"word": "chancellor", "english": "The chancellor gave a speech at the graduation.", "thai": "อธิการบดีกล่าวสุนทรพจน์ในงานรับปริญญา"}
{"word": "chancellor", "english": "She met with the chancellor to discuss funding.", "thai": "เธอพบกับอธิการบดีเพื่อหารือเกี่ยวกับเงินทุน"}
{"word": "chancellor", "english": "The chancellor announced a new campus policy.", "thai": "อธิการบดีประกาศนโยบายใหม่ของมหาวิทยาลัย"}
{"word": "chancellor", "english": "He’s been appointed as the new chancellor.", "thai": "เขาได้รับการแต่งตั้งเป็นอธิการบดีคนใหม่"}
{"word": "chancellor", "english": "The chancellor is visiting our department today.", "thai": "อธิการบดีกำลังเยี่ยมชมภาควิชาของเราวันนี้"}
{"word": "chancellor", "english": "I saw the chancellor at the university event.", "thai": "ฉันเห็นอธิการบดีในงานของมหาวิทยาลัย"}
{"word": "chancellor", "english": "The chancellor approved the new building project.", "thai": "อธิการบดีอนุมัติโครงการอาคารใหม่"}
{"word": "chancellor", "english": "She wrote a letter to the chancellor about tuition.", "thai": "เธอเขียนจดหมายถึงอธิการบดีเกี่ยวกับค่าเล่าเรียน"}
{"word": "chancellor", "english": "The chancellor hosted a town hall meeting.", "thai": "อธิการบดีเป็นเจ้าภาพการประชุมชุมชน"}
{"word": "chancellor", "english": "He’s meeting the chancellor to discuss scholarships.", "thai": "เขากำลังพบอธิการบดีเพื่อหารือเกี่ยวกับทุนการศึกษา"}
{"word": "chancellor", "english": "The chancellor welcomed new students to campus.", "thai": "อธิการบดีต้อนรับนักศึกษาใหม่สู่มหาวิทยาลัย"}
{"word": "chancellor", "english": "The chancellor is speaking at the conference.", "thai": "อธิการบดีกำลังพูดในงานประชุม"}
{"word": "chancellor", "english": "She thanked the chancellor for the new library.", "thai": "เธอขอบคุณอธิการบดีสำหรับห้องสมุดใหม่"}
{"word": "chancellor", "english": "The chancellor addressed the faculty concerns.", "thai": "อธิการบดีกล่าวถึงข้อกังวลของคณาจารย์"}
{"word": "chancellor", "english": "He’s been the chancellor for five years now.", "thai": "เขาเป็นอธิการบดีมาได้ห้าปีแล้ว"}
{"word": "chancellor", "english": "The chancellor launched a sustainability initiative.", "thai": "อธิการบดีเริ่มโครงการความยั่งยืน"}
{"word": "chancellor", "english": "I heard the chancellor at the alumni event.", "thai": "ฉันได้ยินอธิการบดีพูดในงานศิษย์เก่า"}
{"word": "chancellor", "english": "The chancellor is meeting with student leaders.", "thai": "อธิการบดีกำลังพบกับผู้นำนักศึกษา"}
{"word": "chancellor", "english": "She’s writing to the chancellor about parking issues.", "thai": "เธอกำลังเขียนถึงอธิการบดีเกี่ยวกับปัญหาที่จอดรถ"}
{"word": "chancellor", "english": "The chancellor opened the new science center.", "thai": "อธิการบดีเปิดศูนย์วิทยาศาสตร์ใหม่"}
{"word": "chancellor", "english": "He’s discussing budget cuts with the chancellor.", "thai": "เขากำลังหารือเรื่องการตัดงบประมาณกับอธิการบดี"}
{"word": "chancellor", "english": "The chancellor attended the campus art exhibit.", "thai": "อธิการบดีเข้าร่วมนิทรรศการศิลปะของมหาวิทยาลัย"}
{"word": "chancellor", "english": "The chancellor is very approachable and kind.", "thai": "อธิการบดีเป็นคนที่เข้าถึงได้ง่ายและใจดี"}
{"word": "chancellor", "english": "She’s presenting a proposal to the chancellor.", "thai": "เธอกำลังนำเสนอข้อเสนอต่ออธิการบดี"}
{"word": "chancellor", "english": "The chancellor spoke about diversity initiatives.", "thai": "อธิการบดีพูดเกี่ยวกับโครงการความหลากหลาย"}
{"word": "chancellor", "english": "He’s inviting the chancellor to the fundraiser.", "thai": "เขากำลังเชิญอธิการบดีเข้าร่วมงานระดมทุน"}
{"word": "chancellor", "english": "The chancellor approved the new degree program.", "thai": "อธิการบดีอนุมัติหลักสูตรปริญญาใหม่"}
{"word": "chancellor", "english": "I saw the chancellor at the football game.", "thai": "ฉันเห็นอธิการบดีในงานแข่งฟุตบอล"}
{"word": "chancellor", "english": "The chancellor is addressing campus safety.", "thai": "อธิการบดีกำลังพูดถึงความปลอดภัยในมหาวิทยาลัย"}
{"word": "chancellor", "english": "She met the chancellor during orientation.", "thai": "เธอพบอธิการบดีในช่วงปฐมนิเทศ"}
{"word": "chancellor", "english": "The chancellor is hosting a faculty dinner.", "thai": "อธิการบดีเป็นเจ้าภาพงานเลี้ยงคณาจารย์"}
{"word": "chancellor", "english": "He’s working with the chancellor on a new policy.", "thai": "เขากำลังทำงานกับอธิการบดีในนโยบายใหม่"}
{"word": "chancellor", "english": "The chancellor gave a talk on leadership.", "thai": "อธิการบดีให้การบรรยายเกี่ยวกับความเป็นผู้นำ"}
{"word": "chancellor", "english": "She’s asking the chancellor for more resources.", "thai": "เธอกำลังขอทรัพยากรเพิ่มเติมจากอธิการบดี"}
{"word": "chancellor", "english": "The chancellor visited the new research lab.", "thai": "อธิการบดีเยี่ยมชมห้องปฏิบัติการวิจัยใหม่"}
{"word": "chancellor", "english": "He’s writing a report for the chancellor.", "thai": "เขากำลังเขียนรายงานให้อธิการบดี"}
{"word": "chancellor", "english": "The chancellor is speaking at the symposium.", "thai": "อธิการบดีกำลังพูดในงานสัมมนา"}
{"word": "chancellor", "english": "She thanked the chancellor for the scholarship.", "thai": "เธอขอบคุณอธิการบดีสำหรับทุนการศึกษา"}
{"word": "chancellor", "english": "The chancellor is reviewing the budget.", "thai": "อธิการบดีกำลังตรวจสอบงบประมาณ"}
{"word": "chancellor", "english": "He’s discussing campus events with the chancellor.", "thai": "เขากำลังหารือเกี่ยวกับงานในมหาวิทยาลัยกับอธิการบดี"}
{"word": "chancellor", "english": "The chancellor attended the student rally.", "thai": "อธิการบดีเข้าร่วมการชุมนุมของนักศึกษา"}
{"word": "chancellor", "english": "She’s meeting the chancellor about study abroad.", "thai": "เธอกำลังพบอธิการบดีเกี่ยวกับการเรียนต่อต่างประเทศ"}
{"word": "chancellor", "english": "The chancellor announced a new wellness program.", "thai": "อธิการบดีประกาศโครงการสุขภาพใหม่"}
{"word": "chancellor", "english": "He’s presenting research to the chancellor.", "thai": "เขากำลังนำเสนองานวิจัยต่ออธิการบดี"}
{"word": "chancellor", "english": "The chancellor is very supportive of the arts.", "thai": "อธิการบดีสนับสนุนศิลปะอย่างมาก"}
{"word": "chancellor", "english": "She’s inviting the chancellor to the lecture.", "thai": "เธอกำลังเชิญอธิการบดีเข้าร่วมการบรรยาย"}
{"word": "chancellor", "english": "The chancellor spoke at the diversity panel.", "thai": "อธิการบดีพูดในคณะอภิปรายความหลากหลาย"}
{"word": "chancellor", "english": "He’s working on a project with the chancellor.", "thai": "เขากำลังทำงานในโครงการกับอธิการบดี"}
{"word": "chancellor", "english": "The chancellor approved the new curriculum.", "thai": "อธิการบดีอนุมัติหลักสูตรใหม่"}
{"word": "chancellor", "english": "She saw the chancellor at the charity event.", "thai": "เธอเห็นอธิการบดีในงานการกุศล"}
{"word": "chancellor", "english": "The chancellor is addressing tuition concerns.", "thai": "อธิการบดีกำลังพูดถึงข้อกังวลเรื่องค่าเล่าเรียน"}
{"word": "chancellor", "english": "He’s meeting the chancellor to discuss grants.", "thai": "เขากำลังพบอธิการบดีเพื่อหารือเกี่ยวกับทุน"}
{"word": "chancellor", "english": "The chancellor is hosting a campus forum.", "thai": "อธิการบดีเป็นเจ้าภาพการประชุมในมหาวิทยาลัย"}
{"word": "chancellor", "english": "She’s writing to the chancellor about housing.", "thai": "เธอกำลังเขียนถึงอธิการบดีเกี่ยวกับที่พัก"}
{"word": "chancellor", "english": "The chancellor opened the new student center.", "thai": "อธิการบดีเปิดศูนย์นักศึกษาใหม่"}
{"word": "chancellor", "english": "He’s discussing sustainability with the chancellor.", "thai": "เขากำลังหารือเรื่องความยั่งยืนกับอธิการบดี"}
{"word": "chancellor", "english": "The chancellor attended the science fair.", "thai": "อธิการบดีเข้าร่วมงานนิทรรศการวิทยาศาสตร์"}
{"word": "chancellor", "english": "She’s presenting a plan to the chancellor.", "thai": "เธอกำลังนำเสนอแผนต่ออธิการบดี"}
{"word": "chancellor", "english": "The chancellor is speaking at the convocation.", "thai": "อธิการบดีกำลังพูดในพิธีเปิดการศึกษา"}
{"word": "chancellor", "english": "He’s been the chancellor since last year.", "thai": "เขาเป็นอธิการบดีตั้งแต่ปีที่แล้ว"}
{"word": "chancellor", "english": "The chancellor launched a new research fund.", "thai": "อธิการบดีเริ่มกองทุนวิจัยใหม่"}
{"word": "chancellor", "english": "She’s asking the chancellor for more advisors.", "thai": "เธอกำลังขอที่ปรึกษาเพิ่มจากอธิการบดี"}
{"word": "chancellor", "english": "The chancellor is visiting the engineering department.", "thai": "อธิการบดีกำลังเยี่ยมชมภาควิชาวิศวกรรม"}
{"word": "chancellor", "english": "He’s writing a proposal for the chancellor.", "thai": "เขากำลังเขียนข้อเสนอให้อธิการบดี"}
{"word": "chancellor", "english": "The chancellor spoke about academic excellence.", "thai": "อธิการบดีพูดเกี่ยวกับความเป็นเลิศทางวิชาการ"}
{"word": "chancellor", "english": "She’s meeting the chancellor about campus safety.", "thai": "เธอกำลังพบอธิการบดีเกี่ยวกับความปลอดภัยในมหาวิทยาลัย"}
{"word": "chancellor", "english": "The chancellor is hosting a student Q&A.", "thai": "อธิการบดีเป็นเจ้าภาพการถาม-ตอบกับนักศึกษา"}
{"word": "chancellor", "english": "He’s discussing diversity with the chancellor.", "thai": "เขากำลังหารือเรื่องความหลากหลายกับอธิการบดี"}
{"word": "chancellor", "english": "The chancellor attended the music recital.", "thai": "อธิการบดีเข้าร่วมการแสดงดนตรีเดี่ยว"}
{"word": "chancellor", "english": "She’s inviting the chancellor to the art show.", "thai": "เธอกำลังเชิญอธิการบดีเข้าร่วมนิทรรศการศิลปะ"}
{"word": "chancellor", "english": "The chancellor approved the new sports facility.", "thai": "อธิการบดีอนุมัติสิ่งอำนวยความสะดวกกีฬาใหม่"}
{"word": "chancellor", "english": "He’s working with the chancellor on a fundraiser.", "thai": "เขากำลังทำงานกับอธิการบดีในงานระดมทุน"}
{"word": "chancellor", "english": "The chancellor is speaking at the alumni dinner.", "thai": "อธิการบดีกำลังพูดในงานเลี้ยงศิษย์เก่า"}
{"word": "chancellor", "english": "She’s addressing the chancellor about mental health.", "thai": "เธอกำลังพูดกับอธิการบดีเกี่ยวกับสุขภาพจิต"}
{"word": "chancellor", "english": "The chancellor visited the new dorms.", "thai": "อธิการบดีเยี่ยมชมหอพักใหม่"}
{"word": "chancellor", "english": "He’s presenting a budget to the chancellor.", "thai": "เขากำลังนำเสนองบประมาณต่ออธิการบดี"}
{"word": "chancellor", "english": "The chancellor is attending the theater performance.", "thai": "อธิการบดีกำลังเข้าร่วมการแสดงละคร"}
{"word": "chancellor", "english": "She’s discussing research with the chancellor.", "thai": "เธอกำลังหารือเรื่องการวิจัยกับอธิการบดี"}
{"word": "chancellor", "english": "The chancellor is hosting a community event.", "thai": "อธิการบดีเป็นเจ้าภาพงานชุมชน"}
{"word": "chancellor", "english": "He’s meeting the chancellor about internships.", "thai": "เขากำลังพบอธิการบดีเกี่ยวกับการฝึกงาน"}
{"word": "chancellor", "english": "The chancellor spoke at the career fair.", "thai": "อธิการบดีพูดในงานแสดงอาชีพ"}
{"word": "chancellor", "english": "She’s writing to the chancellor about diversity.", "thai": "เธอกำลังเขียนถึงอธิการบดีเกี่ยวกับความหลากหลาย"}
{"word": "chancellor", "english": "The chancellor is reviewing new course proposals.", "thai": "อธิการบดีกำลังตรวจสอบข้อเสนอวิชาใหม่"}
{"word": "chancellor", "english": "He’s discussing campus expansion with the chancellor.", "thai": "เขากำลังหารือเรื่องการขยายมหาวิทยาลัยกับอธิการบดี"}
{"word": "chancellor", "english": "The chancellor attended the student art show.", "thai": "อธิการบดีเข้าร่วมนิทรรศการศิลปะของนักศึกษา"}
{"word": "chancellor", "english": "She’s presenting a sustainability plan to the chancellor.", "thai": "เธอกำลังนำเสนอแผนความยั่งยืนต่ออธิการบดี"}
{"word": "chancellor", "english": "The chancellor is speaking at the orientation.", "thai": "อธิการบดีกำลังพูดในงานปฐมนิเทศ"}
{"word": "chancellor", "english": "He’s been appointed interim chancellor.", "thai": "เขาได้รับการแต่งตั้งเป็นอธิการบดีชั่วคราว"}
{"word": "chancellor", "english": "The chancellor launched a new wellness center.", "thai": "อธิการบดีเปิดศูนย์สุขภาพใหม่"}
{"word": "chancellor", "english": "She’s asking the chancellor for more funding.", "thai": "เธอกำลังขอเงินทุนเพิ่มจากอธิการบดี"}
{"word": "chancellor", "english": "The chancellor visited the chemistry lab.", "thai": "อธิการบดีเยี่ยมชมห้องปฏิบัติการเคมี"}
{"word": "chancellor", "english": "He’s writing a letter to the chancellor.", "thai": "เขากำลังเขียนจดหมายถึงอธิการบดี"}
{"word": "chancellor", "english": "The chancellor spoke about campus improvements.", "thai": "อธิการบดีพูดเกี่ยวกับการปรับปรุงมหาวิทยาลัย"}
{"word": "chancellor", "english": "She’s meeting the chancellor about student services.", "thai": "เธอกำลังพบอธิการบดีเกี่ยวกับบริการนักศึกษา"}
{"word": "chancellor", "english": "The chancellor is hosting a leadership workshop.", "thai": "อธิการบดีเป็นเจ้าภาพการประชุมเชิงปฏิบัติการผู้นำ"}
{"word": "chancellor", "english": "He’s discussing alumni relations with the chancellor.", "thai": "เขากำลังหารือเรื่องความสัมพันธ์กับศิษย์เก่ากับอธิการบดี"}
{"word": "chancellor", "english": "The chancellor attended the debate competition.", "thai": "อธิการบดีเข้าร่วมการแข่งขันโต้วาที"}
{"word": "chancellor", "english": "She’s inviting the chancellor to the science symposium.", "thai": "เธอกำลังเชิญอธิการบดีเข้าร่วมสัมมนาวิทยาศาสตร์"}
{"word": "chancellor", "english": "The chancellor approved the new parking plan.", "thai": "อธิการบดีอนุมัติแผนที่จอดรถใหม่"}
{"word": "chancellor", "english": "He’s working with the chancellor on a new initiative.", "thai": "เขากำลังทำงานกับอธิการบดีในโครงการใหม่"}
{"word": "chancellor", "english": "The chancellor is speaking at the fundraiser.", "thai": "อธิการบดีกำลังพูดในงานระดมทุน"}
{"word": "classroom", "english": "The classroom was quiet during the exam.", "thai": "ห้องเรียนเงียบระหว่างการสอบ"}
{"word": "classroom", "english": "I left my notebook in the classroom.", "thai": "ฉันลืมสมุดจดไว้ในห้องเรียน"}
{"word": "classroom", "english": "The teacher rearranged the classroom desks.", "thai": "ครูจัดเรียงโต๊ะในห้องเรียนใหม่"}
{"word": "classroom", "english": "She’s giving a presentation in the classroom.", "thai": "เธอกำลังนำเสนอในห้องเรียน"}
{"word": "classroom", "english": "The classroom has a new smartboard.", "thai": "ห้องเรียนมีสมาร์ทบอร์ดใหม่"}
{"word": "classroom", "english": "I’m heading to the classroom for my next class.", "thai": "ฉันกำลังไปที่ห้องเรียนสำหรับคาบต่อไป"}
{"word": "classroom", "english": "The classroom was too warm today.", "thai": "ห้องเรียนร้อนเกินไปวันนี้"}
{"word": "classroom", "english": "He’s setting up a projector in the classroom.", "thai": "เขากำลังติดตั้งโปรเจคเตอร์ในห้องเรียน"}
{"word": "classroom", "english": "The classroom discussion was really engaging.", "thai": "การสนทนาในห้องเรียนน่าสนใจมาก"}
{"word": "classroom", "english": "I forgot my textbook in the classroom.", "thai": "ฉันลืมตำราเรียนไว้ในห้องเรียน"}
{"word": "classroom", "english": "The classroom is decorated for the holidays.", "thai": "ห้องเรียนถูกตกแต่งสำหรับวันหยุด"}
{"word": "classroom", "english": "She’s teaching a new lesson in the classroom.", "thai": "เธอกำลังสอนบทเรียนใหม่ในห้องเรียน"}
{"word": "classroom", "english": "The classroom has new computers this year.", "thai": "ห้องเรียนมีคอมพิวเตอร์ใหม่ในปีนี้"}
{"word": "classroom", "english": "I’m meeting my group in the classroom.", "thai": "ฉันจะพบกลุ่มของฉันในห้องเรียน"}
{"word": "classroom", "english": "The classroom was packed for the lecture.", "thai": "ห้องเรียนแน่นไปด้วยผู้คนสำหรับการบรรยาย"}
{"word": "classroom", "english": "He’s cleaning the classroom after school.", "thai": "เขากำลังทำความสะอาดห้องเรียนหลังเลิกเรียน"}
{"word": "classroom", "english": "The classroom has a great view of the campus.", "thai": "ห้องเรียนมีวิวที่สวยงามของมหาวิทยาลัย"}
{"word": "classroom", "english": "She’s putting up posters in the classroom.", "thai": "เธอกำลังติดโปสเตอร์ในห้องเรียน"}
{"word": "classroom", "english": "The classroom is too small for our class.", "thai": "ห้องเรียนเล็กเกินไปสำหรับชั้นเรียนของเรา"}
{"word": "classroom", "english": "I’m helping organize the classroom library.", "thai": "ฉันกำลังช่วยจัดระเบียบห้องสมุดในห้องเรียน"}
{"word": "classroom", "english": "The classroom projector isn’t working today.", "thai": "โปรเจคเตอร์ในห้องเรียนไม่ทำงานวันนี้"}
{"word": "classroom", "english": "He’s leading a discussion in the classroom.", "thai": "เขากำลังนำการสนทนาในห้องเรียน"}
{"word": "classroom", "english": "The classroom was noisy before the bell.", "thai": "ห้องเรียนมีเสียงดังก่อนกระดิ่งดัง"}
{"word": "classroom", "english": "She’s setting up a science experiment in the classroom.", "thai": "เธอกำลังจัดเตรียมการทดลองวิทยาศาสตร์ในห้องเรียน"}
{"word": "classroom", "english": "The classroom has new desks this semester.", "thai": "ห้องเรียนมีโต๊ะใหม่ในภาคเรียนนี้"}
{"word": "classroom", "english": "I’m studying in the classroom after hours.", "thai": "ฉันกำลังเรียนในห้องเรียนหลังเวลาปกติ"}
{"word": "classroom", "english": "The classroom is where we hold club meetings.", "thai": "ห้องเรียนเป็นสถานที่จัดประชุมชมรม"}
{"word": "classroom", "english": "He forgot his jacket in the classroom.", "thai": "เขาลืมแจ็คเก็ตไว้ในห้องเรียน"}
{"word": "classroom", "english": "The classroom was rearranged for group work.", "thai": "ห้องเรียนถูกจัดใหม่สำหรับงานกลุ่ม"}
{"word": "classroom", "english": "She’s teaching math in the classroom next door.", "thai": "เธอกำลังสอนคณิตศาสตร์ในห้องเรียนข้างๆ"}
{"word": "classroom", "english": "The classroom has a new air conditioner.", "thai": "ห้องเรียนมีเครื่องปรับอากาศใหม่"}
{"word": "classroom", "english": "I’m presenting my project in the classroom.", "thai": "ฉันกำลังนำเสนอโปรเจกต์ในห้องเรียน"}
{"word": "classroom", "english": "The classroom is used for art classes.", "thai": "ห้องเรียนถูกใช้สำหรับชั้นเรียนศิลปะ"}
{"word": "classroom", "english": "He’s fixing the whiteboard in the classroom.", "thai": "เขากำลังซ่อมไวท์บอร์ดในห้องเรียน"}
{"word": "classroom", "english": "The classroom was quiet during the quiz.", "thai": "ห้องเรียนเงียบระหว่างการสอบย่อย"}
{"word": "classroom", "english": "She’s decorating the classroom for a party.", "thai": "เธอกำลังตกแต่งห้องเรียนสำหรับงานปาร์ตี้"}
{"word": "classroom", "english": "The classroom has new lighting this year.", "thai": "ห้องเรียนมีไฟใหม่ในปีนี้"}
{"word": "classroom", "english": "I’m helping clean the classroom today.", "thai": "ฉันกำลังช่วยทำความสะอาดห้องเรียนวันนี้"}
{"word": "classroom", "english": "The classroom is where we had our debate.", "thai": "ห้องเรียนเป็นสถานที่ที่เราจัดโต้วาที"}
{"word": "classroom", "english": "He’s setting up a laptop in the classroom.", "thai": "เขากำลังติดตั้งแล็ปท็อปในห้องเรียน"}
{"word": "classroom", "english": "The classroom was too cold this morning.", "thai": "ห้องเรียนหนาวเกินไปเช้านี้"}
{"word": "classroom", "english": "She’s organizing a study session in the classroom.", "thai": "เธอกำลังจัดการเซสชันการเรียนในห้องเรียน"}
{"word": "classroom", "english": "The classroom has a new bulletin board.", "thai": "ห้องเรียนมีกระดานข่าวใหม่"}
{"word": "classroom", "english": "I’m working on my assignment in the classroom.", "thai": "ฉันกำลังทำงานในห้องเรียน"}
{"word": "classroom", "english": "The classroom is used for evening classes.", "thai": "ห้องเรียนถูกใช้สำหรับชั้นเรียนตอนเยาน"}
{"word": "classroom", "english": "He’s teaching a workshop in the classroom.", "thai": "เขากำลังสอนการประชุมเชิงปฏิบัติการในห้องเรียน"}
{"word": "classroom", "english": "The classroom was full for the guest lecture.", "thai": "ห้องเรียนเต็มไปด้วยผู้คนสำหรับการบรรยายจากวิทยากรรับเชิญ"}
{"word": "classroom", "english": "She’s putting up student work in the classroom.", "thai": "เธอกำลังติดผลงานนักเรียนในห้องเรียน"}
{"word": "classroom", "english": "The classroom has a new carpet this semester.", "thai": "ห้องเรียนมีพรมใหม่ในภาคเรียนนี้"}
{"word": "classroom", "english": "I’m meeting my teacher in the classroom.", "thai": "ฉันจะพบครูในห้องเรียน"}
{"word": "classroom", "english": "The classroom is where we do group projects.", "thai": "ห้องเรียนเป็นสถานที่ที่เราทำโปรเจกต์กลุ่ม"}
{"word": "classroom", "english": "He’s installing software in the classroom computers.", "thai": "เขากำลังติดตั้งซอฟต์แวร์ในคอมพิวเตอร์ห้องเรียน"}
{"word": "classroom", "english": "The classroom was noisy during the activity.", "thai": "ห้องเรียนมีเสียงดังระหว่างกิจกรรม"}
{"word": "classroom", "english": "She’s teaching history in the classroom.", "thai": "เธอกำลังสอนประวัติศาสตร์ในห้องเรียน"}
{"word": "classroom", "english": "The classroom has new windows installed.", "thai": Windows ในห้องเรียนได้รับการติดตั้งใหม่"}
{"word": "classroom", "english": "I’m practicing my speech in the classroom.", "thai": "ฉันกำลังฝึกการพูดในห้องเรียน"}
{"word": "classroom", "english": "The classroom is used for science labs.", "thai": "ห้องเรียนถูกใช้สำหรับห้องปฏิบัติการวิทยาศาสตร์"}
{"word": "classroom", "english": "He’s setting up chairs in the classroom.", "thai": "เขากำลังจัดเก้าอี้ในห้องเรียน"}
{"word": "classroom", "english": "The classroom was cleaned after the project.", "thai": "ห้องเรียนถูกทำความสะอาดหลังโปรเจกต์"}
{"word": "classroom", "english": "She’s leading a group activity in the classroom.", "thai": "เธอกำลังนำกิจกรรมกลุ่มในห้องเรียน"}
{"word": "classroom", "english": "The classroom has a new sound system.", "thai": "ห้องเรียนมีระบบเสียงใหม่"}
{"word": "classroom", "english": "I’m studying for my exam in the classroom.", "thai": "ฉันกำลังอ่านหนังสือสอบในห้องเรียน"}
{"word": "classroom", "english": "The classroom is where we watch documentaries.", "thai": "ห้องเรียนเป็นสถานที่ที่เราดูสารคดี"}
{"word": "classroom", "english": "He’s fixing the clock in the classroom.", "thai": "เขากำลังซ่อมนาฬิกาในห้องเรียน"}
{"word": "classroom", "english": "The classroom was too dark during the presentation.", "thai": "ห้องเรียนมืดเกินไประหว่างการนำเสนอ"}
{"word": "classroom", "english": "She’s organizing a debate in the classroom.", "thai": "เธอกำลังจัดการโต้วาทีในห้องเรียน"}
{"word": "classroom", "english": "The classroom has new posters on the walls.", "thai": "ห้องเรียนมีโปสเตอร์ใหม่บนผนัง"}
{"word": "classroom", "english": "I’m helping set up the classroom for a workshop.", "thai": "ฉันกำลังช่วยจัดห้องเรียนสำหรับการประชุมเชิงปฏิบัติการ"}
{"word": "classroom", "english": "The classroom is where we hold study groups.", "thai": "ห้องเรียนเป็นสถานที่ที่เราจัดกลุ่มศึกษา"}
{"word": "classroom", "english": "He’s teaching coding in the classroom.", "thai": "เขากำลังสอนการเขียนโค้ดในห้องเรียน"}
{"word": "classroom", "english": "The classroom was rearranged for the exam.", "thai": "ห้องเรียนถูกจัดใหม่สำหรับการสอบ"}
{"word": "classroom", "english": "She’s decorating the classroom for a celebration.", "thai": "เธอกำลังตกแต่งห้องเรียนสำหรับงานเฉลิมฉลอง"}
{"word": "classroom", "english": "The classroom has a new projector screen.", "thai": "ห้องเรียนมีหน้าจอโปรเจคเตอร์ใหม่"}
{"word": "classroom", "english": "I’m working on a group project in the classroom.", "thai": "ฉันกำลังทำงานกลุ่มในห้องเรียน"}
{"word": "classroom", "english": "The classroom is used for language classes.", "thai": "ห้องเรียนถูกใช้สำหรับชั้นเรียนภาษา"}
{"word": "classroom", "english": "He’s setting up a display in the classroom.", "thai": "เขากำลังจัดแสดงในห้องเรียน"}
{"word": "classroom", "english": "The classroom was quiet during the lecture.", "thai": "ห้องเรียนเงียบระหว่างการบรรยาย"}
{"word": "classroom", "english": "She’s teaching literature in the classroom.", "thai": "เธอกำลังสอนวรรณคดีในห้องเรียน"}
{"word": "classroom", "english": "The classroom has new chairs this year.", "thai": "ห้องเรียนมีเก้าอี้ใหม่ในปีนี้"}
{"word": "classroom", "english": "I’m meeting my classmates in the classroom.", "thai": "ฉันจะพบเพื่อนร่วมชั้นในห้องเรียน"}
{"word": "classroom", "english": "The classroom is where we do experiments.", "thai": "ห้องเรียนเป็นสถานที่ที่เราทำการทดลอง"}
{"word": "classroom", "english": "He’s fixing the lights in the classroom.", "thai": "เขากำลังซ่อมไฟในห้องเรียน"}
{"word": "classroom", "english": "The classroom was too hot during class.", "thai": "ห้องเรียนร้อนเกินไประหว่างชั้นเรียน"}
{"word": "classroom", "english": "She’s leading a review session in the classroom.", "thai": "เธอกำลังนำเซสชันทบทวนในห้องเรียน"}
{"word": "classroom", "english": "The classroom has a new interactive board.", "thai": "ห้องเรียนมีกระดานโต้ตอบใหม่"}
{"word": "classroom", "english": "I’m practicing my presentation in the classroom.", "thai": "ฉันกำลังฝึกนำเสนอในห้องเรียน"}
{"word": "classroom", "english": "The classroom is used for music lessons.", "thai": "ห้องเรียนถูกใช้สำหรับบทเรียนดนตรี"}
{"word": "classroom", "english": "He’s organizing a quiz in the classroom.", "thai": "เขากำลังจัดการสอบย่อยในห้องเรียน"}
{"word": "classroom", "english": "The classroom was cleaned after the activity.", "thai": "ห้องเรียนถูกทำความสะอาดหลังกิจกรรม"}
{"word": "classroom", "english": "She’s setting up a model in the classroom.", "thai": "เธอกำลังจัดตั้งโมเดลในห้องเรียน"}
{"word": "classroom", "english": "The classroom has new bookshelves.", "thai": "ห้องเรียนมีชั้นวางหนังสือใหม่"}
{"word": "classroom", "english": "I’m working on my homework in the classroom.", "thai": "ฉันกำลังทำการบ้านในห้องเรียน"}
{"word": "classroom", "english": "The classroom is where we watch films.", "thai": "ห้องเรียนเป็นสถานที่ที่เราดูภาพยนตร์"}
{"word": "classroom", "english": "He’s teaching a seminar in the classroom.", "thai": "เขากำลังสอนสัมมนาในห้องเรียน"}
{"word": "classroom", "english": "The classroom was packed for the workshop.", "thai": "ห้องเรียนแน่นไปด้วยผู้คนสำหรับการประชุมเชิงปฏิบัติการ"}
{"word": "classroom", "english": "She’s putting up art in the classroom.", "thai": "เธอกำลังติดผลงานศิลปะในห้องเรียน"}
{"word": "classroom", "english": "The classroom has new technology this semester.", "thai": "ห้องเรียนมีเทคโนโลยีใหม่ในภาคเรียนนี้"}
{"word": "classroom", "english": "I’m helping rearrange the classroom desks.", "thai": "ฉันกำลังช่วยจัดเรียงโต๊ะในห้องเรียน"}
{"word": "classroom", "english": "The classroom is where we hold debates.", "thai": "ห้องเรียนเป็นสถานที่ที่เราจัดโต้วาที"}
{"word": "classroom", "english": "He’s installing a new screen in the classroom.", "thai": "เขากำลังติดตั้งหน้าจอใหม่ในห้องเรียน"}
{"word": "classroom", "english": "The classroom was lively during the discussion.", "thai": "ห้องเรียนมีชีวิตชีวาระหว่างการสนทนา"}
{"word": "course", "english": "I’m taking a biology course this semester.", "thai": "ฉันกำลังเรียนวิชาชีววิทยาในภาคเรียนนี้"}
{"word": "course", "english": "The course syllabus was posted online.", "thai": "หลักสูตรวิชาถูกโพสต์ออนไลน์"}
{"word": "course", "english": "She’s struggling with her math course.", "thai": "เธอกำลังมีปัญหากับวิชาคณิตศาสตร์"}
{"word": "course", "english": "This course requires a lot of reading.", "thai": "วิชานี้ต้องอ่านเยอะมาก"}
{"word": "course", "english": "He dropped the course after two weeks.", "thai": "เขาลาออกจากวิชาหลังจากสองสัปดาห์"}
{"word": "course", "english": "The course is taught by a great professor.", "thai": "วิชานี้สอนโดยศาสตราจารย์ที่ยอดเยี่ยม"}
{"word": "course", "english": "I’m excited about my new art course.", "thai": "ฉันตื่นเต้นกับวิชาศิลปะใหม่"}
{"word": "course", "english": "The course has a tough final exam.", "thai": "วิชานี้มีการสอบปลายภาคที่ยาก"}
{"word": "course", "english": "She’s taking an online course this summer.", "thai": "เธอกำลังเรียนวิชาออนไลน์ในช่วงฤดูร้อนนี้"}
{"word": "course", "english": "The course meets twice a week.", "thai": "วิชานี้เรียนสัปดาห์ละสองครั้ง"}
{"word": "course", "english": "I need to buy textbooks for my course.", "thai": "ฉันต้องซื้อตำราเรียนสำหรับวิชาของฉัน"}
{"word": "course", "english": "The course covers modern history.", "thai": "วิชานี้ครอบคลุมประวัติศาสตร์สมัยใหม่"}
{"word": "course", "english": "He’s auditing a philosophy course.", "thai": "เขากำลังฟังวิชาปรัชญาแบบไม่ลงทะเบียน"}
{"word": "course", "english": "The course includes weekly assignments.", "thai": "วิชานี้มีงานมอบหมายทุกสัปดาห์"}
{"word": "course", "english": "I’m switching to a different course.", "thai": "ฉันกำลังเปลี่ยนไปเรียนวิชาอื่น"}
{"word": "course", "english": "The course is part of my major.", "thai": "วิชานี้เป็นส่วนหนึ่งของสาขาวิชาเอกของฉัน"}
{"word": "course", "english": "She aced her chemistry course.", "thai": "เธอได้คะแนนดีเยี่ยมในวิชาเคมี"}
{"word": "course", "english": "The course has a group project.", "thai": "วิชานี้มีโปรเจกต์กลุ่ม"}
{"word": "course", "english": "I’m behind in my literature course.", "thai": "ฉันตามหลังในวิชาวรรณคดี"}
{"word": "course", "english": "The course is offered every spring.", "thai": "วิชานี้เปิดสอนทุกฤดูใบไม้ผลิ"}
{"word": "course", "english": "He’s teaching a course on economics.", "thai": "เขากำลังสอนวิชาเศรษฐศาสตร์"}
{"word": "course", "english": "The course requires a final presentation.", "thai": "วิชานี้ต้องมีการนำเสนอครั้งสุดท้าย"}
{"word": "course", "english": "I’m taking a coding course this fall.", "thai": "ฉันกำลังเรียนวิชาการเขียนโค้ดในฤดูใบไม้ร่วงนี้"}
{"word": "course", "english": "The course was tougher than I expected.", "thai": "วิชานี้ยากกว่าที่ฉันคาดไว้"}
{"word": "course", "english": "She’s enrolled in a psychology course.", "thai": "เธอลงทะเบียนเรียนวิชาจิตวิทยา"}
{"word": "course", "english": "The course has a lot of lab work.", "thai": "วิชานี้มีงานปฏิบัติการเยอะ"}
{"word": "course", "english": "I’m meeting my advisor about my course load.", "thai": "ฉันกำลังพบที่ปรึกษาเกี่ยวกับจำนวนวิชาที่เรียน"}
{"word": "course", "english": "The course is taught in the new building.", "thai": "วิชานี้สอนในอาคารใหม่"}
{"word": "course", "english": "He’s taking a course on data analysis.", "thai": "เขากำลังเรียนวิชาการวิเคราะห์ข้อมูล"}
{"word": "course", "english": "The course includes a field trip.", "thai": "วิชานี้รวมถึงการทัศนศึกษา"}
{"word": "course", "english": "I’m struggling with my physics course.", "thai": "ฉันกำลังมีปัญหากับวิชาฟิสิกส์"}
{"word": "course", "english": "The course has a strict attendance policy.", "thai": "วิชานี้มีนโยบายการเข้าชั้นเรียนที่เข้มงวด"}
{"word": "course", "english": "She’s excited for her photography course.", "thai": "เธอตื่นเต้นกับวิชาถ่ายภาพ"}
{"word": "course", "english": "The course is offered online and in-person.", "thai": "วิชานี้เปิดสอนทั้งออนไลน์และในชั้นเรียน"}
{"word": "course", "english": "I’m taking a course on public speaking.", "thai": "ฉันกำลังเรียนวิชาการพูดในที่สาธารณะ"}
{"word": "course", "english": "The course has a heavy workload.", "thai": "วิชานี้มีภาระงานหนัก"}
{"word": "course", "english": "He’s leading a course on creative writing.", "thai": "เขากำลังนำวิชาการเขียนสร้างสรรค์"}
{"word": "course", "english": "The course requires a research paper.", "thai": "วิชานี้ต้องเขียนเอกสารวิจัย"}
{"word": "course", "english": "I’m enjoying my sociology course.", "thai": "ฉันกำลังสนุกกับวิชาสังคมวิทยา"}
{"word": "course", "english": "The course is part of the core curriculum.", "thai": "วิชานี้เป็นส่วนหนึ่งของหลักสูตรแกนกลาง"}
{"word": "course", "english": "She’s teaching a course on literature.", "thai": "เธอกำลังสอนวิชาวรรณคดี"}
{"word": "course", "english": "The course has weekly discussion groups.", "thai": "วิชานี้มีกลุ่มสนทนาทุกสัปดาห์"}
{"word": "course", "english": "I’m taking a course in environmental science.", "thai": "ฉันกำลังเรียนวิชาวิทยาศาสตร์สิ่งแวดล้อม"}
{"word": "course", "english": "The course is only offered once a year.", "thai": "วิชานี้เปิดสอนเพียงปีละครั้ง"}
{"word": "course", "english": "He’s struggling with his engineering course.", "thai": "เขากำลังมีปัญหากับวิชาวิศวกรรม"}
{"word": "course", "english": "The course includes guest lectures.", "thai": "วิชานี้รวมถึงการบรรยายจากวิทยากรรับเชิญ"}
{"word": "course", "english": "I’m auditing a course on history.", "thai": "ฉันกำลังฟังวิชาประวัติศาสตร์แบบไม่ลงทะเบียน"}
{"word": "course", "english": "The course has a lot of group work.", "thai": "วิชานี้มีงานกลุ่มเยอะ"}
{"word": "course", "english": "She’s taking a course on graphic design.", "thai": "เธอกำลังเรียนวิชาการออกแบบกราฟิก"}
{"word": "course", "english": "The course is taught by a visiting professor.", "thai": "วิชานี้สอนโดยศาสตราจารย์รับเชิญ"}
{"word": "course", "english": "I’m dropping a course to lighten my schedule.", "thai": "ฉันกำลังลาออกจากวิชาเพื่อลดภาระตารางเรียน"}
{"word": "course", "english": "The course has a tough grading policy.", "thai": "วิชานี้มีนโยบายการให้คะแนนที่เข้มงวด"}
{"word": "course", "english": "He’s taking a course on artificial intelligence.", "thai": "เขากำลังเรียนวิชาปัญญาประดิษฐ์"}
{"word": "course", "english": "The course requires a final project.", "thai": "วิชานี้ต้องทำโปรเจกต์สุดท้าย"}
{"word": "course", "english": "I’m enjoying my music theory course.", "thai": "ฉันกำลังสนุกกับวิชาทฤษฎีดนตรี"}
{"word": "course", "english": "The course is part of my minor.", "thai": "วิชานี้เป็นส่วนหนึ่งของสาขาวิชาโทของฉัน"}
{"word": "course", "english": "She’s teaching a course on anthropology.", "thai": "เธอกำลังสอนวิชามานุษยวิทยา"}
{"word": "course", "english": "The course has a lot of practical assignments.", "thai": "วิชานี้มีงานปฏิบัติเยอะ"}
{"word": "course", "english": "I’m taking a course in business ethics.", "thai": "ฉันกำลังเรียนวิชาจริยธรรมธุรกิจ"}
{"word": "course", "english": "The course is offered in the evening.", "thai": "วิชานี้เปิดสอนตอนเย็น"}
{"word": "course", "english": "He’s struggling with his statistics course.", "thai": "เขากำลังมีปัญหากับวิชาสถิติ"}
{"word": "course", "english": "The course includes a study abroad option.", "thai": "วิชานี้มีตัวเลือกการเรียนต่อต่างประเทศ"}
{"word": "course", "english": "I’m taking a course on film studies.", "thai": "ฉันกำลังเรียนวิชาการศึกษาภาพยนตร์"}
{"word": "course", "english": "The course has a lot of online resources.", "thai": "วิชานี้มีทรัพยากรออนไลน์เยอะ"}
{"word": "course", "english": "She’s enrolled in a course on linguistics.", "thai": "เธอลงทะเบียนเรียนวิชาภาษาศาสตร์"}
{"word": "course", "english": "The course is required for graduation.", "thai": "วิชานี้จำเป็นสำหรับการสำเร็จการศึกษา"}
{"word": "course", "english": "I’m taking a course in computer science.", "thai": "ฉันกำลังเรียนวิชาวิทยาการคอมพิวเตอร์"}
{"word": "course", "english": "The course has a challenging midterm.", "thai": "วิชานี้มีการสอบกลางภาคที่ท้าทาย"}
{"word": "course", "english": "He’s teaching a course on political science.", "thai": "เขากำลังสอนวิชารัฐศาสตร์"}
{"word": "course", "english": "The course includes weekly quizzes.", "thai": "วิชานี้มีสอบย่อยทุกสัปดาห์"}
{"word": "course", "english": "I’m enjoying my astronomy course.", "thai": "ฉันกำลังสนุกกับวิชาดาราศาสตร์"}
{"word": "course", "english": "The course is part of the honors program.", "thai": "วิชานี้เป็นส่วนหนึ่งของโปรแกรมเกียรตินิยม"}
{"word": "course", "english": "She’s taking a course on gender studies.", "thai": "เธอกำลังเรียนวิชาการศึกษาเพศ"}
{"word": "course", "english": "The course has a lot of guest speakers.", "thai": "วิชานี้มีวิทยากรรับเชิญเยอะ"}
{"word": "course", "english": "I’m auditing a course on medieval history.", "thai": "ฉันกำลังฟังวิชาประวัติศาสตร์สมัยกลางแบบไม่ลงทะเบียน"}
{"word": "course", "english": "The course requires a lot of group discussions.", "thai": "วิชานี้ต้องมีการสนทนากลุ่มเยอะ"}
{"word": "course", "english": "He’s taking a course on entrepreneurship.", "thai": "เขากำลังเรียนวิชาการเป็นผู้ประกอบการ"}
{"word": "course", "english": "The course is taught in a hybrid format.", "thai": "วิชานี้สอนในรูปแบบผสม"}
{"word": "course", "english": "I’m struggling with my biology course.", "thai": "ฉันกำลังมีปัญหากับวิชาชีววิทยา"}
{"word": "course", "english": "The course has a lot of hands-on projects.", "thai": "วิชานี้มีโปรเจกต์ปฏิบัติเยอะ"}
{"word": "course", "english": "She’s teaching a course on art history.", "thai": "เธอกำลังสอนวิชาประวัติศาสตร์ศิลปะ"}
{"word": "course", "english": "The course is offered through the extension program.", "thai": "วิชานี้เปิดสอนผ่านโปรแกรมต่อขยาย"}
{"word": "course", "english": "I’m taking a course on creative coding.", "thai": "ฉันกำลังเรียนวิชาการเขียนโค้ดสร้างสรรค์"}
{"word": "course", "english": "The course has a lot of writing assignments.", "thai": "วิชานี้มีงานเขียนเยอะ"}
{"word": "course", "english": "He’s enrolled in a course on neuroscience.", "thai": "เขาลงทะเบียนเรียนวิชาประสาทวิทยา"}
{"word": "course", "english": "The course is part of the general education requirements.", "thai": "วิชานี้เป็นส่วนหนึ่งของข้อกำหนดการศึกษาทั่วไป"}
{"word": "course", "english": "I’m taking a course in international relations.", "thai": "ฉันกำลังเรียนวิชาความสัมพันธ์ระหว่างประเทศ"}
{"word": "course", "english": "The course has a lot of practical applications.", "thai": "วิชานี้มีแอปพลิเคชันปฏิบัติเยอะ"}
{"word": "course", "english": "She’s teaching a course on environmental policy.", "thai": "เธอกำลังสอนวิชานโยบายสิ่งแวดล้อม"}
{"word": "course", "english": "The course includes a research component.", "thai": "วิชานี้รวมถึงส่วนประกอบการวิจัย"}
{"word": "course", "english": "I’m enjoying my course on ancient civilizations.", "thai": "ฉันกำลังสนุกกับวิชาอารยธรรมโบราณ"}
{"word": "course", "english": "The course is taught by a renowned scholar.", "thai": "วิชานี้สอนโดยนักวิชาการที่มีชื่อเสียง"}
{"word": "course", "english": "He’s taking a course on game design.", "thai": "เขากำลังเรียนวิชาการออกแบบเกม"}
{"word": "course", "english": "The course has a lot of interactive activities.", "thai": "วิชานี้มีกิจกรรมโต้ตอบเยอะ"}
{"word": "course", "english": "I’m auditing a course on urban planning.", "thai": "ฉันกำลังฟังวิชาการวางผังเมืองแบบไม่ลงทะเบียน"}
{"word": "course", "english": "The course is required for my degree.", "thai": "วิชานี้จำเป็นสำหรับปริญญาของฉัน"}
{"word": "course", "english": "She’s enrolled in a course on marketing.", "thai": "เธอลงทะเบียนเรียนวิชาการตลาด"}
{"word": "course", "english": "The course has a lot of case studies.", "thai": "วิชานี้มีกรณีศึกษาเยอะ"}
{"word": "course", "english": "I’m taking a course on sustainable development.", "thai": "ฉันกำลังเรียนวิชาการพัฒนาที่ยั่งยืน"}
{"word": "curriculum", "english": "The curriculum for this class is really challenging.", "thai": "หลักสูตรสำหรับชั้นเรียนนี้ท้าทายมาก"}
{"word": "curriculum", "english": "They’re updating the curriculum next year.", "thai": "พวกเขากำลังอัปเดตหลักสูตรในปีหน้า"}
{"word": "curriculum", "english": "She helped design the new science curriculum.", "thai": "เธอช่วยออกแบบหลักสูตรวิทยาศาสตร์ใหม่"}
{"word": "curriculum", "english": "The curriculum includes a lot of group projects.", "thai": "หลักสูตรนี้รวมถึงโปรเจกต์กลุ่มจำนวนมาก"}
{"word": "curriculum", "english": "I’m reviewing the curriculum for my major.", "thai": "ฉันกำลังตรวจสอบหลักสูตรสำหรับสาขาวิชาเอกของฉัน"}
{"word": "curriculum", "english": "The curriculum is focused on practical skills.", "thai": "หลักสูตรเน้นที่ทักษะปฏิบัติ"}
{"word": "curriculum", "english": "He’s teaching a course in the new curriculum.", "thai": "เขากำลังสอนวิชาในหลักสูตรใหม่"}
{"word": "curriculum", "english": "The curriculum was approved by the dean.", "thai": "หลักสูตรได้รับการอนุมัติจากคณบดี"}
{"word": "curriculum", "english": "She’s studying the curriculum for next semester.", "thai": "เธอกำลังศึกษาหลักสูตรสำหรับภาคเรียนหน้า"}
{"word": "curriculum", "english": "The curriculum covers modern literature.", "thai": "หลักสูตรครอบคลุมวรรณคดีสมัยใหม่"}
{"word": "curriculum", "english": "I think the curriculum needs more electives.", "thai": "ฉันคิดว่าหลักสูตรต้องการวิชาเลือกเพิ่ม"}
{"word": "curriculum", "english": "The curriculum is designed for beginners.", "thai": "หลักสูตรถูกออกแบบสำหรับผู้เริ่มต้น"}
{"word": "curriculum", "english": "He’s on the committee to revise the curriculum.", "thai": "เขาอยู่ในคณะกรรมการเพื่อปรับปรุงหลักสูตร"}
{"word": "curriculum", "english": "The curriculum includes hands-on training.", "thai": "หลักสูตรรวมถึงการฝึกปฏิบัติ"}
{"word": "curriculum", "english": "She’s excited about the updated curriculum.", "thai": "เธอตื่นเต้นกับหลักสูตรที่อัปเดต"}
{"word": "curriculum", "english": "The curriculum is aligned with industry standards.", "thai": "หลักสูตรสอดคล้องกับมาตรฐานอุตสาหกรรม"}
{"word": "curriculum", "english": "I’m struggling with the curriculum’s workload.", "thai": "ฉันกำลังมีปัญหากับภาระงานของหลักสูตร"}
{"word": "curriculum", "english": "The curriculum emphasizes critical thinking.", "thai": "หลักสูตรเน้นการคิดอย่างมีวิจารณญาณ"}
{"word": "curriculum", "english": "He’s proposing changes to the curriculum.", "thai": "เขากำลังเสนอการเปลี่ยนแปลงหลักสูตร"}
{"word": "curriculum", "english": "The curriculum includes a study abroad option.", "thai": "หลักสูตรรวมถึงตัวเลือกการเรียนต่อต่างประเทศ"}
{"word": "curriculum", "english": "She’s teaching a class in the new curriculum.", "thai": "เธอกำลังสอนวิชาในหลักสูตรใหม่"}
{"word": "curriculum", "english": "The curriculum is tailored for engineering students.", "thai": "หลักสูตรถูกปรับให้เหมาะกับนักศึกษาวิศวกรรม"}
{"word": "curriculum", "english": "I’m reviewing the curriculum with my advisor.", "thai": "ฉันกำลังตรวจสอบหลักสูตรกับที่ปรึกษา"}
{"word": "curriculum", "english": "The curriculum has a lot of required courses.", "thai": "หลักสูตรมีวิชาบังคับเยอะ"}
{"word": "curriculum", "english": "He’s developing a curriculum for coding bootcamp.", "thai": "เขากำลังพัฒนาหลักสูตรสำหรับค่ายฝึกเขียนโค้ด"}
{"word": "curriculum", "english": "The curriculum was updated to include AI topics.", "thai": "หลักสูตรได้รับการอัปเดตให้รวมหัวข้อ AI"}
{"word": "curriculum", "english": "She’s following the curriculum for her degree.", "thai": "เธอกำลังปฏิบัติตามหลักสูตรสำหรับปริญญาของเธอ"}
{"word": "curriculum", "english": "The curriculum is rigorous but rewarding.", "thai": "หลักสูตรเข้มงวดแต่ให้ผลตอบแทนคุ้มค่า"}
{"word": "curriculum", "english": "I’m taking a course outside the curriculum.", "thai": "ฉันกำลังเรียนวิชานอกหลักสูตร"}
{"word": "curriculum", "english": "The curriculum includes a research component.", "thai": "หลักสูตรรวมถึงส่วนประกอบการวิจัย"}
{"word": "curriculum", "english": "He’s discussing the curriculum with the faculty.", "thai": "เขากำลังหารือเกี่ยวกับหลักสูตรกับคณาจารย์"}
{"word": "curriculum", "english": "The curriculum is designed for hands-on learning.", "thai": "หลักสูตรถูกออกแบบสำหรับการเรียนรู้แบบปฏิบัติ"}
{"word": "curriculum", "english": "She’s suggesting changes to the curriculum.", "thai": "เธอกำลังเสนอการเปลี่ยนแปลงหลักสูตร"}
{"word": "curriculum", "english": "The curriculum covers environmental science.", "thai": "หลักสูตรครอบคลุมวิทยาศาสตร์สิ่งแวดล้อม"}
{"word": "curriculum", "english": "I’m studying the curriculum for my minor.", "thai": "ฉันกำลังศึกษาหลักสูตรสำหรับสาขาวิชาโทของฉัน"}
{"word": "curriculum", "english": "The curriculum is part of a new program.", "thai": "หลักสูตรเป็นส่วนหนึ่งของโปรแกรมใหม่"}
{"word": "curriculum", "english": "He’s teaching a course in the core curriculum.", "thai": "เขากำลังสอนวิชาในหลักสูตรแกนกลาง"}
{"word": "curriculum", "english": "The curriculum was revised last semester.", "thai": "หลักสูตรได้รับการปรับปรุงเมื่อภาคเรียนที่แล้ว"}
{"word": "curriculum", "english": "She’s excited about the new art curriculum.", "thai": "เธอตื่นเต้นกับหลักสูตรศิลปะใหม่"}
{"word": "curriculum", "english": "The curriculum includes practical workshops.", "thai": "หลักสูตรรวมถึงการประชุมเชิงปฏิบัติการ"}
{"word": "curriculum", "english": "I’m struggling with the curriculum’s pace.", "thai": "ฉันกำลังมีปัญหากับจังหวะของหลักสูตร"}
{"word": "curriculum", "english": "The curriculum is tailored for business majors.", "thai": "หลักสูตรถูกปรับให้เหมาะกับสาขาวิชาเอกธุรกิจ"}
{"word": "curriculum", "english": "He’s reviewing the curriculum for accreditation.", "thai": "เขากำลังตรวจสอบหลักสูตรเพื่อการรับรอง"}
{"word": "curriculum", "english": "The curriculum emphasizes teamwork skills.", "thai": "หลักสูตรเน้นทักษะการทำงานเป็นทีม"}
{"word": "curriculum", "english": "She’s developing a curriculum for online learning.", "thai": "เธอกำลังพัฒนาหลักสูตรสำหรับการเรียนออนไลน์"}
{"word": "curriculum", "english": "The curriculum includes a lot of lab work.", "thai": "หลักสูตรรวมถึงงานปฏิบัติการเยอะ"}
{"word": "curriculum", "english": "I’m discussing the curriculum with my professor.", "thai": "ฉันกำลังหารือเกี่ยวกับหลักสูตรกับอาจารย์"}
{"word": "curriculum", "english": "The curriculum is focused on sustainability.", "thai": "หลักสูตรเน้นเรื่องความยั่งยืน"}
{"word": "curriculum", "english": "He’s proposing a new curriculum for coding.", "thai": "เขากำลังเสนอหลักสูตรใหม่สำหรับการเขียนโค้ด"}
{"word": "curriculum", "english": "The curriculum was approved by the board.", "thai": "หลักสูตรได้รับการอนุมัติจากคณะกรรมการ"}
{"word": "curriculum", "english": "She’s studying the curriculum for her program.", "thai": "เธอกำลังศึกษาหลักสูตรสำหรับโปรแกรมของเธอ"}
{"word": "curriculum", "english": "The curriculum is designed for advanced students.", "thai": "หลักสูตรถูกออกแบบสำหรับนักเรียนขั้นสูง"}
{"word": "curriculum", "english": "I’m taking a course in the new curriculum.", "thai": "ฉันกำลังเรียนวิชาในหลักสูตรใหม่"}
{"word": "curriculum", "english": "The curriculum includes guest lectures.", "thai": "หลักสูตรรวมถึงการบรรยายจากวิทยากรรับเชิญ"}
{"word": "curriculum", "english": "He’s teaching in the updated curriculum.", "thai": "เขากำลังสอนในหลักสูตรที่อัปเดต"}
{"word": "curriculum", "english": "The curriculum covers global issues.", "thai": "หลักสูตรครอบคลุมประเด็นระดับโลก"}
{"word": "curriculum", "english": "She’s reviewing the curriculum for her department.", "thai": "เธอกำลังตรวจสอบหลักสูตรสำหรับภาควิชาของเธอ"}
{"word": "curriculum", "english": "The curriculum is part of the honors program.", "thai": "หลักสูตรเป็นส่วนหนึ่งของโปรแกรมเกียรตินิยม"}
{"word": "curriculum", "english": "I’m struggling with the curriculum requirements.", "thai": "ฉันกำลังมีปัญหากับข้อกำหนดของหลักสูตร"}
{"word": "curriculum", "english": "The curriculum includes field trips.", "thai": "หลักสูตรรวมถึงการทัศนศึกษา"}
{"word": "curriculum", "english": "He’s developing a curriculum for data science.", "thai": "เขากำลังพัฒนาหลักสูตรสำหรับวิทยาการข้อมูล"}
{"word": "curriculum", "english": "The curriculum was revised to include coding.", "thai": "หลักสูตรได้รับการปรับปรุงให้รวมการเขียนโค้ด"}
{"word": "curriculum", "english": "She’s teaching a class in the new curriculum.", "thai": "เธอกำลังสอนวิชาในหลักสูตรใหม่"}
{"word": "curriculum", "english": "The curriculum is focused on real-world applications.", "thai": "หลักสูตรเน้นการประยุกต์ใช้ในโลกจริง"}
{"word": "curriculum", "english": "I’m reviewing the curriculum with my advisor.", "thai": "ฉันกำลังตรวจสอบหลักสูตรกับที่ปรึกษา"}
{"word": "curriculum", "english": "The curriculum includes a lot of writing.", "thai": "หลักสูตรรวมถึงงานเขียนเยอะ"}
{"word": "curriculum", "english": "He’s proposing changes to the science curriculum.", "thai": "เขากำลังเสนอการเปลี่ยนแปลงหลักสูตรวิทยาศาสตร์"}
{"word": "curriculum", "english": "The curriculum is aligned with career goals.", "thai": "หลักสูตรสอดคล้องกับเป้าหมายอาชีพ"}
{"word": "curriculum", "english": "She’s excited about the new history curriculum.", "thai": "เธอตื่นเต้นกับหลักสูตรประวัติศาสตร์ใหม่"}
{"word": "curriculum", "english": "The curriculum emphasizes problem-solving.", "thai": "หลักสูตรเน้นการแก้ปัญหา"}
{"word": "curriculum", "english": "I’m studying the curriculum for my program.", "thai": "ฉันกำลังศึกษาหลักสูตรสำหรับโปรแกรมของฉัน"}
{"word": "curriculum", "english": "The curriculum was updated last year.", "thai": "หลักสูตรได้รับการอัปเดตเมื่อปีที่แล้ว"}
{"word": "curriculum", "english": "He’s teaching a course in the revised curriculum.", "thai": "เขากำลังสอนวิชาในหลักสูตรที่ปรับปรุง"}
{"word": "curriculum", "english": "The curriculum includes interdisciplinary courses.", "thai": "หลักสูตรรวมถึงวิชาสหสาขาวิชา"}
{"word": "curriculum", "english": "She’s reviewing the curriculum for her major.", "thai": "เธอกำลังตรวจสอบหลักสูตรสำหรับสาขาวิชาเอกของเธอ"}
{"word": "curriculum", "english": "The curriculum is designed for practical learning.", "thai": "หลักสูตรถูกออกแบบสำหรับการเรียนรู้เชิงปฏิบัติ"}
{"word": "curriculum", "english": "I’m taking a class outside the curriculum.", "thai": "ฉันกำลังเรียนวิชานอกหลักสูตร"}
{"word": "curriculum", "english": "The curriculum includes a capstone project.", "thai": "หลักสูตรรวมถึงโปรเจกต์สุดท้าย"}
{"word": "curriculum", "english": "He’s discussing the curriculum with the dean.", "thai": "เขากำลังหารือเกี่ยวกับหลักสูตรกับคณบดี"}
{"word": "curriculum", "english": "The curriculum is tailored for pre-med students.", "thai": "หลักสูตรถูกปรับให้เหมาะกับนักศึกษาเตรียมแพทย์"}
{"word": "curriculum", "english": "She’s developing a curriculum for art classes.", "thai": "เธอกำลังพัฒนาหลักสูตรสำหรับชั้นเรียนศิลปะ"}
{"word": "curriculum", "english": "The curriculum covers advanced mathematics.", "thai": "หลักสูตรครอบคลุมคณิตศาสตร์ขั้นสูง"}
{"word": "curriculum", "english": "I’m struggling with the curriculum’s intensity.", "thai": "ฉันกำลังมีปัญหากับความเข้มข้นของหลักสูตร"}
{"word": "curriculum", "english": "The curriculum is part of the new degree plan.", "thai": "หลักสูตรเป็นส่วนหนึ่งของแผนปริญญาใหม่"}
{"word": "curriculum", "english": "He’s teaching in the core curriculum.", "thai": "เขากำลังสอนในหลักสูตรแกนกลาง"}
{"word": "curriculum", "english": "The curriculum includes online components.", "thai": "หลักสูตรรวมถึงส่วนประกอบออนไลน์"}
{"word": "curriculum", "english": "She’s excited about the new music curriculum.", "thai": "เธอตื่นเต้นกับหลักสูตรดนตรีใหม่"}
{"word": "curriculum", "english": "The curriculum emphasizes leadership skills.", "thai": "หลักสูตรเน้นทักษะความเป็นผู้นำ"}
{"word": "curriculum", "english": "I’m reviewing the curriculum for my degree.", "thai": "ฉันกำลังตรวจสอบหลักสูตรสำหรับปริญญาของฉัน"}
{"word": "curriculum", "english": "The curriculum was revised to include ethics.", "thai": "หลักสูตรได้รับการปรับปรุงให้รวมจริยธรรม"}
{"word": "curriculum", "english": "He’s proposing a new curriculum for engineering.", "thai": "เขากำลังเสนอหลักสูตรใหม่สำหรับวิศวกรรม"}
{"word": "curriculum", "english": "The curriculum is aligned with global standards.", "thai": "หลักสูตรสอดคล้องกับมาตรฐานสากล"}
{"word": "curriculum", "english": "She’s teaching a course in the new curriculum.", "thai": "เธอกำลังสอนวิชาในหลักสูตรใหม่"}
{"word": "curriculum", "english": "The curriculum includes a lot of case studies.", "thai": "หลักสูตรรวมถึงกรณีศึกษาเยอะ"}
{"word": "curriculum", "english": "I’m studying the curriculum for my program.", "thai": "ฉันกำลังศึกษาหลักสูตรสำหรับโปรแกรมของฉัน"}
{"word": "curriculum", "english": "The curriculum is designed for career readiness.", "thai": "หลักสูตรถูกออกแบบเพื่อความพร้อมในอาชีพ"}
{"word": "curriculum", "english": "He’s discussing the curriculum with the chancellor.", "thai": "เขากำลังหารือเกี่ยวกับหลักสูตรกับอธิการบดี"}
{"word": "curriculum", "english": "The curriculum includes a lot of practical training.", "thai": "หลักสูตรรวมถึงการฝึกปฏิบัติเยอะ"}
{"word": "curriculum", "english": "She’s reviewing the curriculum for her department.", "thai": "เธอกำลังตรวจสอบหลักสูตรสำหรับภาควิชาของเธอ"}
{"word": "curriculum", "english": "The curriculum is part of the general education plan.", "thai": "หลักสูตรเป็นส่วนหนึ่งของแผนการศึกษาทั่วไป"}
{"word": "dean", "english": "I’m meeting the dean to discuss my major.", "thai": "ฉันกำลังจะพบคณบดีเพื่อหารือเกี่ยวกับสาขาวิชาเอกของฉัน"}
{"word": "dean", "english": "The dean approved the new course proposal.", "thai": "คณบดีอนุมัติข้อเสนอวิชาใหม่"}
{"word": "dean", "english": "She spoke with the dean about scholarships.", "thai": "เธอพูดคุยกับคณบดีเกี่ยวกับทุนการศึกษา"}
{"word": "dean", "english": "The dean gave a speech at the orientation.", "thai": "คณบดีกล่าวสุนทรพจน์ในงานปฐมนิเทศ"}
{"word": "dean", "english": "He’s been appointed as the new dean.", "thai": "เขาได้รับการแต่งตั้งเป็นคณบดีคนใหม่"}
{"word": "dean", "english": "The dean is reviewing the department budget.", "thai": "คณบดีกำลังตรวจสอบงบประมาณของภาควิชา"}
{"word": "dean", "english": "I wrote a letter to the dean about tuition.", "thai": "ฉันเขียนจดหมายถึงคณบดีเกี่ยวกับค่าเล่าเรียน"}
{"word": "dean", "english": "The dean hosted a faculty meeting yesterday.", "thai": "คณบดีเป็นเจ้าภาพการประชุมคณาจารย์เมื่อวานนี้"}
{"word": "dean", "english": "She’s discussing research funding with the dean.", "thai": "เธอกำลังหารือเรื่องเงินทุนวิจัยกับคณบดี"}
{"word": "dean", "english": "The dean attended the student art show.", "thai": "คณบดีเข้าร่วมนิทรรศการศิลปะของนักศึกษา"}
{"word": "dean", "english": "He’s meeting the dean about academic probation.", "thai": "เขากำลังพบคณบดีเกี่ยวกับการถูกพักการเรียน"}
{"word": "dean", "english": "The dean welcomed new students to campus.", "thai": "คณบดีต้อนรับนักศึกษาใหม่สู่มหาวิทยาลัย"}
{"word": "dean", "english": "She’s presenting a proposal to the dean.", "thai": "เธอกำลังนำเสนอข้อเสนอต่อคณบดี"}
{"word": "dean", "english": "The dean is very supportive of the arts.", "thai": "คณบดีสนับสนุนศิลปะอย่างมาก"}
{"word": "dean", "english": "I saw the dean at the campus fundraiser.", "thai": "ฉันเห็นคณบดีในงานระดมทุนของมหาวิทยาลัย"}
{"word": "dean", "english": "The dean addressed student concerns today.", "thai": "คณบดีกล่าวถึงข้อกังวลของนักศึกษาวันนี้"}
{"word": "dean", "english": "He’s working with the dean on a new program.", "thai": "เขากำลังทำงานกับคณบดีในโปรแกรมใหม่"}
{"word": "dean", "english": "The dean approved the new curriculum changes.", "thai": "คณบดีอนุมัติการเปลี่ยนแปลงหลักสูตรใหม่"}
{"word": "dean", "english": "She’s asking the dean for more resources.", "thai": "เธอกำลังขอทรัพยากรเพิ่มจากคณบดี"}
{"word": "dean", "english": "The dean is speaking at the alumni event.", "thai": "คณบดีกำลังพูดในงานศิษย์เก่า"}
{"word": "dean", "english": "He’s discussing campus safety with the dean.", "thai": "เขากำลังหารือเรื่องความปลอดภัยในมหาวิทยาลัยกับคณบดี"}
{"word": "dean", "english": "The dean visited the new science lab.", "thai": "คณบดีเยี่ยมชมห้องปฏิบัติการวิทยาศาสตร์ใหม่"}
{"word": "dean", "english": "She’s writing to the dean about housing issues.", "thai": "เธอกำลังเขียนถึงคณบดีเกี่ยวกับปัญหาที่พัก"}
{"word": "dean", "english": "The dean is hosting a student forum.", "thai": "คณบดีเป็นเจ้าภาพการประชุมนักศึกษา"}
{"word": "dean", "english": "He’s presenting research to the dean.", "thai": "เขากำลังนำเสนองานวิจัยต่อคณบดี"}
{"word": "dean", "english": "The dean spoke about diversity initiatives.", "thai": "คณบดีพูดเกี่ยวกับโครงการความหลากหลาย"}
{"word": "dean", "english": "She’s meeting the dean about study abroad.", "thai": "เธอกำลังพบคณบดีเกี่ยวกับการเรียนต่อต่างประเทศ"}
{"word": "dean", "english": "The dean approved the new club proposal.", "thai": "คณบดีอนุมัติข้อเสนอชมรมใหม่"}
{"word": "dean", "english": "He’s been the dean for three years now.", "thai": "เขาเป็นคณบดีมาได้สามปีแล้ว"}
{"word": "dean", "english": "The dean attended the music recital.", "thai": "คณบดีเข้าร่วมการแสดงดนตรีเดี่ยว"}
{"word": "dean", "english": "She’s inviting the dean to the lecture series.", "thai": "เธอกำลังเชิญคณบดีเข้าร่วมชุดการบรรยาย"}
{"word": "dean", "english": "The dean is reviewing new faculty hires.", "thai": "คณบดีกำลังตรวจสอบการจ้างคณาจารย์ใหม่"}
{"word": "dean", "english": "He’s discussing budgets with the dean.", "thai": "เขากำลังหารือเรื่องงบประมาณกับคณบดี"}
{"word": "dean", "english": "The dean spoke at the career fair.", "thai": "คณบดีพูดในงานแสดงอาชีพ"}
{"word": "dean", "english": "She’s addressing the dean about mental health.", "thai": "เธอกำลังพูดกับคณบดีเกี่ยวกับสุขภาพจิต"}
{"word": "dean", "english": "The dean opened the new student center.", "thai": "คณบดีเปิดศูนย์นักศึกษาใหม่"}
{"word": "dean", "english": "He’s working with the dean on a fundraiser.", "thai": "เขากำลังทำงานกับคณบดีในงานระดมทุน"}
{"word": "dean", "english": "The dean is hosting a faculty dinner.", "thai": "คณบดีเป็นเจ้าภาพงานเลี้ยงคณาจารย์"}
{"word": "dean", "english": "She’s presenting a plan to the dean.", "thai": "เธอกำลังนำเสนอแผนต่อคณบดี"}
{"word": "dean", "english": "The dean is speaking at the convocation.", "thai": "คณบดีกำลังพูดในพิธีเปิดการศึกษา"}
{"word": "dean", "english": "He’s discussing diversity with the dean.", "thai": "เขากำลังหารือเรื่องความหลากหลายกับคณบดี"}
{"word": "dean", "english": "The dean attended the theater performance.", "thai": "คณบดีเข้าร่วมการแสดงละคร"}
{"word": "dean", "english": "She’s writing to the dean about parking.", "thai": "เธอกำลังเขียนถึงคณบดีเกี่ยวกับที่จอดรถ"}
{"word": "dean", "english": "The dean approved the new sports facility.", "thai": "คณบดีอนุมัติสิ่งอำนวยความสะดวกกีฬาใหม่"}
{"word": "dean", "english": "He’s meeting the dean about internships.", "thai": "เขากำลังพบคณบดีเกี่ยวกับการฝึกงาน"}
{"word": "dean", "english": "The dean is addressing tuition concerns.", "thai": "คณบดีกำลังพูดถึงข้อกังวลเรื่องค่าเล่าเรียน"}
{"word": "dean", "english": "She’s inviting the dean to the science fair.", "thai": "เธอกำลังเชิญคณบดีเข้าร่วมงานนิทรรศการวิทยาศาสตร์"}
{"word": "dean", "english": "The dean visited the engineering department.", "thai": "คณบดีเยี่ยมชมภาควิชาวิศวกรรม"}
{"word": "dean", "english": "He’s presenting a budget to the dean.", "thai": "เขากำลังนำเสนองบประมาณต่อคณบดี"}
{"word": "dean", "english": "The dean spoke about academic excellence.", "thai": "คณบดีพูดเกี่ยวกับความเป็นเลิศทางวิชาการ"}
{"word": "dean", "english": "She’s discussing research with the dean.", "thai": "เธอกำลังหารือเรื่องการวิจัยกับคณบดี"}
{"word": "dean", "english": "The dean is hosting a community event.", "thai": "คณบดีเป็นเจ้าภาพงานชุมชน"}
{"word": "dean", "english": "He’s working with the dean on a new initiative.", "thai": "เขากำลังทำงานกับคณบดีในโครงการใหม่"}
{"word": "dean", "english": "The dean attended the student rally.", "thai": "คณบดีเข้าร่วมการชุมนุมของนักศึกษา"}
{"word": "dean", "english": "She’s meeting the dean about student services.", "thai": "เธอกำลังพบคณบดีเกี่ยวกับบริการนักศึกษา"}
{"word": "dean", "english": "The dean is speaking at the alumni dinner.", "thai": "คณบดีกำลังพูดในงานเลี้ยงศิษย์เก่า"}
{"word": "dean", "english": "He’s discussing campus expansion with the dean.", "thai": "เขากำลังหารือเรื่องการขยายมหาวิทยาลัยกับคณบดี"}
{"word": "dean", "english": "The dean approved the new degree program.", "thai": "คณบดีอนุมัติหลักสูตรปริญญาใหม่"}
{"word": "dean", "english": "She’s asking the dean for more advisors.", "thai": "เธอกำลังขอที่ปรึกษาเพิ่มจากคณบดี"}
{"word": "dean", "english": "The dean visited the new dorms.", "thai": "คณบดีเยี่ยมชมหอพักใหม่"}
{"word": "dean", "english": "He’s writing a report for the dean.", "thai": "เขากำลังเขียนรายงานให้คณบดี"}
{"word": "dean", "english": "The dean is reviewing course evaluations.", "thai": "คณบดีกำลังตรวจสอบการประเมินวิชา"}
{"word": "dean", "english": "She’s presenting a sustainability plan to the dean.", "thai": "เธอกำลังนำเสนอแผนความยั่งยืนต่อคณบดี"}
{"word": "dean", "english": "The dean is speaking at the career workshop.", "thai": "คณบดีกำลังพูดในงานประชุมเชิงปฏิบัติการด้านอาชีพ"}
{"word": "dean", "english": "He’s discussing alumni relations with the dean.", "thai": "เขากำลังหารือเรื่องความสัมพันธ์กับศิษย์เก่ากับคณบดี"}
{"word": "dean", "english": "The dean attended the debate competition.", "thai": "คณบดีเข้าร่วมการแข่งขันโต้วาที"}
{"word": "dean", "english": "She’s inviting the dean to the art exhibit.", "thai": "เธอกำลังเชิญคณบดีเข้าร่วมนิทรรศการศิลปะ"}
{"word": "dean", "english": "The dean approved the new parking plan.", "thai": "คณบดีอนุมัติแผนที่จอดรถใหม่"}
{"word": "dean", "english": "He’s working with the dean on a scholarship fund.", "thai": "เขากำลังทำงานกับคณบดีในกองทุนทุนการศึกษา"}
{"word": "dean", "english": "The dean is hosting a leadership seminar.", "thai": "คณบดีเป็นเจ้าภาพสัมมนาผู้นำ"}
{"word": "dean", "english": "She’s addressing the dean about campus events.", "thai": "เธอกำลังพูดกับคณบดีเกี่ยวกับงานในมหาวิทยาลัย"}
{"word": "dean", "english": "The dean visited the chemistry lab.", "thai": "คณบดีเยี่ยมชมห้องปฏิบัติการเคมี"}
{"word": "dean", "english": "He’s presenting a proposal to the dean.", "thai": "เขากำลังนำเสนอข้อเสนอต่อคณบดี"}
{"word": "dean", "english": "The dean spoke about student engagement.", "thai": "คณบดีพูดเกี่ยวกับการมีส่วนร่วมของนักศึกษา"}
{"word": "dean", "english": "She’s meeting the dean about research grants.", "thai": "เธอกำลังพบคณบดีเกี่ยวกับทุนวิจัย"}
{"word": "dean", "english": "The dean is hosting a student Q&A session.", "thai": "คณบดีเป็นเจ้าภาพเซสชันถาม-ตอบกับนักศึกษา"}
{"word": "dean", "english": "He’s discussing new courses with the dean.", "thai": "เขากำลังหารือเกี่ยวกับวิชาใหม่กับคณบดี"}
{"word": "dean", "english": "The dean attended the music performance.", "thai": "คณบดีเข้าร่วมการแสดงดนตรี"}
{"word": "dean", "english": "She’s writing to the dean about student services.", "thai": "เธอกำลังเขียนถึงคณบดีเกี่ยวกับบริการนักศึกษา"}
{"word": "dean", "english": "The dean approved the new library budget.", "thai": "คณบดีอนุมัติงบประมาณห้องสมุดใหม่"}
{"word": "dean", "english": "He’s working with the dean on a new initiative.", "thai": "เขากำลังทำงานกับคณบดีในโครงการใหม่"}
{"word": "dean", "english": "The dean is speaking at the diversity panel.", "thai": "คณบดีกำลังพูดในคณะอภิปรายความหลากหลาย"}
{"word": "dean", "english": "She’s inviting the dean to the science symposium.", "thai": "เธอกำลังเชิญคณบดีเข้าร่วมสัมมนาวิทยาศาสตร์"}
{"word": "dean", "english": "The dean approved the new academic policy.", "thai": "คณบดีอนุมัตินโยบายวิชาการใหม่"}
{"word": "dean", "english": "He’s discussing faculty hiring with the dean.", "thai": "เขากำลังหารือเรื่องการจ้างคณาจารย์กับคณบดี"}
{"word": "dean", "english": "The dean attended the student council meeting.", "thai": "คณบดีเข้าร่วมการประชุมสภานักศึกษา"}
{"word": "dean", "english": "She’s presenting a budget plan to the dean.", "thai": "เธอกำลังนำเสนอแผนงบประมาณต่อคณบดี"}
{"word": "dean", "english": "The dean is speaking at the research conference.", "thai": "คณบดีกำลังพูดในงานประชุมวิจัย"}
{"word": "dean", "english": "He’s working with the dean on a new curriculum.", "thai": "เขากำลังทำงานกับคณบดีในหลักสูตรใหม่"}
{"word": "dean", "english": "The dean visited the new lecture hall.", "thai": "คณบดีเยี่ยมชมห้องบรรยายใหม่"}
{"word": "dean", "english": "She’s addressing the dean about campus safety.", "thai": "เธอกำลังพูดกับคณบดีเกี่ยวกับความปลอดภัยในมหาวิทยาลัย"}
{"word": "dean", "english": "The dean is hosting a career workshop.", "thai": "คณบดีเป็นเจ้าภาพการประชุมเชิงปฏิบัติการด้านอาชีพ"}
{"word": "dean", "english": "He’s discussing student retention with the dean.", "thai": "เขากำลังหารือเรื่องการรักษานักศึกษากับคณบดี"}
{"word": "dean", "english": "The dean attended the engineering showcase.", "thai": "คณบดีเข้าร่วมงานแสดงวิศวกรรม"}
{"word": "dean", "english": "She’s inviting the dean to the charity event.", "thai": "เธอกำลังเชิญคณบดีเข้าร่วมงานการกุศล"}
{"word": "dean", "english": "The dean approved the new research grant.", "thai": "คณบดีอนุมัติทุนวิจัยใหม่"}
{"word": "degree", "english": "I’m working on my bachelor’s degree in biology.", "thai": "ฉันกำลังเรียนปริญญาตรีด้านชีววิทยา"}
{"word": "degree", "english": "She just earned her master’s degree.", "thai": "เธอเพิ่งได้รับปริญญาโท"}
{"word": "degree", "english": "He’s pursuing a degree in engineering.", "thai": "เขากำลังเรียนปริญญาด้านวิศวกรรม"}
{"word": "degree", "english": "The degree program is really competitive.", "thai": "หลักสูตรปริญญานี้มีการแข่งขันสูง"}
{"word": "degree", "english": "I’m one year away from my degree.", "thai": "ฉันเหลืออีกหนึ่งปีจะได้ปริญญา"}
{"word": "degree", "english": "She’s considering a degree in psychology.", "thai": "เธอกำลังพิจารณาเรียนปริญญาด้านจิตวิทยา"}
{"word": "degree", "english": "He earned his degree in computer science.", "thai": "เขาได้รับปริญญาด้านวิทยาการคอมพิวเตอร์"}
{"word": "degree", "english": "The degree requires 120 credits to complete.", "thai": "ปริญญานี้ต้องใช้ 120 หน่วยกิตจึงจะสำเร็จ"}
{"word": "degree", "english": "I’m switching my degree to business.", "thai": "ฉันกำลังเปลี่ยนปริญญาเป็นด้านธุรกิจ"}
{"word": "degree", "english": "She’s proud of her degree in literature.", "thai": "เธอภูมิใจกับปริญญาด้านวรรณคดี"}
{"word": "degree", "english": "He’s working on a degree in history.", "thai": "เขากำลังเรียนปริญญาด้านประวัติศาสตร์"}
{"word": "degree", "english": "The degree program includes an internship.", "thai": "หลักสูตรปริญญานี้รวมถึงการฝึกงาน"}
{"word": "degree", "english": "I’m halfway through my degree program.", "thai": "ฉันเรียนครึ่งทางของหลักสูตรปริญญาแล้ว"}
{"word": "degree", "english": "She’s applying for a degree in education.", "thai": "เธอกำลังสมัครเรียนปริญญาด้านการศึกษา"}
{"word": "degree", "english": "He completed his degree last spring.", "thai": "เขาเรียนจบปริญญาเมื่อฤดูใบไม้ผลิที่แล้ว"}
{"word": "degree", "english": "The degree has a lot of math requirements.", "thai": "ปริญญานี้มีข้อกำหนดด้านคณิตศาสตร์เยอะ"}
{"word": "degree", "english": "I’m considering a double degree.", "thai": "ฉันกำลังพิจารณาเรียนปริญญาคู่"}
{"word": "degree", "english": "She’s pursuing a degree in graphic design.", "thai": "เธอกำลังเรียนปริญญาด้านการออกแบบกราฟิก"}
{"word": "degree", "english": "He’s excited about his degree in physics.", "thai": "เขาตื่นเต้นกับปริญญาด้านฟิสิกส์"}
{"word": "degree", "english": "The degree program is four years long.", "thai": "หลักสูตรปริญญานี้ใช้เวลาสี่ปี"}
{"word": "degree", "english": "I’m working toward a degree in chemistry.", "thai": "ฉันกำลังเรียนเพื่อปริญญาด้านเคมี"}
{"word": "degree", "english": "She’s finishing her degree this semester.", "thai": "เธอกำลังเรียนจบปริญญาในภาคเรียนนี้"}
{"word": "degree", "english": "He’s applying for a graduate degree.", "thai": "เขากำลังสมัครเรียนปริญญาโท"}
{"word": "degree", "english": "The degree requires a capstone project.", "thai": "ปริญญานี้ต้องทำโปรเจกต์สุดท้าย"}
{"word": "degree", "english": "I’m struggling with my degree requirements.", "thai": "ฉันกำลังมีปัญหากับข้อกำหนดปริญญา"}
{"word": "degree", "english": "She earned a degree in environmental science.", "thai": "เธอได้รับปริญญาด้านวิทยาศาสตร์สิ่งแวดล้อม"}
{"word": "degree", "english": "He’s pursuing a degree in political science.", "thai": "เขากำลังเรียนปริญญาด้านรัฐศาสตร์"}
{"word": "degree", "english": "The degree program has flexible scheduling.", "thai": "หลักสูตรปริญญานี้มีตารางเรียนที่ยืดหยุ่น"}
{"word": "degree", "english": "I’m thinking about a degree in sociology.", "thai": "ฉันกำลังคิดถึงการเรียนปริญญาด้านสังคมวิทยา"}
{"word": "degree", "english": "She’s working on a degree in art history.", "thai": "เธอกำลังเรียนปริญญาด้านประวัติศาสตร์ศิลปะ"}
{"word": "degree", "english": "He completed a degree in economics.", "thai": "เขาเรียนจบปริญญาด้านเศรษฐศาสตร์"}
{"word": "degree", "english": "The degree includes a study abroad option.", "thai": "ปริญญานี้มีตัวเลือกการเรียนต่อต่างประเทศ"}
{"word": "degree", "english": "I’m close to finishing my degree.", "thai": "ฉันใกล้จะเรียนจบปริญญาแล้ว"}
{"word": "degree", "english": "She’s applying for a degree in nursing.", "thai": "เธอกำลังสมัครเรียนปริญญาด้านพยาบาล"}
{"word": "degree", "english": "He’s pursuing a degree in data science.", "thai": "เขากำลังเรียนปริญญาด้านวิทยาการข้อมูล"}
{"word": "degree", "english": "The degree program is highly ranked.", "thai": "หลักสูตรปริญญานี้มีอันดับสูง"}
{"word": "degree", "english": "I’m working on a degree in anthropology.", "thai": "ฉันกำลังเรียนปริญญาด้านมานุษยวิทยา"}
{"word": "degree", "english": "She earned her degree in just three years.", "thai": "เธอได้รับปริญญาในเวลาเพียงสามปี"}
{"word": "degree", "english": "He’s considering a degree in philosophy.", "thai": "เขากำลังพิจารณาเรียนปริญญาด้านปรัชญา"}
{"word": "degree", "english": "The degree requires a lot of lab work.", "thai": "ปริญญานี้ต้องใช้การทำงานในห้องปฏิบัติการเยอะ"}
{"word": "degree", "english": "I’m switching my degree to marketing.", "thai": "ฉันกำลังเปลี่ยนปริญญาเป็นด้านการตลาด"}
{"word": "degree", "english": "She’s proud of her degree in education.", "thai": "เธอภูมิใจกับปริญญาด้านการศึกษา"}
{"word": "degree", "english": "He’s working on a degree in mathematics.", "thai": "เขากำลังเรียนปริญญาด้านคณิตศาสตร์"}
{"word": "degree", "english": "The degree program includes a thesis.", "thai": "หลักสูตรปริญญานี้รวมถึงวิทยานิพนธ์"}
{"word": "degree", "english": "I’m pursuing a degree in public health.", "thai": "ฉันกำลังเรียนปริญญาด้านสาธารณสุข"}
{"word": "degree", "english": "She’s finishing her degree online.", "thai": "เธอกำลังเรียนจบปริญญาออนไลน์"}
{"word": "degree", "english": "He’s applying for a doctoral degree.", "thai": "เขากำลังสมัครเรียนปริญญาเอก"}
{"word": "degree", "english": "The degree has a lot of core courses.", "thai": "ปริญญานี้มีวิชาแกนกลางเยอะ"}
{"word": "degree", "english": "I’m working toward a degree in journalism.", "thai": "ฉันกำลังเรียนเพื่อปริญญาด้านวารสารศาสตร์"}
{"word": "degree", "english": "She’s excited about her degree in music.", "thai": "เธอตื่นเต้นกับปริญญาด้านดนตรี"}
{"word": "degree", "english": "He completed his degree in finance.", "thai": "เขาเรียนจบปริญญาด้านการเงิน"}
{"word": "degree", "english": "The degree program offers hands-on experience.", "thai": "หลักสูตรปริญญานี้ให้ประสบการณ์ปฏิบัติ"}
{"word": "degree", "english": "I’m considering a degree in linguistics.", "thai": "ฉันกำลังพิจารณาเรียนปริญญาด้านภาษาศาสตร์"}
{"word": "degree", "english": "She’s pursuing a degree in architecture.", "thai": "เธอกำลังเรียนปริญญาด้านสถาปัตยกรรม"}
{"word": "degree", "english": "He’s working on a degree in neuroscience.", "thai": "เขากำลังเรียนปริญญาด้านประสาทวิทยา"}
{"word": "degree", "english": "The degree requires a final presentation.", "thai": "ปริญญานี้ต้องมีการนำเสนอครั้งสุดท้าย"}
{"word": "degree", "english": "I’m struggling with my degree’s coursework.", "thai": "ฉันกำลังมีปัญหากับงานวิชาของปริญญา"}
{"word": "degree", "english": "She earned a degree in international relations.", "thai": "เธอได้รับปริญญาด้านความสัมพันธ์ระหว่างประเทศ"}
{"word": "degree", "english": "He’s pursuing a degree in urban planning.", "thai": "เขากำลังเรียนปริญญาด้านการวางผังเมือง"}
{"word": "degree", "english": "The degree program is accredited nationally.", "thai": "หลักสูตรปริญญานี้ได้รับการรับรองระดับชาติ"}
{"word": "degree", "english": "I’m working on a degree in biochemistry.", "thai": "ฉันกำลังเรียนปริญญาด้านชีวเคมี"}
{"word": "degree", "english": "She’s finishing her degree part-time.", "thai": "เธอกำลังเรียนจบปริญญาแบบนอกเวลา"}
{"word": "degree", "english": "He’s applying for a degree in law.", "thai": "เขากำลังสมัครเรียนปริญญาด้านกฎหมาย"}
{"word": "degree", "english": "The degree includes a lot of research.", "thai": "ปริญญานี้รวมถึงการวิจัยเยอะ"}
{"word": "degree", "english": "I’m pursuing a degree in creative writing.", "thai": "ฉันกำลังเรียนปริญญาด้านการเขียนสร้างสรรค์"}
{"word": "degree", "english": "She’s excited about her degree in theater.", "thai": "เธอตื่นเต้นกับปริญญาด้านละคร"}
{"word": "degree", "english": "He completed a degree in accounting.", "thai": "เขาเรียนจบปริญญาด้านบัญชี"}
{"word": "degree", "english": "The degree program has a strong reputation.", "thai": "หลักสูตรปริญญานี้มีชื่อเสียงดี"}
{"word": "degree", "english": "I’m considering a degree in public policy.", "thai": "ฉันกำลังพิจารณาเรียนปริญญาด้านนโยบายสาธารณะ"}
{"word": "degree", "english": "She’s pursuing a degree in social work.", "thai": "เธอกำลังเรียนปริญญาด้านสังคมสงเคราะห์"}
{"word": "degree", "english": "He’s working on a degree in astronomy.", "thai": "เขากำลังเรียนปริญญาด้านดาราศาสตร์"}
{"word": "degree", "english": "The degree requires a lot of group projects.", "thai": "ปริญญานี้ต้องทำโปรเจกต์กลุ่มเยอะ"}
{"word": "degree", "english": "I’m switching my degree to communications.", "thai": "ฉันกำลังเปลี่ยนปริญญาเป็นด้านการสื่อสาร"}
{"word": "degree", "english": "She’s proud of her degree in engineering.", "thai": "เธอภูมิใจกับปริญญาด้านวิศวกรรม"}
{"word": "degree", "english": "He’s working on a degree in philosophy.", "thai": "เขากำลังเรียนปริญญาด้านปรัชญา"}
{"word": "degree", "english": "The degree program includes a field study.", "thai": "หลักสูตรปริญญานี้รวมถึงการศึกษาภาคสนาม"}
{"word": "degree", "english": "I’m pursuing a degree in environmental policy.", "thai": "ฉันกำลังเรียนปริญญาด้านนโยบายสิ่งแวดล้อม"}
{"word": "degree", "english": "She’s finishing her degree this year.", "thai": "เธอกำลังเรียนจบปริญญาในปีนี้"}
{"word": "degree", "english": "He’s applying for a degree in medicine.", "thai": "เขากำลังสมัครเรียนปริญญาด้านการแพทย์"}
{"word": "degree", "english": "The degree has a lot of elective courses.", "thai": "ปริญญานี้มีวิชาเลือกเยอะ"}
{"word": "degree", "english": "I’m working toward a degree in statistics.", "thai": "ฉันกำลังเรียนเพื่อปริญญาด้านสถิติ"}
{"word": "degree", "english": "She’s excited about her degree in dance.", "thai": "เธอตื่นเต้นกับปริญญาด้านการเต้น"}
{"word": "degree", "english": "He completed a degree in marketing.", "thai": "เขาเรียนจบปริญญาด้านการตลาด"}
{"word": "degree", "english": "The degree program offers online classes.", "thai": "หลักสูตรปริญญานี้มีชั้นเรียนออนไลน์"}
{"word": "degree", "english": "I’m considering a degree in archaeology.", "thai": "ฉันกำลังพิจารณาเรียนปริญญาด้านโบราณคดี"}
{"word": "degree", "english": "She’s pursuing a degree in film studies.", "thai": "เธอกำลังเรียนปริญญาด้านการศึกษาภาพยนตร์"}
{"word": "degree", "english": "He’s working on a degree in cybersecurity.", "thai": "เขากำลังเรียนปริญญาด้านความปลอดภัยทางไซเบอร์"}
{"word": "degree", "english": "The degree requires a lot of writing.", "thai": "ปริญญานี้ต้องเขียนเยอะ"}
{"word": "degree", "english": "I’m pursuing a degree in game design.", "thai": "ฉันกำลังเรียนปริญญาด้านการออกแบบเกม"}
{"word": "degree", "english": "She’s excited about her degree in nutrition.", "thai": "เธอตื่นเต้นกับปริญญาด้านโภชนาการ"}
{"word": "degree", "english": "He completed a degree in geography.", "thai": "เขาเรียนจบปริญญาด้านภูมิศาสตร์"}
{"word": "degree", "english": "The degree program is tailored for careers.", "thai": "หลักสูตรปริญญานี้ถูกปรับให้เหมาะกับอาชีพ"}
{"word": "degree", "english": "I’m working on a degree in public administration.", "thai": "ฉันกำลังเรียนปริญญาด้านการบริหารสาธารณะ"}
{"word": "degree", "english": "She’s finishing her degree in urban studies.", "thai": "เธอกำลังเรียนจบปริญญาด้านการศึกษาเมือง"}
{"word": "degree", "english": "He’s applying for a degree in veterinary medicine.", "thai": "เขากำลังสมัครเรียนปริญญาด้านสัตวแพทยศาสตร์"}
{"word": "dormitory", "english": "I’m moving into the dormitory this weekend.", "thai": "ฉันกำลังย้ายเข้าหอพักในสุดสัปดาห์นี้"}
{"word": "dormitory", "english": "The dormitory is right next to the library.", "thai": "หอพักอยู่ติดกับห้องสมุด"}
{"word": "dormitory", "english": "She’s decorating her room in the dormitory.", "thai": "เธอกำลังตกแต่งห้องในหอพัก"}
{"word": "dormitory", "english": "The dormitory has a new lounge area.", "thai": "หอพักมีพื้นที่เลานจ์ใหม่"}
{"word": "dormitory", "english": "He forgot his keys in the dormitory.", "thai": "เขาลืมกุญแจไว้ในหอพัก"}
{"word": "dormitory", "english": "The dormitory is hosting a welcome party.", "thai": "หอพักกำลังจัดงานต้อนรับ"}
{"word": "dormitory", "english": "I’m meeting friends in the dormitory lobby.", "thai": "ฉันจะพบเพื่อนที่ล็อบบี้หอพัก"}
{"word": "dormitory", "english": "The dormitory has free Wi-Fi for students.", "thai": "หอพักมี Wi-Fi ฟรีสำหรับนักศึกษา"}
{"word": "dormitory", "english": "She’s studying in the dormitory common room.", "thai": "เธอกำลังเรียนอยู่ในห้องส่วนกลางของหอพัก"}
{"word": "dormitory", "english": "The dormitory is pretty quiet at night.", "thai": "หอพักเงียบสงบในตอนกลางคืน"}
{"word": "dormitory", "english": "He’s cleaning his room in the dormitory.", "thai": "เขากำลังทำความสะอาดห้องในหอพัก"}
{"word": "dormitory", "english": "The dormitory has a strict curfew.", "thai": "หอพักมีเคอร์ฟิวที่เข้มงวด"}
{"word": "dormitory", "english": "I left my backpack in the dormitory.", "thai": "ฉันลืมกระเป๋าเป้ไว้ในหอพัก"}
{"word": "dormitory", "english": "The dormitory is getting renovated this summer.", "thai": "หอพักกำลังได้รับการปรับปรุงในช่วงฤดูร้อนนี้"}
{"word": "dormitory", "english": "She’s organizing a movie night in the dormitory.", "thai": "เธอกำลังจัดคืนดูหนังในหอพัก"}
{"word": "dormitory", "english": "The dormitory is close to the dining hall.", "thai": "หอพักอยู่ใกล้โรงอาหาร"}
{"word": "dormitory", "english": "He’s living in the new dormitory on campus.", "thai": "เขาอาศัยอยู่ในหอพักใหม่ในมหาวิทยาลัย"}
{"word": "dormitory", "english": "The dormitory has a great study room.", "thai": "หอพักมีห้องเรียนที่ดีมาก"}
{"word": "dormitory", "english": "I’m helping paint the dormitory walls.", "thai": "ฉันกำลังช่วยทาสีผนังหอพัก"}
{"word": "dormitory", "english": "The dormitory is packed during move-in week.", "thai": "หอพักแน่นไปด้วยผู้คนในสัปดาห์ย้ายเข้า"}
{"word": "dormitory", "english": "She’s hosting a game night in the dormitory.", "thai": "เธอกำลังจัดคืนเล่นเกมในหอพัก"}
{"word": "dormitory", "english": "The dormitory has new furniture this year.", "thai": "หอพักมีเฟอร์นิเจอร์ใหม่ในปีนี้"}
{"word": "dormitory", "english": "He’s fixing the lights in the dormitory.", "thai": "เขากำลังซ่อมไฟในหอพัก"}
{"word": "dormitory", "english": "The dormitory is too noisy on weekends.", "thai": "หอพักมีเสียงดังเกินไปในช่วงสุดสัปดาห์"}
{"word": "dormitory", "english": "I’m meeting my roommate in the dormitory.", "thai": "ฉันจะพบเพื่อนร่วมห้องในหอพัก"}
{"word": "dormitory", "english": "The dormitory has a shared kitchen.", "thai": "หอพักมีครัวส่วนกลาง"}
{"word": "dormitory", "english": "She’s decorating the dormitory for Halloween.", "thai": "เธอกำลังตกแต่งหอพักสำหรับวันฮาโลวีน"}
{"word": "dormitory", "english": "The dormitory is near the gym.", "thai": "หอพักอยู่ใกล้โรงยิม"}
{"word": "dormitory", "english": "He’s organizing a study group in the dormitory.", "thai": "เขากำลังจัดการกลุ่มศึกษาในหอพัก"}
{"word": "dormitory", "english": "The dormitory has a laundry room downstairs.", "thai": "หอพักมีห้องซักผ้าชั้นล่าง"}
{"word": "dormitory", "english": "I’m grabbing snacks from the dormitory vending machine.", "thai": "ฉันกำลังซื้อของว่างจากตู้จำหน่ายในหอพัก"}
{"word": "dormitory", "english": "The dormitory is hosting a talent show.", "thai": "หอพักกำลังจัดงานแสดงความสามารถ"}
{"word": "dormitory", "english": "She’s cleaning the dormitory common area.", "thai": "เธอกำลังทำความสะอาดพื้นที่ส่วนกลางของหอพัก"}
{"word": "dormitory", "english": "The dormitory has new air conditioning.", "thai": "หอพักมีเครื่องปรับอากาศใหม่"}
{"word": "dormitory", "english": "He’s moving out of the dormitory next month.", "thai": "เขากำลังย้ายออกจากหอพักเดือนหน้า"}
{"word": "dormitory", "english": "The dormitory is quiet during finals week.", "thai": "หอพักเงียบสงบในช่วงสัปดาห์สอบปลายภาค"}
{"word": "dormitory", "english": "I’m helping set up the dormitory lounge.", "thai": "ฉันกำลังช่วยจัดเลานจ์ในหอพัก"}
{"word": "dormitory", "english": "The dormitory has a strict no-pets policy.", "thai": "หอพักมีนโยบายห้ามเลี้ยงสัตว์ที่เข้มงวด"}
{"word": "dormitory", "english": "She’s hanging posters in the dormitory hallway.", "thai": "เธอกำลังติดโปสเตอร์ในโถงทางเดินหอพัก"}
{"word": "dormitory", "english": "The dormitory is close to the lecture halls.", "thai": "หอพักอยู่ใกล้ห้องบรรยาย"}
{"word": "dormitory", "english": "He’s hosting a pizza night in the dormitory.", "thai": "เขากำลังจัดคืนพิซซ่าในหอพัก"}
{"word": "dormitory", "english": "The dormitory has new windows installed.", "thai": "หอพักมีหน้าต่างใหม่ติดตั้งแล้ว"}
{"word": "dormitory", "english": "I’m studying in the dormitory study room.", "thai": "ฉันกำลังเรียนอยู่ในห้องเรียนของหอพัก"}
{"word": "dormitory", "english": "The dormitory is hosting a holiday party.", "thai": "หอพักกำลังจัดงานเลี้ยงวันหยุด"}
{"word": "dormitory", "english": "She’s organizing a book club in the dormitory.", "thai": "เธอกำลังจัดการชมรมหนังสือในหोพัก"}
{"word": "dormitory", "english": "The dormitory has a new security system.", "thai": "หอพักมีระบบรักษาความปลอดภัยใหม่"}
{"word": "dormitory", "english": "He’s fixing the heater in the dormitory.", "thai": "เขากำลังซ่อมเครื่องทำความร้อนในหอพัก"}
{"word": "dormitory", "english": "The dormitory is too cold in the winter.", "thai": "หอพักหนาวเกินไปในฤดูหนาว"}
{"word": "dormitory", "english": "I’m meeting friends in the dormitory courtyard.", "thai": "ฉันจะพบเพื่อนที่ลานหอพัก"}
{"word": "dormitory", "english": "The dormitory has a shared bathroom.", "thai": "หอพักมีห้องน้ำส่วนกลาง"}
{"word": "dormitory", "english": "She’s decorating the dormitory for Christmas.", "thai": "เธอกำลังตกแต่งหอพักสำหรับคริสต์มาส"}
{"word": "dormitory", "english": "The dormitory is near the student center.", "thai": "หอพักอยู่ใกล้ศูนย์นักศึกษา"}
{"word": "dormitory", "english": "He’s planning a game tournament in the dormitory.", "thai": "เขากำลังวางแผนจัดการแข่งขันเกมในหอพัก"}
{"word": "dormitory", "english": "The dormitory has new carpet this year.", "thai": "หอพักมีพรมใหม่ในปีนี้"}
{"word": "dormitory", "english": "I’m helping clean the dormitory kitchen.", "thai": "ฉันกำลังช่วยทำความสะอาดครัวในหอพัก"}
{"word": "dormitory", "english": "The dormitory is hosting a study marathon.", "thai": "หอพักกำลังจัดมาราธอนการเรียน"}
{"word": "dormitory", "english": "She’s organizing a craft night in the dormitory.", "thai": "เธอกำลังจัดคืนงานฝีมือในหอพัก"}
{"word": "dormitory", "english": "The dormitory has a new vending machine.", "thai": "หอพักมีตู้จำหน่ายสินค้าใหม่"}
{"word": "dormitory", "english": "He’s fixing the Wi-Fi in the dormitory.", "thai": "เขากำลังซ่อม Wi-Fi ในหอพัก"}
{"word": "dormitory", "english": "The dormitory is too loud during parties.", "thai": "หอพักมีเสียงดังเกินไประหว่างงานปาร์ตี้"}
{"word": "dormitory", "english": "I’m meeting my RA in the dormitory.", "thai": "ฉันจะพบผู้ดูแลหอพักในหอพัก"}
{"word": "dormitory", "english": "The dormitory has a shared lounge.", "thai": "หอพักมีเลานจ์ส่วนกลาง"}
{"word": "dormitory", "english": "She’s decorating the dormitory for spring break.", "thai": "เธอกำลังตกแต่งหอพักสำหรับปิดเทอมฤดูใบไม้ผลิ"}
{"word": "dormitory", "english": "The dormitory is close to the bookstore.", "thai": "หอพักอยู่ใกล้ร้านหนังสือ"}
{"word": "dormitory", "english": "He’s hosting a trivia night in the dormitory.", "thai": "เขากำลังจัดคืนตอบคำถามในหอพัก"}
{"word": "dormitory", "english": "The dormitory has new lighting installed.", "thai": "หอพักมีระบบไฟใหม่ติดตั้งแล้ว"}
{"word": "dormitory", "english": "I’m studying in the dormitory common area.", "thai": "ฉันกำลังเรียนอยู่ในพื้นที่ส่วนกลางของหอพัก"}
{"word": "dormitory", "english": "The dormitory is hosting a cultural event.", "thai": "หอพักกำลังจัดงานวัฒนธรรม"}
{"word": "dormitory", "english": "She’s organizing a fitness class in the dormitory.", "thai": "เธอกำลังจัดการชั้นเรียนฟิตเนสในหอพัก"}
{"word": "dormitory", "english": "The dormitory has a new study lounge.", "thai": "หอพักมีเลานจ์เรียนใหม่"}
{"word": "dormitory", "english": "He’s fixing the elevator in the dormitory.", "thai": "เขากำลังซ่อมลิฟต์ในหอพัก"}
{"word": "dormitory", "english": "The dormitory is too warm in the summer.", "thai": "หอพักร้อนเกินไปในฤดูร้อน"}
{"word": "dormitory", "english": "I’m meeting friends in the dormitory game room.", "thai": "ฉันจะพบเพื่อนในห้องเล่นเกมของหอพัก"}
{"word": "dormitory", "english": "The dormitory has a shared study space.", "thai": "หอพักมีพื้นที่เรียนส่วนกลาง"}
{"word": "dormitory", "english": "She’s decorating the dormitory for a party.", "thai": "เธอกำลังตกแต่งหอพักสำหรับงานปาร์ตี้"}
{"word": "dormitory", "english": "The dormitory is near the campus quad.", "thai": "หอพักอยู่ใกล้ลานในมหาวิทยาลัย"}
{"word": "dormitory", "english": "He’s planning a movie marathon in the dormitory.", "thai": "เขากำลังวางแผนมาราธอนดูหนังในหอพัก"}
{"word": "dormitory", "english": "The dormitory has new appliances.", "thai": "หอพักมีเครื่องใช้ไฟฟ้าใหม่"}
{"word": "dormitory", "english": "I’m helping clean the dormitory lounge.", "thai": "ฉันกำลังช่วยทำความสะอาดเลานจ์ในหอพัก"}
{"word": "dormitory", "english": "The dormitory is hosting a charity event.", "thai": "หอพักกำลังจัดงานการกุศล"}
{"word": "dormitory", "english": "She’s organizing a study session in the dormitory.", "thai": "เธอกำลังจัดการเซสชันการเรียนในหอพัก"}
{"word": "dormitory", "english": "The dormitory has a new gym room.", "thai": "หอพักมีห้องออกกำลังกายใหม่"}
{"word": "dormitory", "english": "He’s fixing the plumbing in the dormitory.", "thai": "เขากำลังซ่อมท่อประปาในหอพัก"}
{"word": "dormitory", "english": "The dormitory is too quiet during breaks.", "thai": "หอพักเงียบเกินไปในช่วงปิดเทอม"}
{"word": "dormitory", "english": "I’m meeting my friends in the dormitory kitchen.", "thai": "ฉันจะพบเพื่อนในครัวของหอพัก"}
{"word": "dormitory", "english": "The dormitory has a shared TV room.", "thai": "หอพักมีห้องดูทีวีส่วนกลาง"}
{"word": "dormitory", "english": "She’s decorating the dormitory for a festival.", "thai": "เธอกำลังตกแต่งหอพักสำหรับเทศกาล"}
{"word": "dormitory", "english": "The dormitory is close to the science building.", "thai": "หอพักอยู่ใกล้อาคารวิทยาศาสตร์"}
{"word": "dormitory", "english": "He’s hosting a karaoke night in the dormitory.", "thai": "เขากำลังจัดคืนคาราโอเกะในหอพัก"}
{"word": "dormitory", "english": "The dormitory has new study desks.", "thai": "หอพักมีโต๊ะเรียนใหม่"}
{"word": "dormitory", "english": "I’m helping organize the dormitory library.", "thai": "ฉันกำลังช่วยจัดระเบียบห้องสมุดในหอพัก"}
{"word": "dormitory", "english": "The dormitory is hosting a game night.", "thai": "หอพักกำลังจัดคืนเล่นเกม"}
{"word": "dormitory", "english": "She’s cleaning the dormitory study area.", "thai": "เธอกำลังทำความสะอาดพื้นที่เรียนของหอพัก"}
{"word": "dormitory", "english": "The dormitory has a new lounge space.", "thai": "หอพักมีพื้นที่เลานจ์ใหม่"}
{"word": "dormitory", "english": "He’s fixing the air conditioner in the dormitory.", "thai": "เขากำลังซ่อมเครื่องปรับอากาศในหอพัก"}
{"word": "dormitory", "english": "The dormitory is too noisy during finals.", "thai": "หอพักมีเสียงดังเกินไประหว่างสอบปลายภาค"}
{"word": "dormitory", "english": "I’m meeting my study group in the dormitory.", "thai": "ฉันจะพบกลุ่มศึกษาของฉันในหอพัก"}
{"word": "dormitory", "english": "The dormitory has a shared computer lab.", "thai": "หอพักมีห้องปฏิบัติการคอมพิวเตอร์ส่วนกลาง"}
{"word": "dormitory", "english": "She’s organizing a bake sale in the dormitory.", "thai": "เธอกำลังจัดการขายขนมในหอพัก"}
{"word": "dormitory", "english": "The dormitory is near the campus bookstore.", "thai": "หอพักอยู่ใกล้ร้านหนังสือในมหาวิทยาลัย"}
{"word": "exam", "english": "I’m studying hard for my biology exam.", "thai": "ฉันกำลังเรียนหนักเพื่อสอบวิชาชีววิทยา"}
{"word": "exam", "english": "The exam is scheduled for next Monday.", "thai": "การสอบถูกกำหนดไว้สำหรับวันจันทร์หน้า"}
{"word": "exam", "english": "She aced her math exam last week.", "thai": "เธอได้คะแนนดีเยี่ยมในสอบคณิตศาสตร์เมื่อสัปดาห์ที่แล้ว"}
{"word": "exam", "english": "I’m nervous about the final exam.", "thai": "ฉันกังวลเกี่ยวกับสอบปลายภาค"}
{"word": "exam", "english": "He forgot his calculator for the exam.", "thai": "เขาลืมเครื่องคิดเลขสำหรับการสอบ"}
{"word": "exam", "english": "The exam covers three chapters.", "thai": "การสอบครอบคลุมสามบท"}
{"word": "exam", "english": "I need to review for my history exam.", "thai": "ฉันต้องทบทวนเพื่อสอบวิชาประวัติศาสตร์"}
{"word": "exam", "english": "She’s taking a practice exam tonight.", "thai": "เธอกำลังทำข้อสอบฝึกหัดคืนนี้"}
{"word": "exam", "english": "The exam was tougher than I expected.", "thai": "การสอบยากกว่าที่ฉันคาดไว้"}
{"word": "exam", "english": "He’s retaking the exam next month.", "thai": "เขาจะสอบใหม่ในเดือนหน้า"}
{"word": "exam", "english": "I passed my chemistry exam!", "thai": "ฉันสอบผ่านวิชาเคมี!"}
{"word": "exam", "english": "The exam is worth 30% of the grade.", "thai": "การสอบมีค่าน้ำหนัก 30% ของคะแนน"}
{"word": "exam", "english": "She’s cramming for her physics exam.", "thai": "เธอกำลังท่องจำสำหรับสอบวิชาฟิสิกส์"}
{"word": "exam", "english": "The exam room was really quiet.", "thai": "ห้องสอบเงียบมาก"}
{"word": "exam", "english": "I’m meeting my study group before the exam.", "thai": "ฉันจะพบกลุ่มศึกษาก่อนการสอบ"}
{"word": "exam", "english": "He failed his literature exam.", "thai": "เขาสอบตกวิชาวรรณคดี"}
{"word": "exam", "english": "The exam has multiple-choice questions.", "thai": "การสอบมีคำถามแบบเลือกตอบ"}
{"word": "exam", "english": "I’m reviewing notes for the exam.", "thai": "ฉันกำลังทบทวนบันทึกสำหรับการสอบ"}
{"word": "exam", "english": "She’s stressed about her psychology exam.", "thai": "เธอเครียดเกี่ยวกับสอบวิชาจิตวิทยา"}
{"word": "exam", "english": "The exam is open-book this time.", "thai": "การสอบครั้งนี้เป็นแบบเปิดหนังสือ"}
{"word": "exam", "english": "He’s preparing for his midterm exam.", "thai": "เขากำลังเตรียมตัวสำหรับสอบกลางภาค"}
{"word": "exam", "english": "I need a pencil for the exam.", "thai": "ฉันต้องการดินสอสำหรับการสอบ"}
{"word": "exam", "english": "The exam was postponed to next week.", "thai": "การสอบถูกเลื่อนไปสัปดาห์หน้า"}
{"word": "exam", "english": "She’s taking an exam in the lecture hall.", "thai": "เธอกำลังสอบในห้องบรรยาย"}
{"word": "exam", "english": "I’m nervous about my math exam tomorrow.", "thai": "ฉันกังวลเกี่ยวกับสอบคณิตศาสตร์พรุ่งนี้"}
{"word": "exam", "english": "The exam includes an essay question.", "thai": "การสอบมีคำถามเรียงความ"}
{"word": "exam", "english": "He’s studying late for his biology exam.", "thai": "เขากำลังเรียนดึกเพื่อสอบวิชาชีววิทยา"}
{"word": "exam", "english": "The exam is in the science building.", "thai": "การสอบอยู่ในอาคารวิทยาศาสตร์"}
{"word": "exam", "english": "I forgot to bring my ID to the exam.", "thai": "ฉันลืมนำบัตรประจำตัวไปสอบ"}
{"word": "exam", "english": "She’s reviewing flashcards for the exam.", "thai": "เธอกำลังทบทวนบัตรคำศัพท์สำหรับการสอบ"}
{"word": "exam", "english": "The exam is two hours long.", "thai": "การสอบใช้เวลาสองชั่วโมง"}
{"word": "exam", "english": "He’s anxious about his physics exam.", "thai": "เขากังวลเกี่ยวกับสอบวิชาฟิสิกส์"}
{"word": "exam", "english": "I’m taking a makeup exam next week.", "thai": "ฉันจะสอบชดเชยในสัปดาห์หน้า"}
{"word": "exam", "english": "The exam was easier than I thought.", "thai": "การสอบง่ายกว่าที่ฉันคิด"}
{"word": "exam", "english": "She’s studying for her English exam.", "thai": "เธอกำลังเรียนเพื่อสอบวิชาภาษาอังกฤษ"}
{"word": "exam", "english": "The exam has a strict time limit.", "thai": "การสอบมีข้อจำกัดเวลาที่เข้มงวด"}
{"word": "exam", "english": "I’m preparing for my history exam.", "thai": "ฉันกำลังเตรียมตัวสำหรับสอบวิชาประวัติศาสตร์"}
{"word": "exam", "english": "He passed his chemistry exam with flying colors.", "thai": "เขาสอบผ่านวิชาเคมีด้วยคะแนนดีเยี่ยม"}
{"word": "exam", "english": "The exam is in the main auditorium.", "thai": "การสอบอยู่ในหอประชุมหลัก"}
{"word": "exam", "english": "She’s taking an online exam tomorrow.", "thai": "เธอกำลังจะสอบออนไลน์พรุ่งนี้"}
{"word": "exam", "english": "I need to study more for the exam.", "thai": "ฉันต้องเรียนเพิ่มเพื่อการสอบ"}
{"word": "exam", "english": "The exam covers the entire textbook.", "thai": "การสอบครอบคลุมทั้งตำราเรียน"}
{"word": "exam", "english": "He’s reviewing for his sociology exam.", "thai": "เขากำลังทบทวนเพื่อสอบวิชาสังคมวิทยา"}
{"word": "exam", "english": "The exam was rescheduled due to weather.", "thai": "การสอบถูกเลื่อนเนื่องจากสภาพอากาศ"}
{"word": "exam", "english": "I’m worried about failing my exam.", "thai": "ฉันกังวลว่าจะสอบตก"}
{"word": "exam", "english": "She’s taking a practice exam online.", "thai": "เธอกำลังทำข้อสอบฝึกหัดออนไลน์"}
{"word": "exam", "english": "The exam has a lot of short-answer questions.", "thai": "การสอบมีคำถามตอบสั้นจำนวนมาก"}
{"word": "exam", "english": "He’s studying in the library for the exam.", "thai": "เขากำลังเรียนในห้องสมุดเพื่อการสอบ"}
{"word": "exam", "english": "I’m taking my final exam next Friday.", "thai": "ฉันจะสอบปลายภาคในวันศุกร์หน้า"}
{"word": "exam", "english": "The exam is proctored by the professor.", "thai": "การสอบถูกควบคุมโดยศาสตราจารย์"}
{"word": "exam", "english": "She’s nervous about her literature exam.", "thai": "เธอกังวลเกี่ยวกับสอบวิชาวรรณคดี"}
{"word": "exam", "english": "I forgot the date of my exam.", "thai": "ฉันลืมวันที่สอบ"}
{"word": "exam", "english": "The exam is in the classroom next door.", "thai": "การสอบอยู่ในห้องเรียนข้างๆ"}
{"word": "exam", "english": "He’s preparing for his economics exam.", "thai": "เขากำลังเตรียมตัวสำหรับสอบวิชาเศรษฐศาสตร์"}
{"word": "exam", "english": "The exam has a section on vocabulary.", "thai": "การสอบมีส่วนเกี่ยวกับคำศัพท์"}
{"word": "exam", "english": "I’m reviewing old exams for practice.", "thai": "ฉันกำลังทบทวนข้อสอบเก่าเพื่อฝึก"}
{"word": "exam", "english": "She passed her biology exam yesterday.", "thai": "เธอสอบผ่านวิชาชีววิทยาเมื่อวาน"}
{"word": "exam", "english": "The exam is closed-book this time.", "thai": "การสอบครั้งนี้เป็นแบบปิดหนังสือ"}
{"word": "exam", "english": "He’s studying for his computer science exam.", "thai": "เขากำลังเรียนเพื่อสอบวิชาวิทยาการคอมพิวเตอร์"}
{"word": "exam", "english": "The exam room was too cold.", "thai": "ห้องสอบหนาวเกินไป"}
{"word": "exam", "english": "I’m taking an exam in the testing center.", "thai": "ฉันกำลังสอบในศูนย์สอบ"}
{"word": "exam", "english": "She’s reviewing notes for her chemistry exam.", "thai": "เธอกำลังทบทวนบันทึกสำหรับสอบวิชาเคมี"}
{"word": "exam", "english": "The exam is worth half the course grade.", "thai": "การสอบมีค่าน้ำหนักครึ่งหนึ่งของคะแนนวิชา"}
{"word": "exam", "english": "He’s nervous about his math exam.", "thai": "เขากังวลเกี่ยวกับสอบวิชาคณิตศาสตร์"}
{"word": "exam", "english": "I’m studying with friends for the exam.", "thai": "ฉันกำลังเรียนกับเพื่อนเพื่อการสอบ"}
{"word": "exam", "english": "The exam includes a practical component.", "thai": "การสอบรวมถึงส่วนปฏิบัติ"}
{"word": "exam", "english": "She’s taking an exam in psychology.", "thai": "เธอกำลังสอบวิชาจิตวิทยา"}
{"word": "exam", "english": "The exam was delayed due to technical issues.", "thai": "การสอบถูกเลื่อนเนื่องจากปัญหาทางเทคนิค"}
{"word": "exam", "english": "I’m preparing for my literature exam.", "thai": "ฉันกำลังเตรียมตัวสำหรับสอบวิชาวรรณคดี"}
{"word": "exam", "english": "He aced his physics exam last month.", "thai": "เขาได้คะแนนดีเยี่ยมในสอบวิชาฟิสิกส์เมื่อเดือนที่แล้ว"}
{"word": "exam", "english": "The exam is in the new building.", "thai": "การสอบอยู่ในอาคารใหม่"}
{"word": "exam", "english": "She’s studying for her history exam.", "thai": "เธอกำลังเรียนเพื่อสอบวิชาประวัติศาสตร์"}
{"word": "exam", "english": "The exam has a time limit of one hour.", "thai": "การสอบมีเวลาจำกัดหนึ่งชั่วโมง"}
{"word": "exam", "english": "I’m reviewing for my sociology exam.", "thai": "ฉันกำลังทบทวนเพื่อสอบวิชาสังคมวิทยา"}
{"word": "exam", "english": "The exam was harder than the practice test.", "thai": "การสอบยากกว่าข้อสอบฝึกหัด"}
{"word": "exam", "english": "She’s taking an exam in the computer lab.", "thai": "เธอกำลังสอบในห้องปฏิบัติการคอมพิวเตอร์"}
{"word": "exam", "english": "I need to pass this exam to graduate.", "thai": "ฉันต้องสอบผ่านเพื่อจบการศึกษา"}
{"word": "exam", "english": "He’s preparing for his engineering exam.", "thai": "เขากำลังเตรียมตัวสำหรับสอบวิชาวิศวกรรม"}
{"word": "exam", "english": "The exam includes problem-solving questions.", "thai": "การสอบมีคำถามแก้ปัญหา"}
{"word": "exam", "english": "I’m studying late for my chemistry exam.", "thai": "ฉันกำลังเรียนดึกเพื่อสอบวิชาเคมี"}
{"word": "exam", "english": "The exam is proctored online.", "thai": "การสอบถูกควบคุมออนไลน์"}
{"word": "exam", "english": "She’s nervous about her biology exam.", "thai": "เธอกังวลเกี่ยวกับสอบวิชาชีววิทยา"}
{"word": "exam", "english": "I forgot my notes for the exam.", "thai": "ฉันลืมบันทึกสำหรับการสอบ"}
{"word": "exam", "english": "The exam is in the main classroom.", "thai": "การสอบอยู่ในห้องเรียนหลัก"}
{"word": "exam", "english": "He’s reviewing for his economics exam.", "thai": "เขากำลังทบทวนเพื่อสอบวิชาเศรษฐศาสตร์"}
{"word": "exam", "english": "The exam has a section on essays.", "thai": "การสอบมีส่วนเกี่ยวกับเรียงความ"}
{"word": "exam", "english": "I’m taking a practice exam this weekend.", "thai": "ฉันจะทำข้อสอบฝึกหัดในสุดสัปดาห์นี้"}
{"word": "exam", "english": "She passed her math exam yesterday.", "thai": "เธอสอบผ่านวิชาคณิตศาสตร์เมื่อวาน"}
{"word": "exam", "english": "The exam is open-note this time.", "thai": "การสอบครั้งนี้เป็นแบบเปิดบันทึก"}
{"word": "exam", "english": "He’s studying for his computer science exam.", "thai": "เขากำลังเรียนเพื่อสอบวิชาวิทยาการคอมพิวเตอร์"}
{"word": "exam", "english": "The exam room was too warm.", "thai": "ห้องสอบร้อนเกินไป"}
{"word": "exam", "english": "I’m taking an exam in the science lab.", "thai": "ฉันกำลังสอบในห้องปฏิบัติการวิทยาศาสตร์"}
{"word": "exam", "english": "She’s reviewing for her literature exam.", "thai": "เธอกำลังทบทวนเพื่อสอบวิชาวรรณคดี"}
{"word": "exam", "english": "The exam is worth 40% of the grade.", "thai": "การสอบมีค่าน้ำหนัก 40% ของคะแนน"}
{"word": "exam", "english": "He’s nervous about his history exam.", "thai": "เขากังวลเกี่ยวกับสอบวิชาประวัติศาสตร์"}
{"word": "exam", "english": "I’m studying with a tutor for the exam.", "thai": "ฉันกำลังเรียนกับติวเตอร์เพื่อการสอบ"}
{"word": "exam", "english": "The exam includes a lab component.", "thai": "การสอบรวมถึงส่วนปฏิบัติการ"}
{"word": "exam", "english": "She’s taking an exam in anthropology.", "thai": "เธอกำลังสอบวิชามานุษยวิทยา"}
{"word": "exam", "english": "The exam was canceled due to a power outage.", "thai": "การสอบถูกยกเลิกเนื่องจากไฟดับ"}
{"word": "faculty", "english": "The faculty is meeting to discuss the curriculum.", "thai": "คณาจารย์กำลังประชุมเพื่อหารือเกี่ยวกับหลักสูตร"}
{"word": "faculty", "english": "She’s a new member of the faculty.", "thai": "เธอเป็นสมาชิกใหม่ของคณาจารย์"}
{"word": "faculty", "english": "The faculty organized a research symposium.", "thai": "คณาจารย์จัดงานสัมมนาวิจัย"}
{"word": "faculty", "english": "I’m meeting with a faculty advisor tomorrow.", "thai": "ฉันจะพบกับที่ปรึกษาคณาจารย์พรุ่งนี้"}
{"word": "faculty", "english": "The faculty voted on the new policy.", "thai": "คณาจารย์ลงคะแนนในนโยบายใหม่"}
{"word": "faculty", "english": "He’s been on the faculty for ten years.", "thai": "เขาเป็นคณาจารย์มาได้สิบปีแล้ว"}
{"word": "faculty", "english": "The faculty is hosting a guest lecture.", "thai": "คณาจารย์กำลังเป็นเจ้าภาพการบรรยายจากวิทยากรรับเชิญ"}
{"word": "faculty", "english": "She’s presenting her research to the faculty.", "thai": "เธอกำลังนำเสนองานวิจัยต่อคณาจารย์"}
{"word": "faculty", "english": "The faculty lounge is open to professors.", "thai": "เลานจ์คณาจารย์เปิดให้อาจารย์ใช้"}
{"word": "faculty", "english": "I attended a faculty-led workshop today.", "thai": "ฉันเข้าร่วมการประชุมเชิงปฏิบัติการที่นำโดยคณาจารย์วันนี้"}
{"word": "faculty", "english": "The faculty is reviewing student applications.", "thai": "คณาจารย์กำลังตรวจสอบใบสมัครนักศึกษา"}
{"word": "faculty", "english": "He’s a respected member of the faculty.", "thai": "เขาเป็นสมาชิกที่ได้รับการเคารพของคณาจารย์"}
{"word": "faculty", "english": "The faculty is planning a campus event.", "thai": "คณาจารย์กำลังวางแผนงานในมหาวิทยาลัย"}
{"word": "faculty", "english": "She’s discussing funding with the faculty.", "thai": "เธอกำลังหารือเรื่องเงินทุนกับคณาจารย์"}
{"word": "faculty", "english": "The faculty approved the new degree program.", "thai": "คณาจารย์อนุมัติหลักสูตรปริญญาใหม่"}
{"word": "faculty", "english": "I’m attending a faculty meeting this afternoon.", "thai": "ฉันจะเข้าร่วมการประชุมคณาจารย์บ่ายนี้"}
{"word": "faculty", "english": "The faculty is working on a new curriculum.", "thai": "คณาจารย์กำลังทำงานในหลักสูตรใหม่"}
{"word": "faculty", "english": "He’s collaborating with faculty on research.", "thai": "เขากำลังร่วมงานกับคณาจารย์ในงานวิจัย"}
{"word": "faculty", "english": "The faculty is hosting a career fair.", "thai": "คณาจารย์กำลังเป็นเจ้าภาพงานแสดงอาชีพ"}
{"word": "faculty", "english": "She’s a faculty member in the biology department.", "thai": "เธอเป็นคณาจารย์ในภาควิชาชีววิทยา"}
{"word": "faculty", "english": "The faculty is discussing budget cuts.", "thai": "คณาจารย์กำลังหารือเรื่องการตัดงบประมาณ"}
{"word": "faculty", "english": "I’m meeting a faculty mentor for guidance.", "thai": "ฉันกำลังพบที่ปรึกษาคณาจารย์เพื่อขอคำแนะนำ"}
{"word": "faculty", "english": "The faculty organized a student award ceremony.", "thai": "คณาจารย์จัดพิธีมอบรางวัลนักศึกษา"}
{"word": "faculty", "english": "He’s presenting to the faculty next week.", "thai": "เขาจะนำเสนอต่อคณาจารย์สัปดาห์หน้า"}
{"word": "faculty", "english": "The faculty is revising the course schedule.", "thai": "คณาจารย์กำลังปรับปรุงตารางวิชา"}
{"word": "faculty", "english": "She’s working with faculty on a new project.", "thai": "เธอกำลังทำงานกับคณาจารย์ในโปรเจกต์ใหม่"}
{"word": "faculty", "english": "The faculty is hosting a diversity workshop.", "thai": "คณาจารย์กำลังเป็นเจ้าภาพการประชุมเชิงปฏิบัติการด้านความหลากหลาย"}
{"word": "faculty", "english": "I’m attending a faculty-led seminar.", "thai": "ฉันจะเข้าร่วมสัมมนาที่นำโดยคณาจารย์"}
{"word": "faculty", "english": "The faculty is reviewing tenure applications.", "thai": "คณาจารย์กำลังตรวจสอบใบสมัครตำแหน่งถาวร"}
{"word": "faculty", "english": "He’s a faculty advisor for the science club.", "thai": "เขาเป็นที่ปรึกษาคณาจารย์ของชมรมวิทยาศาสตร์"}
{"word": "faculty", "english": "The faculty is planning a research conference.", "thai": "คณาจารย์กำลังวางแผนการประชุมวิจัย"}
{"word": "faculty", "english": "She’s discussing grants with the faculty.", "thai": "เธอกำลังหารือเรื่องทุนกับคณาจารย์"}
{"word": "faculty", "english": "The faculty approved the new lab equipment.", "thai": "คณาจารย์อนุมัติอุปกรณ์ห้องปฏิบัติการใหม่"}
{"word": "faculty", "english": "I’m meeting with faculty about my thesis.", "thai": "ฉันกำลังพบคณาจารย์เกี่ยวกับวิทยานิพนธ์ของฉัน"}
{"word": "faculty", "english": "The faculty is hosting a student Q&A.", "thai": "คณาจารย์กำลังเป็นเจ้าภาพการถาม-ตอบกับนักศึกษา"}
{"word": "faculty", "english": "He’s a new faculty member in engineering.", "thai": "เขาเป็นคณาจารย์ใหม่ในสาขาวิศวกรรม"}
{"word": "faculty", "english": "The faculty is discussing academic policies.", "thai": "คณาจารย์กำลังหารือเกี่ยวกับนโยบายวิชาการ"}
{"word": "faculty", "english": "She’s collaborating with faculty on a book.", "thai": "เธอกำลังร่วมงานกับคณาจารย์ในงานเขียนหนังสือ"}
{"word": "faculty", "english": "The faculty is organizing a lecture series.", "thai": "คณาจารย์กำลังจัดชุดการบรรยาย"}
{"word": "faculty", "english": "I’m attending a faculty-led field trip.", "thai": "ฉันจะเข้าร่วมการทัศนศึกษาที่นำโดยคณาจารย์"}
{"word": "faculty", "english": "The faculty is reviewing student feedback.", "thai": "คณาจารย์กำลังตรวจสอบข้อเสนอแนะจากนักศึกษา"}
{"word": "faculty", "english": "He’s working with faculty on a grant proposal.", "thai": "เขากำลังทำงานกับคณาจารย์ในข้อเสนอขอทุน"}
{"word": "faculty", "english": "The faculty is hosting a science fair.", "thai": "คณาจารย์กำลังเป็นเจ้าภาพงานนิทรรศการวิทยาศาสตร์"}
{"word": "faculty", "english": "She’s a faculty member in the history department.", "thai": "เธอเป็นคณาจารย์ในภาควิชาประวัติศาสตร์"}
{"word": "faculty", "english": "The faculty is discussing new course offerings.", "thai": "คณาจารย์กำลังหารือเกี่ยวกับวิชาใหม่ที่เปิดสอน"}
{"word": "faculty", "english": "I’m meeting a faculty member for research.", "thai": "ฉันกำลังพบคณาจารย์เพื่อวิจัย"}
{"word": "faculty", "english": "The faculty organized a charity event.", "thai": "คณาจารย์จัดงานการกุศล"}
{"word": "faculty", "english": "He’s presenting data to the faculty.", "thai": "เขากำลังนำเสนอข้อมูลต่อคณาจารย์"}
{"word": "faculty", "english": "The faculty is revising the exam schedule.", "thai": "คณาจารย์กำลังปรับปรุงตารางสอบ"}
{"word": "faculty", "english": "She’s working with faculty on a new initiative.", "thai": "เธอกำลังทำงานกับคณาจารย์ในโครงการใหม่"}
{"word": "faculty", "english": "The faculty is hosting a career workshop.", "thai": "คณาจารย์กำลังเป็นเจ้าภาพการประชุมเชิงปฏิบัติการด้านอาชีพ"}
{"word": "faculty", "english": "I’m attending a faculty-led discussion.", "thai": "ฉันจะเข้าร่วมการสนทนาที่นำโดยคณาจารย์"}
{"word": "faculty", "english": "The faculty is reviewing department goals.", "thai": "คณาจารย์กำลังตรวจสอบเป้าหมายของภาควิชา"}
{"word": "faculty", "english": "He’s a faculty advisor for the debate team.", "thai": "เขาเป็นที่ปรึกษาคณาจารย์ของทีมโต้วาที"}
{"word": "faculty", "english": "The faculty is planning a cultural event.", "thai": "คณาจารย์กำลังวางแผนงานวัฒนธรรม"}
{"word": "faculty", "english": "She’s discussing curriculum with the faculty.", "thai": "เธอกำลังหารือเรื่องหลักสูตรกับคณาจารย์"}
{"word": "faculty", "english": "The faculty approved the new building plan.", "thai": "คณาจารย์อนุมัติแผนอาคารใหม่"}
{"word": "faculty", "english": "I’m meeting with faculty about my major.", "thai": "ฉันกำลังพบคณาจารย์เกี่ยวกับสาขาวิชาเอกของฉัน"}
{"word": "faculty", "english": "The faculty is hosting a student art exhibit.", "thai": "คณาจารย์กำลังเป็นเจ้าภาพนิทรรศการศิลปะนักศึกษา"}
{"word": "faculty", "english": "He’s a faculty member in the physics department.", "thai": "เขาเป็นคณาจารย์ในภาควิชาฟิสิกส์"}
{"word": "faculty", "english": "The faculty is discussing student retention.", "thai": "คณาจารย์กำลังหารือเรื่องการรักษานักศึกษา"}
{"word": "faculty", "english": "She’s collaborating with faculty on a study.", "thai": "เธอกำลังร่วมงานกับคณาจารย์ในงานศึกษา"}
{"word": "faculty", "english": "The faculty is organizing a music recital.", "thai": "คณาจารย์กำลังจัดงานแสดงดนตรีเดี่ยว"}
{"word": "faculty", "english": "I’m attending a faculty-led book club.", "thai": "ฉันจะเข้าร่วมชมรมหนังสือที่นำโดยคณาจารย์"}
{"word": "faculty", "english": "The faculty is reviewing grant applications.", "thai": "คณาจารย์กำลังตรวจสอบใบสมัครขอทุน"}
{"word": "faculty", "english": "He’s working with faculty on a new course.", "thai": "เขากำลังทำงานกับคณาจารย์ในวิชาใหม่"}
{"word": "faculty", "english": "The faculty is hosting a technology workshop.", "thai": "คณาจารย์กำลังเป็นเจ้าภาพการประชุมเชิงปฏิบัติการด้านเทคโนโลยี"}
{"word": "faculty", "english": "She’s a faculty advisor for the art club.", "thai": "เธอเป็นที่ปรึกษาคณาจารย์ของชมรมศิลปะ"}
{"word": "faculty", "english": "The faculty is planning a sustainability event.", "thai": "คณาจารย์กำลังวางแผนงานความยั่งยืน"}
{"word": "faculty", "english": "I’m meeting with faculty about my research.", "thai": "ฉันกำลังพบคณาจารย์เกี่ยวกับงานวิจัยของฉัน"}
{"word": "faculty", "english": "The faculty approved the new lab funding.", "thai": "คณาจารย์อนุมัติเงินทุนห้องปฏิบัติการใหม่"}
{"word": "faculty", "english": "He’s discussing policies with the faculty.", "thai": "เขากำลังหารือเรื่องนโยบายกับคณาจารย์"}
{"word": "faculty", "english": "The faculty is hosting a student debate.", "thai": "คณาจารย์กำลังเป็นเจ้าภาพการโต้วาทีของนักศึกษา"}
{"word": "faculty", "english": "She’s a faculty member in the chemistry department.", "thai": "เธอเป็นคณาจารย์ในภาควิชาเคมี"}
{"word": "faculty", "english": "The faculty is discussing new research opportunities.", "thai": "คณาจารย์กำลังหารือเกี่ยวกับโอกาสการวิจัยใหม่"}
{"word": "faculty", "english": "I’m attending a faculty-led panel discussion.", "thai": "ฉันจะเข้าร่วมการอภิปรายที่นำโดยคณาจารย์"}
{"word": "faculty", "english": "The faculty is reviewing academic standards.", "thai": "คณาจารย์กำลังตรวจสอบมาตรฐานวิชาการ"}
{"word": "faculty", "english": "He’s collaborating with faculty on a publication.", "thai": "เขากำลังร่วมงานกับคณาจารย์ในงานตีพิมพ์"}
{"word": "faculty", "english": "The faculty is organizing a theater performance.", "thai": "คณาจารย์กำลังจัดงานแสดงละคร"}
{"word": "faculty", "english": "She’s discussing funding with the faculty.", "thai": "เธอกำลังหารือเรื่องเงินทุนกับคณาจารย์"}
{"word": "faculty", "english": "The faculty approved the new scholarship program.", "thai": "คณาจารย์อนุมัติโปรแกรมทุนการศึกษาใหม่"}
{"word": "faculty", "english": "I’m meeting with faculty about my dissertation.", "thai": "ฉันกำลังพบคณาจารย์เกี่ยวกับวิทยานิพนธ์ของฉัน"}
{"word": "faculty", "english": "The faculty is hosting a community outreach event.", "thai": "คณาจารย์กำลังเป็นเจ้าภาพงานชุมชน"}
{"word": "faculty", "english": "He’s a faculty member in the literature department.", "thai": "เขาเป็นคณาจารย์ในภาควิชาวรรณคดี"}
{"word": "faculty", "english": "The faculty is discussing campus safety measures.", "thai": "คณาจารย์กำลังหารือเกี่ยวกับมาตรการความปลอดภัยในมหาวิทยาลัย"}
{"word": "faculty", "english": "She’s working with faculty on a new lab.", "thai": "เธอกำลังทำงานกับคณาจารย์ในห้องปฏิบัติการใหม่"}
{"word": "faculty", "english": "The faculty is organizing a film screening.", "thai": "คณาจารย์กำลังจัดงานฉายภาพยนตร์"}
{"word": "faculty", "english": "I’m attending a faculty-led study group.", "thai": "ฉันจะเข้าร่วมกลุ่มศึกษาที่นำโดยคณาจารย์"}
{"word": "faculty", "english": "The faculty is reviewing student projects.", "thai": "คณาจารย์กำลังตรวจสอบโปรเจกต์ของนักศึกษา"}
{"word": "faculty", "english": "He’s discussing grants with the faculty.", "thai": "เขากำลังหารือเรื่องทุนกับคณาจารย์"}
{"word": "faculty", "english": "The faculty approved the new course syllabus.", "thai": "คณาจารย์อนุมัติหลักสูตรวิชาใหม่"}
{"word": "faculty", "english": "She’s a faculty advisor for the music club.", "thai": "เธอเป็นที่ปรึกษาคณาจารย์ของชมรมดนตรี"}
{"word": "faculty", "english": "The faculty is planning a leadership workshop.", "thai": "คณาจารย์กำลังวางแผนการประชุมเชิงปฏิบัติการผู้นำ"}
{"word": "faculty", "english": "I’m meeting with faculty about my coursework.", "thai": "ฉันกำลังพบคณาจารย์เกี่ยวกับงานวิชาของฉัน"}
{"word": "faculty", "english": "The faculty is hosting a science workshop.", "thai": "คณาจารย์กำลังเป็นเจ้าภาพการประชุมเชิงปฏิบัติการวิทยาศาสตร์"}
{"word": "faculty", "english": "He’s collaborating with faculty on a new study.", "thai": "เขากำลังร่วมงานกับคณาจารย์ในงานศึกษาใหม่"}
{"word": "faculty", "english": "The faculty is organizing a student conference.", "thai": "คณาจารย์กำลังจัดงานประชุมนักศึกษา"}
{"word": "faculty", "english": "She’s discussing policies with the faculty.", "thai": "เธอกำลังหารือเรื่องนโยบายกับคณาจารย์"}
{"word": "faculty", "english": "The faculty approved the new research initiative.", "thai": "คณาจารย์อนุมัติโครงการวิจัยใหม่"}
{"word": "grade", "english": "I got an A on my math grade.", "thai": "ฉันได้เกรด A ในวิชาคณิตศาสตร์"}
{"word": "grade", "english": "She’s worried about her history grade.", "thai": "เธอกังวลเกี่ยวกับเกรดวิชาประวัติศาสตร์"}
{"word": "grade", "english": "The teacher posted the exam grade online.", "thai": "ครูโพสต์เกรดสอบออนไลน์"}
{"word": "grade", "english": "He’s trying to improve his science grade.", "thai": "เขากำลังพยายามปรับปรุงเกรดวิชาวิทยาศาสตร์"}
{"word": "grade", "english": "My grade in biology is slipping.", "thai": "เกรดวิชาชีววิทยาของฉันกำลังลดลง"}
{"word": "grade", "english": "The final exam counts for 40% of the grade.", "thai": "การสอบปลายภาคมีค่าน้ำหนัก 40% ของเกรด"}
{"word": "grade", "english": "I need to check my grade for English.", "thai": "ฉันต้องตรวจสอบเกรดวิชาภาษาอังกฤษ"}
{"word": "grade", "english": "She’s thrilled with her chemistry grade.", "thai": "เธอตื่นเต้นกับเกรдวิชาเคมี"}
{"word": "grade", "english": "He got a low grade on the quiz.", "thai": "เขาได้เกรดต่ำในสอบย่อย"}
{"word": "grade", "english": "The professor curved the grade for the class.", "thai": "อาจารย์ปรับเกรดให้ทั้งชั้น"}
{"word": "grade", "english": "I’m hoping for a good grade in physics.", "thai": "ฉันหวังว่าจะได้เกรดดีในวิชาฟิสิกส์"}
{"word": "grade", "english": "Her grade improved after extra credit.", "thai": "เกรดของเธอดีขึ้นหลังจากได้คะแนนพิเศษ"}
{"word": "grade", "english": "The grade for my project was a B.", "thai": "เกรดสำหรับโปรเจกต์ของฉันคือ B"}
{"word": "grade", "english": "He’s stressed about his literature grade.", "thai": "เขากดดันเกี่ยวกับเกรดวิชาวรรณคดี"}
{"word": "grade", "english": "I need to talk to the teacher about my grade.", "thai": "ฉันต้องคุยกับครูเกี่ยวกับเกรดของฉัน"}
{"word": "grade", "english": "She’s checking her grade on the portal.", "thai": "เธอกำลังตรวจสอบเกรดบนพอร์ทัล"}
{"word": "grade", "english": "The grade for the essay was disappointing.", "thai": "เกรดสำหรับเรียงความน่าผิดหวัง"}
{"word": "grade", "english": "He’s working hard to boost his grade.", "thai": "เขากำลังทำงานหนักเพื่อเพิ่มเกรด"}
{"word": "grade", "english": "My grade in math is higher this semester.", "thai": "เกรดวิชาคณิตศาสตร์ของฉันสูงขึ้นในภาคเรียนนี้"}
{"word": "grade", "english": "The teacher hasn’t posted the grade yet.", "thai": "ครูยังไม่ได้โพสต์เกรด"}
{"word": "grade", "english": "She got a perfect grade on her exam.", "thai": "เธอได้เกรดเต็มในการสอบ"}
{"word": "grade", "english": "I’m worried about my biology grade.", "thai": "ฉันกังวลเกี่ยวกับเกรดวิชาชีววิทยา"}
{"word": "grade", "english": "He’s aiming for an A grade in history.", "thai": "เขาตั้งเป้าได้เกรด A ในวิชาประวัติศาสตร์"}
{"word": "grade", "english": "The grade for my presentation was great.", "thai": "เกรดสำหรับการนำเสนอของฉันดีมาก"}
{"word": "grade", "english": "She’s upset about her low math grade.", "thai": "เธอไม่พอใจกับเกрдคณิตศาสตร์ที่ต่ำ"}
{"word": "grade", "english": "I need to study to improve my grade.", "thai": "ฉันต้องเรียนเพื่อปรับปรุงเกรด"}
{"word": "grade", "english": "The grade for the test was posted today.", "thai": "เกรดสำหรับการสอบถูกโพสต์วันนี้"}
{"word": "grade", "english": "He’s happy with his chemistry grade.", "thai": "เขามีความสุขกับเกรдวิชาเคมี"}
{"word": "grade", "english": "My grade in English needs work.", "thai": "เกรดวิชาภาษาอังกฤษของฉันต้องปรับปรุง"}
{"word": "grade", "english": "She’s checking her grade for the project.", "thai": "เธอกำลังตรวจสอบเกรดสำหรับโปรเจกต์"}
{"word": "grade", "english": "The grade for my essay was an A-!", "thai": "เกรดสำหรับเรียงความของฉันคือ A-!"}
{"word": "grade", "english": "He’s retaking the exam to boost his grade.", "thai": "เขากำลังสอบใหม่เพื่อเพิ่มเกรด"}
{"word": "grade", "english": "I’m hoping for a better grade this time.", "thai": "ฉันหวังว่าจะได้เกรดดีขึ้นครั้งนี้"}
{"word": "grade", "english": "The grade for the quiz surprised me.", "thai": "เกรดสำหรับสอบย่อยทำให้ฉันแปลกใจ"}
{"word": "grade", "english": "She’s discussing her grade with the professor.", "thai": "เธอกำลังหารือเรื่องเกรดกับอาจารย์"}
{"word": "grade", "english": "My grade in physics is better now.", "thai": "เกรดวิชาฟิสิกส์ของฉันดีขึ้นแล้ว"}
{"word": "grade", "english": "He got a B grade on his paper.", "thai": "เขาได้เกรด B ในเอกสารของเขา"}
{"word": "grade", "english": "The grade for my midterm was okay.", "thai": "เกรดสำหรับสอบกลางภาคของฉันใช้ได้"}
{"word": "grade", "english": "She’s thrilled with her literature grade.", "thai": "เธอตื่นเต้นกับเกรдวิชาวรรณคดี"}
{"word": "grade", "english": "I’m checking my grade on the class website.", "thai": "ฉันกำลังตรวจสอบเกรดบนเว็บไซต์ของชั้นเรียน"}
{"word": "grade", "english": "The grade for my group project was high.", "thai": "เกรดสำหรับโปรเจกต์กลุ่มของฉันสูง"}
{"word": "grade", "english": "He’s upset about his biology grade.", "thai": "เขาไม่พอใจกับเกрдวิชาชีววิทยา"}
{"word": "grade", "english": "I need to improve my history grade.", "thai": "ฉันต้องปรับปรุงเกรดวิชาประวัติศาสตร์"}
{"word": "grade", "english": "The grade for the exam was posted late.", "thai": "เกรดสำหรับการสอบถูกโพสต์ช้า"}
{"word": "grade", "english": "She’s aiming for an A grade in chemistry.", "thai": "เธอตั้งเป้าได้เกรด A ในวิชาเคมี"}
{"word": "grade", "english": "My grade in math dropped this semester.", "thai": "เกรดวิชาคณิตศาสตร์ของฉันลดลงในภาคเรียนนี้"}
{"word": "grade", "english": "He’s checking his grade for the final.", "thai": "เขากำลังตรวจสอบเกรดสำหรับสอบปลายภาค"}
{"word": "grade", "english": "The grade for my essay was unexpected.", "thai": "เกรดสำหรับเรียงความของฉันไม่คาดคิด"}
{"word": "grade", "english": "She’s happy with her English grade.", "thai": "เธอมีความสุขกับเกрдวิชาภาษาอังกฤษ"}
{"word": "grade", "english": "I’m working to raise my physics grade.", "thai": "ฉันกำลังพยายามเพิ่มเกรดวิชาฟิสิกส์"}
{"word": "grade", "english": "The grade for the test was fair.", "thai": "เกรดสำหรับการสอบยุติธรรม"}
{"word": "grade", "english": "He’s discussing his grade with the teacher.", "thai": "เขากำลังหารือเรื่องเกรดกับครู"}
{"word": "grade", "english": "My grade in biology is really good.", "thai": "เกรดวิชาชีววิทยาของฉันดีมาก"}
{"word": "grade", "english": "She got a low grade on her presentation.", "thai": "เธอได้เกรดต่ำในการนำเสนอ"}
{"word": "grade", "english": "I’m nervous about my math grade.", "thai": "ฉันกังวลเกี่ยวกับเกรดวิชาคณิตศาสตร์"}
{"word": "grade", "english": "The grade for my quiz was an A!", "thai": "เกรดสำหรับสอบย่อยของฉันคือ A!"}
{"word": "grade", "english": "He’s trying to improve his literature grade.", "thai": "เขากำลังพยายามปรับปรุงเกรดวิชาวรรณคดี"}
{"word": "grade", "english": "The grade for my project was posted today.", "thai": "เกรดสำหรับโปรเจกต์ของฉันถูกโพสต์วันนี้"}
{"word": "grade", "english": "She’s upset about her chemistry grade.", "thai": "เธอไม่พอใจกับเกрдวิชาเคมี"}
{"word": "grade", "english": "I need to check my history grade.", "thai": "ฉันต้องตรวจสอบเกรดวิชาประวัติศาสตร์"}
{"word": "grade", "english": "The grade for the exam was curved.", "thai": "เกรดสำหรับการสอบถูกปรับ"}
{"word": "grade", "english": "He’s thrilled with his physics grade.", "thai": "เขาตื่นเต้นกับเกрдวิชาฟิสิกส์"}
{"word": "grade", "english": "My grade in English is improving.", "thai": "เกรดวิชาภาษาอังกฤษของฉันกำลังดีขึ้น"}
{"word": "grade", "english": "She’s checking her grade for the midterm.", "thai": "เธอกำลังตรวจสอบเกรดสำหรับสอบกลางภาค"}
{"word": "grade", "english": "The grade for my paper was a B+.", "thai": "เกรดสำหรับเอกสารของฉันคือ B+"}
{"word": "grade", "english": "He’s worried about his biology grade.", "thai": "เขากังวลเกี่ยวกับเกรдวิชาชีววิทยา"}
{"word": "grade", "english": "I’m aiming for an A grade in math.", "thai": "ฉันตั้งเป้าได้เกรด A ในวิชาคณิตศาสตร์"}
{"word": "grade", "english": "The grade for my presentation was low.", "thai": "เกรดสำหรับการนำเสนอของฉันต่ำ"}
{"word": "grade", "english": "She’s discussing her grade with the advisor.", "thai": "เธอกำลังหารือเรื่องเกรดกับที่ปรึกษา"}
{"word": "grade", "english": "My grade in history is solid.", "thai": "เกรดวิชาประวัติศาสตร์ของฉันดี"}
{"word": "grade", "english": "He got a high grade on his exam.", "thai": "เขาได้เกรดสูงในการสอบ"}
{"word": "grade", "english": "The grade for my quiz was unexpected.", "thai": "เกรดสำหรับสอบย่อยของฉันไม่คาดคิด"}
{"word": "grade", "english": "She’s happy with her literature grade.", "thai": "เธอมีความสุขกับเกрдวิชาวรรณคดี"}
{"word": "grade", "english": "I’m working to improve my chemistry grade.", "thai": "ฉันกำลังพยายามปรับปรุงเกรดวิชาเคมี"}
{"word": "grade", "english": "The grade for my test was an A-!", "thai": "เกรดสำหรับการสอบของฉันคือ A-!"}
{"word": "grade", "english": "He’s checking his grade for the essay.", "thai": "เขากำลังตรวจสอบเกรดสำหรับเรียงความ"}
{"word": "grade", "english": "My grade in physics needs improvement.", "thai": "เกรดวิชาฟิสิกส์ของฉันต้องปรับปรุง"}
{"word": "grade", "english": "She’s thrilled with her biology grade.", "thai": "เธอตื่นเต้นกับเกрдวิชาชีววิทยา"}
{"word": "grade", "english": "I’m discussing my grade with the professor.", "thai": "ฉันกำลังหารือเรื่องเกรดกับอาจารย์"}
{"word": "grade", "english": "The grade for my project was fair.", "thai": "เกรดสำหรับโปรเจกต์ของฉันยุติธรรม"}
{"word": "grade", "english": "He’s aiming for a better grade next time.", "thai": "เขาตั้งเป้าได้เกรดดีขึ้นครั้งหน้า"}
{"word": "grade", "english": "My grade in math is really good.", "thai": "เกรดวิชาคณิตศาสตร์ของฉันดีมาก"}
{"word": "grade", "english": "She got a low grade on her quiz.", "thai": "เธอได้เกรดต่ำในสอบย่อย"}
{"word": "grade", "english": "I’m nervous about my English grade.", "thai": "ฉันกังวลเกี่ยวกับเกรดวิชาภาษาอังกฤษ"}
{"word": "grade", "english": "The grade for my exam was posted today.", "thai": "เกรดสำหรับการสอบของฉันถูกโพสต์วันนี้"}
{"word": "grade", "english": "He’s happy with his history grade.", "thai": "เขามีความสุขกับเกрдวิชาประวัติศาสตร์"}
{"word": "grade", "english": "My grade in chemistry is slipping.", "thai": "เกรดวิชาเคมีของฉันกำลังลดลง"}
{"word": "grade", "english": "She’s checking her grade for the paper.", "thai": "เธอกำลังตรวจสอบเกรดสำหรับเอกสาร"}
{"word": "grade", "english": "The grade for my test was a B.", "thai": "เกรดสำหรับการสอบของฉันคือ B"}
{"word": "grade", "english": "He’s upset about his physics grade.", "thai": "เขาไม่พอใจกับเกрдวิชาฟิสิกส์"}
{"word": "grade", "english": "I need to improve my literature grade.", "thai": "ฉันต้องปรับปรุงเกรดวิชาวรรณคดี"}
{"word": "grade", "english": "The grade for my essay was great.", "thai": "เกรดสำหรับเรียงความของฉันดีมาก"}
{"word": "grade", "english": "She’s aiming for an A grade in biology.", "thai": "เธอตั้งเป้าได้เกรด A ในวิชาชีววิทยา"}
{"word": "grade", "english": "My grade in history is improving.", "thai": "เกรดวิชาประวัติศาสตร์ของฉันกำลังดีขึ้น"}
{"word": "grade", "english": "He’s checking his grade for the midterm.", "thai": "เขากำลังตรวจสอบเกรดสำหรับสอบกลางภาค"}
{"word": "grade", "english": "The grade for my quiz was a C.", "thai": "เกรดสำหรับสอบย่อยของฉันคือ C"}
{"word": "grade", "english": "She’s thrilled with her math grade.", "thai": "เธอตื่นเต้นกับเกрдวิชาคณิตศาสตร์"}
{"word": "grade", "english": "I’m working to raise my English grade.", "thai": "ฉันกำลังพยายามเพิ่มเกรดวิชาภาษาอังกฤษ"}
{"word": "lecture", "english": "I’m heading to a biology lecture this morning.", "thai": "ฉันกำลังไปฟังการบรรยายวิชาชีววิทยาเช้านี้"}
{"word": "lecture", "english": "The lecture on history was really interesting.", "thai": "การบรรยายเกี่ยวกับประวัติศาสตร์น่าสนใจมาก"}
{"word": "lecture", "english": "She’s preparing notes for her lecture.", "thai": "เธอกำลังเตรียมบันทึกสำหรับการบรรยาย"}
{"word": "lecture", "english": "The lecture hall was packed today.", "thai": "ห้องบรรยายแน่นไปด้วยผู้คนวันนี้"}
{"word": "lecture", "english": "He fell asleep during the lecture.", "thai": "เขาหลับระหว่างการบรรยาย"}
{"word": "lecture", "english": "The lecture is about quantum physics.", "thai": "การบรรยายเกี่ยวกับฟิสิกส์ควอนตัม"}
{"word": "lecture", "english": "I forgot my notebook for the lecture.", "thai": "ฉันลืมสมุดจดสำหรับการบรรยาย"}
{"word": "lecture", "english": "She’s giving a lecture on literature.", "thai": "เธอกำลังบรรยายเกี่ยวกับวรรณคดี"}
{"word": "lecture", "english": "The lecture was canceled due to weather.", "thai": "การบรรยายถูกยกเลิกเนื่องจากสภาพอากาศ"}
{"word": "lecture", "english": "I’m recording the lecture for later.", "thai": "ฉันกำลังบันทึกการบรรยายไว้สำหรับภายหลัง"}
{"word": "lecture", "english": "He’s attending a guest lecture tonight.", "thai": "เขาจะเข้าร่วมการบรรยายจากวิทยากรรับเชิญคืนนี้"}
{"word": "lecture", "english": "The lecture covered three chapters.", "thai": "การบรรยายครอบคลุมสามบท"}
{"word": "lecture", "english": "She’s nervous about her first lecture.", "thai": "เธอกังวลเกี่ยวกับการบรรยายครั้งแรก"}
{"word": "lecture", "english": "The lecture is in the science building.", "thai": "การบรรยายอยู่ในอาคารวิทยาศาสตร์"}
{"word": "lecture", "english": "I’m late for my math lecture.", "thai": "ฉันมาสายสำหรับการบรรยายคณิตศาสตร์"}
{"word": "lecture", "english": "He’s preparing slides for the lecture.", "thai": "เขากำลังเตรียมสไลด์สำหรับการบรรยาย"}
{"word": "lecture", "english": "The lecture was really engaging today.", "thai": "การบรรยายน่าสนใจมากวันนี้"}
{"word": "lecture", "english": "She’s attending a lecture on psychology.", "thai": "เธอกำลังเข้าร่วมการบรรยายเกี่ยวกับจิตวิทยา"}
{"word": "lecture", "english": "The lecture hall has new projectors.", "thai": "ห้องบรรยายมีโปรเจคเตอร์ใหม่"}
{"word": "lecture", "english": "I’m reviewing notes from the lecture.", "thai": "ฉันกำลังทบทวนบันทึกจากการบรรยาย"}
{"word": "lecture", "english": "He’s giving a lecture on economics.", "thai": "เขากำลังบรรยายเกี่ยวกับเศรษฐศาสตร์"}
{"word": "lecture", "english": "The lecture is part of the series.", "thai": "การบรรยายเป็นส่วนหนึ่งของชุดการบรรยาย"}
{"word": "lecture", "english": "She missed the lecture due to illness.", "thai": "เธอพลาดการบรรยายเพราะป่วย"}
{"word": "lecture", "english": "The lecture is open to all students.", "thai": "การบรรยายเปิดให้สำหรับนักศึกษาทุกคน"}
{"word": "lecture", "english": "I’m taking notes during the lecture.", "thai": "ฉันกำลังจดบันทึกระหว่างการบรรยาย"}
{"word": "lecture", "english": "He’s hosting a lecture on climate change.", "thai": "เขากำลังเป็นเจ้าภาพการบรรยายเกี่ยวกับการเปลี่ยนแปลงสภาพภูมิอากาศ"}
{"word": "lecture", "english": "The lecture was recorded for online access.", "thai": "การบรรยายถูกบันทึกเพื่อเข้าถึงออนไลน์"}
{"word": "lecture", "english": "She’s preparing for a chemistry lecture.", "thai": "เธอกำลังเตรียมตัวสำหรับการบรรยายวิชาเคมี"}
{"word": "lecture", "english": "The lecture starts at 10 a.m.", "thai": "การบรรยายเริ่มเวลา 10 โมงเช้า"}
{"word": "lecture", "english": "I’m attending a lecture on art history.", "thai": "ฉันกำลังเข้าร่วมการบรรยายเกี่ยวกับประวัติศาสตร์ศิลปะ"}
{"word": "lecture", "english": "He’s giving a lecture in the auditorium.", "thai": "เขากำลังบรรยายในหอประชุม"}
{"word": "lecture", "english": "The lecture was about modern literature.", "thai": "การบรรยายเกี่ยวกับวรรณคดีสมัยใหม่"}
{"word": "lecture", "english": "She’s organizing a lecture series.", "thai": "เธอกำลังจัดการชุดการบรรยาย"}
{"word": "lecture", "english": "The lecture hall was too cold.", "thai": "ห้องบรรยายหนาวเกินไป"}
{"word": "lecture", "english": "I’m skipping the lecture to study.", "thai": "ฉันจะข้ามการบรรยายเพื่อเรียน"}
{"word": "lecture", "english": "He’s attending a lecture on philosophy.", "thai": "เขากำลังเข้าร่วมการบรรยายเกี่ยวกับปรัชญา"}
{"word": "lecture", "english": "The lecture is part of the course.", "thai": "การบรรยายเป็นส่วนหนึ่งของวิชา"}
{"word": "lecture", "english": "She’s taking notes for the lecture.", "thai": "เธอกำลังจดบันทึกสำหรับการบรรยาย"}
{"word": "lecture", "english": "The lecture was postponed to next week.", "thai": "การบรรยายถูกเลื่อนไปสัปดาห์หน้า"}
{"word": "lecture", "english": "I’m watching a recorded lecture online.", "thai": "ฉันกำลังดูการบรรยายที่บันทึกไว้ทางออนไลน์"}
{"word": "lecture", "english": "He’s preparing for a physics lecture.", "thai": "เขากำลังเตรียมตัวสำหรับการบรรยายวิชาฟิสิกส์"}
{"word": "lecture", "english": "The lecture was really informative.", "thai": "การบรรยายให้ข้อมูลมาก"}
{"word": "lecture", "english": "She’s attending a lecture on sociology.", "thai": "เธอกำลังเข้าร่วมการบรรยายเกี่ยวกับสังคมวิทยา"}
{"word": "lecture", "english": "The lecture hall has new seating.", "thai": "ห้องบรรยายมีที่นั่งใหม่"}
{"word": "lecture", "english": "I’m reviewing the lecture slides.", "thai": "ฉันกำลังทบทวนสไลด์การบรรยาย"}
{"word": "lecture", "english": "He’s giving a lecture on data science.", "thai": "เขากำลังบรรยายเกี่ยวกับวิทยาการข้อมูล"}
{"word": "lecture", "english": "The lecture is about environmental science.", "thai": "การบรรยายเกี่ยวกับวิทยาศาสตร์สิ่งแวดล้อม"}
{"word": "lecture", "english": "She missed the lecture due to traffic.", "thai": "เธอพลาดการบรรยายเพราะการจราจร"}
{"word": "lecture", "english": "The lecture is mandatory for the class.", "thai": "การบรรยายเป็นสิ่งบังคับสำหรับชั้นเรียน"}
{"word": "lecture", "english": "I’m taking notes in the lecture hall.", "thai": "ฉันกำลังจดบันทึกในห้องบรรยาย"}
{"word": "lecture", "english": "He’s hosting a lecture on artificial intelligence.", "thai": "เขากำลังเป็นเจ้าภาพการบรรยายเกี่ยวกับปัญญาประดิษฐ์"}
{"word": "lecture", "english": "The lecture was streamed online.", "thai": "การบรรยายถูกสตรีมออนไลน์"}
{"word": "lecture", "english": "She’s preparing for a history lecture.", "thai": "เธอกำลังเตรียมตัวสำหรับการบรรยายวิชาประวัติศาสตร์"}
{"word": "lecture", "english": "The lecture starts in ten minutes.", "thai": "การบรรยายเริ่มในอีกสิบนาที"}
{"word": "lecture", "english": "I’m attending a lecture on anthropology.", "thai": "ฉันกำลังเข้าร่วมการบรรยายเกี่ยวกับมานุษยวิทยา"}
{"word": "lecture", "english": "He’s giving a lecture in the new building.", "thai": "เขากำลังบรรยายในอาคารใหม่"}
{"word": "lecture", "english": "The lecture was about global economics.", "thai": "การบรรยายเกี่ยวกับเศรษฐศาสตร์โลก"}
{"word": "lecture", "english": "She’s organizing a guest lecture.", "thai": "เธอกำลังจัดการการบรรยายจากวิทยากรรับเชิญ"}
{"word": "lecture", "english": "The lecture hall was too warm.", "thai": "ห้องบรรยายร้อนเกินไป"}
{"word": "lecture", "english": "I’m skipping the lecture to finish homework.", "thai": "ฉันจะข้ามการบรรยายเพื่อทำการบ้านให้เสร็จ"}
{"word": "lecture", "english": "He’s attending a lecture on linguistics.", "thai": "เขากำลังเข้าร่วมการบรรยายเกี่ยวกับภาษาศาสตร์"}
{"word": "lecture", "english": "The lecture is part of the curriculum.", "thai": "การบรรยายเป็นส่วนหนึ่งของหลักสูตร"}
{"word": "lecture", "english": "She’s taking notes during the lecture.", "thai": "เธอกำลังจดบันทึกระหว่างการบรรยาย"}
{"word": "lecture", "english": "The lecture was rescheduled for tomorrow.", "thai": "การบรรยายถูกเลื่อนไปเป็นพรุ่งนี้"}
{"word": "lecture", "english": "I’m watching a lecture on my laptop.", "thai": "ฉันกำลังดูการบรรยายบนแล็ปท็อป"}
{"word": "lecture", "english": "He’s preparing for a biology lecture.", "thai": "เขากำลังเตรียมตัวสำหรับการบรรยายวิชาชีววิทยา"}
{"word": "lecture", "english": "The lecture was very interactive.", "thai": "การบรรยายมีการโต้ตอบมาก"}
{"word": "lecture", "english": "She’s attending a lecture on political science.", "thai": "เธอกำลังเข้าร่วมการบรรยายเกี่ยวกับรัฐศาสตร์"}
{"word": "lecture", "english": "The lecture hall has new technology.", "thai": "ห้องบรรยายมีเทคโนโลยีใหม่"}
{"word": "lecture", "english": "I’m reviewing the lecture notes.", "thai": "ฉันกำลังทบทวนบันทึกการบรรยาย"}
{"word": "lecture", "english": "He’s giving a lecture on computer science.", "thai": "เขากำลังบรรยายเกี่ยวกับวิทยาการคอมพิวเตอร์"}
{"word": "lecture", "english": "The lecture is about sustainable development.", "thai": "การบรรยายเกี่ยวกับการพัฒนาที่ยั่งยืน"}
{"word": "lecture", "english": "She missed the lecture due to a meeting.", "thai": "เธอพลาดการบรรยายเพราะการประชุม"}
{"word": "lecture", "english": "The lecture is required for the course.", "thai": "การบรรยายเป็นสิ่งจำเป็นสำหรับวิชา"}
{"word": "lecture", "english": "I’m taking notes in the lecture room.", "thai": "ฉันกำลังจดบันทึกในห้องบรรยาย"}
{"word": "lecture", "english": "He’s hosting a lecture on public health.", "thai": "เขากำลังเป็นเจ้าภาพการบรรยายเกี่ยวกับสาธารณสุข"}
{"word": "lecture", "english": "The lecture was uploaded to the portal.", "thai": "การบรรยายถูกอัปโหลดไปยังพอร์ทัล"}
{"word": "lecture", "english": "She’s preparing for a literature lecture.", "thai": "เธอกำลังเตรียมตัวสำหรับการบรรยายวิชาวรรณคดี"}
{"word": "lecture", "english": "The lecture starts at noon.", "thai": "การบรรยายเริ่มตอนเที่ยง"}
{"word": "lecture", "english": "I’m attending a lecture on architecture.", "thai": "ฉันกำลังเข้าร่วมการบรรยายเกี่ยวกับสถาปัตยกรรม"}
{"word": "lecture", "english": "He’s giving a lecture in the main hall.", "thai": "เขากำลังบรรยายในหอใหญ่"}
{"word": "lecture", "english": "The lecture was about cultural studies.", "thai": "การบรรยายเกี่ยวกับการศึกษาวัฒนธรรม"}
{"word": "lecture", "english": "She’s organizing a lecture on neuroscience.", "thai": "เธอกำลังจัดการการบรรยายเกี่ยวกับประสาทวิทยา"}
{"word": "lecture", "english": "The lecture hall was too noisy.", "thai": "ห้องบรรยายมีเสียงดังเกินไป"}
{"word": "lecture", "english": "I’m skipping the lecture to meet my advisor.", "thai": "ฉันจะข้ามการบรรยายเพื่อพบที่ปรึกษา"}
{"word": "lecture", "english": "He’s attending a lecture on urban planning.", "thai": "เขากำลังเข้าร่วมการบรรยายเกี่ยวกับการวางผังเมือง"}
{"word": "lecture", "english": "The lecture is part of the honors program.", "thai": "การบรรยายเป็นส่วนหนึ่งของโปรแกรมเกียรตินิยม"}
{"word": "lecture", "english": "She’s taking notes for the guest lecture.", "thai": "เธอกำลังจดบันทึกสำหรับการบรรยายจากวิทยากรรับเชิญ"}
{"word": "lecture", "english": "The lecture was canceled due to technical issues.", "thai": "การบรรยายถูกยกเลิกเนื่องจากปัญหาทางเทคนิค"}
{"word": "lecture", "english": "I’m watching a lecture on my phone.", "thai": "ฉันกำลังดูการบรรยายบนโทรศัพท์"}
{"word": "lecture", "english": "He’s preparing for a chemistry lecture.", "thai": "เขากำลังเตรียมตัวสำหรับการบรรยายวิชาเคมี"}
{"word": "lecture", "english": "The lecture was really thought-provoking.", "thai": "การบรรยายกระตุ้นความคิดมาก"}
{"word": "lecture", "english": "She’s attending a lecture on gender studies.", "thai": "เธอกำลังเข้าร่วมการบรรยายเกี่ยวกับการศึกษาเพศ"}
{"word": "lecture", "english": "The lecture hall has new lighting.", "thai": "ห้องบรรยายมีระบบไฟใหม่"}
{"word": "lecture", "english": "I’m reviewing the lecture recordings.", "thai": "ฉันกำลังทบทวนการบันทึกการบรรยาย"}
{"word": "lecture", "english": "He’s giving a lecture on cybersecurity.", "thai": "เขากำลังบรรยายเกี่ยวกับความปลอดภัยทางไซเบอร์"}
{"word": "lecture", "english": "The lecture is about ancient civilizations.", "thai": "การบรรยายเกี่ยวกับอารยธรรมโบราณ"}
{"word": "lecture", "english": "She missed the lecture due to oversleeping.", "thai": "เธอพลาดการบรรยายเพราะตื่นสาย"}
{"word": "lecture", "english": "The lecture is part of the core curriculum.", "thai": "การบรรยายเป็นส่วนหนึ่งของหลักสูตรแกนกลาง"}
{"word": "library", "english": "I’m studying in the library tonight.", "thai": "ฉันกำลังเรียนอยู่ในห้องสมุดคืนนี้"}
{"word": "library", "english": "The library is open until midnight.", "thai": "ห้องสมุดเปิดถึงเที่ยงคืน"}
{"word": "library", "english": "She forgot her book in the library.", "thai": "เธอลืมหนังสือไว้ในห้องสมุด"}
{"word": "library", "english": "The library has a new computer lab.", "thai": "ห้องสมุดมีห้องปฏิบัติการคอมพิวเตอร์ใหม่"}
{"word": "library", "english": "I’m meeting my study group in the library.", "thai": "ฉันจะพบกลุ่มศึกษาของฉันในห้องสมุด"}
{"word": "library", "english": "The library is quiet during finals week.", "thai": "ห้องสมุดเงียบสงบในช่วงสัปดาห์สอบปลายภาค"}
{"word": "library", "english": "He’s borrowing a book from the library.", "thai": "เขากำลังยืมหนังสือจากห้องสมุด"}
{"word": "library", "english": "The library has free Wi-Fi for students.", "thai": "ห้องสมุดมี Wi-Fi ฟรีสำหรับนักศึกษา"}
{"word": "library", "english": "She’s researching in the library all day.", "thai": "เธอกำลังค้นคว้าอยู่ในห้องสมุดทั้งวัน"}
{"word": "library", "english": "The library is near the student center.", "thai": "ห้องสมุดอยู่ใกล้ศูนย์นักศึกษา"}
{"word": "library", "english": "I left my notes in the library.", "thai": "ฉันลืมบันทึกไว้ในห้องสมุด"}
{"word": "library", "english": "The library is hosting a book club.", "thai": "ห้องสมุดกำลังจัดชมรมหนังสือ"}
{"word": "library", "english": "He’s studying for his exam in the library.", "thai": "เขากำลังเรียนเพื่อสอบในห้องสมุด"}
{"word": "library", "english": "The library has a new study room.", "thai": "ห้องสมุดมีห้องเรียนใหม่"}
{"word": "library", "english": "She’s returning a book to the library.", "thai": "เธอกำลังคืนหนังสือให้ห้องสมุด"}
{"word": "library", "english": "The library is packed during midterms.", "thai": "ห้องสมุดแน่นไปด้วยผู้คนในช่วงสอบกลางภาค"}
{"word": "library", "english": "I’m working on my paper in the library.", "thai": "ฉันกำลังทำงานเอกสารในห้องสมุด"}
{"word": "library", "english": "The library has a great reference section.", "thai": "ห้องสมุดมีส่วนอ้างอิงที่ดีมาก"}
{"word": "library", "english": "He’s using the library’s online database.", "thai": "เขากำลังใช้ฐานข้อมูลออนไลน์ของห้องสมุด"}
{"word": "library", "english": "The library is closed on weekends.", "thai": "ห้องสมุดปิดในช่วงสุดสัปดาห์"}
{"word": "library", "english": "She’s volunteering at the library this semester.", "thai": "เธอกำลังเป็นอาสาสมัครที่ห้องสมุดในภาคเรียนนี้"}
{"word": "library", "english": "I’m checking out books from the library.", "thai": "ฉันกำลังยืมหนังสือจากห้องสมุด"}
{"word": "library", "english": "The library has new furniture this year.", "thai": "ห้องสมุดมีเฟอร์นิเจอร์ใหม่ในปีนี้"}
{"word": "library", "english": "He’s meeting his professor in the library.", "thai": "เขาจะพบอาจารย์ในห้องสมุด"}
{"word": "library", "english": "The library is hosting a research workshop.", "thai": "ห้องสมุดกำลังจัดประชุมเชิงปฏิบัติการด้านการวิจัย"}
{"word": "library", "english": "I’m studying in the library’s quiet zone.", "thai": "ฉันกำลังเรียนอยู่ในโซนเงียบของห้องสมุด"}
{"word": "library", "english": "She forgot her laptop in the library.", "thai": "เธอลืมแล็ปท็อปไว้ในห้องสมุด"}
{"word": "library", "english": "The library has a new digital archive.", "thai": "ห้องสมุดมีคลังข้อมูลดิจิทัลใหม่"}
{"word": "library", "english": "He’s researching history in the library.", "thai": "เขากำลังค้นคว้าประวัติศาสตร์ในห้องสมุด"}
{"word": "library", "english": "The library is open to the public.", "thai": "ห้องสมุดเปิดให้ประชาชนทั่วไป"}
{"word": "library", "english": "I’m using the library’s study carrels.", "thai": "ฉันกำลังใช้โต๊ะเรียนส่วนตัวของห้องสมุด"}
{"word": "library", "english": "She’s attending a lecture in the library.", "thai": "เธอกำลังเข้าร่วมการบรรยายในห้องสมุด"}
{"word": "library", "english": "The library has a great selection of journals.", "thai": "ห้องสมุดมีวารสารให้เลือกมากมาย"}
{"word": "library", "english": "He’s working in the library all weekend.", "thai": "เขากำลังทำงานอยู่ในห้องสมุดตลอดสุดสัปดาห์"}
{"word": "library", "english": "The library is near the science building.", "thai": "ห้องสมุดอยู่ใกล้อาคารวิทยาศาสตร์"}
{"word": "library", "english": "I’m borrowing a textbook from the library.", "thai": "ฉันกำลังยืมตำราเรียนจากห้องสมุด"}
{"word": "library", "english": "The library is hosting a book sale.", "thai": "ห้องสมุดกำลังจัดงานขายหนังสือ"}
{"word": "library", "english": "She’s studying for her test in the library.", "thai": "เธอกำลังเรียนเพื่อสอบในห้องสมุด"}
{"word": "library", "english": "The library has new computers this semester.", "thai": "ห้องสมุดมีคอมพิวเตอร์ใหม่ในภาคเรียนนี้"}
{"word": "library", "english": "He’s returning overdue books to the library.", "thai": "เขากำลังคืนหนังสือที่เลยกำหนดให้ห้องสมุด"}
{"word": "library", "english": "The library is too crowded today.", "thai": "ห้องสมุดแออัดเกินไปวันนี้"}
{"word": "library", "english": "I’m meeting my tutor in the library.", "thai": "ฉันจะพบติวเตอร์ในห้องสมุด"}
{"word": "library", "english": "The library has a new study lounge.", "thai": "ห้องสมุดมีเลานจ์เรียนใหม่"}
{"word": "library", "english": "She’s researching for her paper in the library.", "thai": "เธอกำลังค้นคว้าเพื่อเอกสารของเธอในห้องสมุด"}
{"word": "library", "english": "The library is hosting a writing workshop.", "thai": "ห้องสมุดกำลังจัดประชุมเชิงปฏิบัติการด้านการเขียน"}
{"word": "library", "english": "He’s using the library’s online resources.", "thai": "เขากำลังใช้ทรัพยากรออนไลน์ของห้องสมุด"}
{"word": "library", "english": "The library is quiet in the mornings.", "thai": "ห้องสมุดเงียบสงบในตอนเช้า"}
{"word": "library", "english": "I’m checking out a novel from the library.", "thai": "ฉันกำลังยืมนิยายจากห้องสมุด"}
{"word": "library", "english": "The library has new seating areas.", "thai": "ห้องสมุดมีพื้นที่นั่งใหม่"}
{"word": "library", "english": "She’s working on her thesis in the library.", "thai": "เธอกำลังทำงานวิทยานิพนธ์ในห้องสมุด"}
{"word": "library", "english": "The library is near the lecture hall.", "thai": "ห้องสมุดอยู่ใกล้ห้องบรรยาย"}
{"word": "library", "english": "He’s studying chemistry in the library.", "thai": "เขากำลังเรียนเคมีในห้องสมุด"}
{"word": "library", "english": "The library is hosting a poetry reading.", "thai": "ห้องสมุดกำลังจัดงานอ่านบทกวี"}
{"word": "library", "english": "I’m using the library’s group study room.", "thai": "ฉันกำลังใช้ห้องเรียนกลุ่มของห้องสมุด"}
{"word": "library", "english": "The library has a great fiction section.", "thai": "ห้องสมุดมีส่วนนิยายที่ดีมาก"}
{"word": "library", "english": "She’s attending a seminar in the library.", "thai": "เธอกำลังเข้าร่วมสัมมนาในห้องสมุด"}
{"word": "library", "english": "The library is open 24 hours during finals.", "thai": "ห้องสมุดเปิด 24 ชั่วโมงในช่วงสอบปลายภาค"}
{"word": "library", "english": "He’s researching history in the library archives.", "thai": "เขากำลังค้นคว้าประวัติศาสตร์ในคลังเอกสารของห้องสมุด"}
{"word": "library", "english": "I’m borrowing a journal from the library.", "thai": "ฉันกำลังยืมวารสารจากห้องสมุด"}
{"word": "library", "english": "The library is hosting a study marathon.", "thai": "ห้องสมุดกำลังจัดมาราธอนการเรียน"}
{"word": "library", "english": "She’s studying for her exam in the library.", "thai": "เธอกำลังเรียนเพื่อสอบในห้องสมุด"}
{"word": "library", "english": "The library has new digital resources.", "thai": "ห้องสมุดมีทรัพยากรดิจิทัลใหม่"}
{"word": "library", "english": "He’s meeting his group in the library.", "thai": "เขาจะพบกลุ่มของเขาในห้องสมุด"}
{"word": "library", "english": "The library is near the dormitory.", "thai": "ห้องสมุดอยู่ใกล้หอพัก"}
{"word": "library", "english": "I’m checking out a textbook from the library.", "thai": "ฉันกำลังยืมตำราเรียนจากห้องสมุด"}
{"word": "library", "english": "The library is hosting a film screening.", "thai": "ห้องสมุดกำลังจัดงานฉายภาพยนตร์"}
{"word": "library", "english": "She’s researching in the library’s quiet room.", "thai": "เธอกำลังค้นคว้าในห้องเงียบของห้องสมุด"}
{"word": "library", "english": "The library has a new online catalog.", "thai": "ห้องสมุดมีแคตตาล็อกออนไลน์ใหม่"}
{"word": "library", "english": "He’s studying physics in the library.", "thai": "เขากำลังเรียนฟิสิกส์ในห้องสมุด"}
{"word": "library", "english": "The library is hosting a guest lecture.", "thai": "ห้องสมุดกำลังเป็นเจ้าภาพการบรรยายจากวิทยากรรับเชิญ"}
{"word": "library", "english": "I’m using the library’s study tables.", "thai": "ฉันกำลังใช้โต๊ะเรียนของห้องสมุด"}
{"word": "library", "english": "The library has a great history section.", "thai": "ห้องสมุดมีส่วนประวัติศาสตร์ที่ดีมาก"}
{"word": "library", "english": "She’s attending a workshop in the library.", "thai": "เธอกำลังเข้าร่วมประชุมเชิงปฏิบัติการในห้องสมุด"}
{"word": "library", "english": "The library is crowded during exam week.", "thai": "ห้องสมุดแออัดในช่วงสัปดาห์สอบ"}
{"word": "library", "english": "He’s borrowing a magazine from the library.", "thai": "เขากำลังยืมนิตยสารจากห้องสมุด"}
{"word": "library", "english": "The library is hosting a book discussion.", "thai": "ห้องสมุดกำลังจัดงานสนทนาเกี่ยวกับหนังสือ"}
{"word": "library", "english": "I’m studying in the library’s reading room.", "thai": "ฉันกำลังเรียนอยู่ในห้องอ่านหนังสือของห้องสมุด"}
{"word": "library", "english": "The library has new lighting installed.", "thai": "ห้องสมุดมีระบบไฟใหม่ติดตั้งแล้ว"}
{"word": "library", "english": "She’s researching for her thesis in the library.", "thai": "เธอกำลังค้นคว้าเพื่อวิทยานิพนธ์ในห้องสมุด"}
{"word": "library", "english": "The library is near the main quad.", "thai": "ห้องสมุดอยู่ใกล้ลานหลัก"}
{"word": "library", "english": "He’s studying literature in the library.", "thai": "เขากำลังเรียนวรรณคดีในห้องสมุด"}
{"word": "library", "english": "The library is hosting a study skills workshop.", "thai": "ห้องสมุดกำลังจัดประชุมเชิงปฏิบัติการด้านทักษะการเรียน"}
{"word": "library", "english": "I’m using the library’s online journals.", "thai": "ฉันกำลังใช้วารสารออนไลน์ของห้องสมุด"}
{"word": "library", "english": "The library has a new coffee shop.", "thai": "ห้องสมุดมีร้านกาแฟใหม่"}
{"word": "library", "english": "She’s attending a book talk in the library.", "thai": "เธอกำลังเข้าร่วมการพูดคุยเกี่ยวกับหนังสือในห้องสมุด"}
{"word": "library", "english": "The library is open late during finals.", "thai": "ห้องสมุดเปิดถึงดึกในช่วงสอบปลายภาค"}
{"word": "library", "english": "He’s researching in the library’s archives.", "thai": "เขากำลังค้นคว้าในคลังเอกสารของห้องสมุด"}
{"word": "library", "english": "I’m borrowing a reference book from the library.", "thai": "ฉันกำลังยืมหนังสืออ้างอิงจากห้องสมุด"}
{"word": "library", "english": "The library is hosting a literary event.", "thai": "ห้องสมุดกำลังจัดงานวรรณกรรม"}
{"word": "library", "english": "She’s studying for her test in the library.", "thai": "เธอกำลังเรียนเพื่อสอบในห้องสมุด"}
{"word": "library", "english": "The library has new study carrels.", "thai": "ห้องสมุดมีโต๊ะเรียนส่วนตัวใหม่"}
{"word": "library", "english": "He’s meeting his advisor in the library.", "thai": "เขาจะพบที่ปรึกษาในห้องสมุด"}
{"word": "library", "english": "The library is hosting a research seminar.", "thai": "ห้องสมุดกำลังจัดสัมมนาการวิจัย"}
{"word": "library", "english": "I’m studying in the library’s group room.", "thai": "ฉันกำลังเรียนอยู่ในห้องกลุ่มของห้องสมุด"}
{"word": "library", "english": "The library has a great science section.", "thai": "ห้องสมุดมีส่วนวิทยาศาสตร์ที่ดีมาก"}
{"word": "library", "english": "She’s attending a study session in the library.", "thai": "เธอกำลังเข้าร่วมเซสชันการเรียนในห้องสมุด"}
{"word": "library", "english": "The library is quiet during the summer.", "thai": "ห้องสมุดเงียบสงบในช่วงฤดูร้อน"}
{"word": "library", "english": "He’s borrowing a novel from the library.", "thai": "เขากำลังยืมนิยายจากห้องสมุด"}
{"word": "library", "english": "The library is hosting a career workshop.", "thai": "ห้องสมุดกำลังจัดประชุมเชิงปฏิบัติการด้านอาชีพ"}
{"word": "professor", "english": "I’m meeting my professor after class.", "thai": "ฉันจะพบอาจารย์หลังเลิกเรียน"}
{"word": "professor", "english": "The professor gave a great lecture today.", "thai": "อาจารย์ให้การบรรยายที่ยอดเยี่ยมวันนี้"}
{"word": "professor", "english": "She’s asking the professor about the exam.", "thai": "เธอกำลังถามอาจารย์เกี่ยวกับการสอบ"}
{"word": "professor", "english": "The professor posted the grades online.", "thai": "อาจารย์โพสต์เกรดทางออนไลน์"}
{"word": "professor", "english": "He’s a new professor in the biology department.", "thai": "เขาเป็นอาจารย์ใหม่ในภาควิชาชีววิทยา"}
{"word": "professor", "english": "The professor assigned a research paper.", "thai": "อาจารย์มอบหมายงานวิจัย"}
{"word": "professor", "english": "I’m discussing my project with the professor.", "thai": "ฉันกำลังหารือเกี่ยวกับโปรเจกต์กับอาจารย์"}
{"word": "professor", "english": "The professor canceled class today.", "thai": "อาจารย์ยกเลิกชั้นเรียนวันนี้"}
{"word": "professor", "english": "She’s a well-known professor in history.", "thai": "เธอเป็นอาจารย์ที่มีชื่อเสียงในสาขาประวัติศาสตร์"}
{"word": "professor", "english": "The professor is leading a study group.", "thai": "อาจารย์กำลังนำกลุ่มศึกษา"}
{"word": "professor", "english": "I forgot to email the professor my homework.", "thai": "ฉันลืมส่งการบ้านทางอีเมลถึงอาจารย์"}
{"word": "professor", "english": "The professor is giving a guest lecture.", "thai": "อาจารย์กำลังบรรยายในฐานะวิทยากรรับเชิญ"}
{"word": "professor", "english": "He’s meeting the professor about his grade.", "thai": "เขาจะพบอาจารย์เกี่ยวกับเกรดของเขา"}
{"word": "professor", "english": "The professor wrote a book on physics.", "thai": "อาจารย์เขียนหนังสือเกี่ยวกับฟิสิกส์"}
{"word": "professor", "english": "She’s asking the professor for extra credit.", "thai": "เธอกำลังขอคะแนนพิเศษจากอาจารย์"}
{"word": "professor", "english": "The professor is very strict about deadlines.", "thai": "อาจารย์เข้มงวดมากเกี่ยวกับกำหนดส่ง"}
{"word": "professor", "english": "I’m attending the professor’s office hours.", "thai": "ฉันกำลังไปช่วงเวลาทำการของอาจารย์"}
{"word": "professor", "english": "The professor explained the assignment clearly.", "thai": "อาจารย์อธิบายงานที่มอบหมายอย่างชัดเจน"}
{"word": "professor", "english": "He’s a professor in the chemistry department.", "thai": "เขาเป็นอาจารย์ในภาควิชาเคมี"}
{"word": "professor", "english": "The professor is hosting a seminar tomorrow.", "thai": "อาจารย์กำลังจัดสัมมนาพรุ่งนี้"}
{"word": "professor", "english": "She’s discussing her thesis with the professor.", "thai": "เธอกำลังหารือเกี่ยวกับวิทยานิพนธ์กับอาจารย์"}
{"word": "professor", "english": "The professor gave us a tough exam.", "thai": "อาจารย์ให้ข้อสอบที่ยากกับเรา"}
{"word": "professor", "english": "I’m asking the professor for a recommendation.", "thai": "ฉันกำลังขอจดหมายแนะนำจากอาจารย์"}
{"word": "professor", "english": "The professor is leading a research project.", "thai": "อาจารย์กำลังนำโครงการวิจัย"}
{"word": "professor", "english": "He’s emailing the professor about the syllabus.", "thai": "เขากำลังส่งอีเมลถึงอาจารย์เกี่ยวกับหลักสูตร"}
{"word": "professor", "english": "The professor is very engaging in class.", "thai": "อาจารย์มีส่วนร่วมมากในชั้นเรียน"}
{"word": "professor", "english": "She’s a professor in the literature department.", "thai": "เธอเป็นอาจารย์ในภาควิชาวรรณคดี"}
{"word": "professor", "english": "The professor curved the final grades.", "thai": "อาจารย์ปรับเกรดปลายภาค"}
{"word": "professor", "english": "I’m meeting the professor in the library.", "thai": "ฉันจะพบอาจารย์ในห้องสมุด"}
{"word": "professor", "english": "The professor is giving a talk on economics.", "thai": "อาจารย์กำลังบรรยายเกี่ยวกับเศรษฐศาสตร์"}
{"word": "professor", "english": "She’s asking the professor about the lecture.", "thai": "เธอกำลังถามอาจารย์เกี่ยวกับการบรรยาย"}
{"word": "professor", "english": "The professor posted the notes online.", "thai": "อาจารย์โพสต์บันทึกการบรรยายทางออนไลน์"}
{"word": "professor", "english": "He’s a professor in the engineering department.", "thai": "เขาเป็นอาจารย์ในภาควิชาวิศวกรรม"}
{"word": "professor", "english": "The professor is leading a field trip.", "thai": "อาจารย์กำลังนำการทัศนศึกษา"}
{"word": "professor", "english": "I’m discussing my grade with the professor.", "thai": "ฉันกำลังหารือเรื่องเกรดกับอาจารย์"}
{"word": "professor", "english": "The professor wrote a paper on climate change.", "thai": "อาจารย์เขียนเอกสารเกี่ยวกับการเปลี่ยนแปลงสภาพภูมิอากาศ"}
{"word": "professor", "english": "She’s meeting the professor about her project.", "thai": "เธอกำลังพบอาจารย์เกี่ยวกับโปรเจกต์ของเธอ"}
{"word": "professor", "english": "The professor is very approachable.", "thai": "อาจารย์เข้าถึงได้ง่ายมาก"}
{"word": "professor", "english": "He’s asking the professor for an extension.", "thai": "เขากำลังขอขยายเวลาจากอาจารย์"}
{"word": "professor", "english": "The professor is hosting a workshop.", "thai": "อาจารย์กำลังจัดประชุมเชิงปฏิบัติการ"}
{"word": "professor", "english": "I’m attending the professor’s review session.", "thai": "ฉันกำลังเข้าร่วมเซสชันทบทวนของอาจารย์"}
{"word": "professor", "english": "The professor gave a quiz in class.", "thai": "อาจารย์ให้สอบย่อยในชั้นเรียน"}
{"word": "professor", "english": "She’s a professor in the psychology department.", "thai": "เธอเป็นอาจารย์ในภาควิชาจิตวิทยา"}
{"word": "professor", "english": "The professor is leading a discussion group.", "thai": "อาจารย์กำลังนำกลุ่มสนทนา"}
{"word": "professor", "english": "I’m emailing the professor about the assignment.", "thai": "ฉันกำลังส่งอีเมลถึงอาจารย์เกี่ยวกับงานที่มอบหมาย"}
{"word": "professor", "english": "The professor is giving a lecture on history.", "thai": "อาจารย์กำลังบรรยายเกี่ยวกับประวัติศาสตร์"}
{"word": "professor", "english": "He’s meeting the professor after the lecture.", "thai": "เขาจะพบอาจารย์หลังการบรรยาย"}
{"word": "professor", "english": "The professor is very knowledgeable about physics.", "thai": "อาจารย์มีความรู้มากเกี่ยวกับฟิสิกส์"}
{"word": "professor", "english": "She’s discussing her research with the professor.", "thai": "เธอกำลังหารือเกี่ยวกับงานวิจัยกับอาจารย์"}
{"word": "professor", "english": "The professor assigned a group project.", "thai": "อาจารย์มอบหมายโปรเจกต์กลุ่ม"}
{"word": "professor", "english": "I’m asking the professor for study tips.", "thai": "ฉันกำลังขอเคล็ดลับการเรียนจากอาจารย์"}
{"word": "professor", "english": "The professor is leading a lab session.", "thai": "อาจารย์กำลังนำเซสชันห้องปฏิบัติการ"}
{"word": "professor", "english": "He’s a professor in the computer science department.", "thai": "เขาเป็นอาจารย์ในภาควิชาวิทยาการคอมพิวเตอร์"}
{"word": "professor", "english": "The professor is giving a talk on literature.", "thai": "อาจารย์กำลังบรรยายเกี่ยวกับวรรณคดี"}
{"word": "professor", "english": "She’s meeting the professor about her thesis.", "thai": "เธอกำลังพบอาจารย์เกี่ยวกับวิทยานิพนธ์ของเธอ"}
{"word": "professor", "english": "The professor posted the syllabus online.", "thai": "อาจารย์โพสต์หลักสูตรวิชาทางออนไลน์"}
{"word": "professor", "english": "I’m attending the professor’s seminar.", "thai": "ฉันกำลังเข้าร่วมสัมมนาของอาจารย์"}
{"word": "professor", "english": "The professor is very strict about attendance.", "thai": "อาจารย์เข้มงวดมากเกี่ยวกับการเข้าชั้นเรียน"}
{"word": "professor", "english": "He’s discussing his exam with the professor.", "thai": "เขากำลังหารือเกี่ยวกับการสอบกับอาจารย์"}
{"word": "professor", "english": "The professor wrote a book on economics.", "thai": "อาจารย์เขียนหนังสือเกี่ยวกับเศรษฐศาสตร์"}
{"word": "professor", "english": "She’s asking the professor for clarification.", "thai": "เธอกำลังขอคำอธิบายจากอาจารย์"}
{"word": "professor", "english": "The professor is hosting a guest speaker.", "thai": "อาจารย์กำลังเป็นเจ้าภาพวิทยากรรับเชิญ"}
{"word": "professor", "english": "I’m meeting the professor in his office.", "thai": "ฉันจะพบอาจารย์ในสำนักงานของเขา"}
{"word": "professor", "english": "The professor gave a tough assignment.", "thai": "อาจารย์ให้งานที่ยาก"}
{"word": "professor", "english": "She’s a professor in the sociology department.", "thai": "เธอเป็นอาจารย์ในภาควิชาสังคมวิทยา"}
{"word": "professor", "english": "The professor is leading a research team.", "thai": "อาจารย์กำลังนำทีมวิจัย"}
{"word": "professor", "english": "He’s emailing the professor about the project.", "thai": "เขากำลังส่งอีเมลถึงอาจารย์เกี่ยวกับโปรเจกต์"}
{"word": "professor", "english": "The professor is giving a lecture on chemistry.", "thai": "อาจารย์กำลังบรรยายเกี่ยวกับเคมี"}
{"word": "professor", "english": "I’m asking the professor for a reference.", "thai": "ฉันกำลังขอจดหมายอ้างอิงจากอาจารย์"}
{"word": "professor", "english": "The professor is very passionate about history.", "thai": "อาจารย์มีความหลงใหลในประวัติศาสตร์มาก"}
{"word": "professor", "english": "She’s discussing her paper with the professor.", "thai": "เธอกำลังหารือเกี่ยวกับเอกสารของเธอกับอาจารย์"}
{"word": "professor", "english": "The professor assigned a final presentation.", "thai": "อาจารย์มอบหมายการนำเสนอครั้งสุดท้าย"}
{"word": "professor", "english": "I’m attending the professor’s study session.", "thai": "ฉันกำลังเข้าร่วมเซสชันการเรียนของอาจารย์"}
{"word": "professor", "english": "The professor is leading a workshop on coding.", "thai": "อาจารย์กำลังนำการประชุมเชิงปฏิบัติการเกี่ยวกับการเขียนโค้ด"}
{"word": "professor", "english": "He’s a professor in the physics department.", "thai": "เขาเป็นอาจารย์ในภาควิชาฟิสิกส์"}
{"word": "professor", "english": "The professor is giving a talk on neuroscience.", "thai": "อาจารย์กำลังบรรยายเกี่ยวกับประสาทวิทยา"}
{"word": "professor", "english": "She’s meeting the professor about her grade.", "thai": "เธอกำลังพบอาจารย์เกี่ยวกับเกรดของเธอ"}
{"word": "professor", "english": "The professor posted the lecture slides.", "thai": "อาจารย์โพสต์สไลด์การบรรยาย"}
{"word": "professor", "english": "I’m discussing my research with the professor.", "thai": "ฉันกำลังหารือเกี่ยวกับงานวิจัยของฉันกับอาจารย์"}
{"word": "professor", "english": "The professor is very supportive of students.", "thai": "อาจารย์สนับสนุนนักศึกษามาก"}
{"word": "professor", "english": "He’s asking the professor for study materials.", "thai": "เขากำลังขอเอกสารการเรียนจากอาจารย์"}
{"word": "professor", "english": "The professor is hosting a panel discussion.", "thai": "อาจารย์กำลังเป็นเจ้าภาพการอภิปราย"}
{"word": "professor", "english": "I’m meeting the professor about my internship.", "thai": "ฉันจะพบอาจารย์เกี่ยวกับการฝึกงานของฉัน"}
{"word": "professor", "english": "The professor gave a challenging quiz.", "thai": "อาจารย์ให้สอบย่อยที่ท้าทาย"}
{"word": "professor", "english": "She’s a professor in the art history department.", "thai": "เธอเป็นอาจารย์ในภาควิชาประวัติศาสตร์ศิลปะ"}
{"word": "professor", "english": "The professor is leading a study abroad program.", "thai": "อาจารย์กำลังนำโปรแกรมการเรียนต่อต่างประเทศ"}
{"word": "professor", "english": "He’s emailing the professor about the exam.", "thai": "เขากำลังส่งอีเมลถึงอาจารย์เกี่ยวกับการสอบ"}
{"word": "professor", "english": "The professor is giving a lecture on anthropology.", "thai": "อาจารย์กำลังบรรยายเกี่ยวกับมานุษยวิทยา"}
{"word": "professor", "english": "I’m asking the professor for extra help.", "thai": "ฉันกำลังขอความช่วยเหลือเพิ่มเติมจากอาจารย์"}
{"word": "professor", "english": "The professor is very engaging during lectures.", "thai": "อาจารย์มีส่วนร่วมมากระหว่างการบรรยาย"}
{"word": "professor", "english": "She’s discussing her presentation with the professor.", "thai": "เธอกำลังหารือเกี่ยวกับการนำเสนอของเธอกับอาจารย์"}
{"word": "professor", "english": "The professor assigned a group discussion.", "thai": "อาจารย์มอบหมายการสนทนากลุ่ม"}
{"word": "professor", "english": "I’m attending the professor’s review class.", "thai": "ฉันกำลังเข้าร่วมชั้นเรียนทบทวนของอาจารย์"}
{"word": "professor", "english": "The professor is leading a seminar on literature.", "thai": "อาจารย์กำลังนำสัมมนาเกี่ยวกับวรรณคดี"}
{"word": "professor", "english": "He’s a professor in the economics department.", "thai": "เขาเป็นอาจารย์ในภาควิชาเศรษฐศาสตร์"}
{"word": "professor", "english": "The professor is giving a talk on sustainability.", "thai": "อาจารย์กำลังบรรยายเกี่ยวกับความยั่งยืน"}
{"word": "professor", "english": "She’s meeting the professor about her research.", "thai": "เธอกำลังพบอาจารย์เกี่ยวกับงานวิจัยของเธอ"}
{"word": "semester", "english": "I’m taking five classes this semester.", "thai": "ฉันเรียนห้าวิชาในภาคเรียนนี้"}
{"word": "semester", "english": "The semester starts next Monday.", "thai": "ภาคเรียนเริ่มวันจันทร์หน้า"}
{"word": "semester", "english": "She’s struggling with her grades this semester.", "thai": "เธอกำลังมีปัญหากับเกรดในภาคเรียนนี้"}
{"word": "semester", "english": "This semester is going by so fast.", "thai": "ภาคเรียนนี้ผ่านไปเร็วมาก"}
{"word": "semester", "english": "He’s studying abroad next semester.", "thai": "เขาจะเรียนต่อต่างประเทศในภาคเรียนหน้า"}
{"word": "semester", "english": "I’m excited for the new semester.", "thai": "ฉันตื่นเต้นกับภาคเรียนใหม่"}
{"word": "semester", "english": "The semester ends in December.", "thai": "ภาคเรียนสิ้นสุดในเดือนธันวาคม"}
{"word": "semester", "english": "She’s taking a break this semester.", "thai": "เธอกำลังหยุดพักในภาคเรียนนี้"}
{"word": "semester", "english": "I need to register for next semester.", "thai": "ฉันต้องลงทะเบียนสำหรับภาคเรียนหน้า"}
{"word": "semester", "english": "The semester has been really tough.", "thai": "ภาคเรียนนี้ยากมาก"}
{"word": "semester", "english": "He’s dropping a class this semester.", "thai": "เขากำลังถอนวิชาในภาคเรียนนี้"}
{"word": "semester", "english": "I’m working part-time this semester.", "thai": "ฉันทำงานนอกเวลาในภาคเรียนนี้"}
{"word": "semester", "english": "She’s planning her schedule for next semester.", "thai": "เธอกำลังวางแผนตารางเรียนสำหรับภาคเรียนหน้า"}
{"word": "semester", "english": "The semester is almost over.", "thai": "ภาคเรียนใกล้จะจบแล้ว"}
{"word": "semester", "english": "I’m taking a math class this semester.", "thai": "ฉันกำลังเรียนวิชาคณิตศาสตร์ในภาคเรียนนี้"}
{"word": "semester", "english": "He’s been stressed all semester.", "thai": "เขาเครียดตลอดทั้งภาคเรียน"}
{"word": "semester", "english": "The semester started with a big lecture.", "thai": "ภาคเรียนเริ่มด้วยการบรรยายครั้งใหญ่"}
{"word": "semester", "english": "She’s auditing a course this semester.", "thai": "เธอกำลังฟังวิชาแบบไม่ลงทะเบียนในภาคเรียนนี้"}
{"word": "semester", "english": "I’m living in the dorms this semester.", "thai": "ฉันอาศัยอยู่ในหอพักในภาคเรียนนี้"}
{"word": "semester", "english": "The semester has a lot of holidays.", "thai": "ภาคเรียนนี้มีวันหยุดเยอะ"}
{"word": "semester", "english": "He’s taking a heavy course load this semester.", "thai": "เขากำลังเรียนหนักในภาคเรียนนี้"}
{"word": "semester", "english": "I’m joining a club this semester.", "thai": "ฉันกำลังเข้าร่วมชมรมในภาคเรียนนี้"}
{"word": "semester", "english": "She’s excited about her classes this semester.", "thai": "เธอตื่นเต้นกับวิชาเรียนในภาคเรียนนี้"}
{"word": "semester", "english": "The semester is packed with assignments.", "thai": "ภาคเรียนนี้เต็มไปด้วยงานที่มอบหมาย"}
{"word": "semester", "english": "I’m meeting my advisor this semester.", "thai": "ฉันจะพบที่ปรึกษาในภาคเรียนนี้"}
{"word": "semester", "english": "He’s taking a biology class this semester.", "thai": "เขากำลังเรียนวิชาชีววิทยาในภาคเรียนนี้"}
{"word": "semester", "english": "The semester ends with final exams.", "thai": "ภาคเรียนสิ้นสุดด้วยการสอบปลายภาค"}
{"word": "semester", "english": "She’s struggling with chemistry this semester.", "thai": "เธอกำลังมีปัญหากับวิชาเคมีในภาคเรียนนี้"}
{"word": "semester", "english": "I’m volunteering on campus this semester.", "thai": "ฉันกำลังเป็นอาสาสมัครในมหาวิทยาลัยในภาคเรียนนี้"}
{"word": "semester", "english": "The semester has been really busy.", "thai": "ภาคเรียนนี้วุ่นวายมาก"}
{"word": "semester", "english": "He’s taking an online course this semester.", "thai": "เขากำลังเรียนวิชาออนไลน์ในภาคเรียนนี้"}
{"word": "semester", "english": "I’m switching majors next semester.", "thai": "ฉันจะเปลี่ยนสาขาวิชาเอกในภาคเรียนหน้า"}
{"word": "semester", "english": "She’s taking a literature class this semester.", "thai": "เธอกำลังเรียนวิชาวรรณคดีในภาคเรียนนี้"}
{"word": "semester", "english": "The semester started with orientation.", "thai": "ภาคเรียนเริ่มด้วยการปฐมนิเทศ"}
{"word": "semester", "english": "I’m working on a project this semester.", "thai": "ฉันกำลังทำงานในโปรเจกต์ในภาคเรียนนี้"}
{"word": "semester", "english": "He’s excited for the spring semester.", "thai": "เขาตื่นเต้นกับภาคเรียนฤดูใบไม้ผลิ"}
{"word": "semester", "english": "The semester has a lot of group work.", "thai": "ภาคเรียนนี้มีงานกลุ่มเยอะ"}
{"word": "semester", "english": "She’s taking a history class this semester.", "thai": "เธอกำลังเรียนวิชาประวัติศาสตร์ในภาคเรียนนี้"}
{"word": "semester", "english": "I’m studying abroad next semester.", "thai": "ฉันจะเรียนต่อต่างประเทศในภาคเรียนหน้า"}
{"word": "semester", "english": "The semester is going well so far.", "thai": "ภาคเรียนนี้ดำเนินไปด้วยดีจนถึงตอนนี้"}
{"word": "semester", "english": "He’s taking a physics class this semester.", "thai": "เขากำลังเรียนวิชาฟิสิกส์ในภาคเรียนนี้"}
{"word": "semester", "english": "I’m overwhelmed with work this semester.", "thai": "ฉันรู้สึกหนักใจกับงานในภาคเรียนนี้"}
{"word": "semester", "english": "She’s joining a study group this semester.", "thai": "เธอกำลังเข้าร่วมกลุ่มศึกษาในภาคเรียนนี้"}
{"word": "semester", "english": "The semester ends with a big presentation.", "thai": "ภาคเรียนสิ้นสุดด้วยการนำเสนอครั้งใหญ่"}
{"word": "semester", "english": "I’m taking a coding class this semester.", "thai": "ฉันกำลังเรียนวิชาการเขียนโค้ดในภาคเรียนนี้"}
{"word": "semester", "english": "He’s struggling with math this semester.", "thai": "เขากำลังมีปัญหากับวิชาคณิตศาสตร์ในภาคเรียนนี้"}
{"word": "semester", "english": "The semester has been full of surprises.", "thai": "ภาคเรียนนี้เต็มไปด้วยเรื่องน่าประหลาดใจ"}
{"word": "semester", "english": "She’s taking an art class this semester.", "thai": "เธอกำลังเรียนวิชาศิลปะในภาคเรียนนี้"}
{"word": "semester", "english": "I’m planning my courses for next semester.", "thai": "ฉันกำลังวางแผนวิชาเรียนสำหรับภาคเรียนหน้า"}
{"word": "semester", "english": "The semester started with a lot of reading.", "thai": "ภาคเรียนเริ่มด้วยการอ่านเยอะ"}
{"word": "semester", "english": "He’s taking a psychology class this semester.", "thai": "เขากำลังเรียนวิชาจิตวิทยาในภาคเรียนนี้"}
{"word": "semester", "english": "I’m working on my thesis this semester.", "thai": "ฉันกำลังทำงานวิทยานิพนธ์ในภาคเรียนนี้"}
{"word": "semester", "english": "She’s excited for the fall semester.", "thai": "เธอตื่นเต้นกับภาคเรียนฤดูใบไม้ร่วง"}
{"word": "semester", "english": "The semester has a lot of lab work.", "thai": "ภาคเรียนนี้มีงานปฏิบัติการเยอะ"}
{"word": "semester", "english": "I’m taking a sociology class this semester.", "thai": "ฉันกำลังเรียนวิชาสังคมวิทยาในภาคเรียนนี้"}
{"word": "semester", "english": "He’s taking a break next semester.", "thai": "เขาจะหยุดพักในภาคเรียนหน้า"}
{"word": "semester", "english": "The semester is challenging but fun.", "thai": "ภาคเรียนนี้ท้าทายแต่สนุก"}
{"word": "semester", "english": "She’s taking a music class this semester.", "thai": "เธอกำลังเรียนวิชาดนตรีในภาคเรียนนี้"}
{"word": "semester", "english": "I’m registering for classes next semester.", "thai": "ฉันกำลังลงทะเบียนวิชาเรียนสำหรับภาคเรียนหน้า"}
{"word": "semester", "english": "The semester has been really productive.", "thai": "ภาคเรียนนี้มีผลผลิตมาก"}
{"word": "semester", "english": "He’s taking an economics class this semester.", "thai": "เขากำลังเรียนวิชาเศรษฐศาสตร์ในภาคเรียนนี้"}
{"word": "semester", "english": "I’m working on a group project this semester.", "thai": "ฉันกำลังทำงานในโปรเจกต์กลุ่มในภาคเรียนนี้"}
{"word": "semester", "english": "She’s struggling with physics this semester.", "thai": "เธอกำลังมีปัญหากับวิชาฟิสิกส์ในภาคเรียนนี้"}
{"word": "semester", "english": "The semester ends with a research paper.", "thai": "ภาคเรียนสิ้นสุดด้วยเอกสารวิจัย"}
{"word": "semester", "english": "I’m taking a literature class this semester.", "thai": "ฉันกำลังเรียนวิชาวรรณคดีในภาคเรียนนี้"}
{"word": "semester", "english": "He’s joining a club this semester.", "thai": "เขากำลังเข้าร่วมชมรมในภาคเรียนนี้"}
{"word": "semester", "english": "The semester has been exhausting.", "thai": "ภาคเรียนนี้เหนื่อยมาก"}
{"word": "semester", "english": "She’s taking a chemistry class this semester.", "thai": "เธอกำลังเรียนวิชาเคมีในภาคเรียนนี้"}
{"word": "semester", "english": "I’m planning to graduate next semester.", "thai": "ฉันวางแผนจะจบการศึกษาในภาคเรียนหน้า"}
{"word": "semester", "english": "The semester started with a big exam.", "thai": "ภาคเรียนเริ่มด้วยการสอบครั้งใหญ่"}
{"word": "semester", "english": "He’s taking a history class this semester.", "thai": "เขากำลังเรียนวิชาประวัติศาสตร์ในภาคเรียนนี้"}
{"word": "semester", "english": "I’m volunteering at the library this semester.", "thai": "ฉันกำลังเป็นอาสาสมัครที่ห้องสมุดในภาคเรียนนี้"}
{"word": "semester", "english": "She’s taking a philosophy class this semester.", "thai": "เธอกำลังเรียนวิชาปรัชญาในภาคเรียนนี้"}
{"word": "semester", "english": "The semester has a lot of presentations.", "thai": "ภาคเรียนนี้มีการนำเสนอเยอะ"}
{"word": "semester", "english": "I’m taking a computer science class this semester.", "thai": "ฉันกำลังเรียนวิชาวิทยาการคอมพิวเตอร์ในภาคเรียนนี้"}
{"word": "semester", "english": "He’s struggling with biology this semester.", "thai": "เขากำลังมีปัญหากับวิชาชีววิทยาในภาคเรียนนี้"}
{"word": "semester", "english": "The semester is full of group projects.", "thai": "ภาคเรียนนี้เต็มไปด้วยโปรเจกต์กลุ่ม"}
{"word": "semester", "english": "She’s taking an art history class this semester.", "thai": "เธอกำลังเรียนวิชาประวัติศาสตร์ศิลปะในภาคเรียนนี้"}
{"word": "semester", "english": "I’m working on my degree this semester.", "thai": "ฉันกำลังเรียนเพื่อปริญญาในภาคเรียนนี้"}
{"word": "semester", "english": "The semester ends with a big party.", "thai": "ภาคเรียนสิ้นสุดด้วยงานปาร์ตี้ใหญ่"}
{"word": "semester", "english": "He’s taking a sociology class this semester.", "thai": "เขากำลังเรียนวิชาสังคมวิทยาในภาคเรียนนี้"}
{"word": "semester", "english": "I’m taking a break after this semester.", "thai": "ฉันจะหยุดพักหลังจากภาคเรียนนี้"}
{"word": "semester", "english": "She’s excited for the new semester schedule.", "thai": "เธอตื่นเต้นกับตารางภาคเรียนใหม่"}
{"word": "semester", "english": "The semester has been really challenging.", "thai": "ภาคเรียนนี้ท้าทายมาก"}
{"word": "semester", "english": "I’m taking a psychology class this semester.", "thai": "ฉันกำลังเรียนวิชาจิตวิทยาในภาคเรียนนี้"}
{"word": "semester", "english": "He’s working on a research project this semester.", "thai": "เขากำลังทำงานในโปรเจกต์วิจัยในภาคเรียนนี้"}
{"word": "semester", "english": "The semester started with a guest lecture.", "thai": "ภาคเรียนเริ่มด้วยการบรรยายจากวิทยากรรับเชิญ"}
{"word": "semester", "english": "She’s taking a physics class this semester.", "thai": "เธอกำลังเรียนวิชาฟิสิกส์ในภาคเรียนนี้"}
{"word": "semester", "english": "I’m joining a study abroad program next semester.", "thai": "ฉันจะเข้าร่วมโปรแกรมการเรียนต่อต่างประเทศในภาคเรียนหน้า"}
{"word": "semester", "english": "The semester has been really fun so far.", "thai": "ภาคเรียนนี้สนุกมากจนถึงตอนนี้"}
{"word": "semester", "english": "He’s taking a literature class this semester.", "thai": "เขากำลังเรียนวิชาวรรณคดีในภาคเรียนนี้"}
{"word": "semester", "english": "I’m working part-time at the library this semester.", "thai": "ฉันทำงานนอกเวลาที่ห้องสมุดในภาคเรียนนี้"}
{"word": "semester", "english": "She’s struggling with math this semester.", "thai": "เธอกำลังมีปัญหากับวิชาคณิตศาสตร์ในภาคเรียนนี้"}
{"word": "semester", "english": "The semester ends with a final project.", "thai": "ภาคเรียนสิ้นสุดด้วยโปรเจกต์สุดท้าย"}
{"word": "semester", "english": "I’m taking an economics class this semester.", "thai": "ฉันกำลังเรียนวิชาเศรษฐศาสตร์ในภาคเรียนนี้"}
{"word": "semester", "english": "He’s excited for the summer semester.", "thai": "เขาตื่นเต้นกับภาคเรียนฤดูร้อน"}
{"word": "semester", "english": "The semester has been full of exams.", "thai": "ภาคเรียนนี้เต็มไปด้วยการสอบ"}
{"word": "semester", "english": "She’s taking a coding class this semester.", "thai": "เธอกำลังเรียนวิชาการเขียนโค้ดในภาคเรียนนี้"}
{"word": "syllabus", "english": "The professor handed out the syllabus today.", "thai": "อาจารย์แจกหลักสูตรวันนี้"}
{"word": "syllabus", "english": "I need to check the syllabus for due dates.", "thai": "ฉันต้องตรวจสอบหลักสูตรเพื่อดูวันครบกำหนด"}
{"word": "syllabus", "english": "She’s reviewing the syllabus for her math class.", "thai": "เธอกำลังตรวจสอบหลักสูตรสำหรับวิชาคณิตศาสตร์"}
{"word": "syllabus", "english": "The syllabus lists all the required readings.", "thai": "หลักสูตรระบุหนังสือที่ต้องอ่านทั้งหมด"}
{"word": "syllabus", "english": "He forgot to bring the syllabus to class.", "thai": "เขาลืมนำหลักสูตรมาในชั้นเรียน"}
{"word": "syllabus", "english": "The syllabus says the exam is next week.", "thai": "หลักสูตรบอกว่าการสอบจะมีในสัปดาห์หน้า"}
{"word": "syllabus", "english": "I’m confused about the syllabus assignments.", "thai": "ฉันสับสนเกี่ยวกับงานที่มอบหมายในหลักสูตร"}
{"word": "syllabus", "english": "She’s updating the syllabus for the course.", "thai": "เธอกำลังอัปเดตหลักสูตรสำหรับวิชานี้"}
{"word": "syllabus", "english": "The syllabus is posted on the class website.", "thai": "หลักสูตรถูกโพสต์บนเว็บไซต์ของชั้นเรียน"}
{"word": "syllabus", "english": "He’s reading the syllabus for biology.", "thai": "เขากำลังอ่านหลักสูตรสำหรับวิชาชีววิทยา"}
{"word": "syllabus", "english": "The syllabus includes a group project.", "thai": "หลักสูตรรวมถึงโปรเจกต์กลุ่ม"}
{"word": "syllabus", "english": "I need to follow the syllabus for history.", "thai": "ฉันต้องปฏิบัติตามหลักสูตรสำหรับวิชาประวัติศาสตร์"}
{"word": "syllabus", "english": "She’s checking the syllabus for the exam date.", "thai": "เธอกำลังตรวจสอบหลักสูตรเพื่อดูวันสอบ"}
{"word": "syllabus", "english": "The syllabus outlines the grading policy.", "thai": "หลักสูตรระบุนโยบายการให้คะแนน"}
{"word": "syllabus", "english": "He’s discussing the syllabus with the professor.", "thai": "เขากำลังหารือเกี่ยวกับหลักสูตรกับอาจารย์"}
{"word": "syllabus", "english": "The syllabus has a lot of reading assignments.", "thai": "หลักสูตรมีงานอ่านเยอะ"}
{"word": "syllabus", "english": "I lost the syllabus for my English class.", "thai": "ฉันทำหลักสูตรวิชาภาษาอังกฤษหาย"}
{"word": "syllabus", "english": "She’s printing the syllabus for her students.", "thai": "เธอกำลังพิมพ์หลักสูตรให้กับนักศึกษา"}
{"word": "syllabus", "english": "The syllabus says we have a quiz tomorrow.", "thai": "หลักสูตรบอกว่าเราจะมีสอบย่อยพรุ่งนี้"}
{"word": "syllabus", "english": "He’s reviewing the syllabus for chemistry.", "thai": "เขากำลังตรวจสอบหลักสูตรสำหรับวิชาเคมี"}
{"word": "syllabus", "english": "The syllabus lists the course objectives.", "thai": "หลักสูตรระบุวัตถุประสงค์ของวิชา"}
{"word": "syllabus", "english": "I’m checking the syllabus for the textbook.", "thai": "ฉันกำลังตรวจสอบหลักสูตรเพื่อดูตำราเรียน"}
{"word": "syllabus", "english": "She’s confused about the syllabus schedule.", "thai": "เธอสับสนเกี่ยวกับตารางในหลักสูตร"}
{"word": "syllabus", "english": "The syllabus was updated last week.", "thai": "หลักสูตรได้รับการอัปเดตเมื่อสัปดาห์ที่แล้ว"}
{"word": "syllabus", "english": "He’s asking the professor about the syllabus.", "thai": "เขากำลังถามอาจารย์เกี่ยวกับหลักสูตร"}
{"word": "syllabus", "english": "The syllabus includes a final presentation.", "thai": "หลักสูตรรวมถึงการนำเสนอครั้งสุดท้าย"}
{"word": "syllabus", "english": "I need to read the syllabus for physics.", "thai": "ฉันต้องอ่านหลักสูตรสำหรับวิชาฟิสิกส์"}
{"word": "syllabus", "english": "She’s following the syllabus for literature.", "thai": "เธอกำลังปฏิบัติตามหลักสูตรสำหรับวิชาวรรณคดี"}
{"word": "syllabus", "english": "The syllabus has all the assignment details.", "thai": "หลักสูตรมีรายละเอียดงานที่มอบหมายทั้งหมด"}
{"word": "syllabus", "english": "He forgot the syllabus in his dorm.", "thai": "เขาลืมหลักสูตรไว้ในหอพัก"}
{"word": "syllabus", "english": "The syllabus says we need a textbook.", "thai": "หลักสูตรบอกว่าเราต้องการตำราเรียน"}
{"word": "syllabus", "english": "I’m reviewing the syllabus for the semester.", "thai": "ฉันกำลังตรวจสอบหลักสูตรสำหรับภาคเรียนนี้"}
{"word": "syllabus", "english": "She’s discussing the syllabus with her advisor.", "thai": "เธอกำลังหารือเกี่ยวกับหลักสูตรกับที่ปรึกษา"}
{"word": "syllabus", "english": "The syllabus lists the exam weights.", "thai": "หลักสูตรระบุน้ำหนักของการสอบ"}
{"word": "syllabus", "english": "He’s checking the syllabus for due dates.", "thai": "เขากำลังตรวจสอบหลักสูตรเพื่อดูวันครบกำหนด"}
{"word": "syllabus", "english": "The syllabus is available online.", "thai": "หลักสูตรมีให้ทางออนไลน์"}
{"word": "syllabus", "english": "I need to follow the syllabus for biology.", "thai": "ฉันต้องปฏิบัติตามหลักสูตรสำหรับวิชาชีววิทยา"}
{"word": "syllabus", "english": "She’s confused by the syllabus requirements.", "thai": "เธอสับสนกับข้อกำหนดในหลักสูตร"}
{"word": "syllabus", "english": "The syllabus was handed out in class.", "thai": "หลักสูตรถูกแจกในชั้นเรียน"}
{"word": "syllabus", "english": "He’s reviewing the syllabus for history.", "thai": "เขากำลังตรวจสอบหลักสูตรสำหรับวิชาประวัติศาสตร์"}
{"word": "syllabus", "english": "The syllabus includes weekly quizzes.", "thai": "หลักสูตรรวมถึงสอบย่อยทุกสัปดาห์"}
{"word": "syllabus", "english": "I’m checking the syllabus for the schedule.", "thai": "ฉันกำลังตรวจสอบหลักสูตรเพื่อดูตาราง"}
{"word": "syllabus", "english": "She’s updating the syllabus for her class.", "thai": "เธอกำลังอัปเดตหลักสูตรสำหรับชั้นเรียนของเธอ"}
{"word": "syllabus", "english": "The syllabus says we have a group project.", "thai": "หลักสูตรบอกว่าเราจะมีโปรเจกต์กลุ่ม"}
{"word": "syllabus", "english": "He’s asking about the syllabus in class.", "thai": "เขากำลังถามเกี่ยวกับหลักสูตรในชั้นเรียน"}
{"word": "syllabus", "english": "The syllabus outlines the course policies.", "thai": "หลักสูตรระบุนโยบายของวิชา"}
{"word": "syllabus", "english": "I lost the syllabus for my math class.", "thai": "ฉันทำหลักสูตรวิชาคณิตศาสตร์หาย"}
{"word": "syllabus", "english": "She’s reviewing the syllabus for English.", "thai": "เธอกำลังตรวจสอบหลักสูตรสำหรับวิชาภาษาอังกฤษ"}
{"word": "syllabus", "english": "The syllabus lists the required materials.", "thai": "หลักสูตรระบุวัสดุที่จำเป็น"}
{"word": "syllabus", "english": "He’s checking the syllabus for the exam.", "thai": "เขากำลังตรวจสอบหลักสูตรเพื่อดูการสอบ"}
{"word": "syllabus", "english": "The syllabus is posted on the portal.", "thai": "หลักสูตรถูกโพสต์บนพอร์ทัล"}
{"word": "syllabus", "english": "I’m following the syllabus for chemistry.", "thai": "ฉันกำลังปฏิบัติตามหลักสูตรสำหรับวิชาเคมี"}
{"word": "syllabus", "english": "She’s discussing the syllabus with her professor.", "thai": "เธอกำลังหารือเกี่ยวกับหลักสูตรกับอาจารย์"}
{"word": "syllabus", "english": "The syllabus includes a final exam.", "thai": "หลักสูตรรวมถึงการสอบปลายภาค"}
{"word": "syllabus", "english": "He’s reviewing the syllabus for physics.", "thai": "เขากำลังตรวจสอบหลักสูตรสำหรับวิชาฟิสิกส์"}
{"word": "syllabus", "english": "The syllabus says we need to read two books.", "thai": "หลักสูตรบอกว่าเราต้องอ่านหนังสือสองเล่ม"}
{"word": "syllabus", "english": "I’m checking the syllabus for assignments.", "thai": "ฉันกำลังตรวจสอบหลักสูตรเพื่อดูงานที่มอบหมาย"}
{"word": "syllabus", "english": "She’s confused about the syllabus deadlines.", "thai": "เธอสับสนเกี่ยวกับกำหนดส่งในหลักสูตร"}
{"word": "syllabus", "english": "The syllabus was updated this semester.", "thai": "หลักสูตรได้รับการอัปเดตในภาคเรียนนี้"}
{"word": "syllabus", "english": "He’s asking the professor about the syllabus.", "thai": "เขากำลังถามอาจารย์เกี่ยวกับหลักสูตร"}
{"word": "syllabus", "english": "The syllabus includes a research paper.", "thai": "หลักสูตรรวมถึงเอกสารวิจัย"}
{"word": "syllabus", "english": "I need to read the syllabus for literature.", "thai": "ฉันต้องอ่านหลักสูตรสำหรับวิชาวรรณคดี"}
{"word": "syllabus", "english": "She’s following the syllabus for sociology.", "thai": "เธอกำลังปฏิบัติตามหลักสูตรสำหรับวิชาสังคมวิทยา"}
{"word": "syllabus", "english": "The syllabus lists the lecture topics.", "thai": "หลักสูตรระบุหัวข้อการบรรยาย"}
{"word": "syllabus", "english": "He forgot the syllabus in his backpack.", "thai": "เขาลืมหลักสูตรไว้ในกระเป๋าเป้"}
{"word": "syllabus", "english": "The syllabus says we have a midterm.", "thai": "หลักสูตรบอกว่าเราจะมีสอบกลางภาค"}
{"word": "syllabus", "english": "I’m reviewing the syllabus for economics.", "thai": "ฉันกำลังตรวจสอบหลักสูตรสำหรับวิชาเศรษฐศาสตร์"}
{"word": "syllabus", "english": "She’s discussing the syllabus with her classmates.", "thai": "เธอกำลังหารือเกี่ยวกับหลักสูตรกับเพื่อนร่วมชั้น"}
{"word": "syllabus", "english": "The syllabus includes weekly assignments.", "thai": "หลักสูตรรวมถึงงานที่มอบหมายทุกสัปดาห์"}
{"word": "syllabus", "english": "He’s checking the syllabus for the textbook.", "thai": "เขากำลังตรวจสอบหลักสูตรเพื่อดูตำราเรียน"}
{"word": "syllabus", "english": "The syllabus is available on the class website.", "thai": "หลักสูตรมีให้บนเว็บไซต์ของชั้นเรียน"}
{"word": "syllabus", "english": "I’m following the syllabus for psychology.", "thai": "ฉันกำลังปฏิบัติตามหลักสูตรสำหรับวิชาจิตวิทยา"}
{"word": "syllabus", "english": "She’s confused by the syllabus requirements.", "thai": "เธอสับสนกับข้อกำหนดในหลักสูตร"}
{"word": "syllabus", "english": "The syllabus was handed out yesterday.", "thai": "หลักสูตรถูกแจกเมื่อวานนี้"}
{"word": "syllabus", "english": "He’s reviewing the syllabus for anthropology.", "thai": "เขากำลังตรวจสอบหลักสูตรสำหรับวิชามานุษยวิทยา"}
{"word": "syllabus", "english": "The syllabus includes a group presentation.", "thai": "หลักสูตรรวมถึงการนำเสนอกลุ่ม"}
{"word": "syllabus", "english": "I’m checking the syllabus for the exam schedule.", "thai": "ฉันกำลังตรวจสอบหลักสูตรเพื่อดูตารางสอบ"}
{"word": "syllabus", "english": "She’s updating the syllabus for her students.", "thai": "เธอกำลังอัปเดตหลักสูตรให้กับนักศึกษา"}
{"word": "syllabus", "english": "The syllabus says we have a final project.", "thai": "หลักสูตรบอกว่าเราจะมีโปรเจกต์สุดท้าย"}
{"word": "syllabus", "english": "He’s asking about the syllabus requirements.", "thai": "เขากำลังถามเกี่ยวกับข้อกำหนดในหลักสูตร"}
{"word": "syllabus", "english": "The syllabus outlines the course schedule.", "thai": "หลักสูตรระบุตารางของวิชา"}
{"word": "syllabus", "english": "I lost the syllabus for my history class.", "thai": "ฉันทำหลักสูตรวิชาประวัติศาสตร์หาย"}
{"word": "syllabus", "english": "She’s reviewing the syllabus for chemistry.", "thai": "เธอกำลังตรวจสอบหลักสูตรสำหรับวิชาเคมี"}
{"word": "syllabus", "english": "The syllabus lists the required textbooks.", "thai": "หลักสูตรระบุตำราเรียนที่จำเป็น"}
{"word": "syllabus", "english": "He’s checking the syllabus for the quiz dates.", "thai": "เขากำลังตรวจสอบหลักสูตรเพื่อดูวันสอบย่อย"}
{"word": "syllabus", "english": "The syllabus is posted online.", "thai": "หลักสูตรถูกโพสต์ออนไลน์"}
{"word": "syllabus", "english": "I’m following the syllabus for physics.", "thai": "ฉันกำลังปฏิบัติตามหลักสูตรสำหรับวิชาฟิสิกส์"}
{"word": "syllabus", "english": "She’s discussing the syllabus with her professor.", "thai": "เธอกำลังหารือเกี่ยวกับหลักสูตรกับอาจารย์"}
{"word": "syllabus", "english": "The syllabus includes a research assignment.", "thai": "หลักสูตรรวมถึงงานวิจัย"}
{"word": "syllabus", "english": "He’s reviewing the syllabus for literature.", "thai": "เขากำลังตรวจสอบหลักสูตรสำหรับวิชาวรรณคดี"}
{"word": "syllabus", "english": "The syllabus says we need to attend lectures.", "thai": "หลักสูตรบอกว่าเราต้องเข้าร่วมการบรรยาย"}
{"word": "syllabus", "english": "I’m checking the syllabus for the grading scale.", "thai": "ฉันกำลังตรวจสอบหลักสูตรเพื่อดูเกณฑ์การให้คะแนน"}
{"word": "syllabus", "english": "She’s confused about the syllabus policies.", "thai": "เธอสับสนเกี่ยวกับนโยบายในหลักสูตร"}
{"word": "syllabus", "english": "The syllabus was revised this semester.", "thai": "หลักสูตรได้รับการปรับปรุงในภาคเรียนนี้"}
{"word": "syllabus", "english": "He’s asking the professor about the syllabus changes.", "thai": "เขากำลังถามอาจารย์เกี่ยวกับการเปลี่ยนแปลงหลักสูตร"}
{"word": "syllabus", "english": "The syllabus includes a final essay.", "thai": "หลักสูตรรวมถึงเรียงความครั้งสุดท้าย"}
{"word": "syllabus", "english": "I need to read the syllabus for sociology.", "thai": "ฉันต้องอ่านหลักสูตรสำหรับวิชาสังคมวิทยา"}
