{"word": "hanger", "english": "I need a new hanger for my coat.", "thai": "ฉันต้องการที่แขวนเสื้อใหม่สำหรับโค้ทของฉัน"}
{"word": "hanger", "english": "Can you grab a hanger from the closet?", "thai": "ช่วยหยิบที่แขวนเสื้อจากตู้เสื้อผ้ามาให้หน่อยได้ไหม?"}
{"word": "hanger", "english": "This dress looks better on a hanger.", "thai": "ชุดนี้ดูดีกว่าตอนอยู่บนที่แขวนเสื้อ"}
{"word": "hanger", "english": "I broke another hanger trying to hang my jacket.", "thai": "ฉันทำที่แขวนเสื้อพังอีกอันตอนพยายามแขวนแจ็คเก็ต"}
{"word": "hanger", "english": "Where did I put that wooden hanger?", "thai": "ฉันวางที่แขวนเสื้อไม้ไวไหนนะ?"}
{"word": "hanger", "english": "The store ran out of plastic hangers.", "thai": "ร้านหมดที่แขวนเสื้อพลาสติกแล้ว"}
{"word": "hanger", "english": "I prefer using a padded hanger for delicate clothes.", "thai": "ฉันชอบใช้ที่แขวนเสื้อแบบบุนวมสำหรับเสื้อผ้าที่บอบบาง"}
{"word": "hanger", "english": "There’s a hanger tangled in the laundry.", "thai": "มีที่แขวนเสื้อติดอยู่ในกองซักผ้า"}
{"word": "hanger", "english": "I bought a set of velvet hangers for my wardrobe.", "thai": "ฉันซื้อที่แขวนเสื้อกำมะหยี่มาชุดหนึ่งสำหรับตู้เสื้อผ้า"}
{"word": "hanger", "english": "Can you pass me that hanger over there?", "thai": "ช่วยส่งที่แขวนเสื้ออันนั้นมาให้หน่อยได้ไหม?"}
{"word": "hanger", "english": "I don’t have enough hangers for all my shirts.", "thai": "ฉันมีที่แขวนเสื้อไม่พอสำหรับเสื้อเชิ้ตทั้งหมด"}
{"word": "hanger", "english": "The hanger snapped when I hung the heavy coat.", "thai": "ที่แขวนเสื้อหักตอนฉันแขวนโค้ทหนักๆ"}
{"word": "hanger", "english": "I found a hanger under the bed.", "thai": "ฉันเจอที่แขวนเสื้ออยู่ใต้เตียง"}
{"word": "hanger", "english": "This hanger is too small for my jacket.", "thai": "ที่แขวนเสื้ออันนี้เล็กเกินไปสำหรับแจ็คเก็ตของฉัน"}
{"word": "hanger", "english": "I need to organize my closet with better hangers.", "thai": "ฉันต้องจัดตู้เสื้อผ้าด้วยที่แขวนเสื้อที่ดีกว่านี้"}
{"word": "hanger", "english": "Why is there a hanger in the kitchen?", "thai": "ทำไมมีที่แขวนเสื้ออยู่ในครัว?"}
{"word": "hanger", "english": "I got a fancy hanger for my wedding dress.", "thai": "ฉันได้ที่แขวนเสื้อสวยๆ สำหรับชุดแต่งงาน"}
{"word": "hanger", "english": "The hanger left a mark on my sweater.", "thai": "ที่แขวนเสื้อทิ้งรอยไว้บนสเวตเตอร์ของฉัน"}
{"word": "hanger", "english": "I’ll hang this shirt on a hanger to dry.", "thai": "ฉันจะแขวนเสื้อตัวนี้บนที่แขวนเสื้อให้แห้ง"}
{"word": "hanger", "english": "Do we have any extra hangers in the house?", "thai": "เรามีที่แขวนเสื้อสำรองในบ้านไหม?"}
{"word": "hanger", "english": "This hanger is bent out of shape.", "thai": "ที่แขวนเสื้ออันนี้บิดเบี้ยวไปแล้ว"}
{"word": "hanger", "english": "I saw some nice hangers on sale today.", "thai": "วันนี้ฉันเห็นที่แขวนเสื้อสวยๆ ลดราคาอยู่"}
{"word": "hanger", "english": "The hanger keeps slipping off the rod.", "thai": "ที่แขวนเสื้อเลื่อนหลุดจากราวตลอด"}
{"word": "hanger", "english": "I need a sturdy hanger for my suit.", "thai": "ฉันต้องการที่แขวนเสื้อที่แข็งแรงสำหรับชุดสูท"}
{"word": "hanger", "english": "There’s a hanger stuck in the closet door.", "thai": "มีที่แขวนเสื้อติดอยู่ที่ประตูตู้เสื้อผ้า"}
{"word": "hanger", "english": "I’m tired of these cheap hangers breaking.", "thai": "ฉันเบื่อที่แขวนเสื้อราคาถูกที่พังง่ายๆ"}
{"word": "hanger", "english": "Can you buy some hangers when you’re out?", "thai": "ซื้อที่แขวนเสื้อมาบ้างได้ไหมตอนออกไปข้างนอก?"}
{"word": "hanger", "english": "I hung my scarf on a hanger by mistake.", "thai": "ฉันแขวนผ้าพันคอบนที่แขวนเสื้อโดยไม่ได้ตั้งใจ"}
{"word": "hanger", "english": "This hanger is perfect for my pants.", "thai": "ที่แขวนเสื้ออันนี้เหมาะกับกางเกงของฉัน"}
{"word": "hanger", "english": "I tripped over a hanger on the floor.", "thai": "ฉันสะดุดที่แขวนเสื้อที่อยู่บนพื้น"}
{"word": "hanger", "english": "The hanger scratched my new shirt.", "thai": "ที่แขวนเสื้อขูดเสื้อใหม่ของฉัน"}
{"word": "hanger", "english": "I need a hanger with clips for skirts.", "thai": "ฉันต้องการที่แขวนเสื้อที่มีคลิปสำหรับกระโปรง"}
{"word": "hanger", "english": "I organized my ties on a special hanger.", "thai": "ฉันจัดเนคไทไว้บนที่แขวนเสื้อพิเศษ"}
{"word": "hanger", "english": "The hanger is caught in the fabric.", "thai": "ที่แขวนเสื้อติดอยู่ในผ้า"}
{"word": "hanger", "english": "I’m donating some old hangers to charity.", "thai": "ฉันจะบริจาคที่แขวนเสื้อเก่าๆ ให้การกุศล"}
{"word": "hanger", "english": "This hanger doesn’t fit in the closet.", "thai": "ที่แขวนเสื้ออันนี้ไม่พอดีกับตู้เสื้อผ้า"}
{"word": "hanger", "english": "I found a hanger in the laundry basket.", "thai": "ฉันเจอที่แขวนเสื้อในตะกร้าซักผ้า"}
{"word": "hanger", "english": "The hanger is too wide for this shirt.", "thai": "ที่แขวนเสื้ออันนี้กว้างเกินไปสำหรับเสื้อตัวนี้"}
{"word": "hanger", "english": "I need a hanger for my evening gown.", "thai": "ฉันต้องการที่แขวนเสื้อสำหรับชุดราตรี"}
{"word": "hanger", "english": "Why are all the hangers mismatched?", "thai": "ทำไมที่แขวนเสื้อทั้งหมดไม่เข้ากันเลย?"}
{"word": "hanger", "english": "I broke the hanger trying to hang jeans.", "thai": "ฉันทำที่แขวนเสื้อพังตอนพยายามแขวนยีนส์"}
{"word": "hanger", "english": "The hanger is stuck on the closet rod.", "thai": "ที่แขวนเสื้อติดอยู่ที่ราวตู้เสื้อผ้า"}
{"word": "hanger", "english": "I need a hanger for my new blazer.", "thai": "ฉันต้องการที่แขวนเสื้อสำหรับเบลเซอร์ตัวใหม่"}
{"word": "hanger", "english": "This hanger has a weird shape.", "thai": "ที่แขวนเสื้ออันนี้มีรูปร่างแปลกๆ"}
{"word": "hanger", "english": "I left a hanger at the dry cleaner.", "thai": "ฉันลืมที่แขวนเสื้อไว้ที่ร้านซักแห้ง"}
{"word": "hanger", "english": "The hanger is too flimsy for this coat.", "thai": "ที่แขวนเสื้ออันนี้บางเกินไปสำหรับโค้ทตัวนี้"}
{"word": "hanger", "english": "I hung the shirt on a hanger outside.", "thai": "ฉันแขวนเสื้อบนที่แขวนเสื้อข้างนอก"}
{"word": "hanger", "english": "Can you lend me a hanger for my dress?", "thai": "ยืมที่แขวนเสื้อสำหรับชุดของฉันได้ไหม?"}
{"word": "hanger", "english": "The hanger fell behind the dresser.", "thai": "ที่แขวนเสื้อตกลงไปหลังตู้ลิ้นชัก"}
{"word": "hanger", "english": "I’m using a hanger to hang my hat.", "thai": "ฉันใช้ที่แขวนเสื้อแขวนหมวก"}
{"word": "hanger", "english": "This hanger is from the thrift store.", "thai": "ที่แขวนเสื้ออันนี้มาจากร้านมือสอง"}
{"word": "hanger", "english": "I need a hanger for my gym clothes.", "thai": "ฉันต้องการที่แขวนเสื้อสำหรับชุดออกกำลังกาย"}
{"word": "hanger", "english": "The hanger is too short for this robe.", "thai": "ที่แขวนเสื้ออันนี้สั้นเกินไปสำหรับเสื้อคลุมตัวนี้"}
{"word": "hanger", "english": "I found an old hanger in the attic.", "thai": "ฉันเจอที่แขวนเสื้อเก่าๆ ในห้องใต้หลังคา"}
{"word": "hanger", "english": "The hanger is making my shirt stretch.", "thai": "ที่แขวนเสื้อทำให้เสื้อของฉันยืด"}
{"word": "hanger", "english": "I’m hanging my coat on a strong hanger.", "thai": "ฉันกำลังแขวนโค้ทบนที่แขวนเสื้อที่แข็งแรง"}
{"word": "hanger", "english": "The hanger got caught in my sweater.", "thai": "ที่แขวนเสื้อติดอยู่ในสเวตเตอร์ของฉัน"}
{"word": "hanger", "english": "I need a hanger for my costume.", "thai": "ฉันต้องการที่แขวนเสื้อสำหรับชุดคอสตูม"}
{"word": "hanger", "english": "This hanger is from the hotel closet.", "thai": "ที่แขวนเสื้ออันนี้มาจากตู้เสื้อผ้าในโรงแรม"}
{"word": "hanger", "english": "I’m running out of hangers again.", "thai": "ฉันเริ่มไม่มีที่แขวนเสื้ออีกแล้ว"}
{"word": "hanger", "english": "The hanger is too heavy for the rod.", "thai": "ที่แขวนเสื้ออันนี้หนักเกินไปสำหรับราว"}
{"word": "hanger", "english": "I need a hanger for my raincoat.", "thai": "ฉันต้องการที่แขวนเสื้อสำหรับเสื้อกันฝน"}
{"word": "hanger", "english": "The hanger broke in the middle of the night.", "thai": "ที่แขวนเสื้อหักตอนกลางคืน"}
{"word": "hanger", "english": "I’m using a hanger to dry my scarf.", "thai": "ฉันใช้ที่แขวนเสื้อตากผ้าพันคอ"}
{"word": "hanger", "english": "The hanger is too big for this closet.", "thai": "ที่แขวนเสื้ออันนี้ใหญ่เกินไปสำหรับตู้เสื้อผ้า"}
{"word": "hanger", "english": "I found a hanger in the car.", "thai": "ฉันเจอที่แขวนเสื้อในรถ"}
{"word": "hanger", "english": "This hanger is perfect for my cardigan.", "thai": "ที่แขวนเสื้ออันนี้เหมาะกับคาร์ดิแกนของฉัน"}
{"word": "hanger", "english": "The hanger is stuck in the laundry machine.", "thai": "ที่แขวนเสื้อติดอยู่ในเครื่องซักผ้า"}
{"word": "hanger", "english": "I need a hanger for my new sweater.", "thai": "ฉันต้องการที่แขวนเสื้อสำหรับสเวตเตอร์ตัวใหม่"}
{"word": "hanger", "english": "The hanger is tangled with the others.", "thai": "ที่แขวนเสื้อพันกันกับอันอื่นๆ"}
{"word": "hanger", "english": "I’m buying hangers in bulk this time.", "thai": "คราวนี้ฉันจะซื้อที่แขวนเสื้อเป็นจำนวนมาก"}
{"word": "hanger", "english": "The hanger is too weak for this jacket.", "thai": "ที่แขวนเสื้ออันนี้บางเกินไปสำหรับแจ็คเก็ตตัวนี้"}
{"word": "hanger", "english": "I left a hanger at the tailor’s shop.", "thai": "ฉันลืมที่แขวนเสื้อไว้ที่ร้านตัดเสื้อ"}
{"word": "hanger", "english": "The hanger is scratched and rough.", "thai": "ที่แขวนเสื้อมีรอยขูดและหยาบ"}
{"word": "hanger", "english": "I need a hanger for my workout gear.", "thai": "ฉันต้องการที่แขวนเสื้อสำหรับชุดออกกำลังกาย"}
{"word": "hanger", "english": "The hanger fell off the rack.", "thai": "ที่แขวนเสื้อตกลงจากราว"}
{"word": "hanger", "english": "I’m using a hanger to hang my towel.", "thai": "ฉันใช้ที่แขวนเสื้อแขวนผ้าขนหนู"}
{"word": "hanger", "english": "The hanger is too narrow for this coat.", "thai": "ที่แขวนเสื้ออันนี้แคบเกินไปสำหรับโค้ทตัวนี้"}
{"word": "hanger", "english": "I found a hanger in the guest room.", "thai": "ฉันเจอที่แขวนเสื้อในห้องรับแขก"}
{"word": "hanger", "english": "The hanger is from an old suit.", "thai": "ที่แขวนเสื้ออันนี้มาจากชุดสูทเก่า"}
{"word": "hanger", "english": "I need a hanger for my denim jacket.", "thai": "ฉันต้องการที่แขวนเสื้อสำหรับแจ็คเก็ตยีนส์"}
{"word": "hanger", "english": "The hanger is slipping on the pole.", "thai": "ที่แขวนเสื้อเลื่อนไถลบนเสา"}
{"word": "hanger", "english": "I’m throwing out this broken hanger.", "thai": "ฉันจะทิ้งที่แขวนเสื้อที่พังอันนี้"}
{"word": "hanger", "english": "The hanger is too tall for the closet.", "thai": "ที่แขวนเสื้ออันนี้สูงเกินไปสำหรับตู้เสื้อผ้า"}
{"word": "hanger", "english": "I need a hanger for my silk shirt.", "thai": "ฉันต้องการที่แขวนเสื้อสำหรับเสื้อไหม"}
{"word": "hanger", "english": "The hanger is stuck in the drawer.", "thai": "ที่แขวนเสื้อติดอยู่ในลิ้นชัก"}
{"word": "hanger", "english": "I’m using a hanger to hang my belt.", "thai": "ฉันใช้ที่แขวนเสื้อแขวนเข็มขัด"}
{"word": "hanger", "english": "The hanger is from the department store.", "thai": "ที่แขวนเสื้ออันนี้มาจากห้างสรรพสินค้า"}
{"word": "hanger", "english": "I need a hanger for my winter coat.", "thai": "ฉันต้องการที่แขวนเสื้อสำหรับโค้ทฤดูหนาว"}
{"word": "hanger", "english": "The hanger is too old and rusty.", "thai": "ที่แขวนเสื้ออันนี้เก่าและขึ้นสนิม"}
{"word": "hanger", "english": "I’m hanging my shirt on a new hanger.", "thai": "ฉันกำลังแขวนเสื้อบนที่แขวนเสื้อใหม่"}
{"word": "hanger", "english": "The hanger is caught in the curtain.", "thai": "ที่แขวนเสื้อติดอยู่ในม่าน"}
{"word": "hanger", "english": "I need a hanger for my party dress.", "thai": "ฉันต้องการที่แขวนเสื้อสำหรับชุดไปงานเลี้ยง"}
{"word": "hanger", "english": "The hanger is too light for this coat.", "thai": "ที่แขวนเสื้ออันนี้เบาเกินไปสำหรับโค้ทตัวนี้"}
{"word": "hanger", "english": "I’m using a hanger to hang my apron.", "thai": "ฉันใช้ที่แขวนเสื้อแขวนผ้ากันเปื้อน"}
{"word": "hanger", "english": "The hanger is from my old apartment.", "thai": "ที่แขวนเสื้ออันนี้มาจากอพาร์ตเมนต์เก่าของฉัน"}
{"word": "hanger", "english": "I need a hanger for my leather jacket.", "thai": "ฉันต้องการที่แขวนเสื้อสำหรับแจ็คเก็ตหนัง"}
{"word": "hanger", "english": "The hanger is tangled in the clothesline.", "thai": "ที่แขวนเสื้อติดอยู่ในเชือกตากผ้า"}
{"word": "hanger", "english": "I’m getting rid of these old hangers.", "thai": "ฉันจะกำจัดที่แขวนเสื้อเก่าๆ เหล่านี้"}
{"word": "iron", "english": "I need to iron my shirt before the meeting.", "thai": "ฉันต้องรีดเสื้อก่อนการประชุม"}
{"word": "iron", "english": "Can you pass me the iron from the closet?", "thai": "ช่วยส่งเตารีดจากตู้มาให้หน่อยได้ไหม?"}
{"word": "iron", "english": "This iron is too heavy to use comfortably.", "thai": "เตารีดนี้หนักเกินไปที่จะใช้ได้สะดวก"}
{"word": "iron", "english": "I forgot to unplug the iron last night.", "thai": "ฉันลืมถอดปลั๊กเตารีดเมื่อคืน"}
{"word": "iron", "english": "The iron left a burn mark on my dress.", "thai": "เตารีดทิ้งรอยไหม้ไว้บนชุดของฉัน"}
{"word": "iron", "english": "I bought a new steam iron yesterday.", "thai": "ฉันซื้อเตารีดไอน้ำใหม่เมื่อวาน"}
{"word": "iron", "english": "Do we have an iron in the house?", "thai": "เรามีเตารีดในบ้านไหม?"}
{"word": "iron", "english": "This shirt needs a quick iron before I wear it.", "thai": "เสื้อตัวนี้ต้องรีดเร็วๆ ก่อนที่ฉันจะใส่"}
{"word": "iron", "english": "The iron isn’t heating up properly.", "thai": "เตารีดไม่ร้อนขึ้นอย่างที่ควร"}
{"word": "iron", "english": "I’ll iron the tablecloth for the dinner party.", "thai": "ฉันจะรีดผ้าปูโต๊ะสำหรับงานเลี้ยงอาหารค่ำ"}
{"word": "iron", "english": "Where’s the cord for this iron?", "thai": "สายไฟของเตารีดนี้อยู่ไหน?"}
{"word": "iron", "english": "I need to iron my pants for work.", "thai": "ฉันต้องรีดกางเกงสำหรับไปทำงาน"}
{"word": "iron", "english": "The iron is too hot for this fabric.", "thai": "เตารีดร้อนเกินไปสำหรับผ้าชนิดนี้"}
{"word": "iron", "english": "I found an old iron in the basement.", "thai": "ฉันเจอเตารีดเก่าในห้องใต้ดิน"}
{"word": "iron", "english": "Can you iron this skirt for me?", "thai": "ช่วยรีดกระโปรงตัวนี้ให้ฉันหน่อยได้ไหม?"}
{"word": "iron", "english": "The iron keeps sticking to the clothes.", "thai": "เตารีดติดกับเสื้อผ้าตลอด"}
{"word": "iron", "english": "I need a new iron; this one’s broken.", "thai": "ฉันต้องการเตารีดใหม่ อันนี้พังแล้ว"}
{"word": "iron", "english": "I’ll iron the curtains to make them look neat.", "thai": "ฉันจะรีดผ้าม่านให้ดูเรียบร้อย"}
{"word": "iron", "english": "The iron is leaking water everywhere.", "thai": "เตารีดรั่วน้ำไปทั่ว"}
{"word": "iron", "english": "I hate using this old iron.", "thai": "ฉันเกลียดการใช้เตารีดเก่านี้"}
{"word": "iron", "english": "I need to fill the iron with water.", "thai": "ฉันต้องเติมน้ำในเตารีด"}
{"word": "iron", "english": "The iron is making weird noises.", "thai": "เตารีดส่งเสียงแปลกๆ"}
{"word": "iron", "english": "I ironed my tie for the event.", "thai": "ฉันรีดเนคไทสำหรับงานนี้"}
{"word": "iron", "english": "This iron has a really short cord.", "thai": "เตารีดนี้มีสายสั้นมาก"}
{"word": "iron", "english": "I need to iron my uniform tonight.", "thai": "ฉันต้องรีดชุดยูนิฟอร์มคืนนี้"}
{"word": "iron", "english": "The iron scorched my favorite blouse.", "thai": "เตารีดเผาเสื้อตัวโปรดของฉัน"}
{"word": "iron", "english": "I’m looking for a lightweight iron.", "thai": "ฉันกำลังมองหาเตารีดน้ำหนักเบา"}
{"word": "iron", "english": "Can you iron these sheets for me?", "thai": "ช่วยรีดผ้าปูที่นอนให้ฉันหน่อยได้ไหม?"}
{"word": "iron", "english": "The iron isn’t working at all.", "thai": "เตารีดไม่ทำงานเลย"}
{"word": "iron", "english": "I’ll iron my jacket for the interview.", "thai": "ฉันจะรีดแจ็คเก็ตสำหรับการสัมภาษณ์"}
{"word": "iron", "english": "The iron is too old to use safely.", "thai": "เตารีดนี้เก่าเกินไปที่จะใช้ได้อย่างปลอดภัย"}
{"word": "iron", "english": "I need to iron this dress for the party.", "thai": "ฉันต้องรีดชุดนี้สำหรับงานปาร์ตี้"}
{"word": "iron", "english": "The iron is still hot, be careful!", "thai": "เตารีดยังร้อนอยู่ ระวังด้วย!"}
{"word": "iron", "english": "I ironed all the clothes this morning.", "thai": "ฉันรีดเสื้อผ้าทั้งหมดเมื่อเช้า"}
{"word": "iron", "english": "This iron has a great steam feature.", "thai": "เตารีดนี้มีฟังก์ชันไอน้ำที่ดีมาก"}
{"word": "iron", "english": "I left the iron on by mistake.", "thai": "ฉันลืมปิดเตารีดโดยไม่ได้ตั้งใจ"}
{"word": "iron", "english": "I need to buy an iron for the new apartment.", "thai": "ฉันต้องซื้อเตารีดสำหรับอพาร์ตเมนต์ใหม่"}
{"word": "iron", "english": "The iron is making my clothes shiny.", "thai": "เตารีดทำให้เสื้อผ้าของฉันมันวาว"}
{"word": "iron", "english": "I ironed the napkins for the dinner.", "thai": "ฉันรีดผ้าเช็ดปากสำหรับมื้อค่ำ"}
{"word": "iron", "english": "The iron is too cold for this fabric.", "thai": "เตารีดเย็นเกินไปสำหรับผ้าชนิดนี้"}
{"word": "iron", "english": "I found an iron in the laundry room.", "thai": "ฉันเจอเตารีดในห้องซักผ้า"}
{"word": "iron", "english": "The iron cord is all tangled up.", "thai": "สายเตารีดพันกันยุ่งเหยิง"}
{"word": "iron", "english": "I need to iron my scarf before wearing it.", "thai": "ฉันต้องรีดผ้าพันคอก่อนใส่"}
{"word": "iron", "english": "This iron is really hard to clean.", "thai": "เตารีดนี้ทำความสะอาดยากมาก"}
{"word": "iron", "english": "I ironed my shirt, but it’s still wrinkled.", "thai": "ฉันรีดเสื้อแล้ว แต่ยังยับอยู่"}
{"word": "iron", "english": "The iron is on sale at the store.", "thai": "เตารีดกำลังลดราคาที่ร้าน"}
{"word": "iron", "english": "I need an iron for my sewing project.", "thai": "ฉันต้องการเตารีดสำหรับโปรเจกต์เย็บผ้า"}
{"word": "iron", "english": "The iron is too big for small clothes.", "thai": "เตารีดนี้ใหญ่เกินไปสำหรับเสื้อผ้าชิ้นเล็ก"}
{"word": "iron", "english": "I’m using the iron to press my jeans.", "thai": "ฉันใช้เตารีดรีดยีนส์"}
{"word": "iron", "english": "The iron stopped working after a week.", "thai": "เตารีดหยุดทำงานหลังจากหนึ่งสัปดาห์"}
{"word": "iron", "english": "I need to iron my costume for the play.", "thai": "ฉันต้องรีดชุดสำหรับการแสดง"}
{"word": "iron", "english": "The iron is leaving marks on my clothes.", "thai": "เตารีดทิ้งรอยไว้บนเสื้อผ้าของฉัน"}
{"word": "iron", "english": "I ironed the pillowcases yesterday.", "thai": "ฉันรีดปลอกหมอนเมื่อวาน"}
{"word": "iron", "english": "This iron is perfect for delicate fabrics.", "thai": "เตารีดนี้เหมาะสำหรับผ้าบอบบาง"}
{"word": "iron", "english": "I need to iron my suit for the wedding.", "thai": "ฉันต้องรีดสูทสำหรับงานแต่งงาน"}
{"word": "iron", "english": "The iron is too expensive for me.", "thai": "เตารีดนี้แพงเกินไปสำหรับฉัน"}
{"word": "iron", "english": "I’m borrowing your iron for the weekend.", "thai": "ฉันจะยืมเตารีดของเธอสำหรับสุดสัปดาห์"}
{"word": "iron", "english": "The iron is making a hissing sound.", "thai": "เตารีดส่งเสียงดังฟู่"}
{"word": "iron", "english": "I need to iron my blouse for tomorrow.", "thai": "ฉันต้องรีดเสื้อสำหรับพรุ่งนี้"}
{"word": "iron", "english": "The iron is too heavy for long use.", "thai": "เตารีดนี้หนักเกินไปสำหรับการใช้งานนานๆ"}
{"word": "iron", "english": "I ironed the kids’ uniforms this morning.", "thai": "ฉันรีดชุดยูนิฟอร์มของเด็กๆ เมื่อเช้า"}
{"word": "iron", "english": "The iron is brand new and works great.", "thai": "เตารีดนี้ใหม่เอี่ยมและใช้งานได้ดี"}
{"word": "iron", "english": "I need to iron my apron for work.", "thai": "ฉันต้องรีดผ้ากันเปื้อนสำหรับทำงาน"}
{"word": "iron", "english": "The iron is stuck on the highest setting.", "thai": "เตารีดติดอยู่ที่การตั้งค่าความร้อนสูงสุด"}
{"word": "iron", "english": "I ironed the dress, but it’s still creased.", "thai": "ฉันรีดชุดแล้ว แต่ยังมีรอยยับ"}
{"word": "iron", "english": "The iron is too small for big items.", "thai": "เตารีดนี้เล็กเกินไปสำหรับของชิ้นใหญ่"}
{"word": "iron", "english": "I need to iron my cardigan tonight.", "thai": "ฉันต้องรีดคาร์ดิแกนคืนนี้"}
{"word": "iron", "english": "The iron is from the thrift store.", "thai": "เตารีดนี้มาจากร้านมือสอง"}
{"word": "iron", "english": "I’m using the iron to press a patch.", "thai": "ฉันใช้เตารีดรีดแพทช์"}
{"word": "iron", "english": "The iron is getting rusty on the bottom.", "thai": "เตารีดเริ่มขึ้นสนิมที่ด้านล่าง"}
{"word": "iron", "english": "I need to iron my shirt for the date.", "thai": "ฉันต้องรีดเสื้อสำหรับเดท"}
{"word": "iron", "english": "The iron is too loud when steaming.", "thai": "เตารีดดังเกินไปตอนปล่อยไอน้ำ"}
{"word": "iron", "english": "I ironed the table runner for the party.", "thai": "ฉันรีดผ้าปูโต๊ะสำหรับงานปาร์ตี้"}
{"word": "iron", "english": "The iron is overheating too quickly.", "thai": "เตารีดร้อนเกินไปเร็วเกิน"}
{"word": "iron", "english": "I need to iron my vest for the event.", "thai": "ฉันต้องรีดเสื้อกั๊กสำหรับงาน"}
{"word": "iron", "english": "The iron is leaving water spots.", "thai": "เตารีดทิ้งรอยน้ำไว้"}
{"word": "iron", "english": "I ironed all the napkins for the wedding.", "thai": "ฉันรีดผ้าเช็ดปากทั้งหมดสำหรับงานแต่งงาน"}
{"word": "iron", "english": "The iron is too complicated to use.", "thai": "เตารีดนี้ใช้งานซับซ้อนเกินไป"}
{"word": "iron", "english": "I need to iron my robe for tomorrow.", "thai": "ฉันต้องรีดเสื้อคลุมสำหรับพรุ่งนี้"}
{"word": "iron", "english": "The iron is from my old apartment.", "thai": "เตารีดนี้มาจากอพาร์ตเมนต์เก่าของฉัน"}
{"word": "iron", "english": "I’m using the iron to press my scarf.", "thai": "ฉันใช้เตารีดรีดผ้าพันคอ"}
{"word": "iron", "english": "The iron is too slow to heat up.", "thai": "เตารีดร้อนช้าเกินไป"}
{"word": "iron", "english": "I need to iron my jacket for the trip.", "thai": "ฉันต้องรีดแจ็คเก็ตสำหรับการเดินทาง"}
{"word": "iron", "english": "The iron is making my clothes smell weird.", "thai": "เตารีดทำให้เสื้อผ้าของฉันมีกลิ่นแปลกๆ"}
{"word": "iron", "english": "I ironed the kids’ clothes for school.", "thai": "ฉันรีดเสื้อผ้าของเด็กๆ สำหรับโรงเรียน"}
{"word": "iron", "english": "The iron is too bulky to store.", "thai": "เตารีดนี้เทอะทะเกินไปที่จะเก็บ"}
{"word": "iron", "english": "I need to iron my dress for the gala.", "thai": "ฉันต้องรีดชุดสำหรับงานกาล่า"}
{"word": "iron", "english": "The iron is dripping water on my shirt.", "thai": "เตารีดหยดน้ำลงบนเสื้อของฉัน"}
{"word": "iron", "english": "I’m borrowing an iron from my neighbor.", "thai": "ฉันกำลังยืมเตารีดจากเพื่อนบ้าน"}
{"word": "iron", "english": "The iron is too light to press well.", "thai": "เตารีดนี้เบาเกินไปที่จะรีดได้ดี"}
{"word": "iron", "english": "I need to iron my shirt for the photo.", "thai": "ฉันต้องรีดเสื้อสำหรับถ่ายรูป"}
{"word": "iron", "english": "The iron is from the hotel laundry.", "thai": "เตารีดนี้มาจากห้องซักรีดของโรงแรม"}
{"word": "iron", "english": "I ironed the costume for the kids’ play.", "thai": "ฉันรีดชุดสำหรับการแสดงของเด็กๆ"}
{"word": "iron", "english": "The iron is too old to steam properly.", "thai": "เตารีดนี้เก่าเกินไปที่จะปล่อยไอน้ำได้ดี"}
{"word": "iron", "english": "I need to iron my blazer for the meeting.", "thai": "ฉันต้องรีดเบลเซอร์สำหรับการประชุม"}
{"word": "iron", "english": "The iron is making a funny smell.", "thai": "เตารีดส่งกลิ่นแปลกๆ"}
{"word": "iron", "english": "I’m using the iron to press my tie.", "thai": "ฉันใช้เตารีดรีดเนคไท"}
{"word": "iron", "english": "The iron is too heavy for my wrist.", "thai": "เตารีดนี้หนักเกินไปสำหรับข้อมือของฉัน"}
{"word": "iron", "english": "I need to iron my clothes for the week.", "thai": "ฉันต้องรีดเสื้อผ้าสำหรับทั้งสัปดาห์"}
{"word": "iron", "english": "The iron is perfect for quick touch-ups.", "thai": "เตารีดนี้เหมาะสำหรับการรีดแบบเร็วๆ"}
{"word": "ironing board", "english": "I need to set up the ironing board for my clothes.", "thai": "ฉันต้องตั้งโต๊ะรีดผ้าสำหรับรีดเสื้อผ้า"}
{"word": "ironing board", "english": "Can you help me fold the ironing board?", "thai": "ช่วยฉันพับโต๊ะรีดผ้าได้ไหม?"}
{"word": "ironing board", "english": "The ironing board is wobbly and needs fixing.", "thai": "โต๊ะรีดผ้าโยกเยกและต้องซ่อม"}
{"word": "ironing board", "english": "I left the iron on the ironing board.", "thai": "ฉันลืมเตารีดไว้บนโต๊ะรีดผ้า"}
{"word": "ironing board", "english": "Where did I put the ironing board?", "thai": "ฉันวางโต๊ะรีดผ้าไว้ไหนนะ?"}
{"word": "ironing board", "english": "The ironing board is too short for me.", "thai": "โต๊ะรีดผ้าสั้นเกินไปสำหรับฉัน"}
{"word": "ironing board", "english": "I bought a new ironing board yesterday.", "thai": "ฉันซื้อโต๊ะรีดผ้าใหม่เมื่อวาน"}
{"word": "ironing board", "english": "The ironing board is taking up too much space.", "thai": "โต๊ะรีดผ้าใช้พื้นที่มากเกินไป"}
{"word": "ironing board", "english": "I need a cover for the ironing board.", "thai": "ฉันต้องการผ้าคลุมสำหรับโต๊ะรีดผ้า"}
{"word": "ironing board", "english": "The ironing board is stuck and won’t fold.", "thai": "โต๊ะรีดผ้าติดและพับไม่ได้"}
{"word": "ironing board", "english": "I spilled water on the ironing board.", "thai": "ฉันทำน้ำหกใส่โต๊ะรีดผ้า"}
{"word": "ironing board", "english": "Can you move the ironing board to the laundry room?", "thai": "ช่วยย้ายโต๊ะรีดผ้าไปที่ห้องซักผ้าได้ไหม?"}
{"word": "ironing board", "english": "The ironing board is too heavy to carry.", "thai": "โต๊ะรีดผ้าหนักเกินไปที่จะยก"}
{"word": "ironing board", "english": "I found an old ironing board in the garage.", "thai": "ฉันเจอโต๊ะรีดผ้าเก่าในโรงรถ"}
{"word": "ironing board", "english": "The ironing board’s legs are rusty.", "thai": "ขาของโต๊ะรีดผ้าขึ้นสนิม"}
{"word": "ironing board", "english": "I need a taller ironing board for comfort.", "thai": "ฉันต้องการโต๊ะรีดผ้าที่สูงกว่านี้เพื่อความสะดวก"}
{"word": "ironing board", "english": "The ironing board is scratched up.", "thai": "โต๊ะรีดผ้ามีรอยขีดข่วน"}
{"word": "ironing board", "english": "I’m setting up the ironing board in the bedroom.", "thai": "ฉันกำลังตั้งโต๊ะรีดผ้าในห้องนอน"}
{"word": "ironing board", "english": "The ironing board cover is torn.", "thai": "ผ้าคลุมโต๊ะรีดผ้าขาด"}
{"word": "ironing board", "english": "I tripped over the ironing board in the hallway.", "thai": "ฉันสะดุดโต๊ะรีดผ้าในโถงทางเดิน"}
{"word": "ironing board", "english": "The ironing board is too small for this blanket.", "thai": "โต๊ะรีดผ้าเล็กเกินไปสำหรับผ้าห่มนี้"}
{"word": "ironing board", "english": "I need to clean the ironing board before using it.", "thai": "ฉันต้องทำความสะอาดโต๊ะรีดผ้าก่อนใช้งาน"}
{"word": "ironing board", "english": "The ironing board is leaning against the wall.", "thai": "โต๊ะรีดผ้าพิงอยู่กับผนัง"}
{"word": "ironing board", "english": "I got a folding ironing board for the apartment.", "thai": "ฉันซื้อโต๊ะรีดผ้าแบบพับได้สำหรับอพาร์ตเมนต์"}
{"word": "ironing board", "english": "The ironing board is from the thrift store.", "thai": "โต๊ะรีดผ้ามาจากร้านมือสอง"}
{"word": "ironing board", "english": "I need to adjust the height of the ironing board.", "thai": "ฉันต้องปรับความสูงของโต๊ะรีดผ้า"}
{"word": "ironing board", "english": "The ironing board is brand new.", "thai": "โต๊ะรีดผ้าใหม่เอี่ยม"}
{"word": "ironing board", "english": "I left my shirt on the ironing board.", "thai": "ฉันวางเสื้อไว้บนโต๊ะรีดผ้า"}
{"word": "ironing board", "english": "The ironing board is too wide for this room.", "thai": "โต๊ะรีดผ้ากว้างเกินไปสำหรับห้องนี้"}
{"word": "ironing board", "english": "I’m borrowing your ironing board for the weekend.", "thai": "ฉันจะยืมโต๊ะรีดผ้าของคุณสำหรับสุดสัปดาห์"}
{"word": "ironing board", "english": "The ironing board is making a creaking noise.", "thai": "โต๊ะรีดผ้าส่งเสียงดังเอี๊ยด"}
{"word": "ironing board", "english": "I need an ironing board for my new place.", "thai": "ฉันต้องการโต๊ะรีดผ้าสำหรับบ้านใหม่"}
{"word": "ironing board", "english": "The ironing board is too flimsy.", "thai": "โต๊ะรีดผ้าบางเกินไป"}
{"word": "ironing board", "english": "I set up the ironing board in the living room.", "thai": "ฉันตั้งโต๊ะรีดผ้าในห้องนั่งเล่น"}
{"word": "ironing board", "english": "The ironing board is missing a leg.", "thai": "โต๊ะรีдผ้าขาดขาไปหนึ่งข้าง"}
{"word": "ironing board", "english": "I need to replace the ironing board cover.", "thai": "ฉันต้องเปลี่ยนผ้าคลุมโต๊ะรีдผ้า"}
{"word": "ironing board", "english": "The ironing board is too old to use.", "thai": "โต๊ะรีдผ้าเก่าเกินไปที่จะใช้"}
{"word": "ironing board", "english": "I’m storing the ironing board in the closet.", "thai": "ฉันเก็บโต๊ะรีдผ้าไว้ในตู้"}
{"word": "ironing board", "english": "The ironing board is covered in stains.", "thai": "โต๊ะรีдผ้ามีคราบเปื้อน"}
{"word": "ironing board", "english": "I need a portable ironing board for travel.", "thai": "ฉันต้องการโต๊ะรีдผ้าแบบพกพาสำหรับเดินทาง"}
{"word": "ironing board", "english": "The ironing board is in the laundry basket.", "thai": "โต๊ะรีдผ้าอยู่ในตะกร้าซักผ้า"}
{"word": "ironing board", "english": "I broke the ironing board while moving it.", "thai": "ฉันทำโต๊ะรีдผ้าพังตอนย้าย"}
{"word": "ironing board", "english": "The ironing board is too narrow for this sheet.", "thai": "โต๊ะรีдผ้าแคบเกินไปสำหรับผ้าปูนี้"}
{"word": "ironing board", "english": "I found an ironing board at the flea market.", "thai": "ฉันเจอโต๊ะรีдผ้าที่ตลาดนัด"}
{"word": "ironing board", "english": "The ironing board is leaning in the corner.", "thai": "โต๊ะรีдผ้าพิงอยู่ในมุม"}
{"word": "ironing board", "english": "I need to buy an ironing board this weekend.", "thai": "ฉันต้องซื้อโต๊ะรีдผ้าสุดสัปดาห์นี้"}
{"word": "ironing board", "english": "The ironing board is too tall for me.", "thai": "โต๊ะรีдผ้าสูงเกินไปสำหรับฉัน"}
{"word": "ironing board", "english": "I’m using the ironing board to press my dress.", "thai": "ฉันใช้โต๊ะรีдผ้ารีดชุด"}
{"word": "ironing board", "english": "The ironing board is from my old house.", "thai": "โต๊ะรีдผ้ามาจากบ้านเก่าของฉัน"}
{"word": "ironing board", "english": "I need a sturdy ironing board for heavy fabrics.", "thai": "ฉันต้องการโต๊ะรีдผ้าที่แข็งแรงสำหรับผ้าหนา"}
{"word": "ironing board", "english": "The ironing board is in the guest room.", "thai": "โต๊ะรีдผ้าอยู่ในห้องรับแขก"}
{"word": "ironing board", "english": "I’m cleaning the ironing board today.", "thai": "ฉันกำลังทำความสะอาดโต๊ะรีдผ้าวันนี้"}
{"word": "ironing board", "english": "The ironing board is too big for this closet.", "thai": "โต๊ะรีдผ้าใหญ่เกินไปสำหรับตู้ใบนี้"}
{"word": "ironing board", "english": "I need an ironing board for my sewing project.", "thai": "ฉันต้องการโต๊ะรีдผ้าสำหรับโปรเจกต์เย็บผ้า"}
{"word": "ironing board", "english": "The ironing board is making my back hurt.", "thai": "โต๊ะรีдผ้าทำให้ฉันปวดหลัง"}
{"word": "ironing board", "english": "I left the ironing board out overnight.", "thai": "ฉันทิ้งโต๊ะรีдผ้าไว้นอกบ้านทั้งคืน"}
{"word": "ironing board", "english": "The ironing board is perfect for small spaces.", "thai": "โต๊ะรีдผ้าเหมาะสำหรับพื้นที่เล็กๆ"}
{"word": "ironing board", "english": "I need to fix the ironing board’s legs.", "thai": "ฉันต้องซ่อมขาของโต๊ะรีдผ้า"}
{"word": "ironing board", "english": "The ironing board is from the 90s.", "thai": "โต๊ะรีдผ้ามาจากยุค 90"}
{"word": "ironing board", "english": "I’m using the ironing board to iron my shirt.", "thai": "ฉันใช้โต๊ะรีдผ้ารีดเสื้อ"}
{"word": "ironing board", "english": "The ironing board is too light and tips over.", "thai": "โต๊ะรีдผ้าเบาเกินไปและล้มง่าย"}
{"word": "ironing board", "english": "I need an ironing board for my new apartment.", "thai": "ฉันต้องการโต๊ะรีдผ้าสำหรับอพาร์ตเมนต์ใหม่"}
{"word": "ironing board", "english": "The ironing board is covered in dust.", "thai": "โต๊ะรีдผ้าเต็มไปด้วยฝุ่น"}
{"word": "ironing board", "english": "I’m setting up the ironing board in the kitchen.", "thai": "ฉันกำลังตั้งโต๊ะรีдผ้าในครัว"}
{"word": "ironing board", "english": "The ironing board is too wide for this space.", "thai": "โต๊ะรีдผ้ากว้างเกินไปสำหรับพื้นที่นี้"}
{"word": "ironing board", "english": "I need a new ironing board cover.", "thai": "ฉันต้องการผ้าคลุมโต๊ะรีдผ้าใหม่"}
{"word": "ironing board", "english": "The ironing board is from my parents’ house.", "thai": "โต๊ะรีдผ้ามาจากบ้านพ่อแม่"}
{"word": "ironing board", "english": "I’m using the ironing board for my crafts.", "thai": "ฉันใช้โต๊ะรีдผ้าสำหรับงานฝีมือ"}
{"word": "ironing board", "english": "The ironing board is stuck in the open position.", "thai": "โต๊ะรีдผ้าติดอยู่ในท่าที่กางออก"}
{"word": "ironing board", "english": "I need an ironing board for my uniform.", "thai": "ฉันต้องการโต๊ะรีдผ้าสำหรับชุดยูนิฟอร์ม"}
{"word": "ironing board", "english": "The ironing board is too short for tall people.", "thai": "โต๊ะรีдผ้าสั้นเกินไปสำหรับคนสูง"}
{"word": "ironing board", "english": "I’m moving the ironing board to the basement.", "thai": "ฉันกำลังย้ายโต๊ะรีдผ้าไปที่ห้องใต้ดิน"}
{"word": "ironing board", "english": "The ironing board is really hard to open.", "thai": "โต๊ะรีдผ้าเปิดยากมาก"}
{"word": "ironing board", "english": "I need an ironing board for my suit.", "thai": "ฉันต้องการโต๊ะรีдผ้าสำหรับสูท"}
{"word": "ironing board", "english": "The ironing board is from a garage sale.", "thai": "โต๊ะรีдผ้ามาจากการขายของในโรงรถ"}
{"word": "ironing board", "english": "I’m using the ironing board to press my jeans.", "thai": "ฉันใช้โต๊ะรีдผ้ารีดยีนส์"}
{"word": "ironing board", "english": "The ironing board is too heavy to move.", "thai": "โต๊ะรีдผ้าหนักเกินไปที่จะย้าย"}
{"word": "ironing board", "english": "I need an ironing board for my dress.", "thai": "ฉันต้องการโต๊ะรีдผ้าสำหรับชุด"}
{"word": "ironing board", "english": "The ironing board is making my floor dirty.", "thai": "โต๊ะรีдผ้าทำให้พื้นของฉันสกปรก"}
{"word": "ironing board", "english": "I’m storing the ironing board under the bed.", "thai": "ฉันเก็บโต๊ะรีдผ้าไว้ใต้เตียง"}
{"word": "ironing board", "english": "The ironing board is too bulky for this room.", "thai": "โต๊ะรีдผ้าเทอะทะเกินไปสำหรับห้องนี้"}
{"word": "ironing board", "english": "I need an ironing board for my tablecloth.", "thai": "ฉันต้องการโต๊ะรีдผ้าสำหรับผ้าปูโต๊ะ"}
{"word": "ironing board", "english": "The ironing board is from the hotel.", "thai": "โต๊ะรีдผ้ามาจากโรงแรม"}
{"word": "ironing board", "english": "I’m using the ironing board to iron my scarf.", "thai": "ฉันใช้โต๊ะรีдผ้ารีดผ้าพันคอ"}
{"word": "ironing board", "english": "The ironing board is too old and creaky.", "thai": "โต๊ะรีдผ้าเก่าและมีเสียงดังเอี๊ยด"}
{"word": "ironing board", "english": "I need an ironing board for my costume.", "thai": "ฉันต้องการโต๊ะรีдผ้าสำหรับชุดคอสตูม"}
{"word": "ironing board", "english": "The ironing board is in the way.", "thai": "โต๊ะรีдผ้าขวางทางอยู่"}
{"word": "ironing board", "english": "I’m setting up the ironing board for my shirt.", "thai": "ฉันกำลังตั้งโต๊ะรีдผ้าสำหรับรีดเสื้อ"}
{"word": "ironing board", "english": "The ironing board is too light and unstable.", "thai": "โต๊ะรีдผ้าเบาเกินไปและไม่มั่นคง"}
{"word": "ironing board", "english": "I need an ironing board for my new job.", "thai": "ฉันต้องการโต๊ะรีдผ้าสำหรับงานใหม่"}
{"word": "ironing board", "english": "The ironing board is from my grandma’s house.", "thai": "โต๊ะรีдผ้ามาจากบ้านย่า"}
{"word": "ironing board", "english": "I’m using the ironing board to press my tie.", "thai": "ฉันใช้โต๊ะรีдผ้ารีดเนคไท"}
{"word": "ironing board", "english": "The ironing board is too narrow for this blanket.", "thai": "โต๊ะรีдผ้าแคบเกินไปสำหรับผ้าห่มนี้"}
{"word": "ironing board", "english": "I need an ironing board for my curtains.", "thai": "ฉันต้องการโต๊ะรีдผ้าสำหรับผ้าม่าน"}
{"word": "ironing board", "english": "The ironing board is stuck in the closet.", "thai": "โต๊ะรีдผ้าติดอยู่ในตู้"}
{"word": "ironing board", "english": "I’m moving the ironing board to the attic.", "thai": "ฉันกำลังย้ายโต๊ะรีдผ้าไปที่ห้องใต้หลังคา"}
{"word": "ironing board", "english": "The ironing board is perfect for my small apartment.", "thai": "โต๊ะรีдผ้าเหมาะกับอพาร์ตเมนต์เล็กๆ ของฉัน"}
{"word": "ironing board", "english": "I need an ironing board for my sewing room.", "thai": "ฉันต้องการโต๊ะรีдผ้าสำหรับห้องเย็บผ้า"}
{"word": "ironing board", "english": "The ironing board is too expensive for me.", "thai": "โต๊ะรีдผ้าแพงเกินไปสำหรับฉัน"}
{"word": "pen", "english": "I need a pen to write this note.", "thai": "ฉันต้องการปากกาเพื่อเขียนโน้ตนี้"}
{"word": "pen", "english": "Can you lend me a pen for the test?", "thai": "ยืมปากกาให้ฉันสำหรับสอบหน่อยได้ไหม?"}
{"word": "pen", "english": "I lost my favorite pen at school.", "thai": "ฉันทำปากกาตัวโปรดหายที่โรงเรียน"}
{"word": "pen", "english": "This pen is out of ink already.", "thai": "ปากกานี้หมึกหมดแล้ว"}
{"word": "pen", "english": "I found a pen under the couch.", "thai": "ฉันเจอปากกาอยู่ใต้โซฟา"}
{"word": "pen", "english": "Do you have a spare pen I can use?", "thai": "คุณมีปากกาสำรองให้ฉันใช้ได้ไหม?"}
{"word": "pen", "english": "I bought a fancy pen for signing documents.", "thai": "ฉันซื้อปากกาสวยๆ สำหรับเซ็นเอกสาร"}
{"word": "pen", "english": "The pen is leaking ink all over my hand.", "thai": "ปากกานี้หมึกรั่วเปื้อนมือฉันไปหมด"}
{"word": "pen", "english": "I need a blue pen for this form.", "thai": "ฉันต้องการปากกาสีน้ำเงินสำหรับฟอร์มนี้"}
{"word": "pen", "english": "This pen writes so smoothly.", "thai": "ปากกานี้เขียนลื่นมาก"}
{"word": "pen", "english": "I left my pen on the desk.", "thai": "ฉันวางปากกาไว้บนโต๊ะ"}
{"word": "pen", "english": "The pen rolled off the table.", "thai": "ปากกากลิ้งตกจากโต๊ะ"}
{"word": "pen", "english": "I need a pen to mark my calendar.", "thai": "ฉันต้องการปากกาเพื่อทำเครื่องหมายในปฏิทิน"}
{"word": "pen", "english": "This pen is too expensive for me.", "thai": "ปากกานี้แพงเกินไปสำหรับฉัน"}
{"word": "pen", "english": "I found a pen in my backpack.", "thai": "ฉันเจอปากกาในกระเป๋าเป้"}
{"word": "pen", "english": "Can you grab a pen from the drawer?", "thai": "ช่วยหยิบปากกาจากลิ้นชักมาให้หน่อยได้ไหม?"}
{"word": "pen", "english": "The pen is stuck in my pocket.", "thai": "ปากกาติดอยู่ในกระเป๋าของฉัน"}
{"word": "pen", "english": "I need a pen for the meeting.", "thai": "ฉันต้องการปากกาสำหรับการประชุม"}
{"word": "pen", "english": "This pen has a cool design.", "thai": "ปากกานี้มีดีไซน์เท่"}
{"word": "pen", "english": "I dropped my pen on the floor.", "thai": "ฉันทำปากกาตกบนพื้น"}
{"word": "pen", "english": "The pen is from the hotel.", "thai": "ปากกานี้มาจากโรงแรม"}
{"word": "pen", "english": "I need a pen to sign this card.", "thai": "ฉันต้องการปากกาเพื่อเซ็นการ์ดนี้"}
{"word": "pen", "english": "The pen is running out of ink.", "thai": "ปากกานี้หมึกใกล้หมดแล้ว"}
{"word": "pen", "english": "I’m using a pen to highlight my notes.", "thai": "ฉันใช้ปากกาเพื่อไฮไลต์โน้ต"}
{"word": "pen", "english": "The pen is too big for my hand.", "thai": "ปากกานี้ใหญ่เกินไปสำหรับมือของฉัน"}
{"word": "pen", "english": "I found a pen in the car.", "thai": "ฉันเจอปากกาในรถ"}
{"word": "pen", "english": "Can you buy a pen when you’re out?", "thai": "ซื้อปากกามาให้หน่อยได้ไหมตอนออกไปข้างนอก?"}
{"word": "pen", "english": "The pen is from my old job.", "thai": "ปากกานี้มาจากงานเก่าของฉัน"}
{"word": "pen", "english": "I need a pen for my journal.", "thai": "ฉันต้องการปากกาสำหรับสมุดบันทึก"}
{"word": "pen", "english": "The pen is stuck in the couch cushions.", "thai": "ปากกาติดอยู่ในเบาะโซฟา"}
{"word": "pen", "english": "I’m borrowing your pen for a second.", "thai": "ฉันขอยืมปากกาของคุณแป๊บหนึ่ง"}
{"word": "pen", "english": "The pen is too cheap and keeps breaking.", "thai": "ปากกานี้ถูกเกินไปและพังง่าย"}
{"word": "pen", "english": "I need a red pen for grading papers.", "thai": "ฉันต้องการปากกาสีแดงสำหรับตรวจกระดาษ"}
{"word": "pen", "english": "The pen is from the conference.", "thai": "ปากกานี้มาจากงานประชุม"}
{"word": "pen", "english": "I lost my pen at the library.", "thai": "ฉันทำปากกาหายที่ห้องสมุด"}
{"word": "pen", "english": "This pen is perfect for sketching.", "thai": "ปากกานี้เหมาะสำหรับการร่างภาพ"}
{"word": "pen", "english": "I need a pen to fill out this form.", "thai": "ฉันต้องการปากกาเพื่อกรอกฟอร์มนี้"}
{"word": "pen", "english": "The pen is rolling around in my bag.", "thai": "ปากกากลิ้งไปมาในกระเป๋าของฉัน"}
{"word": "pen", "english": "I found a pen in the kitchen.", "thai": "ฉันเจอปากกาในครัว"}
{"word": "pen", "english": "The pen is too heavy to write with.", "thai": "ปากกานี้หนักเกินไปที่จะเขียน"}
{"word": "pen", "english": "I need a pen for my to-do list.", "thai": "ฉันต้องการปากกาสำหรับลิสต์สิ่งที่ต้องทำ"}
{"word": "pen", "english": "The pen is from the bank.", "thai": "ปากกานี้มาจากธนาคาร"}
{"word": "pen", "english": "I’m using a pen to mark my book.", "thai": "ฉันใช้ปากกาเพื่อทำเครื่องหมายในหนังสือ"}
{"word": "pen", "english": "The pen is stuck in my hair.", "thai": "ปากกาติดอยู่ในผมของฉัน"}
{"word": "pen", "english": "I need a pen for my planner.", "thai": "ฉันต้องการปากกาสำหรับสมุดวางแผน"}
{"word": "pen", "english": "The pen is from my mom’s office.", "thai": "ปากกานี้มาจากออฟฟิศของแม่"}
{"word": "pen", "english": "I dropped my pen in the classroom.", "thai": "ฉันทำปากกาตกในห้องเรียน"}
{"word": "pen", "english": "The pen is too scratchy to use.", "thai": "ปากกานี้ฝืดเกินไปที่จะใช้"}
{"word": "pen", "english": "I need a pen to write a letter.", "thai": "ฉันต้องการปากกาเพื่อเขียนจดหมาย"}
{"word": "pen", "english": "The pen is from the gift shop.", "thai": "ปากกานี้มาจากร้านของที่ระลึก"}
{"word": "pen", "english": "I’m using a pen to doodle in my notebook.", "thai": "ฉันใช้ปากกาขีดเขียนในสมุด"}
{"word": "pen", "english": "The pen is too thin to hold comfortably.", "thai": "ปากกานี้บางเกินไปที่จะจับถนัด"}
{"word": "pen", "english": "I need a pen for the guest book.", "thai": "ฉันต้องการปากกาสำหรับสมุดเยี่ยม"}
{"word": "pen", "english": "The pen is from my last trip.", "thai": "ปากกานี้มาจากทริปครั้งล่าสุด"}
{"word": "pen", "english": "I found a pen in the laundry.", "thai": "ฉันเจอปากกาในกองซักผ้า"}
{"word": "pen", "english": "The pen is making my writing smudge.", "thai": "ปากกานี้ทำให้งานเขียนของฉันเลอะ"}
{"word": "pen", "english": "I need a pen to sign this contract.", "thai": "ฉันต้องการปากกาเพื่อเซ็นสัญญานี้"}
{"word": "pen", "english": "The pen is from the stationery store.", "thai": "ปากกานี้มาจากร้านเครื่องเขียน"}
{"word": "pen", "english": "I’m using a pen to take notes.", "thai": "ฉันใช้ปากกาเพื่อจดโน้ต"}
{"word": "pen", "english": "The pen is too old to write well.", "thai": "ปากกานี้เก่าเกินไปที่จะเขียนได้ดี"}
{"word": "pen", "english": "I need a pen for my crossword puzzle.", "thai": "ฉันต้องการปากกาสำหรับปริศนาอักษรไขว้"}
{"word": "pen", "english": "The pen is from my teacher.", "thai": "ปากกานี้มาจากครูของฉัน"}
{"word": "pen", "english": "I dropped my pen in the coffee shop.", "thai": "ฉันทำปากกาตกในร้านกาแฟ"}
{"word": "pen", "english": "The pen is too fancy for everyday use.", "thai": "ปากกานี้หรูเกินไปสำหรับใช้ทุกวัน"}
{"word": "pen", "english": "I need a pen to write a check.", "thai": "ฉันต้องการปากกาเพื่อเขียนเช็ค"}
{"word": "pen", "english": "The pen is from the office supply closet.", "thai": "ปากกานี้มาจากตู้เก็บของในออฟฟิศ"}
{"word": "pen", "english": "I’m using a pen to mark my textbook.", "thai": "ฉันใช้ปากกาเพื่อทำเครื่องหมายในตำรา"}
{"word": "pen", "english": "The pen is too light to write with.", "thai": "ปากกานี้เบาเกินไปที่จะเขียน"}
{"word": "pen", "english": "I need a pen for my grocery list.", "thai": "ฉันต้องการปากกาสำหรับลิสต์ของชำ"}
{"word": "pen", "english": "The pen is from the museum gift shop.", "thai": "ปากกานี้มาจากร้านของที่ระลึกในพิพิธภัณฑ์"}
{"word": "pen", "english": "I found a pen in my jacket pocket.", "thai": "ฉันเจอปากกาในกระเป๋าแจ็คเก็ต"}
{"word": "pen", "english": "The pen is making my paper tear.", "thai": "ปากกานี้ทำให้กระดาษของฉันขาด"}
{"word": "pen", "english": "I need a pen to write a thank-you note.", "thai": "ฉันต้องการปากกาเพื่อเขียนโน้ตขอบคุณ"}
{"word": "pen", "english": "The pen is from my sister’s desk.", "thai": "ปากกานี้มาจากโต๊ะของน้องสาว"}
{"word": "pen", "english": "I’m using a pen to draw a map.", "thai": "ฉันใช้ปากกาเพื่อวาดแผนที่"}
{"word": "pen", "english": "The pen is too smooth for this paper.", "thai": "ปากกานี้ลื่นเกินไปสำหรับกระดาษนี้"}
{"word": "pen", "english": "I need a pen for my sketchbook.", "thai": "ฉันต้องการปากกาสำหรับสมุดร่าง"}
{"word": "pen", "english": "The pen is from the hotel lobby.", "thai": "ปากกานี้มาจากล็อบบี้โรงแรม"}
{"word": "pen", "english": "I dropped my pen in the meeting.", "thai": "ฉันทำปากกาตกในการประชุม"}
{"word": "pen", "english": "The pen is too thick to write neatly.", "thai": "ปากกานี้หนาเกินไปที่จะเขียนให้เรียบร้อย"}
{"word": "pen", "english": "I need a pen for my diary.", "thai": "ฉันต้องการปากกาสำหรับไดอารี่"}
{"word": "pen", "english": "The pen is from my dad’s office.", "thai": "ปากกานี้มาจากออฟฟิศของพ่อ"}
{"word": "pen", "english": "I’m using a pen to write a poem.", "thai": "ฉันใช้ปากกาเพื่อเขียนบทกวี"}
{"word": "pen", "english": "The pen is too dry to write with.", "thai": "ปากกานี้แห้งเกินไปที่จะเขียน"}
{"word": "pen", "english": "I need a pen for my homework.", "thai": "ฉันต้องการปากกาสำหรับการบ้าน"}
{"word": "pen", "english": "The pen is from the bookstore.", "thai": "ปากกานี้มาจากร้านหนังสือ"}
{"word": "pen", "english": "I found a pen in the parking lot.", "thai": "ฉันเจอปากกาในลานจอดรถ"}
{"word": "pen", "english": "The pen is too short to hold.", "thai": "ปากกานี้สั้นเกินไปที่จะจับ"}
{"word": "pen", "english": "I need a pen to write a postcard.", "thai": "ฉันต้องการปากกาเพื่อเขียนโปสการ์ด"}
{"word": "pen", "english": "The pen is from my friend’s bag.", "thai": "ปากกานี้มาจากกระเป๋าของเพื่อน"}
{"word": "pen", "english": "I’m using a pen to sign my name.", "thai": "ฉันใช้ปากกาเพื่อเซ็นชื่อ"}
{"word": "pen", "english": "The pen is too slippery to grip.", "thai": "ปากกานี้ลื่นเกินไปที่จะจับ"}
{"word": "pen", "english": "I need a pen for my art project.", "thai": "ฉันต้องการปากกาสำหรับโปรเจกต์ศิลปะ"}
{"word": "pen", "english": "The pen is from the school supply room.", "thai": "ปากกานี้มาจากห้องเก็บของโรงเรียน"}
{"word": "pen", "english": "I dropped my pen in the hallway.", "thai": "ฉันทำปากกาตกในโถงทางเดิน"}
{"word": "pen", "english": "The pen is too fancy for my taste.", "thai": "ปากกานี้หรูเกินไปสำหรับรสนิยมของฉัน"}
{"word": "pen", "english": "I need a pen to write a reminder.", "thai": "ฉันต้องการปากกาเพื่อเขียนเตือนความจำ"}
{"word": "pen", "english": "The pen is from the office party.", "thai": "ปากกานี้มาจากงานปาร์ตี้ออฟฟิศ"}
{"word": "pen", "english": "I’m using a pen to underline my notes.", "thai": "ฉันใช้ปากกาเพื่อขีดเส้นใต้โน้ต"}
{"word": "pen", "english": "The pen is too old to work well.", "thai": "ปากกานี้เก่าเกินไปที่จะใช้งานได้ดี"}
{"word": "notebook", "english": "I need a new notebook for my classes.", "thai": "ฉันต้องการสมุดบันทึกใหม่สำหรับชั้นเรียน"}
{"word": "notebook", "english": "Can you lend me your notebook for a sec?", "thai": "ยืมสมุดบันทึกของเธอแป๊บหนึ่งได้ไหม?"}
{"word": "notebook", "english": "I lost my notebook in the library.", "thai": "ฉันทำสมุดบันทึกหายในห้องสมุด"}
{"word": "notebook", "english": "This notebook is full of my sketches.", "thai": "สมุดบันทึกเล่มนี้เต็มไปด้วยภาพร่างของฉัน"}
{"word": "notebook", "english": "I found a notebook under the desk.", "thai": "ฉันเจอสมุดบันทึกอยู่ใต้โต๊ะ"}
{"word": "notebook", "english": "Do you have a spare notebook I can use?", "thai": "คุณมีสมุดบันทึกสำรองให้ฉันใช้ได้ไหม?"}
{"word": "notebook", "english": "I bought a fancy notebook for my journal.", "thai": "ฉันซื้อสมุดบันทึกสวยๆ สำหรับไดอารี่"}
{"word": "notebook", "english": "The notebook is filled with my notes.", "thai": "สมุดบันทึกเล่มนี้เต็มไปด้วยโน้ตของฉัน"}
{"word": "notebook", "english": "I need a notebook for the meeting.", "thai": "ฉันต้องการสมุดบันทึกสำหรับการประชุม"}
{"word": "notebook", "english": "This notebook has a cool cover design.", "thai": "สมุดบันทึกเล่มนี้มีดีไซน์ปกที่เท่"}
{"word": "notebook", "english": "I dropped my notebook in the hallway.", "thai": "ฉันทำสมุดบันทึกตกในโถงทางเดิน"}
{"word": "notebook", "english": "The notebook is from the bookstore.", "thai": "สมุดบันทึกเล่มนี้มาจากร้านหนังสือ"}
{"word": "notebook", "english": "I need a notebook to write my ideas.", "thai": "ฉันต้องการสมุดบันทึกเพื่อเขียนไอเดีย"}
{"word": "notebook", "english": "The notebook is too small for my notes.", "thai": "สมุดบันทึกเล่มนี้เล็กเกินไปสำหรับโน้ตของฉัน"}
{"word": "notebook", "english": "I found a notebook in my backpack.", "thai": "ฉันเจอสมุดบันทึกในกระเป๋าเป้"}
{"word": "notebook", "english": "Can you grab a notebook from the shelf?", "thai": "ช่วยหยิบสมุดบันทึกจากชั้นวางมาให้หน่อยได้ไหม?"}
{"word": "notebook", "english": "The notebook is stuck in my bag.", "thai": "สมุดบันทึกติดอยู่ในกระเป๋าของฉัน"}
{"word": "notebook", "english": "I need a notebook for my math class.", "thai": "ฉันต้องการสมุดบันทึกสำหรับวิชาคณิตศาสตร์"}
{"word": "notebook", "english": "This notebook is perfect for doodling.", "thai": "สมุดบันทึกเล่มนี้เหมาะสำหรับการขีดเขียน"}
{"word": "notebook", "english": "I left my notebook at home.", "thai": "ฉันลืมสมุดบันทึกไว้ที่บ้าน"}
{"word": "notebook", "english": "The notebook is from the office supply store.", "thai": "สมุดบันทึกเล่มนี้มาจากร้านเครื่องเขียน"}
{"word": "notebook", "english": "I need a notebook to plan my week.", "thai": "ฉันต้องการสมุดบันทึกเพื่อวางแผนสัปดาห์"}
{"word": "notebook", "english": "The notebook is full of my poems.", "thai": "สมุดบันทึกเล่มนี้เต็มไปด้วยบทกวีของฉัน"}
{"word": "notebook", "english": "I’m using a notebook for my grocery list.", "thai": "ฉันใช้สมุดบันทึกสำหรับลิสต์ของชำ"}
{"word": "notebook", "english": "The notebook is too heavy to carry.", "thai": "สมุดบันทึกเล่มนี้หนักเกินไปที่จะพก"}
{"word": "notebook", "english": "I need a notebook for my art project.", "thai": "ฉันต้องการสมุดบันทึกสำหรับโปรเจกต์ศิลปะ"}
{"word": "notebook", "english": "The notebook is from my old school.", "thai": "สมุดบันทึกเล่มนี้มาจากโรงเรียนเก่าของฉัน"}
{"word": "notebook", "english": "I found a notebook in the car.", "thai": "ฉันเจอสมุดบันทึกในรถ"}
{"word": "notebook", "english": "Can you buy a notebook when you’re out?", "thai": "ซื้อสมุดบันทึกมาให้หน่อยได้ไหมตอนออกไปข้างนอก?"}
{"word": "notebook", "english": "The notebook is from my mom’s office.", "thai": "สมุดบันทึกเล่มนี้มาจากออฟฟิศของแม่"}
{"word": "notebook", "english": "I need a notebook for my to-do list.", "thai": "ฉันต้องการสมุดบันทึกสำหรับลิสต์สิ่งที่ต้องทำ"}
{"word": "notebook", "english": "The notebook is too big for my bag.", "thai": "สมุดบันทึกเล่มนี้ใหญ่เกินไปสำหรับกระเป๋าของฉัน"}
{"word": "notebook", "english": "I’m borrowing your notebook for notes.", "thai": "ฉันขอยืมสมุดบันทึกของเธอสำหรับจดโน้ต"}
{"word": "notebook", "english": "The notebook is from the thrift store.", "thai": "สมุดบันทึกเล่มนี้มาจากร้านมือสอง"}
{"word": "notebook", "english": "I need a notebook for my English class.", "thai": "ฉันต้องการสมุดบันทึกสำหรับวิชาภาษาอังกฤษ"}
{"word": "notebook", "english": "The notebook is filled with my drawings.", "thai": "สมุดบันทึกเล่มนี้เต็มไปด้วยภาพวาดของฉัน"}
{"word": "notebook", "english": "I dropped my notebook in the classroom.", "thai": "ฉันทำสมุดบันทึกตกในห้องเรียน"}
{"word": "notebook", "english": "The notebook is too old to use.", "thai": "สมุดบันทึกเล่มนี้เก่าเกินไปที่จะใช้"}
{"word": "notebook", "english": "I need a notebook for my science project.", "thai": "ฉันต้องการสมุดบันทึกสำหรับโปรเจกต์วิทยาศาสตร์"}
{"word": "notebook", "english": "The notebook is from the gift shop.", "thai": "สมุดบันทึกเล่มนี้มาจากร้านของที่ระลึก"}
{"word": "notebook", "english": "I’m using a notebook to write a story.", "thai": "ฉันใช้สมุดบันทึกเพื่อเขียนเรื่องราว"}
{"word": "notebook", "english": "The notebook is too small for my sketches.", "thai": "สมุดบันทึกเล่มนี้เล็กเกินไปสำหรับภาพร่างของฉัน"}
{"word": "notebook", "english": "I need a notebook for my travel journal.", "thai": "ฉันต้องการสมุดบันทึกสำหรับบันทึกการเดินทาง"}
{"word": "notebook", "english": "The notebook is from my dad’s desk.", "thai": "สมุดบันทึกเล่มนี้มาจากโต๊ะของพ่อ"}
{"word": "notebook", "english": "I found a notebook in the laundry room.", "thai": "ฉันเจอสมุดบันทึกในห้องซักผ้า"}
{"word": "notebook", "english": "The notebook is falling apart.", "thai": "สมุดบันทึกเล่มนี้เริ่มขาดแล้ว"}
{"word": "notebook", "english": "I need a notebook for my study group.", "thai": "ฉันต้องการสมุดบันทึกสำหรับกลุ่มเรียน"}
{"word": "notebook", "english": "The notebook is from the school supply store.", "thai": "สมุดบันทึกเล่มนี้มาจากร้านเครื่องเขียนโรงเรียน"}
{"word": "notebook", "english": "I’m using a notebook to track my expenses.", "thai": "ฉันใช้สมุดบันทึกเพื่อติดตามค่าใช้จ่าย"}
{"word": "notebook", "english": "The notebook is too fancy for everyday use.", "thai": "สมุดบันทึกเล่มนี้หรูเกินไปสำหรับใช้ทุกวัน"}
{"word": "notebook", "english": "I need a notebook for my recipes.", "thai": "ฉันต้องการสมุดบันทึกสำหรับสูตรอาหาร"}
{"word": "notebook", "english": "The notebook is from my sister’s room.", "thai": "สมุดบันทึกเล่มนี้มาจากห้องของน้องสาว"}
{"word": "notebook", "english": "I dropped my notebook in the coffee shop.", "thai": "ฉันทำสมุดบันทึกตกในร้านกาแฟ"}
{"word": "notebook", "english": "The notebook is too thick to carry.", "thai": "สมุดบันทึกเล่มนี้หนาเกินไปที่จะพก"}
{"word": "notebook", "english": "I need a notebook for my history class.", "thai": "ฉันต้องการสมุดบันทึกสำหรับวิชาประวัติศาสตร์"}
{"word": "notebook", "english": "The notebook is from the museum shop.", "thai": "สมุดบันทึกเล่มนี้มาจากร้านของพิพิธภัณฑ์"}
{"word": "notebook", "english": "I’m using a notebook to plan my trip.", "thai": "ฉันใช้สมุดบันทึกเพื่อวางแผนการเดินทาง"}
{"word": "notebook", "english": "The notebook is too worn out.", "thai": "สมุดบันทึกเล่มนี้เก่าจนขาดแล้ว"}
{"word": "notebook", "english": "I need a notebook for my poetry.", "thai": "ฉันต้องการสมุดบันทึกสำหรับบทกวี"}
{"word": "notebook", "english": "The notebook is from my friend’s bag.", "thai": "สมุดบันทึกเล่มนี้มาจากกระเป๋าของเพื่อน"}
{"word": "notebook", "english": "I found a notebook in the classroom.", "thai": "ฉันเจอสมุดบันทึกในห้องเรียน"}
{"word": "notebook", "english": "The notebook is too expensive for me.", "thai": "สมุดบันทึกเล่มนี้แพงเกินไปสำหรับฉัน"}
{"word": "notebook", "english": "I need a notebook for my workout log.", "thai": "ฉันต้องการสมุดบันทึกสำหรับบันทึกการออกกำลังกาย"}
{"word": "notebook", "english": "The notebook is from the hotel gift shop.", "thai": "สมุดบันทึกเล่มนี้มาจากร้านของที่ระลึกในโรงแรม"}
{"word": "notebook", "english": "I’m using a notebook to write my goals.", "thai": "ฉันใช้สมุดบันทึกเพื่อเขียนเป้าหมาย"}
{"word": "notebook", "english": "The notebook is too thin for my needs.", "thai": "สมุดบันทึกเล่มนี้บางเกินไปสำหรับความต้องการของฉัน"}
{"word": "notebook", "english": "I need a notebook for my language class.", "thai": "ฉันต้องการสมุดบันทึกสำหรับชั้นเรียนภาษา"}
{"word": "notebook", "english": "The notebook is from my teacher’s desk.", "thai": "สมุดบันทึกเล่มนี้มาจากโต๊ะของครู"}
{"word": "notebook", "english": "I dropped my notebook in the park.", "thai": "ฉันทำสมุดบันทึกตกในสวนสาธารณะ"}
{"word": "notebook", "english": "The notebook is too plain for my taste.", "thai": "สมุดบันทึกเล่มนี้เรียบเกินไปสำหรับรสนิยมของฉัน"}
{"word": "notebook", "english": "I need a notebook for my meeting notes.", "thai": "ฉันต้องการสมุดบันทึกสำหรับจดโน้ตการประชุม"}
{"word": "notebook", "english": "The notebook is from the office party.", "thai": "สมุดบันทึกเล่มนี้มาจากงานปาร์ตี้ออฟฟิศ"}
{"word": "notebook", "english": "I’m using a notebook to track my projects.", "thai": "ฉันใช้สมุดบันทึกเพื่อติดตามโปรเจกต์"}
{"word": "notebook", "english": "The notebook is too old to write in.", "thai": "สมุดบันทึกเล่มนี้เก่าเกินไปที่จะเขียน"}
{"word": "notebook", "english": "I need a notebook for my book ideas.", "thai": "ฉันต้องการสมุดบันทึกสำหรับไอเดียหนังสือ"}
{"word": "notebook", "english": "The notebook is from my brother’s room.", "thai": "สมุดบันทึกเล่มนี้มาจากห้องของน้องชาย"}
{"word": "notebook", "english": "I found a notebook in the kitchen.", "thai": "ฉันเจอสมุดบันทึกในครัว"}
{"word": "notebook", "english": "The notebook is falling apart at the spine.", "thai": "สมุดบันทึกเล่มนี้สันขาดแล้ว"}
{"word": "notebook", "english": "I need a notebook for my study notes.", "thai": "ฉันต้องการสมุดบันทึกสำหรับโน้ตการเรียน"}
{"word": "notebook", "english": "The notebook is from the stationery shop.", "thai": "สมุดบันทึกเล่มนี้มาจากร้านเครื่องเขียน"}
{"word": "notebook", "english": "I’m using a notebook to write a letter.", "thai": "ฉันใช้สมุดบันทึกเพื่อเขียนจดหมาย"}
{"word": "notebook", "english": "The notebook is too bulky for my bag.", "thai": "สมุดบันทึกเล่มนี้เทอะทะเกินไปสำหรับกระเป๋าของฉัน"}
{"word": "notebook", "english": "I need a notebook for my art sketches.", "thai": "ฉันต้องการสมุดบันทึกสำหรับร่างภาพศิลปะ"}
{"word": "notebook", "english": "The notebook is from my old job.", "thai": "สมุดบันทึกเล่มนี้มาจากงานเก่าของฉัน"}
{"word": "notebook", "english": "I dropped my notebook in the rain.", "thai": "ฉันทำสมุดบันทึกตกในฝน"}
{"word": "notebook", "english": "The notebook is too colorful for school.", "thai": "สมุดบันทึกเล่มนี้สีสันเกินไปสำหรับโรงเรียน"}
{"word": "notebook", "english": "I need a notebook for my budget plan.", "thai": "ฉันต้องการสมุดบันทึกสำหรับแผนงบประมาณ"}
{"word": "notebook", "english": "The notebook is from the conference.", "thai": "สมุดบันทึกเล่มนี้มาจากงานประชุม"}
{"word": "notebook", "english": "I’m using a notebook to write my dreams.", "thai": "ฉันใช้สมุดบันทึกเพื่อเขียนความฝัน"}
{"word": "notebook", "english": "The notebook is too worn to use.", "thai": "สมุดบันทึกเล่มนี้เก่าจนใช้ไม่ได้"}
{"word": "notebook", "english": "I need a notebook for my vocabulary list.", "thai": "ฉันต้องการสมุดบันทึกสำหรับลิสต์คำศัพท์"}
{"word": "notebook", "english": "The notebook is from my friend’s house.", "thai": "สมุดบันทึกเล่มนี้มาจากบ้านเพื่อน"}
{"word": "notebook", "english": "I found a notebook in the locker.", "thai": "ฉันเจอสมุดบันทึกในล็อกเกอร์"}
{"word": "notebook", "english": "The notebook is too fancy for my notes.", "thai": "สมุดบันทึกเล่มนี้หรูเกินไปสำหรับโน้ตของฉัน"}
{"word": "notebook", "english": "I need a notebook for my diary entries.", "thai": "ฉันต้องการสมุดบันทึกสำหรับบันทึกไดอารี่"}
{"word": "notebook", "english": "The notebook is from the school library.", "thai": "สมุดบันทึกเล่มนี้มาจากห้องสมุดโรงเรียน"}
{"word": "notebook", "english": "I’m using a notebook to plan my party.", "thai": "ฉันใช้สมุดบันทึกเพื่อวางแผนงานปาร์ตี้"}
{"word": "notebook", "english": "The notebook is too small for my drawings.", "thai": "สมุดบันทึกเล่มนี้เล็กเกินไปสำหรับภาพวาดของฉัน"}
{"word": "notebook", "english": "I need a notebook for my class notes.", "thai": "ฉันต้องการสมุดบันทึกสำหรับโน้ตในชั้นเรียน"}
{"word": "notebook", "english": "The notebook is from my last trip.", "thai": "สมุดบันทึกเล่มนี้มาจากทริปครั้งล่าสุด"}
{"word": "paper", "english": "I need some paper to write a note.", "thai": "ฉันต้องการกระดาษเพื่อเขียนโน้ต"}
{"word": "paper", "english": "Can you grab some paper from the printer?", "thai": "ช่วยหยิบกระดาษจากเครื่องพิมพ์มาให้หน่อยได้ไหม?"}
{"word": "paper", "english": "I ran out of paper for my homework.", "thai": "ฉันกระดาษหมดสำหรับการบ้าน"}
{"word": "paper", "english": "This paper is too thin for drawing.", "thai": "กระดาษนี้บางเกินไปสำหรับวาดรูป"}
{"word": "paper", "english": "I found a piece of paper in my pocket.", "thai": "ฉันเจอกระดาษแผ่นหนึ่งในกระเป๋า"}
{"word": "paper", "english": "Do you have any paper I can use?", "thai": "คุณมีกระดาษให้ฉันใช้ได้ไหม?"}
{"word": "paper", "english": "I wrote my number on a piece of paper.", "thai": "ฉันเขียนเบอร์ของฉันบนกระดาษ"}
{"word": "paper", "english": "The paper got wet and tore apart.", "thai": "กระดาษเปียกและขาดออกจากกัน"}
{"word": "paper", "english": "I need paper for my art project.", "thai": "ฉันต้องการกระดาษสำหรับโปรเจกต์ศิลปะ"}
{"word": "paper", "english": "This paper has a nice texture.", "thai": "กระดาษนี้มีพื้นผิวที่ดี"}
{"word": "paper", "english": "I left some paper on the desk.", "thai": "ฉันวางกระดาษไว้บนโต๊ะ"}
{"word": "paper", "english": "The paper jammed in the printer.", "thai": "กระดาษติดอยู่ในเครื่องพิมพ์"}
{"word": "paper", "english": "I need paper to make a list.", "thai": "ฉันต้องการกระดาษเพื่อทำลิสต์"}
{"word": "paper", "english": "This paper is too rough for writing.", "thai": "กระดาษนี้หยาบเกินไปสำหรับเขียน"}
{"word": "paper", "english": "I found some paper in the drawer.", "thai": "ฉันเจอกระดาษในลิ้นชัก"}
{"word": "paper", "english": "Can you buy some paper at the store?", "thai": "ซื้อกระดาษที่ร้านมาให้หน่อยได้ไหม?"}
{"word": "paper", "english": "The paper is crumpled in my bag.", "thai": "กระดาษยับอยู่ในกระเป๋าของฉัน"}
{"word": "paper", "english": "I need paper for my sketchbook.", "thai": "ฉันต้องการกระดาษสำหรับสมุดร่าง"}
{"word": "paper", "english": "This paper is from the office.", "thai": "กระดาษนี้มาจากออฟฟิศ"}
{"word": "paper", "english": "I dropped some paper on the floor.", "thai": "ฉันทำกระดาษตกบนพื้น"}
{"word": "paper", "english": "The paper is too shiny for my pen.", "thai": "กระดาษนี้มันวาวเกินไปสำหรับปากกาของฉัน"}
{"word": "paper", "english": "I need paper to wrap this gift.", "thai": "ฉันต้องการกระดาษเพื่อห่อของขวัญนี้"}
{"word": "paper", "english": "The paper is from the recycling bin.", "thai": "กระดาษนี้มาจากถังรีไซเคิล"}
{"word": "paper", "english": "I’m using paper to make origami.", "thai": "ฉันใช้กระดาษเพื่อพับโอริกามิ"}
{"word": "paper", "english": "The paper is too thick for the printer.", "thai": "กระดาษนี้หนาเกินไปสำหรับเครื่องพิมพ์"}
{"word": "paper", "english": "I need paper for my math homework.", "thai": "ฉันต้องการกระดาษสำหรับการบ้านคณิตศาสตร์"}
{"word": "paper", "english": "The paper is from my old notebook.", "thai": "กระดาษนี้มาจากสมุดบันทึกเก่าของฉัน"}
{"word": "paper", "english": "I found some paper in the car.", "thai": "ฉันเจอกระดาษในรถ"}
{"word": "paper", "english": "The paper is too small for this drawing.", "thai": "กระดาษนี้เล็กเกินไปสำหรับภาพวาดนี้"}
{"word": "paper", "english": "I need paper for my to-do list.", "thai": "ฉันต้องการกระดาษสำหรับลิสต์สิ่งที่ต้องทำ"}
{"word": "paper", "english": "The paper is from the stationery store.", "thai": "กระดาษนี้มาจากร้านเครื่องเขียน"}
{"word": "paper", "english": "I’m using paper to write a letter.", "thai": "ฉันใช้กระดาษเพื่อเขียนจดหมาย"}
{"word": "paper", "english": "The paper is too flimsy for this project.", "thai": "กระดาษนี้บางเกินไปสำหรับโปรเจกต์นี้"}
{"word": "paper", "english": "I need paper for my English class.", "thai": "ฉันต้องการกระดาษสำหรับวิชาภาษาอังกฤษ"}
{"word": "paper", "english": "The paper is from my mom’s office.", "thai": "กระดาษนี้มาจากออฟฟิศของแม่"}
{"word": "paper", "english": "I dropped some paper in the classroom.", "thai": "ฉันทำกระดาษตกในห้องเรียน"}
{"word": "paper", "english": "The paper is too old to use.", "thai": "กระดาษนี้เก่าเกินไปที่จะใช้"}
{"word": "paper", "english": "I need paper for my science project.", "thai": "ฉันต้องการกระดาษสำหรับโปรเจกต์วิทยาศาสตร์"}
{"word": "paper", "english": "The paper is from the gift shop.", "thai": "กระดาษนี้มาจากร้านของที่ระลึก"}
{"word": "paper", "english": "I’m using paper to make a card.", "thai": "ฉันใช้กระดาษเพื่อทำการ์ด"}
{"word": "paper", "english": "The paper is too smooth for charcoal.", "thai": "กระดาษนี้ลื่นเกินไปสำหรับถ่าน"}
{"word": "paper", "english": "I need paper for my grocery list.", "thai": "ฉันต้องการกระดาษสำหรับลิสต์ของชำ"}
{"word": "paper", "english": "The paper is from my dad’s desk.", "thai": "กระดาษนี้มาจากโต๊ะของพ่อ"}
{"word": "paper", "english": "I found some paper in the kitchen.", "thai": "ฉันเจอกระดาษในครัว"}
{"word": "paper", "english": "The paper is torn at the edges.", "thai": "กระดาษขาดที่ขอบ"}
{"word": "paper", "english": "I need paper for my study notes.", "thai": "ฉันต้องการกระดาษสำหรับโน้ตการเรียน"}
{"word": "paper", "english": "The paper is from the school supply room.", "thai": "กระดาษนี้มาจากห้องเก็บของโรงเรียน"}
{"word": "paper", "english": "I’m using paper to sketch a design.", "thai": "ฉันใช้กระดาษเพื่อร่างแบบ"}
{"word": "paper", "english": "The paper is too thin for painting.", "thai": "กระดาษนี้บางเกินไปสำหรับการวาดภาพ"}
{"word": "paper", "english": "I need paper for my journal.", "thai": "ฉันต้องการกระดาษสำหรับไดอารี่"}
{"word": "paper", "english": "The paper is from my sister’s room.", "thai": "กระดาษนี้มาจากห้องของน้องสาว"}
{"word": "paper", "english": "I dropped some paper in the coffee shop.", "thai": "ฉันทำกระดาษตกในร้านกาแฟ"}
{"word": "paper", "english": "The paper is too rough for my pen.", "thai": "กระดาษนี้หยาบเกินไปสำหรับปากกาของฉัน"}
{"word": "paper", "english": "I need paper for my vocabulary list.", "thai": "ฉันต้องการกระดาษสำหรับลิสต์คำศัพท์"}
{"word": "paper", "english": "The paper is from the hotel lobby.", "thai": "กระดาษนี้มาจากล็อบบี้โรงแรม"}
{"word": "paper", "english": "I’m using paper to make a poster.", "thai": "ฉันใช้กระดาษเพื่อทำโปสเตอร์"}
{"word": "paper", "english": "The paper is too colorful for notes.", "thai": "กระดาษนี้สีสันเกินไปสำหรับโน้ต"}
{"word": "paper", "english": "I need paper for my budget plan.", "thai": "ฉันต้องการกระดาษสำหรับแผนงบประมาณ"}
{"word": "paper", "english": "The paper is from the conference.", "thai": "กระดาษนี้มาจากงานประชุม"}
{"word": "paper", "english": "I’m using paper to write a poem.", "thai": "ฉันใช้กระดาษเพื่อเขียนบทกวี"}
{"word": "paper", "english": "The paper is too old and yellowed.", "thai": "กระดาษนี้เก่าและเหลืองแล้ว"}
{"word": "paper", "english": "I need paper for my history class.", "thai": "ฉันต้องการกระดาษสำหรับวิชาประวัติศาสตร์"}
{"word": "paper", "english": "The paper is from my friend’s bag.", "thai": "กระดาษนี้มาจากกระเป๋าของเพื่อน"}
{"word": "paper", "english": "I found some paper in the locker.", "thai": "ฉันเจอกระดาษในล็อกเกอร์"}
{"word": "paper", "english": "The paper is too expensive for me.", "thai": "กระดาษนี้แพงเกินไปสำหรับฉัน"}
{"word": "paper", "english": "I need paper for my art class.", "thai": "ฉันต้องการกระดาษสำหรับวิชาศิลปะ"}
{"word": "paper", "english": "The paper is from my teacher’s desk.", "thai": "กระดาษนี้มาจากโต๊ะของครู"}
{"word": "paper", "english": "I’m using paper to make a card.", "thai": "ฉันใช้กระดาษเพื่อทำการ์ด"}
{"word": "paper", "english": "The paper is too slick for my pencil.", "thai": "กระดาษนี้ลื่นเกินไปสำหรับดินสอของฉัน"}
{"word": "paper", "english": "I need paper for my meeting notes.", "thai": "ฉันต้องการกระดาษสำหรับโน้ตการประชุม"}
{"word": "paper", "english": "The paper is from the office party.", "thai": "กระดาษนี้มาจากงานปาร์ตี้ออฟฟิศ"}
{"word": "paper", "english": "I’m using paper to plan my trip.", "thai": "ฉันใช้กระดาษเพื่อวางแผนการเดินทาง"}
{"word": "paper", "english": "The paper is too thin for markers.", "thai": "กระดาษนี้บางเกินไปสำหรับปากกามาร์กเกอร์"}
{"word": "paper", "english": "I need paper for my diary entries.", "thai": "ฉันต้องการกระดาษสำหรับบันทึกไดอารี่"}
{"word": "paper", "english": "The paper is from my brother’s room.", "thai": "กระดาษนี้มาจากห้องของน้องชาย"}
{"word": "paper", "english": "I found some paper in the backpack.", "thai": "ฉันเจอกระดาษในกระเป๋าเป้"}
{"word": "paper", "english": "The paper is too textured for writing.", "thai": "กระดาษนี้มีพื้นผิวเกินไปสำหรับเขียน"}
{"word": "paper", "english": "I need paper for my workout log.", "thai": "ฉันต้องการกระดาษสำหรับบันทึกการออกกำลังกาย"}
{"word": "paper", "english": "The paper is from the museum shop.", "thai": "กระดาษนี้มาจากร้านของพิพิธภัณฑ์"}
{"word": "paper", "english": "I’m using paper to write a story.", "thai": "ฉันใช้กระดาษเพื่อเขียนเรื่องราว"}
{"word": "paper", "english": "The paper is too brittle to use.", "thai": "กระดาษนี้เปราะเกินไปที่จะใช้"}
{"word": "paper", "english": "I need paper for my language class.", "thai": "ฉันต้องการกระดาษสำหรับชั้นเรียนภาษา"}
{"word": "paper", "english": "The paper is from my old job.", "thai": "กระดาษนี้มาจากงานเก่าของฉัน"}
{"word": "paper", "english": "I dropped some paper in the park.", "thai": "ฉันทำกระดาษตกในสวนสาธารณะ"}
{"word": "paper", "english": "The paper is too fancy for notes.", "thai": "กระดาษนี้หรูเกินไปสำหรับโน้ต"}
{"word": "paper", "english": "I need paper for my recipe cards.", "thai": "ฉันต้องการกระดาษสำหรับการ์ดสูตรอาหาร"}
{"word": "paper", "english": "The paper is from the school library.", "thai": "กระดาษนี้มาจากห้องสมุดโรงเรียน"}
{"word": "paper", "english": "I’m using paper to make a sign.", "thai": "ฉันใช้กระดาษเพื่อทำป้าย"}
{"word": "paper", "english": "The paper is too heavy for this project.", "thai": "กระดาษนี้หนักเกินไปสำหรับโปรเจกต์นี้"}
{"word": "paper", "english": "I need paper for my class notes.", "thai": "ฉันต้องการกระดาษสำหรับโน้ตในชั้นเรียน"}
{"word": "paper", "english": "The paper is from my last trip.", "thai": "กระดาษนี้มาจากทริปครั้งล่าสุด"}
{"word": "paper", "english": "I’m using paper to wrap a present.", "thai": "ฉันใช้กระดาษเพื่อห่อของขวัญ"}
{"word": "paper", "english": "The paper is too small for my drawing.", "thai": "กระดาษนี้เล็กเกินไปสำหรับภาพวาดของฉัน"}
{"word": "paper", "english": "I need paper for my presentation.", "thai": "ฉันต้องการกระดาษสำหรับการนำเสนอ"}
{"word": "paper", "english": "The paper is from my friend’s house.", "thai": "กระดาษนี้มาจากบ้านเพื่อน"}
{"word": "paper", "english": "I found some paper in the trash.", "thai": "ฉันเจอกระดาษในถังขยะ"}
{"word": "paper", "english": "The paper is too thin for my project.", "thai": "กระดาษนี้บางเกินไปสำหรับโปรเจกต์ของฉัน"}
{"word": "paper", "english": "I need paper for my shopping list.", "thai": "ฉันต้องการกระดาษสำหรับลิสต์ช็อปปิ้ง"}
{"word": "paper", "english": "The paper is from the bookstore.", "thai": "กระดาษนี้มาจากร้านหนังสือ"}
{"word": "paper", "english": "I’m using paper to make a collage.", "thai": "ฉันใช้กระดาษเพื่อทำคอลลาจ"}
{"word": "paper", "english": "The paper is too glossy for my notes.", "thai": "กระดาษนี้มันวาวเกินไปสำหรับโน้ตของฉัน"}
{"word": "scissors", "english": "I need scissors to cut this paper.", "thai": "ฉันต้องการกรรไกรเพื่อตัดกระดาษนี้"}
{"word": "scissors", "english": "Can you pass me the scissors from the drawer?", "thai": "ช่วยส่งกรรไกรจากลิ้นชักมาให้หน่อยได้ไหม?"}
{"word": "scissors", "english": "I lost my scissors in the craft room.", "thai": "ฉันทำกรรไกรหายในห้องงานฝีมือ"}
{"word": "scissors", "english": "These scissors are too dull to use.", "thai": "กรรไกรคู่นี้ทื่อเกินไปที่จะใช้"}
{"word": "scissors", "english": "I found a pair of scissors in the kitchen.", "thai": "ฉันเจอกรรไกรคู่หนึ่งในครัว"}
{"word": "scissors", "english": "Do you have any scissors I can borrow?", "thai": "คุณมีกรรไกรให้ฉันยืมได้ไหม?"}
{"word": "scissors", "english": "I bought new scissors for my sewing project.", "thai": "ฉันซื้อกรรไกรใหม่สำหรับโปรเจกต์เย็บผ้า"}
{"word": "scissors", "english": "The scissors left a jagged edge on the fabric.", "thai": "กรรไกรทำให้ขอบผ้ามีรอยหยัก"}
{"word": "scissors", "english": "I need scissors for my art class.", "thai": "ฉันต้องการกรรไกรสำหรับวิชาศิลปะ"}
{"word": "scissors", "english": "These scissors are really sharp.", "thai": "กรรไกรคู่นี้คมมาก"}
{"word": "scissors", "english": "I left the scissors on the table.", "thai": "ฉันวางกรรไกรไว้บนโต๊ะ"}
{"word": "scissors", "english": "The scissors slipped out of my hand.", "thai": "กรรไกรหลุดจากมือของฉัน"}
{"word": "scissors", "english": "I need scissors to trim my hair.", "thai": "ฉันต้องการกรรไกรเพื่อตัดผม"}
{"word": "scissors", "english": "These scissors are too small for this task.", "thai": "กรรไกรคู่นี้เล็กเกินไปสำหรับงานนี้"}
{"word": "scissors", "english": "I found scissors in my backpack.", "thai": "ฉันเจอกรรไกรในกระเป๋าเป้"}
{"word": "scissors", "english": "Can you buy some scissors at the store?", "thai": "ซื้อกรรไกรที่ร้านมาให้หน่อยได้ไหม?"}
{"word": "scissors", "english": "The scissors are stuck in the drawer.", "thai": "กรรไกรติดอยู่ในลิ้นชัก"}
{"word": "scissors", "english": "I need scissors for my scrapbook.", "thai": "ฉันต้องการกรรไกรสำหรับสมุดภาพ"}
{"word": "scissors", "english": "These scissors are from the craft store.", "thai": "กรรไกรคู่นี้มาจากร้านงานฝีมือ"}
{"word": "scissors", "english": "I dropped the scissors on the floor.", "thai": "ฉันทำกรรไกรตกบนพื้น"}
{"word": "scissors", "english": "The scissors are too heavy to use.", "thai": "กรรไกรคู่นี้หนักเกินไปที่จะใช้"}
{"word": "scissors", "english": "I need scissors to cut this ribbon.", "thai": "ฉันต้องการกรรไกรเพื่อตัดริบบิ้นนี้"}
{"word": "scissors", "english": "The scissors are from my mom’s sewing kit.", "thai": "กรรไกรคู่นี้มาจากชุดเย็บผ้าของแม่"}
{"word": "scissors", "english": "I’m using scissors to make a card.", "thai": "ฉันใช้กรรไกรเพื่อทำการ์ด"}
{"word": "scissors", "english": "The scissors are too blunt for this fabric.", "thai": "กรรไกรคู่นี้ทื่อเกินไปสำหรับผ้านี้"}
{"word": "scissors", "english": "I need scissors for my school project.", "thai": "ฉันต้องการกรรไกรสำหรับโปรเจกต์โรงเรียน"}
{"word": "scissors", "english": "The scissors are from the office.", "thai": "กรรไกรคู่นี้มาจากออฟฟิศ"}
{"word": "scissors", "english": "I found scissors in the laundry room.", "thai": "ฉันเจอกรรไกรในห้องซักผ้า"}
{"word": "scissors", "english": "The scissors are too old to cut well.", "thai": "กรรไกรคู่นี้เก่าเกินไปที่จะตัดได้ดี"}
{"word": "scissors", "english": "I need scissors to open this package.", "thai": "ฉันต้องการกรรไกรเพื่อเปิดกล่องนี้"}
{"word": "scissors", "english": "The scissors are from the dollar store.", "thai": "กรรไกรคู่นี้มาจากร้านค้าถูก"}
{"word": "scissors", "english": "I’m using scissors to trim the wrapping paper.", "thai": "ฉันใช้กรรไกรเพื่อตัดกระดาษห่อ"}
{"word": "scissors", "english": "The scissors are too big for my hands.", "thai": "กรรไกรคู่นี้ใหญ่เกินไปสำหรับมือของฉัน"}
{"word": "scissors", "english": "I need scissors for my craft project.", "thai": "ฉันต้องการกรรไกรสำหรับโปรเจกต์งานฝีมือ"}
{"word": "scissors", "english": "The scissors are from my sister’s desk.", "thai": "กรรไกรคู่นี้มาจากโต๊ะของน้องสาว"}
{"word": "scissors", "english": "I dropped the scissors in the classroom.", "thai": "ฉันทำกรรไกรตกในห้องเรียน"}
{"word": "scissors", "english": "The scissors are too rusty to use.", "thai": "กรรไกรคู่นี้ขึ้นสนิมเกินไปที่จะใช้"}
{"word": "scissors", "english": "I need scissors to cut this string.", "thai": "ฉันต้องการกรรไกรเพื่อตัดเชือกนี้"}
{"word": "scissors", "english": "The scissors are from the school supply room.", "thai": "กรรไกรคู่นี้มาจากห้องเก็บของโรงเรียน"}
{"word": "scissors", "english": "I’m using scissors to make a collage.", "thai": "ฉันใช้กรรไกรเพื่อทำคอลลาจ"}
{"word": "scissors", "english": "The scissors are too dull for this tape.", "thai": "กรรไกรคู่นี้ทื่อเกินไปสำหรับเทปนี้"}
{"word": "scissors", "english": "I need scissors for my wrapping project.", "thai": "ฉันต้องการกรรไกรสำหรับโปรเจกต์ห่อของ"}
{"word": "scissors", "english": "The scissors are from my dad’s toolbox.", "thai": "กรรไกรคู่นี้มาจากกล่องเครื่องมือของพ่อ"}
{"word": "scissors", "english": "I found scissors in the car.", "thai": "ฉันเจอกรรไกรในรถ"}
{"word": "scissors", "english": "The scissors are too cheap to cut well.", "thai": "กรรไกรคู่นี้ถูกเกินไปที่จะตัดได้ดี"}
{"word": "scissors", "english": "I need scissors to trim my nails.", "thai": "ฉันต้องการกรรไกรเพื่อตัดเล็บ"}
{"word": "scissors", "english": "The scissors are from the gift shop.", "thai": "กรรไกรคู่นี้มาจากร้านของที่ระลึก"}
{"word": "scissors", "english": "I’m using scissors to cut out shapes.", "thai": "ฉันใช้กรรไกรเพื่อตัดรูปทรง"}
{"word": "scissors", "english": "The scissors are too heavy for kids.", "thai": "กรรไกรคู่นี้หนักเกินไปสำหรับเด็ก"}
{"word": "scissors", "english": "I need scissors for my sewing class.", "thai": "ฉันต้องการกรรไกรสำหรับชั้นเรียนเย็บผ้า"}
{"word": "scissors", "english": "The scissors are from my friend’s house.", "thai": "กรรไกรคู่นี้มาจากบ้านเพื่อน"}
{"word": "scissors", "english": "I dropped the scissors in the kitchen.", "thai": "ฉันทำกรรไกรตกในครัว"}
{"word": "scissors", "english": "The scissors are too blunt for this paper.", "thai": "กรรไกรคู่นี้ทื่อเกินไปสำหรับกระดาษนี้"}
{"word": "scissors", "english": "I need scissors to cut this coupon.", "thai": "ฉันต้องการกรรไกรเพื่อตัดคูปองนี้"}
{"word": "scissors", "english": "The scissors are from the stationery store.", "thai": "กรรไกรคู่นี้มาจากร้านเครื่องเขียน"}
{"word": "scissors", "english": "I’m using scissors to trim the fabric.", "thai": "ฉันใช้กรรไกรเพื่อตัดผ้า"}
{"word": "scissors", "english": "The scissors are too old to sharpen.", "thai": "กรรไกรคู่นี้เก่าเกินไปที่จะลับให้คม"}
{"word": "scissors", "english": "I need scissors for my art project.", "thai": "ฉันต้องการกรรไกรสำหรับโปรเจกต์ศิลปะ"}
{"word": "scissors", "english": "The scissors are from my teacher’s desk.", "thai": "กรรไกรคู่นี้มาจากโต๊ะของครู"}
{"word": "scissors", "english": "I found scissors in the garage.", "thai": "ฉันเจอกรรไกรในโรงรถ"}
{"word": "scissors", "english": "The scissors are too small for this job.", "thai": "กรรไกรคู่นี้เล็กเกินไปสำหรับงานนี้"}
{"word": "scissors", "english": "I need scissors to cut this wrapping.", "thai": "ฉันต้องการกรรไกรเพื่อตัดกระดาษห่อนี้"}
{"word": "scissors", "english": "The scissors are from my brother’s room.", "thai": "กรรไกรคู่นี้มาจากห้องของน้องชาย"}
{"word": "scissors", "english": "I’m using scissors to make a poster.", "thai": "ฉันใช้กรรไกรเพื่อทำโปสเตอร์"}
{"word": "scissors", "english": "The scissors are too rusty for use.", "thai": "กรรไกรคู่นี้ขึ้นสนิมเกินไปที่จะใช้"}
{"word": "scissors", "english": "I need scissors for my gift wrapping.", "thai": "ฉันต้องการกรรไกรสำหรับห่อของขวัญ"}
{"word": "scissors", "english": "The scissors are from the school library.", "thai": "กรรไกรคู่นี้มาจากห้องสมุดโรงเรียน"}
{"word": "scissors", "english": "I dropped the scissors in the hallway.", "thai": "ฉันทำกรรไกรตกในโถงทางเดิน"}
{"word": "scissors", "english": "The scissors are too fancy for everyday use.", "thai": "กรรไกรคู่นี้หรูเกินไปสำหรับใช้ทุกวัน"}
{"word": "scissors", "english": "I need scissors to cut this tape.", "thai": "ฉันต้องการกรรไกรเพื่อตัดเทปนี้"}
{"word": "scissors", "english": "The scissors are from my old apartment.", "thai": "กรรไกรคู่นี้มาจากอพาร์ตเมนต์เก่าของฉัน"}
{"word": "scissors", "english": "I’m using scissors to trim my bangs.", "thai": "ฉันใช้กรรไกรเพื่อตัดหน้าม้า"}
{"word": "scissors", "english": "The scissors are too dull for cardboard.", "thai": "กรรไกรคู่นี้ทื่อเกินไปสำหรับกระดาษแข็ง"}
{"word": "scissors", "english": "I need scissors for my kids’ project.", "thai": "ฉันต้องการกรรไกรสำหรับโปรเจกต์ของเด็กๆ"}
{"word": "scissors", "english": "The scissors are from the hotel.", "thai": "กรรไกรคู่นี้มาจากโรงแรม"}
{"word": "scissors", "english": "I found scissors in the craft box.", "thai": "ฉันเจอกรรไกรในกล่องงานฝีมือ"}
{"word": "scissors", "english": "The scissors are too heavy for crafting.", "thai": "กรรไกรคู่นี้หนักเกินไปสำหรับงานฝีมือ"}
{"word": "scissors", "english": "I need scissors to cut this label.", "thai": "ฉันต้องการกรรไกรเพื่อตัดป้ายนี้"}
{"word": "scissors", "english": "The scissors are from my grandma’s house.", "thai": "กรรไกรคู่นี้มาจากบ้านย่า"}
{"word": "scissors", "english": "I’m using scissors to make decorations.", "thai": "ฉันใช้กรรไกรเพื่อทำของตกแต่ง"}
{"word": "scissors", "english": "The scissors are too blunt for this thread.", "thai": "กรรไกรคู่นี้ทื่อเกินไปสำหรับด้ายนี้"}
{"word": "scissors", "english": "I need scissors for my wrapping paper.", "thai": "ฉันต้องการกรรไกรสำหรับกระดาษห่อ"}
{"word": "scissors", "english": "The scissors are from the office supply closet.", "thai": "กรรไกรคู่นี้มาจากตู้เก็บของในออฟฟิศ"}
{"word": "scissors", "english": "I dropped the scissors in the bathroom.", "thai": "ฉันทำกรรไกรตกในห้องน้ำ"}
{"word": "scissors", "english": "The scissors are too old to cut straight.", "thai": "กรรไกรคู่นี้เก่าเกินไปที่จะตัดตรง"}
{"word": "scissors", "english": "I need scissors for my paper craft.", "thai": "ฉันต้องการกรรไกรสำหรับงานฝีมือกระดาษ"}
{"word": "scissors", "english": "The scissors are from my mom’s desk.", "thai": "กรรไกรคู่นี้มาจากโต๊ะของแม่"}
{"word": "scissors", "english": "I’m using scissors to cut out coupons.", "thai": "ฉันใช้กรรไกรเพื่อตัดคูปอง"}
{"word": "scissors", "english": "The scissors are too small for this fabric.", "thai": "กรรไกรคู่นี้เล็กเกินไปสำหรับผ้านี้"}
{"word": "scissors", "english": "I need scissors for my art homework.", "thai": "ฉันต้องการกรรไกรสำหรับการบ้านศิลปะ"}
{"word": "scissors", "english": "The scissors are from the thrift store.", "thai": "กรรไกรคู่นี้มาจากร้านมือสอง"}
{"word": "scissors", "english": "I found scissors in the sewing kit.", "thai": "ฉันเจอกรรไกรในชุดเย็บผ้า"}
{"word": "scissors", "english": "The scissors are too dull for this project.", "thai": "กรรไกรคู่นี้ทื่อเกินไปสำหรับโปรเจกต์นี้"}
{"word": "scissors", "english": "I need scissors to cut this plastic.", "thai": "ฉันต้องการกรรไกรเพื่อตัดพลาสติกนี้"}
{"word": "scissors", "english": "The scissors are from my old school.", "thai": "กรรไกรคู่นี้มาจากโรงเรียนเก่าของฉัน"}
{"word": "scissors", "english": "I’m using scissors to make a sign.", "thai": "ฉันใช้กรรไกรเพื่อทำป้าย"}
{"word": "scissors", "english": "The scissors are too expensive for me.", "thai": "กรรไกรคู่นี้แพงเกินไปสำหรับฉัน"}
{"word": "scissors", "english": "I need scissors for my craft class.", "thai": "ฉันต้องการกรรไกรสำหรับชั้นเรียนงานฝีมือ"}
{"word": "scissors", "english": "The scissors are from my friend’s bag.", "thai": "กรรไกรคู่นี้มาจากกระเป๋าของเพื่อน"}
{"word": "scissors", "english": "I dropped the scissors in the craft room.", "thai": "ฉันทำกรรไกรตกในห้องงานฝีมือ"}
{"word": "scissors", "english": "The scissors are too sharp for kids.", "thai": "กรรไกรคู่นี้คมเกินไปสำหรับเด็ก"}
{"word": "tape", "english": "I need some tape to fix this paper.", "thai": "ฉันต้องการเทปเพื่อติดกระดาษนี้"}
{"word": "tape", "english": "Can you pass me the tape from the desk?", "thai": "ช่วยส่งเทปจากโต๊ะมาให้หน่อยได้ไหม?"}
{"word": "tape", "english": "I ran out of tape for my project.", "thai": "ฉันใช้เทปหมดสำหรับโปรเจกต์"}
{"word": "tape", "english": "This tape is too sticky for my liking.", "thai": "เทปนี้เหนียวเกินไปสำหรับฉัน"}
{"word": "tape", "english": "I found some tape in the drawer.", "thai": "ฉันเจอเทปในลิ้นชัก"}
{"word": "tape", "english": "Do you have any tape I can borrow?", "thai": "คุณมีเทปให้ฉันยืมได้ไหม?"}
{"word": "tape", "english": "I used tape to wrap this gift.", "thai": "ฉันใช้เทปเพื่อห่อของขวัญนี้"}
{"word": "tape", "english": "The tape is stuck to my fingers.", "thai": "เทปติดอยู่ที่นิ้วของฉัน"}
{"word": "tape", "english": "I need tape for my art project.", "thai": "ฉันต้องการเทปสำหรับโปรเจกต์ศิลปะ"}
{"word": "tape", "english": "This tape is really strong.", "thai": "เทปนี้แข็งแรงมาก"}
{"word": "tape", "english": "I left the tape on the kitchen counter.", "thai": "ฉันวางเทปไว้บนเคาน์เตอร์ครัว"}
{"word": "tape", "english": "The tape tore when I pulled it.", "thai": "เทปขาดตอนฉันดึง"}
{"word": "tape", "english": "I need tape to fix my notebook.", "thai": "ฉันต้องการเทปเพื่อซ่อมสมุดบันทึก"}
{"word": "tape", "english": "This tape is too thin to hold.", "thai": "เทปนี้บางเกินไปที่จะยึด"}
{"word": "tape", "english": "I found some tape in my backpack.", "thai": "ฉันเจอเทปในกระเป๋าเป้"}
{"word": "tape", "english": "Can you buy some tape at the store?", "thai": "ซื้อเทปที่ร้านมาให้หน่อยได้ไหม?"}
{"word": "tape", "english": "The tape is tangled in the drawer.", "thai": "เทปพันกันอยู่ในลิ้นชัก"}
{"word": "tape", "english": "I need tape for my poster.", "thai": "ฉันต้องการเทปสำหรับโปสเตอร์"}
{"word": "tape", "english": "This tape is from the office.", "thai": "เทปนี้มาจากออฟฟิศ"}
{"word": "tape", "english": "I dropped the tape on the floor.", "thai": "ฉันทำเทปตกบนพื้น"}
{"word": "tape", "english": "The tape is too weak to hold this box.", "thai": "เทปนี้บางเกินไปที่จะยึดกล่องนี้"}
{"word": "tape", "english": "I need tape to seal this package.", "thai": "ฉันต้องการเทปเพื่อปิดกล่องนี้"}
{"word": "tape", "english": "The tape is from the stationery store.", "thai": "เทปนี้มาจากร้านเครื่องเขียน"}
{"word": "tape", "english": "I’m using tape to make a collage.", "thai": "ฉันใช้เทปเพื่อทำคอลลาจ"}
{"word": "tape", "english": "The tape is too old to stick well.", "thai": "เทปนี้เก่าเกินไปที่จะติดได้ดี"}
{"word": "tape", "english": "I need tape for my school project.", "thai": "ฉันต้องการเทปสำหรับโปรเจกต์โรงเรียน"}
{"word": "tape", "english": "The tape is from my mom’s desk.", "thai": "เทปนี้มาจากโต๊ะของแม่"}
{"word": "tape", "english": "I found some tape in the kitchen.", "thai": "ฉันเจอเทปในครัว"}
{"word": "tape", "english": "The tape is all used up.", "thai": "เทปนี้ใช้หมดแล้ว"}
{"word": "tape", "english": "I need tape to fix this torn page.", "thai": "ฉันต้องการเทปเพื่อซ่อมหน้ากระดาษที่ขาด"}
{"word": "tape", "english": "The tape is from the craft store.", "thai": "เทปนี้มาจากร้านงานฝีมือ"}
{"word": "tape", "english": "I’m using tape to hang this picture.", "thai": "ฉันใช้เทปเพื่อแขวนรูปนี้"}
{"word": "tape", "english": "The tape is too sticky for this paper.", "thai": "เทปนี้เหนียวเกินไปสำหรับกระดาษนี้"}
{"word": "tape", "english": "I need tape for my wrapping project.", "thai": "ฉันต้องการเทปสำหรับโปรเจกต์ห่อของ"}
{"word": "tape", "english": "The tape is from my sister’s room.", "thai": "เทปนี้มาจากห้องของน้องสาว"}
{"word": "tape", "english": "I dropped the tape in the classroom.", "thai": "ฉันทำเทปตกในห้องเรียน"}
{"word": "tape", "english": "The tape is too thin for this box.", "thai": "เทปนี้บางเกินไปสำหรับกล่องนี้"}
{"word": "tape", "english": "I need tape to make a sign.", "thai": "ฉันต้องการเทปเพื่อทำป้าย"}
{"word": "tape", "english": "The tape is from my dad’s office.", "thai": "เทปนี้มาจากออฟฟิศของพ่อ"}
{"word": "tape", "english": "I’m using tape to fix my book.", "thai": "ฉันใช้เทปเพื่อซ่อมหนังสือ"}
{"word": "tape", "english": "The tape is too weak for this package.", "thai": "เทปนี้บางเกินไปสำหรับกล่องนี้"}
{"word": "tape", "english": "I need tape for my art class.", "thai": "ฉันต้องการเทปสำหรับวิชาศิลปะ"}
{"word": "tape", "english": "The tape is from the school supply room.", "thai": "เทปนี้มาจากห้องเก็บของโรงเรียน"}
{"word": "tape", "english": "I found some tape in the car.", "thai": "ฉันเจอเทปในรถ"}
{"word": "tape", "english": "The tape is too expensive for me.", "thai": "เทปนี้แพงเกินไปสำหรับฉัน"}
{"word": "tape", "english": "I need tape to secure this poster.", "thai": "ฉันต้องการเทปเพื่อยึดโปสเตอร์นี้"}
{"word": "tape", "english": "The tape is from the gift shop.", "thai": "เทปนี้มาจากร้านของที่ระลึก"}
{"word": "tape", "english": "I’m using tape to make decorations.", "thai": "ฉันใช้เทปเพื่อทำของตกแต่ง"}
{"word": "tape", "english": "The tape is too short to use.", "thai": "เทปนี้สั้นเกินไปที่จะใช้"}
{"word": "tape", "english": "I need tape for my craft project.", "thai": "ฉันต้องการเทปสำหรับโปรเจกต์งานฝีมือ"}
{"word": "tape", "english": "The tape is from my friend’s bag.", "thai": "เทปนี้มาจากกระเป๋าของเพื่อน"}
{"word": "tape", "english": "I dropped the tape in the hallway.", "thai": "ฉันทำเทปตกในโถงทางเดิน"}
{"word": "tape", "english": "The tape is too sticky for this surface.", "thai": "เทปนี้เหนียวเกินไปสำหรับพื้นผิวนี้"}
{"word": "tape", "english": "I need tape to fix this label.", "thai": "ฉันต้องการเทปเพื่อซ่อมป้ายนี้"}
{"word": "tape", "english": "The tape is from the thrift store.", "thai": "เทปนี้มาจากร้านมือสอง"}
{"word": "tape", "english": "I’m using tape to seal this envelope.", "thai": "ฉันใช้เทปเพื่อปิดซองจดหมายนี้"}
{"word": "tape", "english": "The tape is too old to stick properly.", "thai": "เทปนี้เก่าเกินไปที่จะติดได้ดี"}
{"word": "tape", "english": "I need tape for my wrapping paper.", "thai": "ฉันต้องการเทปสำหรับกระดาษห่อ"}
{"word": "tape", "english": "The tape is from my brother’s room.", "thai": "เทปนี้มาจากห้องของน้องชาย"}
{"word": "tape", "english": "I found some tape in the garage.", "thai": "ฉันเจอเทปในโรงรถ"}
{"word": "tape", "english": "The tape is too thin for heavy items.", "thai": "เทปนี้บางเกินไปสำหรับของหนัก"}
{"word": "tape", "english": "I need tape to hang this banner.", "thai": "ฉันต้องการเทปเพื่อแขวนป้ายนี้"}
{"word": "tape", "english": "The tape is from my old apartment.", "thai": "เทปนี้มาจากอพาร์ตเมนต์เก่าของฉัน"}
{"word": "tape", "english": "I’m using tape to fix my headphones.", "thai": "ฉันใช้เทปเพื่อซ่อมหูฟัง"}
{"word": "tape", "english": "The tape is too weak for this cardboard.", "thai": "เทปนี้บางเกินไปสำหรับกระดาษแข็งนี้"}
{"word": "tape", "english": "I need tape for my kids’ project.", "thai": "ฉันต้องการเทปสำหรับโปรเจกต์ของเด็กๆ"}
{"word": "tape", "english": "The tape is from the hotel.", "thai": "เทปนี้มาจากโรงแรม"}
{"word": "tape", "english": "I found some tape in the craft box.", "thai": "ฉันเจอเทปในกล่องงานฝีมือ"}
{"word": "tape", "english": "The tape is too sticky for my notebook.", "thai": "เทปนี้เหนียวเกินไปสำหรับสมุดบันทึกของฉัน"}
{"word": "tape", "english": "I need tape to fix this poster.", "thai": "ฉันต้องการเทปเพื่อซ่อมโปสเตอร์นี้"}
{"word": "tape", "english": "The tape is from my grandma’s house.", "thai": "เทปนี้มาจากบ้านย่า"}
{"word": "tape", "english": "I’m using tape to make a sign.", "thai": "ฉันใช้เทปเพื่อทำป้าย"}
{"word": "tape", "english": "The tape is too thin for this task.", "thai": "เทปนี้บางเกินไปสำหรับงานนี้"}
{"word": "tape", "english": "I need tape for my gift wrapping.", "thai": "ฉันต้องการเทปสำหรับห่อของขวัญ"}
{"word": "tape", "english": "The tape is from the school library.", "thai": "เทปนี้มาจากห้องสมุดโรงเรียน"}
{"word": "tape", "english": "I dropped the tape in the bathroom.", "thai": "ฉันทำเทปตกในห้องน้ำ"}
{"word": "tape", "english": "The tape is too old to use.", "thai": "เทปนี้เก่าเกินไปที่จะใช้"}
{"word": "tape", "english": "I need tape for my paper craft.", "thai": "ฉันต้องการเทปสำหรับงานฝีมือกระดาษ"}
{"word": "tape", "english": "The tape is from my teacher’s desk.", "thai": "เทปนี้มาจากโต๊ะของครู"}
{"word": "tape", "english": "I’m using tape to fix my shoes.", "thai": "ฉันใช้เทปเพื่อซ่อมรองเท้า"}
{"word": "tape", "english": "The tape is too weak for this box.", "thai": "เทปนี้บางเกินไปสำหรับกล่องนี้"}
{"word": "tape", "english": "I need tape for my art homework.", "thai": "ฉันต้องการเทปสำหรับการบ้านศิลปะ"}
{"word": "tape", "english": "The tape is from the office supply closet.", "thai": "เทปนี้มาจากตู้เก็บของในออฟฟิศ"}
{"word": "tape", "english": "I found some tape in the toolbox.", "thai": "ฉันเจอเทปในกล่องเครื่องมือ"}
{"word": "tape", "english": "The tape is too sticky for this fabric.", "thai": "เทปนี้เหนียวเกินไปสำหรับผ้านี้"}
{"word": "tape", "english": "I need tape to secure this cable.", "thai": "ฉันต้องการเทปเพื่อยึดสายเคเบิลนี้"}
{"word": "tape", "english": "The tape is from my friend’s house.", "thai": "เทปนี้มาจากบ้านเพื่อน"}
{"word": "tape", "english": "I’m using tape to make a label.", "thai": "ฉันใช้เทปเพื่อทำป้าย"}
{"word": "tape", "english": "The tape is too short for this job.", "thai": "เทปนี้สั้นเกินไปสำหรับงานนี้"}
{"word": "tape", "english": "I need tape for my craft class.", "thai": "ฉันต้องการเทปสำหรับชั้นเรียนงานฝีมือ"}
{"word": "tape", "english": "The tape is from my old school.", "thai": "เทปนี้มาจากโรงเรียนเก่าของฉัน"}
{"word": "tape", "english": "I dropped the tape in the craft room.", "thai": "ฉันทำเทปตกในห้องงานฝีมือ"}
{"word": "tape", "english": "The tape is too thick for this paper.", "thai": "เทปนี้หนาเกินไปสำหรับกระดาษนี้"}
{"word": "tape", "english": "I need tape to fix my backpack.", "thai": "ฉันต้องการเทปเพื่อซ่อมกระเป๋าเป้"}
{"word": "tape", "english": "The tape is from the bookstore.", "thai": "เทปนี้มาจากร้านหนังสือ"}
{"word": "tape", "english": "I’m using tape to hang decorations.", "thai": "ฉันใช้เทปเพื่อแขวนของตกแต่ง"}
{"word": "tape", "english": "The tape is too weak for this project.", "thai": "เทปนี้บางเกินไปสำหรับโปรเจกต์นี้"}
{"word": "tape", "english": "I need tape for my scrapbook.", "thai": "ฉันต้องการเทปสำหรับสมุดภาพ"}
{"word": "tape", "english": "The tape is from my mom’s office.", "thai": "เทปนี้มาจากออฟฟิศของแม่"}
{"word": "tape", "english": "I found some tape in the classroom.", "thai": "ฉันเจอเทปในห้องเรียน"}
{"word": "tape", "english": "The tape is too sticky for my liking.", "thai": "เทปนี้เหนียวเกินไปสำหรับฉัน"}
{"word": "stapler", "english": "I need a stapler to bind these papers.", "thai": "ฉันต้องการที่เย็บกระดาษเพื่อเย็บกระดาษเหล่านี้"}
{"word": "stapler", "english": "Can you pass me the stapler from the desk?", "thai": "ช่วยส่งที่เย็บกระดาษจากโต๊ะมาให้หน่อยได้ไหม?"}
{"word": "stapler", "english": "I lost my stapler in the office.", "thai": "ฉันทำที่เย็บกระดาษหายในออฟฟิศ"}
{"word": "stapler", "english": "This stapler is out of staples.", "thai": "ที่เย็บกระดาษนี้ไม่มีลวดเย็บแล้ว"}
{"word": "stapler", "english": "I found a stapler in the drawer.", "thai": "ฉันเจอที่เย็บกระดาษในลิ้นชัก"}
{"word": "stapler", "english": "Do you have a stapler I can borrow?", "thai": "คุณมีที่เย็บกระดาษให้ฉันยืมได้ไหม?"}
{"word": "stapler", "english": "I bought a new stapler for my desk.", "thai": "ฉันซื้อที่เย็บกระดาษใหม่สำหรับโต๊ะของฉัน"}
{"word": "stapler", "english": "The stapler jammed when I used it.", "thai": "ที่เย็บกระดาษติดตอนฉันใช้"}
{"word": "stapler", "english": "I need a stapler for my school project.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับโปรเจกต์โรงเรียน"}
{"word": "stapler", "english": "This stapler is really heavy.", "thai": "ที่เย็บกระดาษนี้หนักมาก"}
{"word": "stapler", "english": "I left the stapler on the table.", "thai": "ฉันวางที่เย็บกระดาษไว้บนโต๊ะ"}
{"word": "stapler", "english": "The stapler broke when I dropped it.", "thai": "ที่เย็บกระดาษพังตอนฉันทำตก"}
{"word": "stapler", "english": "I need a stapler to finish my report.", "thai": "ฉันต้องการที่เย็บกระดาษเพื่อทำรายงานให้เสร็จ"}
{"word": "stapler", "english": "This stapler is too small for thick papers.", "thai": "ที่เย็บกระดาษนี้เล็กเกินไปสำหรับกระดาษหนา"}
{"word": "stapler", "english": "I found a stapler in my backpack.", "thai": "ฉันเจอที่เย็บกระดาษในกระเป๋าเป้"}
{"word": "stapler", "english": "Can you buy a stapler at the store?", "thai": "ซื้อที่เย็บกระดาษที่ร้านมาให้หน่อยได้ไหม?"}
{"word": "stapler", "english": "The stapler is stuck in the drawer.", "thai": "ที่เย็บกระดาษติดอยู่ในลิ้นชัก"}
{"word": "stapler", "english": "I need a stapler for my presentation.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับการนำเสนอ"}
{"word": "stapler", "english": "This stapler is from the office.", "thai": "ที่เย็บกระดาษนี้มาจากออฟฟิศ"}
{"word": "stapler", "english": "I dropped the stapler on the floor.", "thai": "ฉันทำที่เย็บกระดาษตกบนพื้น"}
{"word": "stapler", "english": "The stapler is too weak for this stack.", "thai": "ที่เย็บกระดาษนี้ไม่แข็งแรงพอสำหรับกองนี้"}
{"word": "stapler", "english": "I need a stapler to bind my notes.", "thai": "ฉันต้องการที่เย็บกระดาษเพื่อเย็บโน้ต"}
{"word": "stapler", "english": "The stapler is from the stationery store.", "thai": "ที่เย็บกระดาษนี้มาจากร้านเครื่องเขียน"}
{"word": "stapler", "english": "I’m using a stapler to make a booklet.", "thai": "ฉันใช้ที่เย็บกระดาษเพื่อทำสมุดเล่มเล็ก"}
{"word": "stapler", "english": "The stapler is too old to work well.", "thai": "ที่เย็บกระดาษนี้เก่าเกินไปที่จะทำงานได้ดี"}
{"word": "stapler", "english": "I need a stapler for my homework.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับการบ้าน"}
{"word": "stapler", "english": "The stapler is from my mom’s office.", "thai": "ที่เย็บกระดาษนี้มาจากออฟฟิศของแม่"}
{"word": "stapler", "english": "I found a stapler in the classroom.", "thai": "ฉันเจอที่เย็บกระดาษในห้องเรียน"}
{"word": "stapler", "english": "The stapler is out of staples again.", "thai": "ที่เย็บกระดาษนี้ไม่มีลวดเย็บอีกแล้ว"}
{"word": "stapler", "english": "I need a stapler for my art project.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับโปรเจกต์ศิลปะ"}
{"word": "stapler", "english": "The stapler is from the school supply room.", "thai": "ที่เย็บกระดาษนี้มาจากห้องเก็บของโรงเรียน"}
{"word": "stapler", "english": "I’m using a stapler to fix my packet.", "thai": "ฉันใช้ที่เย็บกระดาษเพื่อซ่อมชุดเอกสาร"}
{"word": "stapler", "english": "The stapler is too heavy for my desk.", "thai": "ที่เย็บกระดาษนี้หนักเกินไปสำหรับโต๊ะของฉัน"}
{"word": "stapler", "english": "I need a stapler for my math homework.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับการบ้านคณิตศาสตร์"}
{"word": "stapler", "english": "The stapler is from my dad’s desk.", "thai": "ที่เย็บกระดาษนี้มาจากโต๊ะของพ่อ"}
{"word": "stapler", "english": "I dropped the stapler in the hallway.", "thai": "ฉันทำที่เย็บกระดาษตกในโถงทางเดิน"}
{"word": "stapler", "english": "The stapler is too cheap to work well.", "thai": "ที่เย็บกระดาษนี้ถูกเกินไปที่จะทำงานได้ดี"}
{"word": "stapler", "english": "I need a stapler to organize my papers.", "thai": "ฉันต้องการที่เย็บกระดาษเพื่อจัดระเบียบกระดาษ"}
{"word": "stapler", "english": "The stapler is from the thrift store.", "thai": "ที่เย็บกระดาษนี้มาจากร้านมือสอง"}
{"word": "stapler", "english": "I’m using a stapler to make a report.", "thai": "ฉันใช้ที่เย็บกระดาษเพื่อทำรายงาน"}
{"word": "stapler", "english": "The stapler is too small for this stack.", "thai": "ที่เย็บกระดาษนี้เล็กเกินไปสำหรับกองนี้"}
{"word": "stapler", "english": "I need a stapler for my English class.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับวิชาภาษาอังกฤษ"}
{"word": "stapler", "english": "The stapler is from my sister’s room.", "thai": "ที่เย็บกระดาษนี้มาจากห้องของน้องสาว"}
{"word": "stapler", "english": "I found a stapler in the car.", "thai": "ฉันเจอที่เย็บกระดาษในรถ"}
{"word": "stapler", "english": "The stapler is too rusty to use.", "thai": "ที่เย็บกระดาษนี้ขึ้นสนิมเกินไปที่จะใช้"}
{"word": "stapler", "english": "I need a stapler to bind my notes.", "thai": "ฉันต้องการที่เย็บกระดาษเพื่อเย็บโน้ต"}
{"word": "stapler", "english": "The stapler is from the gift shop.", "thai": "ที่เย็บกระดาษนี้มาจากร้านของที่ระลึก"}
{"word": "stapler", "english": "I’m using a stapler to make a booklet.", "thai": "ฉันใช้ที่เย็บกระดาษเพื่อทำสมุดเล่มเล็ก"}
{"word": "stapler", "english": "The stapler is too old to function.", "thai": "ที่เย็บกระดาษนี้เก่าเกินไปที่จะใช้งาน"}
{"word": "stapler", "english": "I need a stapler for my science project.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับโปรเจกต์วิทยาศาสตร์"}
{"word": "stapler", "english": "The stapler is from my friend’s bag.", "thai": "ที่เย็บกระดาษนี้มาจากกระเป๋าของเพื่อน"}
{"word": "stapler", "english": "I dropped the stapler in the classroom.", "thai": "ฉันทำที่เย็บกระดาษตกในห้องเรียน"}
{"word": "stapler", "english": "The stapler is too weak for thick stacks.", "thai": "ที่เย็บกระดาษนี้ไม่แข็งแรงพอสำหรับกองหนา"}
{"word": "stapler", "english": "I need a stapler for my history class.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับวิชาประวัติศาสตร์"}
{"word": "stapler", "english": "The stapler is from the school library.", "thai": "ที่เย็บกระดาษนี้มาจากห้องสมุดโรงเรียน"}
{"word": "stapler", "english": "I’m using a stapler to organize my files.", "thai": "ฉันใช้ที่เย็บกระดาษเพื่อจัดระเบียบไฟล์"}
{"word": "stapler", "english": "The stapler is too heavy to carry.", "thai": "ที่เย็บกระดาษนี้หนักเกินไปที่จะพก"}
{"word": "stapler", "english": "I need a stapler for my art class.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับวิชาศิลปะ"}
{"word": "stapler", "english": "The stapler is from my teacher’s desk.", "thai": "ที่เย็บกระดาษนี้มาจากโต๊ะของครู"}
{"word": "stapler", "english": "I found a stapler in the kitchen.", "thai": "ฉันเจอที่เย็บกระดาษในครัว"}
{"word": "stapler", "english": "The stapler is too cheap to last long.", "thai": "ที่เย็บกระดาษนี้ถูกเกินไปที่จะทนทาน"}
{"word": "stapler", "english": "I need a stapler for my study notes.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับโน้ตการเรียน"}
{"word": "stapler", "english": "The stapler is from the office supply closet.", "thai": "ที่เย็บกระดาษนี้มาจากตู้เก็บของในออฟฟิศ"}
{"word": "stapler", "english": "I’m using a stapler to make a packet.", "thai": "ฉันใช้ที่เย็บกระดาษเพื่อทำชุดเอกสาร"}
{"word": "stapler", "english": "The stapler is too small for big projects.", "thai": "ที่เย็บกระดาษนี้เล็กเกินไปสำหรับโปรเจกต์ใหญ่"}
{"word": "stapler", "english": "I need a stapler for my language class.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับชั้นเรียนภาษา"}
{"word": "stapler", "english": "The stapler is from my brother’s room.", "thai": "ที่เย็บกระดาษนี้มาจากห้องของน้องชาย"}
{"word": "stapler", "english": "I found a stapler in the garage.", "thai": "ฉันเจอที่เย็บกระดาษในโรงรถ"}
{"word": "stapler", "english": "The stapler is too old to staple well.", "thai": "ที่เย็บกระดาษนี้เก่าเกินไปที่จะเย็บได้ดี"}
{"word": "stapler", "english": "I need a stapler for my meeting notes.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับโน้ตการประชุม"}
{"word": "stapler", "english": "The stapler is from the bookstore.", "thai": "ที่เย็บกระดาษนี้มาจากร้านหนังสือ"}
{"word": "stapler", "english": "I’m using a stapler to bind my essays.", "thai": "ฉันใช้ที่เย็บกระดาษเพื่อเย็บเรียงความ"}
{"word": "stapler", "english": "The stapler is too weak for this paper.", "thai": "ที่เย็บกระดาษนี้ไม่แข็งแรงพอสำหรับกระดาษนี้"}
{"word": "stapler", "english": "I need a stapler for my craft project.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับโปรเจกต์งานฝีมือ"}
{"word": "stapler", "english": "The stapler is from my old school.", "thai": "ที่เย็บกระดาษนี้มาจากโรงเรียนเก่าของฉัน"}
{"word": "stapler", "english": "I dropped the stapler in the library.", "thai": "ฉันทำที่เย็บกระดาษตกในห้องสมุด"}
{"word": "stapler", "english": "The stapler is too fancy for everyday use.", "thai": "ที่เย็บกระดาษนี้หรูเกินไปสำหรับใช้ทุกวัน"}
{"word": "stapler", "english": "I need a stapler for my budget plan.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับแผนงบประมาณ"}
{"word": "stapler", "english": "The stapler is from my friend’s house.", "thai": "ที่เย็บกระดาษนี้มาจากบ้านเพื่อน"}
{"word": "stapler", "english": "I’m using a stapler to make a schedule.", "thai": "ฉันใช้ที่เย็บกระดาษเพื่อทำตารางเวลา"}
{"word": "stapler", "english": "The stapler is too heavy for my bag.", "thai": "ที่เย็บกระดาษนี้หนักเกินไปสำหรับกระเป๋าของฉัน"}
{"word": "stapler", "english": "I need a stapler for my vocabulary list.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับลิสต์คำศัพท์"}
{"word": "stapler", "english": "The stapler is from the conference.", "thai": "ที่เย็บกระดาษนี้มาจากงานประชุม"}
{"word": "stapler", "english": "I found a stapler in the meeting room.", "thai": "ฉันเจอที่เย็บกระดาษในห้องประชุม"}
{"word": "stapler", "english": "The stapler is too old to work properly.", "thai": "ที่เย็บกระดาษนี้เก่าเกินไปที่จะทำงานได้ดี"}
{"word": "stapler", "english": "I need a stapler for my class notes.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับโน้ตในชั้นเรียน"}
{"word": "stapler", "english": "The stapler is from my mom’s desk.", "thai": "ที่เย็บกระดาษนี้มาจากโต๊ะของแม่"}
{"word": "stapler", "english": "I’m using a stapler to bind my worksheets.", "thai": "ฉันใช้ที่เย็บกระดาษเพื่อเย็บใบงาน"}
{"word": "stapler", "english": "The stapler is too small for my needs.", "thai": "ที่เย็บกระดาษนี้เล็กเกินไปสำหรับความต้องการของฉัน"}
{"word": "stapler", "english": "I need a stapler for my office work.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับงานออฟฟิศ"}
{"word": "stapler", "english": "The stapler is from the hotel.", "thai": "ที่เย็บกระดาษนี้มาจากโรงแรม"}
{"word": "stapler", "english": "I dropped the stapler in the office.", "thai": "ฉันทำที่เย็บกระดาษตกในออฟฟิศ"}
{"word": "stapler", "english": "The stapler is too expensive for me.", "thai": "ที่เย็บกระดาษนี้แพงเกินไปสำหรับฉัน"}
{"word": "stapler", "english": "I need a stapler for my study group.", "thai": "ฉันต้องการที่เย็บกระดาษสำหรับกลุ่มเรียน"}
{"word": "stapler", "english": "The stapler is from my old job.", "thai": "ที่เย็บกระดาษนี้มาจากงานเก่าของฉัน"}
{"word": "stapler", "english": "I’m using a stapler to make a folder.", "thai": "ฉันใช้ที่เย็บกระดาษเพื่อทำโฟลเดอร์"}
{"word": "stapler", "english": "The stapler is too weak for this booklet.", "thai": "ที่เย็บกระดาษนี้ไม่แข็งแรงพอสำหรับสมุดเล่มเล็กนี้"}
{"word": "desk", "english": "I need a new desk for my home office.", "thai": "ฉันต้องการโต๊ะใหม่สำหรับสำนักงานที่บ้าน"}
{"word": "desk", "english": "Can you grab a pen from my desk?", "thai": "ช่วยหยิบปากกาจากโต๊ะของฉันหน่อยได้ไหม?"}
{"word": "desk", "english": "I left my notebook on the desk.", "thai": "ฉันวางสมุดบันทึกไว้บนโต๊ะ"}
{"word": "desk", "english": "This desk is too small for my laptop.", "thai": "โต๊ะนี้เล็กเกินไปสำหรับแล็ปท็อปของฉัน"}
{"word": "desk", "english": "I found a stapler under the desk.", "thai": "ฉันเจอที่เย็บกระดาษอยู่ใต้โต๊ะ"}
{"word": "desk", "english": "Do you have a desk in your room?", "thai": "คุณมีโต๊ะในห้องของคุณไหม?"}
{"word": "desk", "english": "I bought a wooden desk for my study.", "thai": "ฉันซื้อโต๊ะไม้สำหรับห้องอ่านหนังสือ"}
{"word": "desk", "english": "The desk is cluttered with papers.", "thai": "โต๊ะรกไปด้วยกระดาษ"}
{"word": "desk", "english": "I need a desk for my schoolwork.", "thai": "ฉันต้องการโต๊ะสำหรับงานโรงเรียน"}
{"word": "desk", "english": "This desk is really sturdy.", "thai": "โต๊ะนี้แข็งแรงมาก"}
{"word": "desk", "english": "I left my glasses on the desk.", "thai": "ฉันวางแว่นตาไว้บนโต๊ะ"}
{"word": "desk", "english": "The desk wobbles when I write.", "thai": "โต๊ะโยกเมื่อฉันเขียน"}
{"word": "desk", "english": "I need a desk for my new apartment.", "thai": "ฉันต้องการโต๊ะสำหรับอพาร์ตเมนต์ใหม่"}
{"word": "desk", "english": "This desk is too big for my room.", "thai": "โต๊ะนี้ใหญ่เกินไปสำหรับห้องของฉัน"}
{"word": "desk", "english": "I found a desk at the thrift store.", "thai": "ฉันเจอโต๊ะที่ร้านมือสอง"}
{"word": "desk", "english": "Can you help me move this desk?", "thai": "ช่วยฉันย้ายโต๊ะนี้หน่อยได้ไหม?"}
{"word": "desk", "english": "The desk is scratched on the surface.", "thai": "โต๊ะมีรอยขีดข่วนบนพื้นผิว"}
{"word": "desk", "english": "I need a desk for my art projects.", "thai": "ฉันต้องการโต๊ะสำหรับโปรเจกต์ศิลปะ"}
{"word": "desk", "english": "This desk is from my old office.", "thai": "โต๊ะนี้มาจากออฟฟิศเก่าของฉัน"}
{"word": "desk", "english": "I dropped my pen under the desk.", "thai": "ฉันทำปากกาตกใต้โต๊ะ"}
{"word": "desk", "english": "The desk is too heavy to lift.", "thai": "โต๊ะนี้หนักเกินไปที่จะยก"}
{"word": "desk", "english": "I need a desk for my study group.", "thai": "ฉันต้องการโต๊ะสำหรับกลุ่มเรียน"}
{"word": "desk", "english": "The desk is from my mom’s office.", "thai": "โต๊ะนี้มาจากออฟฟิศของแม่"}
{"word": "desk", "english": "I’m organizing my desk this weekend.", "thai": "ฉันจะจัดระเบียบโต๊ะสุดสัปดาห์นี้"}
{"word": "desk", "english": "The desk is too old to use.", "thai": "โต๊ะนี้เก่าเกินไปที่จะใช้"}
{"word": "desk", "english": "I need a desk for my computer.", "thai": "ฉันต้องการโต๊ะสำหรับคอมพิวเตอร์"}
{"word": "desk", "english": "The desk is from the school library.", "thai": "โต๊ะนี้มาจากห้องสมุดโรงเรียน"}
{"word": "desk", "english": "I found a desk in the garage.", "thai": "ฉันเจอโต๊ะในโรงรถ"}
{"word": "desk", "english": "The desk is too small for my books.", "thai": "โต๊ะนี้เล็กเกินไปสำหรับหนังสือของฉัน"}
{"word": "desk", "english": "I need a desk for my math homework.", "thai": "ฉันต้องการโต๊ะสำหรับการบ้านคณิตศาสตร์"}
{"word": "desk", "english": "The desk is from my dad’s office.", "thai": "โต๊ะนี้มาจากออฟฟิศของพ่อ"}
{"word": "desk", "english": "I dropped my notebook under the desk.", "thai": "ฉันทำสมุดบันทึกตกใต้โต๊ะ"}
{"word": "desk", "english": "The desk is too expensive for me.", "thai": "โต๊ะนี้แพงเกินไปสำหรับฉัน"}
{"word": "desk", "english": "I need a desk for my English class.", "thai": "ฉันต้องการโต๊ะสำหรับวิชาภาษาอังกฤษ"}
{"word": "desk", "english": "The desk is from my sister’s room.", "thai": "โต๊ะนี้มาจากห้องของน้องสาว"}
{"word": "desk", "english": "I’m cleaning my desk this afternoon.", "thai": "ฉันจะทำความสะอาดโต๊ะบ่ายนี้"}
{"word": "desk", "english": "The desk is too wobbly to work on.", "thai": "โต๊ะนี้โยกเกินไปที่จะทำงาน"}
{"word": "desk", "english": "I need a desk for my language class.", "thai": "ฉันต้องการโต๊ะสำหรับชั้นเรียนภาษา"}
{"word": "desk", "english": "The desk is from my friend’s house.", "thai": "โต๊ะนี้มาจากบ้านเพื่อน"}
{"word": "desk", "english": "I found a desk in the classroom.", "thai": "ฉันเจอโต๊ะในห้องเรียน"}
{"word": "desk", "english": "The desk is too heavy for this room.", "thai": "โต๊ะนี้หนักเกินไปสำหรับห้องนี้"}
{"word": "desk", "english": "I need a desk for my science project.", "thai": "ฉันต้องการโต๊ะสำหรับโปรเจกต์วิทยาศาสตร์"}
{"word": "desk", "english": "The desk is from the thrift shop.", "thai": "โต๊ะนี้มาจากร้านมือสอง"}
{"word": "desk", "english": "I’m using my desk to write a letter.", "thai": "ฉันใช้โต๊ะเพื่อเขียนจดหมาย"}
{"word": "desk", "english": "The desk is too small for my monitor.", "thai": "โต๊ะนี้เล็กเกินไปสำหรับจอของฉัน"}
{"word": "desk", "english": "I need a desk for my art class.", "thai": "ฉันต้องการโต๊ะสำหรับวิชาศิลปะ"}
{"word": "desk", "english": "The desk is from my old school.", "thai": "โต๊ะนี้มาจากโรงเรียนเก่าของฉัน"}
{"word": "desk", "english": "I dropped my stapler under the desk.", "thai": "ฉันทำที่เย็บกระดาษตกใต้โต๊ะ"}
{"word": "desk", "english": "The desk is too old to look nice.", "thai": "โต๊ะนี้เก่าเกินไปที่จะดูดี"}
{"word": "desk", "english": "I need a desk for my study notes.", "thai": "ฉันต้องการโต๊ะสำหรับโน้ตการเรียน"}
{"word": "desk", "english": "The desk is from the office supply store.", "thai": "โต๊ะนี้มาจากร้านเครื่องเขียน"}
{"word": "desk", "english": "I’m organizing my desk for the week.", "thai": "ฉันกำลังจัดระเบียบโต๊ะสำหรับสัปดาห์นี้"}
{"word": "desk", "english": "The desk is too big for my apartment.", "thai": "โต๊ะนี้ใหญ่เกินไปสำหรับอพาร์ตเมนต์ของฉัน"}
{"word": "desk", "english": "I need a desk for my history class.", "thai": "ฉันต้องการโต๊ะสำหรับวิชาประวัติศาสตร์"}
{"word": "desk", "english": "The desk is from my brother’s room.", "thai": "โต๊ะนี้มาจากห้องของน้องชาย"}
{"word": "desk", "english": "I found a desk in the attic.", "thai": "ฉันเจอโต๊ะในห้องใต้หลังคา"}
{"word": "desk", "english": "The desk is too scratched to use.", "thai": "โต๊ะนี้มีรอยขีดข่วนเกินไปที่จะใช้"}
{"word": "desk", "english": "I need a desk for my vocabulary list.", "thai": "ฉันต้องการโต๊ะสำหรับลิสต์คำศัพท์"}
{"word": "desk", "english": "The desk is from my grandma’s house.", "thai": "โต๊ะนี้มาจากบ้านย่า"}
{"word": "desk", "english": "I’m using my desk to do my homework.", "thai": "ฉันใช้โต๊ะเพื่อทำการบ้าน"}
{"word": "desk", "english": "The desk is too heavy to move.", "thai": "โต๊ะนี้หนักเกินไปที่จะย้าย"}
{"word": "desk", "english": "I need a desk for my meeting notes.", "thai": "ฉันต้องการโต๊ะสำหรับโน้ตการประชุม"}
{"word": "desk", "english": "The desk is from the bookstore.", "thai": "โต๊ะนี้มาจากร้านหนังสือ"}
{"word": "desk", "english": "I dropped my paper under the desk.", "thai": "ฉันทำกระดาษตกใต้โต๊ะ"}
{"word": "desk", "english": "The desk is too wobbly for my laptop.", "thai": "โต๊ะนี้โยกเกินไปสำหรับแล็ปท็อปของฉัน"}
{"word": "desk", "english": "I need a desk for my craft project.", "thai": "ฉันต้องการโต๊ะสำหรับโปรเจกต์งานฝีมือ"}
{"word": "desk", "english": "The desk is from my old job.", "thai": "โต๊ะนี้มาจากงานเก่าของฉัน"}
{"word": "desk", "english": "I’m cleaning my desk for the new year.", "thai": "ฉันกำลังทำความสะอาดโต๊ะสำหรับปีใหม่"}
{"word": "desk", "english": "The desk is too small for my books.", "thai": "โต๊ะนี้เล็กเกินไปสำหรับหนังสือของฉัน"}
{"word": "desk", "english": "I need a desk for my language homework.", "thai": "ฉันต้องการโต๊ะสำหรับการบ้านภาษา"}
{"word": "desk", "english": "The desk is from my friend’s office.", "thai": "โต๊ะนี้มาจากออฟฟิศของเพื่อน"}
{"word": "desk", "english": "I found a desk in the storage room.", "thai": "ฉันเจอโต๊ะในห้องเก็บของ"}
{"word": "desk", "english": "The desk is too old to look good.", "thai": "โต๊ะนี้เก่าเกินไปที่จะดูดี"}
{"word": "desk", "english": "I need a desk for my journal.", "thai": "ฉันต้องการโต๊ะสำหรับไดอารี่"}
{"word": "desk", "english": "The desk is from the school supply room.", "thai": "โต๊ะนี้มาจากห้องเก็บของโรงเรียน"}
{"word": "desk", "english": "I’m using my desk to write a story.", "thai": "ฉันใช้โต๊ะเพื่อเขียนเรื่องราว"}
{"word": "desk", "english": "The desk is too heavy for my room.", "thai": "โต๊ะนี้หนักเกินไปสำหรับห้องของฉัน"}
{"word": "desk", "english": "I need a desk for my budget plan.", "thai": "ฉันต้องการโต๊ะสำหรับแผนงบประมาณ"}
{"word": "desk", "english": "The desk is from my teacher’s room.", "thai": "โต๊ะนี้มาจากห้องของครู"}
{"word": "desk", "english": "I dropped my scissors under the desk.", "thai": "ฉันทำกรรไกรตกใต้โต๊ะ"}
{"word": "desk", "english": "The desk is too big for my space.", "thai": "โต๊ะนี้ใหญ่เกินไปสำหรับพื้นที่ของฉัน"}
{"word": "desk", "english": "I need a desk for my study area.", "thai": "ฉันต้องการโต๊ะสำหรับพื้นที่เรียน"}
{"word": "desk", "english": "The desk is from my old apartment.", "thai": "โต๊ะนี้มาจากอพาร์ตเมนต์เก่าของฉัน"}
{"word": "desk", "english": "I’m organizing my desk for school.", "thai": "ฉันกำลังจัดระเบียบโต๊ะสำหรับโรงเรียน"}
{"word": "desk", "english": "The desk is too scratched for my taste.", "thai": "โต๊ะนี้มีรอยขีดข่วนเกินไปสำหรับรสนิยมของฉัน"}
{"word": "desk", "english": "I need a desk for my vocabulary practice.", "thai": "ฉันต้องการโต๊ะสำหรับฝึกคำศัพท์"}
{"word": "desk", "english": "The desk is from my parents’ house.", "thai": "โต๊ะนี้มาจากบ้านพ่อแม่"}
{"word": "desk", "english": "I found a desk in the basement.", "thai": "ฉันเจอโต๊ะในห้องใต้ดิน"}
{"word": "desk", "english": "The desk is too wobbly to write on.", "thai": "โต๊ะนี้โยกเกินไปที่จะเขียน"}
{"word": "desk", "english": "I need a desk for my work projects.", "thai": "ฉันต้องการโต๊ะสำหรับโปรเจกต์งาน"}
{"word": "desk", "english": "The desk is from the furniture store.", "thai": "โต๊ะนี้มาจากร้านเฟอร์นิเจอร์"}
{"word": "desk", "english": "I’m using my desk to do my taxes.", "thai": "ฉันใช้โต๊ะเพื่อทำภาษี"}
{"word": "desk", "english": "The desk is too small for my office.", "thai": "โต๊ะนี้เล็กเกินไปสำหรับออฟฟิศของฉัน"}
{"word": "desk", "english": "I need a desk for my online classes.", "thai": "ฉันต้องการโต๊ะสำหรับชั้นเรียนออนไลน์"}
{"word": "desk", "english": "The desk is from my old classroom.", "thai": "โต๊ะนี้มาจากห้องเรียนเก่าของฉัน"}
{"word": "desk", "english": "I dropped my tape under the desk.", "thai": "ฉันทำเทปตกใต้โต๊ะ"}
{"word": "desk", "english": "The desk is too heavy for my apartment.", "thai": "โต๊ะนี้หนักเกินไปสำหรับอพาร์ตเมนต์ของฉัน"}
{"word": "desk", "english": "I need a desk for my writing projects.", "thai": "ฉันต้องการโต๊ะสำหรับโปรเจกต์เขียน"}
{"word": "desk", "english": "The desk is from my neighbor’s house.", "thai": "โต๊ะนี้มาจากบ้านเพื่อนบ้าน"}
{"word": "chair", "english": "I need a new chair for my desk.", "thai": "ฉันต้องการเก้าอี้ใหม่สำหรับโต๊ะของฉัน"}
{"word": "chair", "english": "Can you move that chair to the corner?", "thai": "ช่วยย้ายเก้าอี้นั้นไปที่มุมได้ไหม?"}
{"word": "chair", "english": "I left my jacket on the chair.", "thai": "ฉันวางแจ็คเก็ตไว้บนเก้าอี้"}
{"word": "chair", "english": "This chair is too hard to sit on.", "thai": "เก้าอี้นี้แข็งเกินไปที่จะนั่ง"}
{"word": "chair", "english": "I found a chair at the thrift store.", "thai": "ฉันเจอเก้าอี้ที่ร้านมือสอง"}
{"word": "chair", "english": "Do you have an extra chair for the table?", "thai": "คุณมีเก้าอี้สำรองสำหรับโต๊ะไหม?"}
{"word": "chair", "english": "I bought a comfy chair for my room.", "thai": "ฉันซื้อเก้าอี้นุ่มสำหรับห้องของฉัน"}
{"word": "chair", "english": "The chair is wobbly and needs fixing.", "thai": "เก้าอี้โยกเยกและต้องซ่อม"}
{"word": "chair", "english": "I need a chair for my study area.", "thai": "ฉันต้องการเก้าอี้สำหรับพื้นที่เรียน"}
{"word": "chair", "english": "This chair is really heavy to move.", "thai": "เก้าอี้นี้หนักมากที่จะย้าย"}
{"word": "chair", "english": "I left my bag on the chair.", "thai": "ฉันวางกระเป๋าไว้บนเก้าอี้"}
{"word": "chair", "english": "The chair is too big for this room.", "thai": "เก้าอี้นี้ใหญ่เกินไปสำหรับห้องนี้"}
{"word": "chair", "english": "I need a chair for my office.", "thai": "ฉันต้องการเก้าอี้สำหรับออฟฟิศ"}
{"word": "chair", "english": "The chair is scratched on the legs.", "thai": "เก้าอี้มีรอยขีดข่วนที่ขา"}
{"word": "chair", "english": "I found a chair in the garage.", "thai": "ฉันเจอเก้าอี้ในโรงรถ"}
{"word": "chair", "english": "Can you clean the chair for me?", "thai": "ช่วยทำความสะอาดเก้าอี้ให้ฉันหน่อยได้ไหม?"}
{"word": "chair", "english": "The chair is from my old house.", "thai": "เก้าอี้นี้มาจากบ้านเก่าของฉัน"}
{"word": "chair", "english": "I need a chair for my computer desk.", "thai": "ฉันต้องการเก้าอี้สำหรับโต๊ะคอมพิวเตอร์"}
{"word": "chair", "english": "This chair is perfect for reading.", "thai": "เก้าอี้นี้เหมาะสำหรับการอ่าน"}
{"word": "chair", "english": "I dropped my pen under the chair.", "thai": "ฉันทำปากกาตกใต้เก้าอี้"}
{"word": "chair", "english": "The chair is from the furniture store.", "thai": "เก้าอี้นี้มาจากร้านเฟอร์นิเจอร์"}
{"word": "chair", "english": "I need a chair for my new apartment.", "thai": "ฉันต้องการเก้าอี้สำหรับอพาร์ตเมนต์ใหม่"}
{"word": "chair", "english": "The chair is too old to use.", "thai": "เก้าอี้นี้เก่าเกินไปที่จะใช้"}
{"word": "chair", "english": "I’m cleaning the chair today.", "thai": "ฉันกำลังทำความสะอาดเก้าอี้วันนี้"}
{"word": "chair", "english": "The chair is covered in dust.", "thai": "เก้าอี้เต็มไปด้วยฝุ่น"}
{"word": "chair", "english": "I need a chair for my study group.", "thai": "ฉันต้องการเก้าอี้สำหรับกลุ่มเรียน"}
{"word": "chair", "english": "The chair is from my mom’s office.", "thai": "เก้าอี้นี้มาจากออฟฟิศของแม่"}
{"word": "chair", "english": "I found a chair in the classroom.", "thai": "ฉันเจอเก้าอี้ในห้องเรียน"}
{"word": "chair", "english": "The chair is too tall for my desk.", "thai": "เก้าอี้นี้สูงเกินไปสำหรับโต๊ะของฉัน"}
{"word": "chair", "english": "I need a chair for my art projects.", "thai": "ฉันต้องการเก้าอี้สำหรับโปรเจกต์ศิลปะ"}
{"word": "chair", "english": "The chair is from the school library.", "thai": "เก้าอี้นี้มาจากห้องสมุดโรงเรียน"}
{"word": "chair", "english": "I’m using the chair in the kitchen.", "thai": "ฉันใช้เก้าอี้ในครัว"}
{"word": "chair", "english": "The chair is too small for me.", "thai": "เก้าอี้นี้เล็กเกินไปสำหรับฉัน"}
{"word": "chair", "english": "I need a chair for my office work.", "thai": "ฉันต้องการเก้าอี้สำหรับงานออฟฟิศ"}
{"word": "chair", "english": "The chair is from my dad’s office.", "thai": "เก้าอี้นี้มาจากออฟฟิศของพ่อ"}
{"word": "chair", "english": "I dropped something under the chair.", "thai": "ฉันทำของตกใต้เก้าอี้"}
{"word": "chair", "english": "The chair is too expensive for me.", "thai": "เก้าอี้นี้แพงเกินไปสำหรับฉัน"}
{"word": "chair", "english": "I need a chair for my art class.", "thai": "ฉันต้องการเก้าอี้สำหรับวิชาศิลปะ"}
{"word": "chair", "english": "The chair is from my sister’s room.", "thai": "เก้าอี้นี้มาจากห้องของน้องสาว"}
{"word": "chair", "english": "I found a chair in the attic.", "thai": "ฉันเจอเก้าอี้ในห้องใต้หลังคา"}
{"word": "chair", "english": "The chair is too heavy to lift.", "thai": "เก้าอี้นี้หนักเกินไปที่จะยก"}
{"word": "chair", "english": "I need a chair for my study space.", "thai": "ฉันต้องการเก้าอี้สำหรับพื้นที่เรียน"}
{"word": "chair", "english": "The chair is from my old school.", "thai": "เก้าอี้นี้มาจากโรงเรียนเก่าของฉัน"}
{"word": "chair", "english": "I’m cleaning the chair this afternoon.", "thai": "ฉันกำลังทำความสะอาดเก้าอี้บ่ายนี้"}
{"word": "chair", "english": "The chair is too wobbly to sit on.", "thai": "เก้าอี้นี้โยกเยกเกินไปที่จะนั่ง"}
{"word": "chair", "english": "I need a chair for my writing.", "thai": "ฉันต้องการเก้าอี้สำหรับการเขียน"}
{"word": "chair", "english": "The chair is from my friend’s house.", "thai": "เก้าอี้นี้มาจากบ้านเพื่อน"}
{"word": "chair", "english": "I found a chair in the basement.", "thai": "ฉันเจอเก้าอี้ในห้องใต้ดิน"}
{"word": "chair", "english": "The chair is too old to look nice.", "thai": "เก้าอี้นี้เก่าเกินไปที่จะดูดี"}
{"word": "chair", "english": "I need a chair for my math class.", "thai": "ฉันต้องการเก้าอี้สำหรับวิชาคณิตศาสตร์"}
{"word": "chair", "english": "The chair is from my teacher’s classroom.", "thai": "เก้าอี้นี้มาจากห้องเรียนของครู"}
{"word": "chair", "english": "I’m using the chair to do my homework.", "thai": "ฉันใช้เก้าอี้เพื่อทำการบ้าน"}
{"word": "chair", "english": "The chair is too small for my desk.", "thai": "เก้าอี้นี้เล็กเกินไปสำหรับโต๊ะของฉัน"}
{"word": "chair", "english": "I need a chair for my science project.", "thai": "ฉันต้องการเก้าอี้สำหรับโปรเจกต์วิทยาศาสตร์"}
{"word": "chair", "english": "The chair is from my brother’s room.", "thai": "เก้าอี้นี้มาจากห้องของน้องชาย"}
{"word": "chair", "english": "I found a chair in the library.", "thai": "ฉันเจอเก้าอี้ในห้องสมุด"}
{"word": "chair", "english": "The chair is too scratched to use.", "thai": "เก้าอี้นี้มีรอยขีดข่วนเกินไปที่จะใช้"}
{"word": "chair", "english": "I need a chair for my English class.", "thai": "ฉันต้องการเก้าอี้สำหรับวิชาภาษาอังกฤษ"}
{"word": "chair", "english": "The chair is from my old apartment.", "thai": "เก้าอี้นี้มาจากอพาร์ตเมนต์เก่าของฉัน"}
{"word": "chair", "english": "I’m using the chair to do my drawing.", "thai": "ฉันใช้เก้าอี้เพื่อวาดรูป"}
{"word": "chair", "english": "The chair is too tall for my table.", "thai": "เก้าอี้นี้สูงเกินไปสำหรับโต๊ะของฉัน"}
{"word": "chair", "english": "I need a chair for my study nook.", "thai": "ฉันต้องการเก้าอี้สำหรับมุมเรียน"}
{"word": "chair", "english": "The chair is from the hotel.", "thai": "เก้าอี้นี้มาจากโรงแรม"}
{"word": "chair", "english": "I found a chair in the guest room.", "thai": "ฉันเจอเก้าอี้ในห้องรับแขก"}
{"word": "chair", "english": "The chair is too heavy for this room.", "thai": "เก้าอี้นี้หนักเกินไปสำหรับห้องนี้"}
{"word": "chair", "english": "I need a chair for my writing project.", "thai": "ฉันต้องการเก้าอี้สำหรับโปรเจกต์การเขียน"}
{"word": "chair", "english": "The chair is from my grandma’s house.", "thai": "เก้าอี้นี้มาจากบ้านย่า"}
{"word": "chair", "english": "I’m using the chair to do my taxes.", "thai": "ฉันใช้เก้าอี้เพื่อทำภาษี"}
{"word": "chair", "english": "The chair is too small for my workspace.", "thai": "เก้าอี้นี้เล็กเกินไปสำหรับพื้นที่ทำงานของฉัน"}
{"word": "chair", "english": "I need a chair for my history class.", "thai": "ฉันต้องการเก้าอี้สำหรับวิชาประวัติศาสตร์"}
{"word": "chair", "english": "The chair is from my mom’s office.", "thai": "เก้าอี้นี้มาจากออฟฟิศของแม่"}
{"word": "chair", "english": "I found a chair in the storage room.", "thai": "ฉันเจอเก้าอี้ในห้องเก็บของ"}
{"word": "chair", "english": "The chair is too old to keep.", "thai": "เก้าอี้นี้เก่าเกินไปที่จะเก็บไว้"}
{"word": "chair", "english": "I need a chair for my craft projects.", "thai": "ฉันต้องการเก้าอี้สำหรับโปรเจกต์งานฝีมือ"}
{"word": "chair", "english": "The chair is from my friend’s office.", "thai": "เก้าอี้นี้มาจากออฟฟิศของเพื่อน"}
{"word": "chair", "english": "I’m using the chair to write my journal.", "thai": "ฉันใช้เก้าอี้เพื่อเขียนไดอารี่"}
{"word": "chair", "english": "The chair is too big for my room.", "thai": "เก้าอี้นี้ใหญ่เกินไปสำหรับห้องของฉัน"}
{"word": "chair", "english": "I need a chair for my study notes.", "thai": "ฉันต้องการเก้าอี้สำหรับโน้ตการเรียน"}
{"word": "chair", "english": "The chair is from the school supply store.", "thai": "เก้าอี้นี้มาจากร้านเครื่องเขียน"}
{"word": "chair", "english": "I found a chair in the hallway.", "thai": "ฉันเจอเก้าอี้ในโถงทางเดิน"}
{"word": "chair", "english": "The chair is too heavy to move alone.", "thai": "เก้าอี้นี้หนักเกินไปที่จะย้ายคนเดียว"}
{"word": "chair", "english": "I need a chair for my new job.", "thai": "ฉันต้องการเก้าอี้สำหรับงานใหม่"}
{"word": "chair", "english": "The chair is from my old house.", "thai": "เก้าอี้นี้มาจากบ้านเก่าของฉัน"}
{"word": "chair", "english": "I’m using the chair to do my art.", "thai": "ฉันใช้เก้าอี้เพื่อทำศิลปะ"}
{"word": "chair", "english": "The chair is too scratched for my liking.", "thai": "เก้าอี้นี้มีรอยขีดข่วนเกินไปสำหรับฉัน"}
{"word": "chair", "english": "I need a chair for my online classes.", "thai": "ฉันต้องการเก้าอี้สำหรับชั้นเรียนออนไลน์"}
{"word": "chair", "english": "The chair is from my brother’s room.", "thai": "เก้าอี้นี้มาจากห้องของน้องชาย"}
{"word": "chair", "english": "I found a chair in the conference room.", "thai": "ฉันเจอเก้าอี้ในห้องประชุม"}
{"word": "chair", "english": "The chair is too expensive for my budget.", "thai": "เก้าอี้นี้แพงเกินไปสำหรับงบของฉัน"}
{"word": "chair", "english": "I need a chair for my vocabulary practice.", "thai": "ฉันต้องการเก้าอี้สำหรับฝึกคำศัพท์"}
{"word": "chair", "english": "The chair is from my teacher’s office.", "thai": "เก้าอี้นี้มาจากออฟฟิศของครู"}
{"word": "chair", "english": "I’m using the chair to plan my schedule.", "thai": "ฉันใช้เก้าอี้เพื่อวางแผนตารางเวลา"}
{"word": "chair", "english": "The chair is too small for my projects.", "thai": "เก้าอี้นี้เล็กเกินไปสำหรับโปรเจกต์ของฉัน"}
{"word": "chair", "english": "I need a chair for my reading nook.", "thai": "ฉันต้องการเก้าอี้สำหรับมุมอ่านหนังสือ"}
{"word": "chair", "english": "The chair is from my friend’s house.", "thai": "เก้าอี้นี้มาจากบ้านเพื่อน"}
{"word": "chair", "english": "I found a chair in the storage closet.", "thai": "ฉันเจอเก้าอี้ในตู้เก็บของ"}
{"word": "chair", "english": "The chair is too old to keep.", "thai": "เก้าอี้นี้เก่าเกินไปที่จะเก็บไว้"}
{"word": "lamp", "english": "I need a new lamp for my desk.", "thai": "ฉันต้องการโคมไฟใหม่สำหรับโต๊ะของฉัน"}
{"word": "lamp", "english": "Can you turn on the lamp in the corner?", "thai": "ช่วยเปิดโคมไฟที่มุมได้ไหม?"}
{"word": "lamp", "english": "I left my book under the lamp.", "thai": "ฉันวางหนังสือไว้ใต้โคมไฟ"}
{"word": "lamp", "english": "This lamp is too dim for reading.", "thai": "โคมไฟนี้สลัวเกินไปสำหรับการอ่าน"}
{"word": "lamp", "english": "I found a lamp at the thrift store.", "thai": "ฉันเจอโคมไฟที่ร้านมือสอง"}
{"word": "lamp", "english": "Do you have an extra lamp for the room?", "thai": "คุณมีโคมไฟสำรองสำหรับห้องนี้ไหม?"}
{"word": "lamp", "english": "I bought a bright lamp for my office.", "thai": "ฉันซื้อโคมไฟสว่างสำหรับออฟฟิศ"}
{"word": "lamp", "english": "The lamp is flickering and needs fixing.", "thai": "โคมไฟนี้กะพริบและต้องซ่อม"}
{"word": "lamp", "english": "I need a lamp for my study area.", "thai": "ฉันต้องการโคมไฟสำหรับพื้นที่เรียน"}
{"word": "lamp", "english": "This lamp is really heavy to move.", "thai": "โคมไฟนี้หนักมากที่จะย้าย"}
{"word": "lamp", "english": "I left my glasses on the lamp table.", "thai": "ฉันวางแว่นตาไว้บนโต๊ะข้างโคมไฟ"}
{"word": "lamp", "english": "The lamp is too tall for this desk.", "thai": "โคมไฟนี้สูงเกินไปสำหรับโต๊ะนี้"}
{"word": "lamp", "english": "I need a lamp for my bedroom.", "thai": "ฉันต้องการโคมไฟสำหรับห้องนอน"}
{"word": "lamp", "english": "The lamp is scratched on the base.", "thai": "โคมไฟนี้มีรอยขีดข่วนที่ฐาน"}
{"word": "lamp", "english": "I found a lamp in the attic.", "thai": "ฉันเจอโคมไฟในห้องใต้หลังคา"}
{"word": "lamp", "english": "Can you clean the lamp for me?", "thai": "ช่วยทำความสะอาดโคมไฟให้ฉันหน่อยได้ไหม?"}
{"word": "lamp", "english": "The lamp is from my old apartment.", "thai": "โคมไฟนี้มาจากอพาร์ตเมนต์เก่าของฉัน"}
{"word": "lamp", "english": "I need a lamp for my computer desk.", "thai": "ฉันต้องการโคมไฟสำหรับโต๊ะคอมพิวเตอร์"}
{"word": "lamp", "english": "This lamp is perfect for studying.", "thai": "โคมไฟนี้เหมาะสำหรับการเรียน"}
{"word": "lamp", "english": "I dropped my pen under the lamp.", "thai": "ฉันทำปากกาตกใต้โคมไฟ"}
{"word": "lamp", "english": "The lamp is from the furniture store.", "thai": "โคมไฟนี้มาจากร้านเฟอร์นิเจอร์"}
{"word": "lamp", "english": "I need a lamp for my new house.", "thai": "ฉันต้องการโคมไฟสำหรับบ้านใหม่"}
{"word": "lamp", "english": "The lamp is too old to work well.", "thai": "โคมไฟนี้เก่าเกินไปที่จะทำงานได้ดี"}
{"word": "lamp", "english": "I’m cleaning the lamp today.", "thai": "ฉันกำลังทำความสะอาดโคมไฟวันนี้"}
{"word": "lamp", "english": "The lamp is covered in dust.", "thai": "โคมไฟนี้เต็มไปด้วยฝุ่น"}
{"word": "lamp", "english": "I need a lamp for my study group.", "thai": "ฉันต้องการโคมไฟสำหรับกลุ่มเรียน"}
{"word": "lamp", "english": "The lamp is from my mom’s office.", "thai": "โคมไฟนี้มาจากออฟฟิศของแม่"}
{"word": "lamp", "english": "I found a lamp in the classroom.", "thai": "ฉันเจอโคมไฟในห้องเรียน"}
{"word": "lamp", "english": "The lamp is too bright for my eyes.", "thai": "โคมไฟนี้สว่างเกินไปสำหรับตาของฉัน"}
{"word": "lamp", "english": "I need a lamp for my art projects.", "thai": "ฉันต้องการโคมไฟสำหรับโปรเจกต์ศิลปะ"}
{"word": "lamp", "english": "The lamp is from the school library.", "thai": "โคมไฟนี้มาจากห้องสมุดโรงเรียน"}
{"word": "lamp", "english": "I’m using the lamp to read at night.", "thai": "ฉันใช้โคมไฟเพื่ออ่านหนังสือตอนกลางคืน"}
{"word": "lamp", "english": "The lamp is too small for this room.", "thai": "โคมไฟนี้เล็กเกินไปสำหรับห้องนี้"}
{"word": "lamp", "english": "I need a lamp for my office work.", "thai": "ฉันต้องการโคมไฟสำหรับงานออฟฟิศ"}
{"word": "lamp", "english": "The lamp is from my dad’s office.", "thai": "โคมไฟนี้มาจากออฟฟิศของพ่อ"}
{"word": "lamp", "english": "I dropped something under the lamp.", "thai": "ฉันทำของตกใต้โคมไฟ"}
{"word": "lamp", "english": "The lamp is too expensive for me.", "thai": "โคมไฟนี้แพงเกินไปสำหรับฉัน"}
{"word": "lamp", "english": "I need a lamp for my art class.", "thai": "ฉันต้องการโคมไฟสำหรับวิชาศิลปะ"}
{"word": "lamp", "english": "The lamp is from my sister’s room.", "thai": "โคมไฟนี้มาจากห้องของน้องสาว"}
{"word": "lamp", "english": "I found a lamp in the basement.", "thai": "ฉันเจอโคมไฟในห้องใต้ดิน"}
{"word": "lamp", "english": "The lamp is too heavy to move.", "thai": "โคมไฟนี้หนักเกินไปที่จะย้าย"}
{"word": "lamp", "english": "I need a lamp for my study space.", "thai": "ฉันต้องการโคมไฟสำหรับพื้นที่เรียน"}
{"word": "lamp", "english": "The lamp is from my old school.", "thai": "โคมไฟนี้มาจากโรงเรียนเก่าของฉัน"}
{"word": "lamp", "english": "I’m cleaning the lamp this afternoon.", "thai": "ฉันกำลังทำความสะอาดโคมไฟบ่ายนี้"}
{"word": "lamp", "english": "The lamp is too dim for my desk.", "thai": "โคมไฟนี้สลัวเกินไปสำหรับโต๊ะของฉัน"}
{"word": "lamp", "english": "I need a lamp for my writing.", "thai": "ฉันต้องการโคมไฟสำหรับการเขียน"}
{"word": "lamp", "english": "The lamp is from my friend’s house.", "thai": "โคมไฟนี้มาจากบ้านเพื่อน"}
{"word": "lamp", "english": "I found a lamp in the storage room.", "thai": "ฉันเจอโคมไฟในห้องเก็บของ"}
{"word": "lamp", "english": "The lamp is too old to look nice.", "thai": "โคมไฟนี้เก่าเกินไปที่จะดูดี"}
{"word": "lamp", "english": "I need a lamp for my math homework.", "thai": "ฉันต้องการโคมไฟสำหรับการบ้านคณิตศาสตร์"}
{"word": "lamp", "english": "The lamp is from my teacher’s classroom.", "thai": "โคมไฟนี้มาจากห้องเรียนของครู"}
{"word": "lamp", "english": "I’m using the lamp to do my homework.", "thai": "ฉันใช้โคมไฟเพื่อทำการบ้าน"}
{"word": "lamp", "english": "The lamp is too tall for my table.", "thai": "โคมไฟนี้สูงเกินไปสำหรับโต๊ะของฉัน"}
{"word": "lamp", "english": "I need a lamp for my science project.", "thai": "ฉันต้องการโคมไฟสำหรับโปรเจกต์วิทยาศาสตร์"}
{"word": "lamp", "english": "The lamp is from my brother’s room.", "thai": "โคมไฟนี้มาจากห้องของน้องชาย"}
{"word": "lamp", "english": "I found a lamp in the library.", "thai": "ฉันเจอโคมไฟในห้องสมุด"}
{"word": "lamp", "english": "The lamp is too scratched to use.", "thai": "โคมไฟนี้มีรอยขีดข่วนเกินไปที่จะใช้"}
{"word": "lamp", "english": "I need a lamp for my English class.", "thai": "ฉันต้องการโคมไฟสำหรับวิชาภาษาอังกฤษ"}
{"word": "lamp", "english": "The lamp is from my old apartment.", "thai": "โคมไฟนี้มาจากอพาร์ตเมนต์เก่าของฉัน"}
{"word": "lamp", "english": "I’m using the lamp to do my drawing.", "thai": "ฉันใช้โคมไฟเพื่อวาดรูป"}
{"word": "lamp", "english": "The lamp is too bright for my room.", "thai": "โคมไฟนี้สว่างเกินไปสำหรับห้องของฉัน"}
{"word": "lamp", "english": "I need a lamp for my study nook.", "thai": "ฉันต้องการโคมไฟสำหรับมุมเรียน"}
{"word": "lamp", "english": "The lamp is from the hotel.", "thai": "โคมไฟนี้มาจากโรงแรม"}
{"word": "lamp", "english": "I found a lamp in the guest room.", "thai": "ฉันเจอโคมไฟในห้องรับแขก"}
{"word": "lamp", "english": "The lamp is too heavy for this table.", "thai": "โคมไฟนี้หนักเกินไปสำหรับโต๊ะนี้"}
{"word": "lamp", "english": "I need a lamp for my writing project.", "thai": "ฉันต้องการโคมไฟสำหรับโปรเจกต์การเขียน"}
{"word": "lamp", "english": "The lamp is from my grandma’s house.", "thai": "โคมไฟนี้มาจากบ้านย่า"}
{"word": "lamp", "english": "I’m using the lamp to do my taxes.", "thai": "ฉันใช้โคมไฟเพื่อทำภาษี"}
{"word": "lamp", "english": "The lamp is too small for my workspace.", "thai": "โคมไฟนี้เล็กเกินไปสำหรับพื้นที่ทำงานของฉัน"}
{"word": "lamp", "english": "I need a lamp for my history class.", "thai": "ฉันต้องการโคมไฟสำหรับวิชาประวัติศาสตร์"}
{"word": "lamp", "english": "The lamp is from my mom’s office.", "thai": "โคมไฟนี้มาจากออฟฟิศของแม่"}
{"word": "lamp", "english": "I found a lamp in the storage room.", "thai": "ฉันเจอโคมไฟในห้องเก็บของ"}
{"word": "lamp", "english": "The lamp is too old to keep.", "thai": "โคมไฟนี้เก่าเกินไปที่จะเก็บไว้"}
{"word": "lamp", "english": "I need a lamp for my craft projects.", "thai": "ฉันต้องการโคมไฟสำหรับโปรเจกต์งานฝีมือ"}
{"word": "lamp", "english": "The lamp is from my friend’s office.", "thai": "โคมไฟนี้มาจากออฟฟิศของเพื่อน"}
{"word": "lamp", "english": "I’m using the lamp to write my journal.", "thai": "ฉันใช้โคมไฟเพื่อเขียนไดอารี่"}
{"word": "lamp", "english": "The lamp is too big for my room.", "thai": "โคมไฟนี้ใหญ่เกินไปสำหรับห้องของฉัน"}
{"word": "lamp", "english": "I need a lamp for my study notes.", "thai": "ฉันต้องการโคมไฟสำหรับโน้ตการเรียน"}
{"word": "lamp", "english": "The lamp is from the school supply store.", "thai": "โคมไฟนี้มาจากร้านเครื่องเขียน"}
{"word": "lamp", "english": "I found a lamp in the hallway.", "thai": "ฉันเจอโคมไฟในโถงทางเดิน"}
{"word": "lamp", "english": "The lamp is too heavy to move alone.", "thai": "โคมไฟนี้หนักเกินไปที่จะย้ายคนเดียว"}
{"word": "lamp", "english": "I need a lamp for my new job.", "thai": "ฉันต้องการโคมไฟสำหรับงานใหม่"}
{"word": "lamp", "english": "The lamp is from my old house.", "thai": "โคมไฟนี้มาจากบ้านเก่าของฉัน"}
{"word": "lamp", "english": "I’m using the lamp to do my art.", "thai": "ฉันใช้โคมไฟเพื่อทำศิลปะ"}
{"word": "lamp", "english": "The lamp is too scratched for my liking.", "thai": "โคมไฟนี้มีรอยขีดข่วนเกินไปสำหรับฉัน"}
{"word": "lamp", "english": "I need a lamp for my online classes.", "thai": "ฉันต้องการโคมไฟสำหรับชั้นเรียนออนไลน์"}
{"word": "lamp", "english": "The lamp is from my brother’s room.", "thai": "โคมไฟนี้มาจากห้องของน้องชาย"}
{"word": "lamp", "english": "I found a lamp in the conference room.", "thai": "ฉันเจอโคมไฟในห้องประชุม"}
{"word": "lamp", "english": "The lamp is too expensive for my budget.", "thai": "โคมไฟนี้แพงเกินไปสำหรับงบของฉัน"}
{"word": "lamp", "english": "I need a lamp for my vocabulary practice.", "thai": "ฉันต้องการโคมไฟสำหรับฝึกคำศัพท์"}
{"word": "lamp", "english": "The lamp is from my teacher’s office.", "thai": "โคมไฟนี้มาจากออฟฟิศของครู"}
{"word": "lamp", "english": "I’m using the lamp to plan my schedule.", "thai": "ฉันใช้โคมไฟเพื่อวางแผนตารางเวลา"}
{"word": "lamp", "english": "The lamp is too small for my projects.", "thai": "โคมไฟนี้เล็กเกินไปสำหรับโปรเจกต์ของฉัน"}
{"word": "lamp", "english": "I need a lamp for my reading nook.", "thai": "ฉันต้องการโคมไฟสำหรับมุมอ่านหนังสือ"}
{"word": "lamp", "english": "The lamp is from my friend’s house.", "thai": "โคมไฟนี้มาจากบ้านเพื่อน"}
{"word": "lamp", "english": "I found a lamp in the storage closet.", "thai": "ฉันเจอโคมไฟในตู้เก็บของ"}
{"word": "lamp", "english": "The lamp is too old to keep.", "thai": "โคมไฟนี้เก่าเกินไปที่จะเก็บไว้"}
{"word": "computer", "english": "I need a new computer for my work.", "thai": "ฉันต้องการคอมพิวเตอร์ใหม่สำหรับงานของฉัน"}
{"word": "computer", "english": "Can you fix my computer? It’s slow.", "thai": "ช่วยซ่อมคอมพิวเตอร์ของฉันได้ไหม? มันช้า"}
{"word": "computer", "english": "I left my notes on the computer.", "thai": "ฉันวางโน้ตไว้ในคอมพิวเตอร์"}
{"word": "computer", "english": "This computer is too old to run games.", "thai": "คอมพิวเตอร์เครื่องนี้เก่าเกินไปที่จะเล่นเกม"}
{"word": "computer", "english": "I found a computer at the electronics store.", "thai": "ฉันเจอคอมพิวเตอร์ที่ร้านเครื่องใช้ไฟฟ้า"}
{"word": "computer", "english": "Do you have a computer I can use?", "thai": "คุณมีคอมพิวเตอร์ให้ฉันใช้ได้ไหม?"}
{"word": "computer", "english": "I bought a fast computer for school.", "thai": "ฉันซื้อคอมพิวเตอร์เร็วสำหรับโรงเรียน"}
{"word": "computer", "english": "The computer crashed during my project.", "thai": "คอมพิวเตอร์ล่มระหว่างโปรเจกต์ของฉัน"}
{"word": "computer", "english": "I need a computer for my homework.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับการบ้าน"}
{"word": "computer", "english": "This computer is really heavy to carry.", "thai": "คอมพิวเตอร์เครื่องนี้หนักมากที่จะพก"}
{"word": "computer", "english": "I left my file open on the computer.", "thai": "ฉันทิ้งไฟล์ไว้เปิดในคอมพิวเตอร์"}
{"word": "computer", "english": "The computer is too slow for this software.", "thai": "คอมพิวเตอร์เครื่องนี้ช้าเกินไปสำหรับซอฟต์แวร์นี้"}
{"word": "computer", "english": "I need a computer for my online class.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับชั้นเรียนออนไลน์"}
{"word": "computer", "english": "The computer screen is scratched.", "thai": "หน้าจอคอมพิวเตอร์มีรอยขีดข่วน"}
{"word": "computer", "english": "I found a computer in the office.", "thai": "ฉันเจอคอมพิวเตอร์ในออฟฟิศ"}
{"word": "computer", "english": "Can you restart the computer for me?", "thai": "ช่วยรีสตาร์ทคอมพิวเตอร์ให้ฉันหน่อยได้ไหม?"}
{"word": "computer", "english": "The computer is from my old job.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากงานเก่าของฉัน"}
{"word": "computer", "english": "I need a computer for my study area.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับพื้นที่เรียน"}
{"word": "computer", "english": "This computer is perfect for coding.", "thai": "คอมพิวเตอร์เครื่องนี้เหมาะสำหรับการเขียนโค้ด"}
{"word": "computer", "english": "I dropped my mouse next to the computer.", "thai": "ฉันทำเมาส์ตกข้างคอมพิวเตอร์"}
{"word": "computer", "english": "The computer is from the tech store.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากร้านเทคโนโลยี"}
{"word": "computer", "english": "I need a computer for my new apartment.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับอพาร์ตเมนต์ใหม่"}
{"word": "computer", "english": "The computer is too old to update.", "thai": "คอมพิวเตอร์เครื่องนี้เก่าเกินไปที่จะอัปเดต"}
{"word": "computer", "english": "I’m cleaning the computer today.", "thai": "ฉันกำลังทำความสะอาดคอมพิวเตอร์วันนี้"}
{"word": "computer", "english": "The computer is covered in dust.", "thai": "คอมพิวเตอร์เครื่องนี้เต็มไปด้วยฝุ่น"}
{"word": "computer", "english": "I need a computer for my study group.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับกลุ่มเรียน"}
{"word": "computer", "english": "The computer is from my mom’s office.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากออฟฟิศของแม่"}
{"word": "computer", "english": "I found a computer in the classroom.", "thai": "ฉันเจอคอมพิวเตอร์ในห้องเรียน"}
{"word": "computer", "english": "The computer is too slow for my work.", "thai": "คอมพิวเตอร์เครื่องนี้ช้าเกินไปสำหรับงานของฉัน"}
{"word": "computer", "english": "I need a computer for my art projects.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับโปรเจกต์ศิลปะ"}
{"word": "computer", "english": "The computer is from the school lab.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากห้องปฏิบัติการโรงเรียน"}
{"word": "computer", "english": "I’m using the computer to do my homework.", "thai": "ฉันใช้คอมพิวเตอร์เพื่อทำการบ้าน"}
{"word": "computer", "english": "The computer is too big for my desk.", "thai": "คอมพิวเตอร์เครื่องนี้ใหญ่เกินไปสำหรับโต๊ะของฉัน"}
{"word": "computer", "english": "I need a computer for my office work.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับงานออฟฟิศ"}
{"word": "computer", "english": "The computer is from my dad’s office.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากออฟฟิศของพ่อ"}
{"word": "computer", "english": "I dropped my USB next to the computer.", "thai": "ฉันทำยูเอสบีตกข้างคอมพิวเตอร์"}
{"word": "computer", "english": "The computer is too expensive for me.", "thai": "คอมพิวเตอร์เครื่องนี้แพงเกินไปสำหรับฉัน"}
{"word": "computer", "english": "I need a computer for my art class.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับวิชาศิลปะ"}
{"word": "computer", "english": "The computer is from my sister’s room.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากห้องของน้องสาว"}
{"word": "computer", "english": "I found a computer in the storage room.", "thai": "ฉันเจอคอมพิวเตอร์ในห้องเก็บของ"}
{"word": "computer", "english": "The computer is too heavy to move.", "thai": "คอมพิวเตอร์เครื่องนี้หนักเกินไปที่จะย้าย"}
{"word": "computer", "english": "I need a computer for my study space.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับพื้นที่เรียน"}
{"word": "computer", "english": "The computer is from my old school.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากโรงเรียนเก่าของฉัน"}
{"word": "computer", "english": "I’m cleaning the computer screen today.", "thai": "ฉันกำลังทำความสะอาดหน้าจอคอมพิวเตอร์วันนี้"}
{"word": "computer", "english": "The computer is too slow for gaming.", "thai": "คอมพิวเตอร์เครื่องนี้ช้าเกินไปสำหรับเล่นเกม"}
{"word": "computer", "english": "I need a computer for my writing.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับการเขียน"}
{"word": "computer", "english": "The computer is from my friend’s house.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากบ้านเพื่อน"}
{"word": "computer", "english": "I found a computer in the basement.", "thai": "ฉันเจอคอมพิวเตอร์ในห้องใต้ดิน"}
{"word": "computer", "english": "The computer is too old to run well.", "thai": "คอมพิวเตอร์เครื่องนี้เก่าเกินไปที่จะทำงานได้ดี"}
{"word": "computer", "english": "I need a computer for my math homework.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับการบ้านคณิตศาสตร์"}
{"word": "computer", "english": "The computer is from my teacher’s office.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากออฟฟิศของครู"}
{"word": "computer", "english": "I’m using the computer to do my research.", "thai": "ฉันใช้คอมพิวเตอร์เพื่อทำวิจัย"}
{"word": "computer", "english": "The computer is too big for my room.", "thai": "คอมพิวเตอร์เครื่องนี้ใหญ่เกินไปสำหรับห้องของฉัน"}
{"word": "computer", "english": "I need a computer for my science project.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับโปรเจกต์วิทยาศาสตร์"}
{"word": "computer", "english": "The computer is from my brother’s room.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากห้องของน้องชาย"}
{"word": "computer", "english": "I found a computer in the library.", "thai": "ฉันเจอคอมพิวเตอร์ในห้องสมุด"}
{"word": "computer", "english": "The computer is too slow for my needs.", "thai": "คอมพิวเตอร์เครื่องนี้ช้าเกินไปสำหรับความต้องการของฉัน"}
{"word": "computer", "english": "I need a computer for my English class.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับวิชาภาษาอังกฤษ"}
{"word": "computer", "english": "The computer is from my old apartment.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากอพาร์ตเมนต์เก่าของฉัน"}
{"word": "computer", "english": "I’m using the computer to edit photos.", "thai": "ฉันใช้คอมพิวเตอร์เพื่อแก้ไขรูปภาพ"}
{"word": "computer", "english": "The computer is too heavy for my desk.", "thai": "คอมพิวเตอร์เครื่องนี้หนักเกินไปสำหรับโต๊ะของฉัน"}
{"word": "computer", "english": "I need a computer for my study nook.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับมุมเรียน"}
{"word": "computer", "english": "The computer is from the hotel.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากโรงแรม"}
{"word": "computer", "english": "I found a computer in the guest room.", "thai": "ฉันเจอคอมพิวเตอร์ในห้องรับแขก"}
{"word": "computer", "english": "The computer is too old for this software.", "thai": "คอมพิวเตอร์เครื่องนี้เก่าเกินไปสำหรับซอฟต์แวร์นี้"}
{"word": "computer", "english": "I need a computer for my writing project.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับโปรเจกต์การเขียน"}
{"word": "computer", "english": "The computer is from my grandma’s house.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากบ้านย่า"}
{"word": "computer", "english": "I’m using the computer to do my taxes.", "thai": "ฉันใช้คอมพิวเตอร์เพื่อทำภาษี"}
{"word": "computer", "english": "The computer is too slow for my work.", "thai": "คอมพิวเตอร์เครื่องนี้ช้าเกินไปสำหรับงานของฉัน"}
{"word": "computer", "english": "I need a computer for my history class.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับวิชาประวัติศาสตร์"}
{"word": "computer", "english": "The computer is from my mom’s office.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากออฟฟิศของแม่"}
{"word": "computer", "english": "I found a computer in the storage room.", "thai": "ฉันเจอคอมพิวเตอร์ในห้องเก็บของ"}
{"word": "computer", "english": "The computer is too old to keep.", "thai": "คอมพิวเตอร์เครื่องนี้เก่าเกินไปที่จะเก็บไว้"}
{"word": "computer", "english": "I need a computer for my craft projects.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับโปรเจกต์งานฝีมือ"}
{"word": "computer", "english": "The computer is from my friend’s office.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากออฟฟิศของเพื่อน"}
{"word": "computer", "english": "I’m using the computer to write my journal.", "thai": "ฉันใช้คอมพิวเตอร์เพื่อเขียนไดอารี่"}
{"word": "computer", "english": "The computer is too big for my workspace.", "thai": "คอมพิวเตอร์เครื่องนี้ใหญ่เกินไปสำหรับพื้นที่ทำงานของฉัน"}
{"word": "computer", "english": "I need a computer for my study notes.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับโน้ตการเรียน"}
{"word": "computer", "english": "The computer is from the school supply store.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากร้านเครื่องเขียน"}
{"word": "computer", "english": "I found a computer in the hallway.", "thai": "ฉันเจอคอมพิวเตอร์ในโถงทางเดิน"}
{"word": "computer", "english": "The computer is too heavy to move alone.", "thai": "คอมพิวเตอร์เครื่องนี้หนักเกินไปที่จะย้ายคนเดียว"}
{"word": "computer", "english": "I need a computer for my new job.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับงานใหม่"}
{"word": "computer", "english": "The computer is from my old house.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากบ้านเก่าของฉัน"}
{"word": "computer", "english": "I’m using the computer to do my art.", "thai": "ฉันใช้คอมพิวเตอร์เพื่อทำศิลปะ"}
{"word": "computer", "english": "The computer is too scratched for my liking.", "thai": "คอมพิวเตอร์เครื่องนี้มีรอยขีดข่วนเกินไปสำหรับฉัน"}
{"word": "computer", "english": "I need a computer for my online classes.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับชั้นเรียนออนไลน์"}
{"word": "computer", "english": "The computer is from my brother’s room.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากห้องของน้องชาย"}
{"word": "computer", "english": "I found a computer in the conference room.", "thai": "ฉันเจอคอมพิวเตอร์ในห้องประชุม"}
{"word": "computer", "english": "The computer is too expensive for my budget.", "thai": "คอมพิวเตอร์เครื่องนี้แพงเกินไปสำหรับงบของฉัน"}
{"word": "computer", "english": "I need a computer for my vocabulary practice.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับฝึกคำศัพท์"}
{"word": "computer", "english": "The computer is from my teacher’s office.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากออฟฟิศของครู"}
{"word": "computer", "english": "I’m using the computer to plan my schedule.", "thai": "ฉันใช้คอมพิวเตอร์เพื่อวางแผนตารางเวลา"}
{"word": "computer", "english": "The computer is too slow for my projects.", "thai": "คอมพิวเตอร์เครื่องนี้ช้าเกินไปสำหรับโปรเจกต์ของฉัน"}
{"word": "computer", "english": "I need a computer for my reading nook.", "thai": "ฉันต้องการคอมพิวเตอร์สำหรับมุมอ่านหนังสือ"}
{"word": "computer", "english": "The computer is from my friend’s house.", "thai": "คอมพิวเตอร์เครื่องนี้มาจากบ้านเพื่อน"}
{"word": "computer", "english": "I found a computer in the storage closet.", "thai": "ฉันเจอคอมพิวเตอร์ในตู้เก็บของ"}
{"word": "computer", "english": "The computer is too old to keep.", "thai": "คอมพิวเตอร์เครื่องนี้เก่าเกินไปที่จะเก็บไว้"}
{"word": "printer", "english": "I need a new printer for my office.", "thai": "ฉันต้องการเครื่องพิมพ์ใหม่สำหรับออฟฟิศของฉัน"}
{"word": "printer", "english": "Can you fix the printer? It’s jammed.", "thai": "ช่วยซ่อมเครื่องพิมพ์ได้ไหม? มันติด"}
{"word": "printer", "english": "I left my paper next to the printer.", "thai": "ฉันวางกระดาษไว้ข้างเครื่องพิมพ์"}
{"word": "printer", "english": "This printer is too slow for my work.", "thai": "เครื่องพิมพ์นี้ช้าเกินไปสำหรับงานของฉัน"}
{"word": "printer", "english": "I found a printer at the electronics store.", "thai": "ฉันเจอเครื่องพิมพ์ที่ร้านเครื่องใช้ไฟฟ้า"}
{"word": "printer", "english": "Do you have a printer I can use?", "thai": "คุณมีเครื่องพิมพ์ให้ฉันใช้ได้ไหม?"}
{"word": "printer", "english": "I bought a wireless printer for home.", "thai": "ฉันซื้อเครื่องพิมพ์ไร้สายสำหรับบ้าน"}
{"word": "printer", "english": "The printer is out of ink again.", "thai": "เครื่องพิมพ์หมึกหมดอีกแล้ว"}
{"word": "printer", "english": "I need a printer for my homework.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับการบ้าน"}
{"word": "printer", "english": "This printer is really heavy to move.", "thai": "เครื่องพิมพ์นี้หนักมากที่จะย้าย"}
{"word": "printer", "english": "I left my document in the printer.", "thai": "ฉันทิ้งเอกสารไว้ในเครื่องพิมพ์"}
{"word": "printer", "english": "The printer is too old to work well.", "thai": "เครื่องพิมพ์นี้เก่าเกินไปที่จะทำงานได้ดี"}
{"word": "printer", "english": "I need a printer for my study area.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับพื้นที่เรียน"}
{"word": "printer", "english": "The printer is making weird noises.", "thai": "เครื่องพิมพ์ส่งเสียงแปลกๆ"}
{"word": "printer", "english": "I found a printer in the office.", "thai": "ฉันเจอเครื่องพิมพ์ในออฟฟิศ"}
{"word": "printer", "english": "Can you load paper in the printer?", "thai": "ช่วยใส่กระดาษในเครื่องพิมพ์ได้ไหม?"}
{"word": "printer", "english": "The printer is from my old job.", "thai": "เครื่องพิมพ์นี้มาจากงานเก่าของฉัน"}
{"word": "printer", "english": "I need a printer for my assignments.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับงานที่ได้รับมอบหมาย"}
{"word": "printer", "english": "This printer is perfect for photos.", "thai": "เครื่องพิมพ์นี้เหมาะสำหรับพิมพ์รูป"}
{"word": "printer", "english": "I dropped my pen near the printer.", "thai": "ฉันทำปากกาตกใกล้เครื่องพิมพ์"}
{"word": "printer", "english": "The printer is from the tech store.", "thai": "เครื่องพิมพ์นี้มาจากร้านเทคโนโลยี"}
{"word": "printer", "english": "I need a printer for my new apartment.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับอพาร์ตเมนต์ใหม่"}
{"word": "printer", "english": "The printer is too slow to print color.", "thai": "เครื่องพิมพ์นี้ช้าเกินไปที่จะพิมพ์สี"}
{"word": "printer", "english": "I’m cleaning the printer today.", "thai": "ฉันกำลังทำความสะอาดเครื่องพิมพ์วันนี้"}
{"word": "printer", "english": "The printer is covered in dust.", "thai": "เครื่องพิมพ์นี้เต็มไปด้วยฝุ่น"}
{"word": "printer", "english": "I need a printer for my study group.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับกลุ่มเรียน"}
{"word": "printer", "english": "The printer is from my mom’s office.", "thai": "เครื่องพิมพ์นี้มาจากออฟฟิศของแม่"}
{"word": "printer", "english": "I found a printer in the classroom.", "thai": "ฉันเจอเครื่องพิมพ์ในห้องเรียน"}
{"word": "printer", "english": "The printer is out of toner.", "thai": "เครื่องพิมพ์นี้ผงหมึกหมด"}
{"word": "printer", "english": "I need a printer for my art projects.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับโปรเจกต์ศิลปะ"}
{"word": "printer", "english": "The printer is from the school lab.", "thai": "เครื่องพิมพ์นี้มาจากห้องปฏิบัติการโรงเรียน"}
{"word": "printer", "english": "I’m using the printer for my homework.", "thai": "ฉันใช้เครื่องพิมพ์สำหรับการบ้าน"}
{"word": "printer", "english": "The printer is too big for my desk.", "thai": "เครื่องพิมพ์นี้ใหญ่เกินไปสำหรับโต๊ะของฉัน"}
{"word": "printer", "english": "I need a printer for my office work.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับงานออฟฟิศ"}
{"word": "printer", "english": "The printer is from my dad’s office.", "thai": "เครื่องพิมพ์นี้มาจากออฟฟิศของพ่อ"}
{"word": "printer", "english": "I dropped my paper near the printer.", "thai": "ฉันทำกระดาษตกใกล้เครื่องพิมพ์"}
{"word": "printer", "english": "The printer is too expensive for me.", "thai": "เครื่องพิมพ์นี้แพงเกินไปสำหรับฉัน"}
{"word": "printer", "english": "I need a printer for my art class.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับวิชาศิลปะ"}
{"word": "printer", "english": "The printer is from my sister’s room.", "thai": "เครื่องพิมพ์นี้มาจากห้องของน้องสาว"}
{"word": "printer", "english": "I found a printer in the storage room.", "thai": "ฉันเจอเครื่องพิมพ์ในห้องเก็บของ"}
{"word": "printer", "english": "The printer is too heavy to move.", "thai": "เครื่องพิมพ์นี้หนักเกินไปที่จะย้าย"}
{"word": "printer", "english": "I need a printer for my study space.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับพื้นที่เรียน"}
{"word": "printer", "english": "The printer is from my old school.", "thai": "เครื่องพิมพ์นี้มาจากโรงเรียนเก่าของฉัน"}
{"word": "printer", "english": "I’m cleaning the printer tray today.", "thai": "ฉันกำลังทำความสะอาดถาดเครื่องพิมพ์วันนี้"}
{"word": "printer", "english": "The printer is too slow for large files.", "thai": "เครื่องพิมพ์นี้ช้าเกินไปสำหรับไฟล์ใหญ่"}
{"word": "printer", "english": "I need a printer for my writing.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับการเขียน"}
{"word": "printer", "english": "The printer is from my friend’s house.", "thai": "เครื่องพิมพ์นี้มาจากบ้านเพื่อน"}
{"word": "printer", "english": "I found a printer in the basement.", "thai": "ฉันเจอเครื่องพิมพ์ในห้องใต้ดิน"}
{"word": "printer", "english": "The printer is too old to print well.", "thai": "เครื่องพิมพ์นี้เก่าเกินไปที่จะพิมพ์ได้ดี"}
{"word": "printer", "english": "I need a printer for my math homework.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับการบ้านคณิตศาสตร์"}
{"word": "printer", "english": "The printer is from my teacher’s office.", "thai": "เครื่องพิมพ์นี้มาจากออฟฟิศของครู"}
{"word": "printer", "english": "I’m using the printer for my report.", "thai": "ฉันใช้เครื่องพิมพ์สำหรับรายงาน"}
{"word": "printer", "english": "The printer is too big for my room.", "thai": "เครื่องพิมพ์นี้ใหญ่เกินไปสำหรับห้องของฉัน"}
{"word": "printer", "english": "I need a printer for my science project.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับโปรเจกต์วิทยาศาสตร์"}
{"word": "printer", "english": "The printer is from my brother’s room.", "thai": "เครื่องพิมพ์นี้มาจากห้องของน้องชาย"}
{"word": "printer", "english": "I found a printer in the library.", "thai": "ฉันเจอเครื่องพิมพ์ในห้องสมุด"}
{"word": "printer", "english": "The printer is too slow for my needs.", "thai": "เครื่องพิมพ์นี้ช้าเกินไปสำหรับความต้องการของฉัน"}
{"word": "printer", "english": "I need a printer for my English class.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับวิชาภาษาอังกฤษ"}
{"word": "printer", "english": "The printer is from my old apartment.", "thai": "เครื่องพิมพ์นี้มาจากอพาร์ตเมนต์เก่าของฉัน"}
{"word": "printer", "english": "I’m using the printer to print photos.", "thai": "ฉันใช้เครื่องพิมพ์เพื่อพิมพ์รูปภาพ"}
{"word": "printer", "english": "The printer is too heavy for my desk.", "thai": "เครื่องพิมพ์นี้หนักเกินไปสำหรับโต๊ะของฉัน"}
{"word": "printer", "english": "I need a printer for my study nook.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับมุมเรียน"}
{"word": "printer", "english": "The printer is from the hotel.", "thai": "เครื่องพิมพ์นี้มาจากโรงแรม"}
{"word": "printer", "english": "I found a printer in the guest room.", "thai": "ฉันเจอเครื่องพิมพ์ในห้องรับแขก"}
{"word": "printer", "english": "The printer is too old for this software.", "thai": "เครื่องพิมพ์นี้เก่าเกินไปสำหรับซอฟต์แวร์นี้"}
{"word": "printer", "english": "I need a printer for my writing project.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับโปรเจกต์การเขียน"}
{"word": "printer", "english": "The printer is from my grandma’s house.", "thai": "เครื่องพิมพ์นี้มาจากบ้านย่า"}
{"word": "printer", "english": "I’m using the printer to print my notes.", "thai": "ฉันใช้เครื่องพิมพ์เพื่อพิมพ์โน้ต"}
{"word": "printer", "english": "The printer is too slow for my work.", "thai": "เครื่องพิมพ์นี้ช้าเกินไปสำหรับงานของฉัน"}
{"word": "printer", "english": "I need a printer for my history class.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับวิชาประวัติศาสตร์"}
{"word": "printer", "english": "The printer is from my mom’s office.", "thai": "เครื่องพิมพ์นี้มาจากออฟฟิศของแม่"}
{"word": "printer", "english": "I found a printer in the storage room.", "thai": "ฉันเจอเครื่องพิมพ์ในห้องเก็บของ"}
{"word": "printer", "english": "The printer is too old to keep.", "thai": "เครื่องพิมพ์นี้เก่าเกินไปที่จะเก็บไว้"}
{"word": "printer", "english": "I need a printer for my craft projects.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับโปรเจกต์งานฝีมือ"}
{"word": "printer", "english": "The printer is from my friend’s office.", "thai": "เครื่องพิมพ์นี้มาจากออฟฟิศของเพื่อน"}
{"word": "printer", "english": "I’m using the printer to print my essay.", "thai": "ฉันใช้เครื่องพิมพ์เพื่อพิมพ์เรียงความ"}
{"word": "printer", "english": "The printer is too big for my workspace.", "thai": "เครื่องพิมพ์นี้ใหญ่เกินไปสำหรับพื้นที่ทำงานของฉัน"}
{"word": "printer", "english": "I need a printer for my study notes.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับโน้ตการเรียน"}
{"word": "printer", "english": "The printer is from the school supply store.", "thai": "เครื่องพิมพ์นี้มาจากร้านเครื่องเขียน"}
{"word": "printer", "english": "I found a printer in the hallway.", "thai": "ฉันเจอเครื่องพิมพ์ในโถงทางเดิน"}
{"word": "printer", "english": "The printer is too heavy to move alone.", "thai": "เครื่องพิมพ์นี้หนักเกินไปที่จะย้ายคนเดียว"}
{"word": "printer", "english": "I need a printer for my new job.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับงานใหม่"}
{"word": "printer", "english": "The printer is from my old house.", "thai": "เครื่องพิมพ์นี้มาจากบ้านเก่าของฉัน"}
{"word": "printer", "english": "I’m using the printer to print a poster.", "thai": "ฉันใช้เครื่องพิมพ์เพื่อพิมพ์โปสเตอร์"}
{"word": "printer", "english": "The printer is too slow for my projects.", "thai": "เครื่องพิมพ์นี้ช้าเกินไปสำหรับโปรเจกต์ของฉัน"}
{"word": "printer", "english": "I need a printer for my reading nook.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับมุมอ่านหนังสือ"}
{"word": "printer", "english": "The printer is from my friend’s house.", "thai": "เครื่องพิมพ์นี้มาจากบ้านเพื่อน"}
{"word": "printer", "english": "I found a printer in the storage closet.", "thai": "ฉันเจอเครื่องพิมพ์ในตู้เก็บของ"}
{"word": "printer", "english": "The printer is too old to keep.", "thai": "เครื่องพิมพ์นี้เก่าเกินไปที่จะเก็บไว้"}
{"word": "printer", "english": "I need a printer for my vocabulary practice.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับฝึกคำศัพท์"}
{"word": "printer", "english": "The printer is from my teacher’s office.", "thai": "เครื่องพิมพ์นี้มาจากออฟฟิศของครู"}
{"word": "printer", "english": "I’m using the printer to print my schedule.", "thai": "ฉันใช้เครื่องพิมพ์เพื่อพิมพ์ตารางเวลา"}
{"word": "printer", "english": "The printer is too expensive for my budget.", "thai": "เครื่องพิมพ์นี้แพงเกินไปสำหรับงบของฉัน"}
{"word": "printer", "english": "I need a printer for my online classes.", "thai": "ฉันต้องการเครื่องพิมพ์สำหรับชั้นเรียนออนไลน์"}
{"word": "printer", "english": "The printer is from my brother’s room.", "thai": "เครื่องพิมพ์นี้มาจากห้องของน้องชาย"}
{"word": "printer", "english": "I found a printer in the conference room.", "thai": "ฉันเจอเครื่องพิมพ์ในห้องประชุม"}
{"word": "printer", "english": "The printer is too slow for my assignments.", "thai": "เครื่องพิมพ์นี้ช้าเกินไปสำหรับงานที่ได้รับมอบหมาย"}
{"word": "pencil", "english": "I need a pencil to write my notes.", "thai": "ฉันต้องการดินสอเพื่อเขียนโน้ต"}
{"word": "pencil", "english": "Can you lend me a pencil for the test?", "thai": "ยืมดินสอให้ฉันสำหรับสอบหน่อยได้ไหม?"}
{"word": "pencil", "english": "I lost my pencil in the classroom.", "thai": "ฉันทำดินสอหายในห้องเรียน"}
{"word": "pencil", "english": "This pencil is too dull to write with.", "thai": "ดินสอนี้ทื่อเกินไปที่จะเขียน"}
{"word": "pencil", "english": "I found a pencil under the desk.", "thai": "ฉันเจอดินสออยู่ใต้โต๊ะ"}
{"word": "pencil", "english": "Do you have a spare pencil I can use?", "thai": "คุณมีดินสอสำรองให้ฉันใช้ได้ไหม?"}
{"word": "pencil", "english": "I bought a new pencil for my sketchbook.", "thai": "ฉันซื้อดินสอใหม่สำหรับสมุดร่าง"}
{"word": "pencil", "english": "The pencil broke while I was writing.", "thai": "ดินสอหักตอนฉันกำลังเขียน"}
{"word": "pencil", "english": "I need a pencil for my math homework.", "thai": "ฉันต้องการดินสอสำหรับการบ้านคณิตศาสตร์"}
{"word": "pencil", "english": "This pencil is really sharp.", "thai": "ดินสอนี้คมมาก"}
{"word": "pencil", "english": "I left my pencil on the table.", "thai": "ฉันวางดินสอไว้บนโต๊ะ"}
{"word": "pencil", "english": "The pencil rolled off the desk.", "thai": "ดินสอกลิ้งตกจากโต๊ะ"}
{"word": "pencil", "english": "I need a pencil to mark my book.", "thai": "ฉันต้องการดินสอเพื่อทำเครื่องหมายในหนังสือ"}
{"word": "pencil", "english": "This pencil is too short to use.", "thai": "ดินสอนี้สั้นเกินไปที่จะใช้"}
{"word": "pencil", "english": "I found a pencil in my backpack.", "thai": "ฉันเจอดินสอในกระเป๋าเป้"}
{"word": "pencil", "english": "Can you grab a pencil from the drawer?", "thai": "ช่วยหยิบดินสอจากลิ้นชักมาให้หน่อยได้ไหม?"}
{"word": "pencil", "english": "The pencil is stuck in my pocket.", "thai": "ดินสอติดอยู่ในกระเป๋าของฉัน"}
{"word": "pencil", "english": "I need a pencil for my art class.", "thai": "ฉันต้องการดินสอสำหรับวิชาศิลปะ"}
{"word": "pencil", "english": "This pencil has a cool design.", "thai": "ดินสอนี้มีดีไซน์เท่"}
{"word": "pencil", "english": "I dropped my pencil on the floor.", "thai": "ฉันทำดินสอตกบนพื้น"}
{"word": "pencil", "english": "The pencil is from the school supply store.", "thai": "ดินสอนี้มาจากร้านเครื่องเขียน"}
{"word": "pencil", "english": "I need a pencil to write a letter.", "thai": "ฉันต้องการดินสอเพื่อเขียนจดหมาย"}
{"word": "pencil", "english": "The pencil is too soft for this paper.", "thai": "ดินสอนี้นุ่มเกินไปสำหรับกระดาษนี้"}
{"word": "pencil", "english": "I’m using a pencil to sketch a drawing.", "thai": "ฉันใช้ดินสอเพื่อร่างภาพ"}
{"word": "pencil", "english": "The pencil is too hard to write smoothly.", "thai": "ดินสอนี้แข็งเกินไปที่จะเขียนได้ลื่น"}
{"word": "pencil", "english": "I need a pencil for my study group.", "thai": "ฉันต้องการดินสอสำหรับกลุ่มเรียน"}
{"word": "pencil", "english": "The pencil is from my mom’s office.", "thai": "ดินสอนี้มาจากออฟฟิศของแม่"}
{"word": "pencil", "english": "I found a pencil in the library.", "thai": "ฉันเจอดินสอในห้องสมุด"}
{"word": "pencil", "english": "The pencil is too old to sharpen.", "thai": "ดินสอนี้เก่าเกินไปที่จะเหลา"}
{"word": "pencil", "english": "I need a pencil for my English class.", "thai": "ฉันต้องการดินสอสำหรับวิชาภาษาอังกฤษ"}
{"word": "pencil", "english": "The pencil is from my teacher’s desk.", "thai": "ดินสอนี้มาจากโต๊ะของครู"}
{"word": "pencil", "english": "I’m using a pencil to mark my calendar.", "thai": "ฉันใช้ดินสอเพื่อทำเครื่องหมายในปฏิทิน"}
{"word": "pencil", "english": "The pencil is too short for my hand.", "thai": "ดินสอนี้สั้นเกินไปสำหรับมือของฉัน"}
{"word": "pencil", "english": "I need a pencil for my science project.", "thai": "ฉันต้องการดินสอสำหรับโปรเจกต์วิทยาศาสตร์"}
{"word": "pencil", "english": "The pencil is from my sister’s room.", "thai": "ดินสอนี้มาจากห้องของน้องสาว"}
{"word": "pencil", "english": "I dropped my pencil in the hallway.", "thai": "ฉันทำดินสอตกในโถงทางเดิน"}
{"word": "pencil", "english": "The pencil is too cheap to last long.", "thai": "ดินสอนี้ถูกเกินไปที่จะทนทาน"}
{"word": "pencil", "english": "I need a pencil for my to-do list.", "thai": "ฉันต้องการดินสอสำหรับลิสต์สิ่งที่ต้องทำ"}
{"word": "pencil", "english": "The pencil is from the gift shop.", "thai": "ดินสอนี้มาจากร้านของที่ระลึก"}
{"word": "pencil", "english": "I’m using a pencil to draw a map.", "thai": "ฉันใช้ดินสอเพื่อวาดแผนที่"}
{"word": "pencil", "english": "The pencil is too blunt for sketching.", "thai": "ดินสอนี้ทื่อเกินไปสำหรับการร่าง"}
{"word": "pencil", "english": "I need a pencil for my history class.", "thai": "ฉันต้องการดินสอสำหรับวิชาประวัติศาสตร์"}
{"word": "pencil", "english": "The pencil is from my dad’s desk.", "thai": "ดินสอนี้มาจากโต๊ะของพ่อ"}
{"word": "pencil", "english": "I found a pencil in the kitchen.", "thai": "ฉันเจอดินสอในครัว"}
{"word": "pencil", "english": "The pencil is too light to write well.", "thai": "ดินสอนี้เบาเกินไปที่จะเขียนได้ดี"}
{"word": "pencil", "english": "I need a pencil for my journal.", "thai": "ฉันต้องการดินสอสำหรับไดอารี่"}
{"word": "pencil", "english": "The pencil is from my friend’s bag.", "thai": "ดินสอนี้มาจากกระเป๋าของเพื่อน"}
{"word": "pencil", "english": "I’m using a pencil to underline my notes.", "thai": "ฉันใช้ดินสอเพื่อขีดเส้นใต้โน้ต"}
{"word": "pencil", "english": "The pencil is too old to use.", "thai": "ดินสอนี้เก่าเกินไปที่จะใช้"}
{"word": "pencil", "english": "I need a pencil for my art project.", "thai": "ฉันต้องการดินสอสำหรับโปรเจกต์ศิลปะ"}
{"word": "pencil", "english": "The pencil is from the school supply room.", "thai": "ดินสอนี้มาจากห้องเก็บของโรงเรียน"}
{"word": "pencil", "english": "I dropped my pencil in the coffee shop.", "thai": "ฉันทำดินสอตกในร้านกาแฟ"}
{"word": "pencil", "english": "The pencil is too fancy for everyday use.", "thai": "ดินสอนี้หรูเกินไปสำหรับใช้ทุกวัน"}
{"word": "pencil", "english": "I need a pencil to write a reminder.", "thai": "ฉันต้องการดินสอเพื่อเขียนเตือนความจำ"}
{"word": "pencil", "english": "The pencil is from the bookstore.", "thai": "ดินสอนี้มาจากร้านหนังสือ"}
{"word": "pencil", "english": "I’m using a pencil to draw a portrait.", "thai": "ฉันใช้ดินสอเพื่อวาดภาพเหมือน"}
{"word": "pencil", "english": "The pencil is too soft for this task.", "thai": "ดินสอนี้นุ่มเกินไปสำหรับงานนี้"}
{"word": "pencil", "english": "I need a pencil for my vocabulary list.", "thai": "ฉันต้องการดินสอสำหรับลิสต์คำศัพท์"}
{"word": "pencil", "english": "The pencil is from my brother’s room.", "thai": "ดินสอนี้มาจากห้องของน้องชาย"}
{"word": "pencil", "english": "I found a pencil in the car.", "thai": "ฉันเจอดินสอในรถ"}
{"word": "pencil", "english": "The pencil is too short to hold comfortably.", "thai": "ดินสอนี้สั้นเกินไปที่จะจับถนัด"}
{"word": "pencil", "english": "I need a pencil for my crossword puzzle.", "thai": "ฉันต้องการดินสอสำหรับปริศนาอักษรไขว้"}
{"word": "pencil", "english": "The pencil is from my old school.", "thai": "ดินสอนี้มาจากโรงเรียนเก่าของฉัน"}
{"word": "pencil", "english": "I’m using a pencil to mark my planner.", "thai": "ฉันใช้ดินสอเพื่อทำเครื่องหมายในสมุดวางแผน"}
{"word": "pencil", "english": "The pencil is too hard for sketching.", "thai": "ดินสอนี้แข็งเกินไปสำหรับการร่าง"}
{"word": "pencil", "english": "I need a pencil for my study notes.", "thai": "ฉันต้องการดินสอสำหรับโน้ตการเรียน"}
{"word": "pencil", "english": "The pencil is from the office supply closet.", "thai": "ดินสอนี้มาจากตู้เก็บของในออฟฟิศ"}
{"word": "pencil", "english": "I dropped my pencil in the library.", "thai": "ฉันทำดินสอตกในห้องสมุด"}
{"word": "pencil", "english": "The pencil is too cheap to write well.", "thai": "ดินสอนี้ถูกเกินไปที่จะเขียนได้ดี"}
{"word": "pencil", "english": "I need a pencil for my writing project.", "thai": "ฉันต้องการดินสอสำหรับโปรเจกต์การเขียน"}
{"word": "pencil", "english": "The pencil is from my grandma’s house.", "thai": "ดินสอนี้มาจากบ้านย่า"}
{"word": "pencil", "english": "I’m using a pencil to draw a diagram.", "thai": "ฉันใช้ดินสอเพื่อวาดแผนภาพ"}
{"word": "pencil", "english": "The pencil is too blunt for my notes.", "thai": "ดินสอนี้ทื่อเกินไปสำหรับโน้ตของฉัน"}
{"word": "pencil", "english": "I need a pencil for my language class.", "thai": "ฉันต้องการดินสอสำหรับชั้นเรียนภาษา"}
{"word": "pencil", "english": "The pencil is from my friend’s house.", "thai": "ดินสอนี้มาจากบ้านเพื่อน"}
{"word": "pencil", "english": "I found a pencil in the storage closet.", "thai": "ฉันเจอดินสอในตู้เก็บของ"}
{"word": "pencil", "english": "The pencil is too old to sharpen well.", "thai": "ดินสอนี้เก่าเกินไปที่จะเหลาได้ดี"}
{"word": "pencil", "english": "I need a pencil for my reading nook.", "thai": "ฉันต้องการดินสอสำหรับมุมอ่านหนังสือ"}
{"word": "pencil", "english": "The pencil is from the hotel.", "thai": "ดินสอนี้มาจากโรงแรม"}
{"word": "pencil", "english": "I’m using a pencil to write a poem.", "thai": "ฉันใช้ดินสอเพื่อเขียนบทกวี"}
{"word": "pencil", "english": "The pencil is too short for sketching.", "thai": "ดินสอนี้สั้นเกินไปสำหรับการร่าง"}
{"word": "pencil", "english": "I need a pencil for my new job.", "thai": "ฉันต้องการดินสอสำหรับงานใหม่"}
{"word": "pencil", "english": "The pencil is from my old apartment.", "thai": "ดินสอนี้มาจากอพาร์ตเมนต์เก่าของฉัน"}
{"word": "pencil", "english": "I dropped my pencil in the meeting room.", "thai": "ฉันทำดินสอตกในห้องประชุม"}
{"word": "pencil", "english": "The pencil is too fancy for my taste.", "thai": "ดินสอนี้หรูเกินไปสำหรับรสนิยมของฉัน"}
{"word": "pencil", "english": "I need a pencil for my grocery list.", "thai": "ฉันต้องการดินสอสำหรับลิสต์ของชำ"}
{"word": "pencil", "english": "The pencil is from the conference.", "thai": "ดินสอนี้มาจากงานประชุม"}
{"word": "pencil", "english": "I’m using a pencil to mark my textbook.", "thai": "ฉันใช้ดินสอเพื่อทำเครื่องหมายในตำรา"}
{"word": "pencil", "english": "The pencil is too soft for writing.", "thai": "ดินสอนี้นุ่มเกินไปสำหรับการเขียน"}
{"word": "pencil", "english": "I need a pencil for my craft project.", "thai": "ฉันต้องการดินสอสำหรับโปรเจกต์งานฝีมือ"}
{"word": "pencil", "english": "The pencil is from my teacher’s office.", "thai": "ดินสอนี้มาจากออฟฟิศของครู"}
{"word": "pencil", "english": "I found a pencil in the guest room.", "thai": "ฉันเจอดินสอในห้องรับแขก"}
{"word": "pencil", "english": "The pencil is too expensive for me.", "thai": "ดินสอนี้แพงเกินไปสำหรับฉัน"}
{"word": "pencil", "english": "I need a pencil for my online classes.", "thai": "ฉันต้องการดินสอสำหรับชั้นเรียนออนไลน์"}
{"word": "pencil", "english": "The pencil is from my friend’s desk.", "thai": "ดินสอนี้มาจากโต๊ะของเพื่อน"}
{"word": "pencil", "english": "I’m using a pencil to write my schedule.", "thai": "ฉันใช้ดินสอเพื่อเขียนตารางเวลา"}
{"word": "pencil", "english": "The pencil is too hard for my sketch.", "thai": "ดินสอนี้แข็งเกินไปสำหรับภาพร่างของฉัน"}
{"word": "pencil", "english": "I need a pencil for my study nook.", "thai": "ฉันต้องการดินสอสำหรับมุมเรียน"}
{"word": "pencil", "english": "The pencil is from my old house.", "thai": "ดินสอนี้มาจากบ้านเก่าของฉัน"}
{"word": "pencil", "english": "I dropped my pencil in the storage room.", "thai": "ฉันทำดินสอตกในห้องเก็บของ"}
{"word": "pencil", "english": "The pencil is too short to use comfortably.", "thai": "ดินสอนี้สั้นเกินไปที่จะใช้ได้สะดวก"}
{"word": "backpack", "english": "I need a new backpack for school.", "thai": "ฉันต้องการกระเป๋าเป้ใหม่สำหรับโรงเรียน"}
{"word": "backpack", "english": "Can you grab my backpack from the car?", "thai": "ช่วยหยิบกระเป๋าเป้ของฉันจากรถหน่อยได้ไหม?"}
{"word": "backpack", "english": "I lost my backpack at the park.", "thai": "ฉันทำกระเป๋าเป้หายที่สวนสาธารณะ"}
{"word": "backpack", "english": "This backpack is too heavy to carry.", "thai": "กระเป๋าเป้นี้หนักเกินไปที่จะแบก"}
{"word": "backpack", "english": "I found a backpack in the classroom.", "thai": "ฉันเจอกระเป๋าเป้ในห้องเรียน"}
{"word": "backpack", "english": "Do you have a backpack I can borrow?", "thai": "คุณมีกระเป๋าเป้ให้ฉันยืมได้ไหม?"}
{"word": "backpack", "english": "I bought a new backpack for hiking.", "thai": "ฉันซื้อกระเป๋าเป้ใหม่สำหรับเดินป่า"}
{"word": "backpack", "english": "The backpack ripped at the seam.", "thai": "กระเป๋าเป้ขาดที่ตะเข็บ"}
{"word": "backpack", "english": "I need a backpack for my books.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับหนังสือ"}
{"word": "backpack", "english": "This backpack is really comfortable.", "thai": "กระเป๋าเป้นี้สบายมาก"}
{"word": "backpack", "english": "I left my backpack on the bus.", "thai": "ฉันลืมกระเป๋าเป้ไว้บนรถบัส"}
{"word": "backpack", "english": "The backpack is too small for my laptop.", "thai": "กระเป๋าเป้นี้เล็กเกินไปสำหรับแล็ปท็อปของฉัน"}
{"word": "backpack", "english": "I need a backpack for my trip.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับการเดินทาง"}
{"word": "backpack", "english": "The backpack is torn at the strap.", "thai": "กระเป๋าเป้ขาดที่สายสะพาย"}
{"word": "backpack", "english": "I found a backpack in the hallway.", "thai": "ฉันเจอกระเป๋าเป้ในโถงทางเดิน"}
{"word": "backpack", "english": "Can you check my backpack for my keys?", "thai": "ช่วยตรวจกระเป๋าเป้ของฉันหาคีย์หน่อยได้ไหม?"}
{"word": "backpack", "english": "The backpack is from my old school.", "thai": "กระเป๋าเป้นี้มาจากโรงเรียนเก่าของฉัน"}
{"word": "backpack", "english": "I need a backpack for my gym clothes.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับชุดออกกำลังกาย"}
{"word": "backpack", "english": "This backpack has a cool design.", "thai": "กระเป๋าเป้นี้มีดีไซน์เท่"}
{"word": "backpack", "english": "I dropped my backpack in the library.", "thai": "ฉันทำกระเป๋าเป้ตกในห้องสมุด"}
{"word": "backpack", "english": "The backpack is from the camping store.", "thai": "กระเป๋าเป้นี้มาจากร้านอุปกรณ์แคมปิ้ง"}
{"word": "backpack", "english": "I need a backpack for my new job.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับงานใหม่"}
{"word": "backpack", "english": "The backpack is too old to use.", "thai": "กระเป๋าเป้นี้เก่าเกินไปที่จะใช้"}
{"word": "backpack", "english": "I’m packing my backpack for school.", "thai": "ฉันกำลังจัดกระเป๋าเป้สำหรับโรงเรียน"}
{"word": "backpack", "english": "The backpack is full of books.", "thai": "กระเป๋าเป้เต็มไปด้วยหนังสือ"}
{"word": "backpack", "english": "I need a backpack for my study group.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับกลุ่มเรียน"}
{"word": "backpack", "english": "The backpack is from my mom’s office.", "thai": "กระเป๋าเป้นี้มาจากออฟฟิศของแม่"}
{"word": "backpack", "english": "I found a backpack in the closet.", "thai": "ฉันเจอกระเป๋าเป้ในตู้เสื้อผ้า"}
{"word": "backpack", "english": "The backpack is too heavy for my back.", "thai": "กระเป๋าเป้นี้หนักเกินไปสำหรับหลังของฉัน"}
{"word": "backpack", "english": "I need a backpack for my art supplies.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับอุปกรณ์ศิลปะ"}
{"word": "backpack", "english": "The backpack is from the school store.", "thai": "กระเป๋าเป้นี้มาจากร้านโรงเรียน"}
{"word": "backpack", "english": "I’m using my backpack for a day trip.", "thai": "ฉันใช้กระเป๋าเป้สำหรับทริปวันเดียว"}
{"word": "backpack", "english": "The backpack is too small for my books.", "thai": "กระเป๋าเป้นี้เล็กเกินไปสำหรับหนังสือของฉัน"}
{"word": "backpack", "english": "I need a backpack for my office work.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับงานออฟฟิศ"}
{"word": "backpack", "english": "The backpack is from my dad’s office.", "thai": "กระเป๋าเป้นี้มาจากออฟฟิศของพ่อ"}
{"word": "backpack", "english": "I dropped my backpack in the classroom.", "thai": "ฉันทำกระเป๋าเป้ตกในห้องเรียน"}
{"word": "backpack", "english": "The backpack is too expensive for me.", "thai": "กระเป๋าเป้นี้แพงเกินไปสำหรับฉัน"}
{"word": "backpack", "english": "I need a backpack for my math class.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับวิชาคณิตศาสตร์"}
{"word": "backpack", "english": "The backpack is from my sister’s room.", "thai": "กระเป๋าเป้นี้มาจากห้องของน้องสาว"}
{"word": "backpack", "english": "I found a backpack in the storage room.", "thai": "ฉันเจอกระเป๋าเป้ในห้องเก็บของ"}
{"word": "backpack", "english": "The backpack is too worn to use.", "thai": "กระเป๋าเป้นี้เก่าจนใช้ไม่ได้"}
{"word": "backpack", "english": "I need a backpack for my English class.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับวิชาภาษาอังกฤษ"}
{"word": "backpack", "english": "The backpack is from my friend’s house.", "thai": "กระเป๋าเป้นี้มาจากบ้านเพื่อน"}
{"word": "backpack", "english": "I’m packing my backpack for a hike.", "thai": "ฉันกำลังจัดกระเป๋าเป้สำหรับเดินป่า"}
{"word": "backpack", "english": "The backpack is too heavy for my trip.", "thai": "กระเป๋าเป้นี้หนักเกินไปสำหรับการเดินทาง"}
{"word": "backpack", "english": "I need a backpack for my science project.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับโปรเจกต์วิทยาศาสตร์"}
{"word": "backpack", "english": "The backpack is from the thrift store.", "thai": "กระเป๋าเป้นี้มาจากร้านมือสอง"}
{"word": "backpack", "english": "I dropped my backpack in the library.", "thai": "ฉันทำกระเป๋าเป้ตกในห้องสมุด"}
{"word": "backpack", "english": "The backpack is too small for my supplies.", "thai": "กระเป๋าเป้นี้เล็กเกินไปสำหรับของใช้ของฉัน"}
{"word": "backpack", "english": "I need a backpack for my study nook.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับมุมเรียน"}
{"word": "backpack", "english": "The backpack is from my old apartment.", "thai": "กระเป๋าเป้นี้มาจากอพาร์ตเมนต์เก่าของฉัน"}
{"word": "backpack", "english": "I’m using my backpack for camping.", "thai": "ฉันใช้กระเป๋าเป้สำหรับแคมปิ้ง"}
{"word": "backpack", "english": "The backpack is too old to carry much.", "thai": "กระเป๋าเป้นี้เก่าเกินไปที่จะบรรทุกของเยอะ"}
{"word": "backpack", "english": "I need a backpack for my history class.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับวิชาประวัติศาสตร์"}
{"word": "backpack", "english": "The backpack is from my brother’s room.", "thai": "กระเป๋าเป้นี้มาจากห้องของน้องชาย"}
{"word": "backpack", "english": "I found a backpack in the guest room.", "thai": "ฉันเจอกระเป๋าเป้ในห้องรับแขก"}
{"word": "backpack", "english": "The backpack is too heavy for my shoulders.", "thai": "กระเป๋าเป้นี้หนักเกินไปสำหรับไหล่ของฉัน"}
{"word": "backpack", "english": "I need a backpack for my online classes.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับชั้นเรียนออนไลน์"}
{"word": "backpack", "english": "The backpack is from the bookstore.", "thai": "กระเป๋าเป้นี้มาจากร้านหนังสือ"}
{"word": "backpack", "english": "I’m packing my backpack for a picnic.", "thai": "ฉันกำลังจัดกระเป๋าเป้สำหรับปิกนิก"}
{"word": "backpack", "english": "The backpack is too small for my laptop.", "thai": "กระเป๋าเป้นี้เล็กเกินไปสำหรับแล็ปท็อปของฉัน"}
{"word": "backpack", "english": "I need a backpack for my art project.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับโปรเจกต์ศิลปะ"}
{"word": "backpack", "english": "The backpack is from my teacher’s office.", "thai": "กระเป๋าเป้นี้มาจากออฟฟิศของครู"}
{"word": "backpack", "english": "I dropped my backpack in the hallway.", "thai": "ฉันทำกระเป๋าเป้ตกในโถงทางเดิน"}
{"word": "backpack", "english": "The backpack is too expensive for my budget.", "thai": "กระเป๋าเป้นี้แพงเกินไปสำหรับงบของฉัน"}
{"word": "backpack", "english": "I need a backpack for my gym class.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับชั้นเรียนยิม"}
{"word": "backpack", "english": "The backpack is from my friend’s desk.", "thai": "กระเป๋าเป้นี้มาจากโต๊ะของเพื่อน"}
{"word": "backpack", "english": "I’m using my backpack for a road trip.", "thai": "ฉันใช้กระเป๋าเป้สำหรับทริปถนน"}
{"word": "backpack", "english": "The backpack is too worn for school.", "thai": "กระเป๋าเป้นี้เก่าจนใช้ที่โรงเรียนไม่ได้"}
{"word": "backpack", "english": "I need a backpack for my study notes.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับโน้ตการเรียน"}
{"word": "backpack", "english": "The backpack is from the hotel.", "thai": "กระเป๋าเป้นี้มาจากโรงแรม"}
{"word": "backpack", "english": "I found a backpack in the meeting room.", "thai": "ฉันเจอกระเป๋าเป้ในห้องประชุม"}
{"word": "backpack", "english": "The backpack is too heavy for my books.", "thai": "กระเป๋าเป้นี้หนักเกินไปสำหรับหนังสือของฉัน"}
{"word": "backpack", "english": "I need a backpack for my new course.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับคอร์สใหม่"}
{"word": "backpack", "english": "The backpack is from my old house.", "thai": "กระเป๋าเป้นี้มาจากบ้านเก่าของฉัน"}
{"word": "backpack", "english": "I’m packing my backpack for a vacation.", "thai": "ฉันกำลังจัดกระเป๋าเป้สำหรับวันหยุด"}
{"word": "backpack", "english": "The backpack is too small for my supplies.", "thai": "กระเป๋าเป้นี้เล็กเกินไปสำหรับของใช้ของฉัน"}
{"word": "backpack", "english": "I need a backpack for my writing class.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับชั้นเรียนการเขียน"}
{"word": "backpack", "english": "The backpack is from my mom’s desk.", "thai": "กระเป๋าเป้นี้มาจากโต๊ะของแม่"}
{"word": "backpack", "english": "I found a backpack in the storage closet.", "thai": "ฉันเจอกระเป๋าเป้ในตู้เก็บของ"}
{"word": "backpack", "english": "The backpack is too old to keep.", "thai": "กระเป๋าเป้นี้เก่าเกินไปที่จะเก็บไว้"}
{"word": "backpack", "english": "I need a backpack for my language class.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับชั้นเรียนภาษา"}
{"word": "backpack", "english": "The backpack is from my teacher’s room.", "thai": "กระเป๋าเป้นี้มาจากห้องของครู"}
{"word": "backpack", "english": "I’m using my backpack for a field trip.", "thai": "ฉันใช้กระเป๋าเป้สำหรับทัศนศึกษา"}
{"word": "backpack", "english": "The backpack is too heavy for my back.", "thai": "กระเป๋าเป้นี้หนักเกินไปสำหรับหลังของฉัน"}
{"word": "backpack", "english": "I need a backpack for my online classes.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับชั้นเรียนออนไลน์"}
{"word": "backpack", "english": "The backpack is from the gift shop.", "thai": "กระเป๋าเป้นี้มาจากร้านของที่ระลึก"}
{"word": "backpack", "english": "I dropped my backpack in the gym.", "thai": "ฉันทำกระเป๋าเป้ตกในยิม"}
{"word": "backpack", "english": "The backpack is too small for my laptop.", "thai": "กระเป๋าเป้นี้เล็กเกินไปสำหรับแล็ปท็อปของฉัน"}
{"word": "backpack", "english": "I need a backpack for my art class.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับวิชาศิลปะ"}
{"word": "backpack", "english": "The backpack is from my friend’s house.", "thai": "กระเป๋าเป้นี้มาจากบ้านเพื่อน"}
{"word": "backpack", "english": "I’m packing my backpack for a sleepover.", "thai": "ฉันกำลังจัดกระเป๋าเป้สำหรับค้างคืน"}
{"word": "backpack", "english": "The backpack is too worn for my trip.", "thai": "กระเป๋าเป้นี้เก่าจนใช้สำหรับทริปไม่ได้"}
{"word": "backpack", "english": "I need a backpack for my study materials.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับอุปกรณ์การเรียน"}
{"word": "backpack", "english": "The backpack is from my old job.", "thai": "กระเป๋าเป้นี้มาจากงานเก่าของฉัน"}
{"word": "backpack", "english": "I found a backpack in the conference room.", "thai": "ฉันเจอกระเป๋าเป้ในห้องประชุม"}
{"word": "backpack", "english": "The backpack is too expensive for my budget.", "thai": "กระเป๋าเป้นี้แพงเกินไปสำหรับงบของฉัน"}
{"word": "backpack", "english": "I need a backpack for my new hobby.", "thai": "ฉันต้องการกระเป๋าเป้สำหรับงานอดิเรกใหม่"}
{"word": "backpack", "english": "The backpack is from my grandma’s house.", "thai": "กระเป๋าเป้นี้มาจากบ้านย่า"}
{"word": "backpack", "english": "I’m packing my backpack for a day out.", "thai": "ฉันกำลังจัดกระเป๋าเป้สำหรับออกไปข้างนอกหนึ่งวัน"}
{"word": "backpack", "english": "The backpack is too heavy for my shoulders.", "thai": "กระเป๋าเป้นี้หนักเกินไปสำหรับไหล่ของฉัน"}
{"word": "ruler", "english": "I need a ruler to draw a straight line.", "thai": "ฉันต้องการไม้บรรทัดเพื่อวาดเส้นตรง"}
{"word": "ruler", "english": "Can you lend me a ruler for my homework?", "thai": "ยืมไม้บรรทัดให้ฉันสำหรับการบ้านหน่อยได้ไหม?"}
{"word": "ruler", "english": "I lost my ruler in the classroom.", "thai": "ฉันทำไม้บรรทัดหายในห้องเรียน"}
{"word": "ruler", "english": "This ruler is too short for this paper.", "thai": "ไม้บรรทัดนี้สั้นเกินไปสำหรับกระดาษนี้"}
{"word": "ruler", "english": "I found a ruler under the desk.", "thai": "ฉันเจอไม้บรรทัดอยู่ใต้โต๊ะ"}
{"word": "ruler", "english": "Do you have a spare ruler I can use?", "thai": "คุณมีไม้บรรทัดสำรองให้ฉันใช้ได้ไหม?"}
{"word": "ruler", "english": "I bought a new ruler for my art class.", "thai": "ฉันซื้อไม้บรรทัดใหม่สำหรับวิชาศิลปะ"}
{"word": "ruler", "english": "The ruler broke while I was measuring.", "thai": "ไม้บรรทัดหักตอนฉันกำลังวัด"}
{"word": "ruler", "english": "I need a ruler for my math homework.", "thai": "ฉันต้องการไม้บรรทัดสำหรับการบ้านคณิตศาสตร์"}
{"word": "ruler", "english": "This ruler is really sturdy.", "thai": "ไม้บรรทัดนี้แข็งแรงมาก"}
{"word": "ruler", "english": "I left my ruler on the table.", "thai": "ฉันวางไม้บรรทัดไว้บนโต๊ะ"}
{"word": "ruler", "english": "The ruler slipped out of my hand.", "thai": "ไม้บรรทัดหลุดจากมือของฉัน"}
{"word": "ruler", "english": "I need a ruler to measure this fabric.", "thai": "ฉันต้องการไม้บรรทัดเพื่อวัดผ้านี้"}
{"word": "ruler", "english": "This ruler is too flexible to use.", "thai": "ไม้บรรทัดนี้ยืดหยุ่นเกินไปที่จะใช้"}
{"word": "ruler", "english": "I found a ruler in my backpack.", "thai": "ฉันเจอไม้บรรทัดในกระเป๋าเป้"}
{"word": "ruler", "english": "Can you grab a ruler from the drawer?", "thai": "ช่วยหยิบไม้บรรทัดจากลิ้นชักมาให้หน่อยได้ไหม?"}
{"word": "ruler", "english": "The ruler is stuck in my pencil case.", "thai": "ไม้บรรทัดติดอยู่ในกล่องดินสอของฉัน"}
{"word": "ruler", "english": "I need a ruler for my geometry class.", "thai": "ฉันต้องการไม้บรรทัดสำหรับวิชาเรขาคณิต"}
{"word": "ruler", "english": "This ruler has a cool design.", "thai": "ไม้บรรทัดนี้มีดีไซน์เท่"}
{"word": "ruler", "english": "I dropped my ruler on the floor.", "thai": "ฉันทำไม้บรรทัดตกบนพื้น"}
{"word": "ruler", "english": "The ruler is from the stationery store.", "thai": "ไม้บรรทัดนี้มาจากร้านเครื่องเขียน"}
{"word": "ruler", "english": "I need a ruler to draw a chart.", "thai": "ฉันต้องการไม้บรรทัดเพื่อวาดแผนภูมิ"}
{"word": "ruler", "english": "The ruler is too small for this project.", "thai": "ไม้บรรทัดนี้เล็กเกินไปสำหรับโปรเจกต์นี้"}
{"word": "ruler", "english": "I’m using a ruler to measure my desk.", "thai": "ฉันใช้ไม้บรรทัดเพื่อวัดโต๊ะของฉัน"}
{"word": "ruler", "english": "The ruler is too old to read clearly.", "thai": "ไม้บรรทัดนี้เก่าเกินไปจนอ่านไม่ชัด"}
{"word": "ruler", "english": "I need a ruler for my study group.", "thai": "ฉันต้องการไม้บรรทัดสำหรับกลุ่มเรียน"}
{"word": "ruler", "english": "The ruler is from my mom’s office.", "thai": "ไม้บรรทัดนี้มาจากออฟฟิศของแม่"}
{"word": "ruler", "english": "I found a ruler in the library.", "thai": "ฉันเจอไม้บรรทัดในห้องสมุด"}
{"word": "ruler", "english": "The ruler is too flimsy to use.", "thai": "ไม้บรรทัดนี้บอบบางเกินไปที่จะใช้"}
{"word": "ruler", "english": "I need a ruler for my science project.", "thai": "ฉันต้องการไม้บรรทัดสำหรับโปรเจกต์วิทยาศาสตร์"}
{"word": "ruler", "english": "The ruler is from my sister’s desk.", "thai": "ไม้บรรทัดนี้มาจากโต๊ะของน้องสาว"}
{"word": "ruler", "english": "I dropped my ruler in the hallway.", "thai": "ฉันทำไม้บรรทัดตกในโถงทางเดิน"}
{"word": "ruler", "english": "The ruler is too cheap to last long.", "thai": "ไม้บรรทัดนี้ถูกเกินไปที่จะทนทาน"}
{"word": "ruler", "english": "I need a ruler for my art project.", "thai": "ฉันต้องการไม้บรรทัดสำหรับโปรเจกต์ศิลปะ"}
{"word": "ruler", "english": "The ruler is from my dad’s office.", "thai": "ไม้บรรทัดนี้มาจากออฟฟิศของพ่อ"}
{"word": "ruler", "english": "I found a ruler in the kitchen.", "thai": "ฉันเจอไม้บรรทัดในครัว"}
{"word": "ruler", "english": "The ruler is too short for this task.", "thai": "ไม้บรรทัดนี้สั้นเกินไปสำหรับงานนี้"}
{"word": "ruler", "english": "I need a ruler to draw a diagram.", "thai": "ฉันต้องการไม้บรรทัดเพื่อวาดแผนภาพ"}
{"word": "ruler", "english": "The ruler is from the school supply room.", "thai": "ไม้บรรทัดนี้มาจากห้องเก็บของโรงเรียน"}
{"word": "ruler", "english": "I’m using a ruler to measure my book.", "thai": "ฉันใช้ไม้บรรทัดเพื่อวัดหนังสือ"}
{"word": "ruler", "english": "The ruler is too scratched to read.", "thai": "ไม้บรรทัดนี้มีรอยขีดข่วนจนอ่านไม่ได้"}
{"word": "ruler", "english": "I need a ruler for my history class.", "thai": "ฉันต้องการไม้บรรทัดสำหรับวิชาประวัติศาสตร์"}
{"word": "ruler", "english": "The ruler is from my friend’s bag.", "thai": "ไม้บรรทัดนี้มาจากกระเป๋าของเพื่อน"}
{"word": "ruler", "english": "I dropped my ruler in the classroom.", "thai": "ฉันทำไม้บรรทัดตกในห้องเรียน"}
{"word": "ruler", "english": "The ruler is too flexible for drawing.", "thai": "ไม้บรรทัดนี้ยืดหยุ่นเกินไปสำหรับการวาด"}
{"word": "ruler", "english": "I need a ruler for my English class.", "thai": "ฉันต้องการไม้บรรทัดสำหรับวิชาภาษาอังกฤษ"}
{"word": "ruler", "english": "The ruler is from the gift shop.", "thai": "ไม้บรรทัดนี้มาจากร้านของที่ระลึก"}
{"word": "ruler", "english": "I’m using a ruler to measure my paper.", "thai": "ฉันใช้ไม้บรรทัดเพื่อวัดกระดาษ"}
{"word": "ruler", "english": "The ruler is too old to use.", "thai": "ไม้บรรทัดนี้เก่าเกินไปที่จะใช้"}
{"word": "ruler", "english": "I need a ruler for my craft project.", "thai": "ฉันต้องการไม้บรรทัดสำหรับโปรเจกต์งานฝีมือ"}
{"word": "ruler", "english": "The ruler is from my brother’s room.", "thai": "ไม้บรรทัดนี้มาจากห้องของน้องชาย"}
{"word": "ruler", "english": "I found a ruler in the car.", "thai": "ฉันเจอไม้บรรทัดในรถ"}
{"word": "ruler", "english": "The ruler is too short to measure this.", "thai": "ไม้บรรทัดนี้สั้นเกินไปที่จะวัดสิ่งนี้"}
{"word": "ruler", "english": "I need a ruler for my study notes.", "thai": "ฉันต้องการไม้บรรทัดสำหรับโน้ตการเรียน"}
{"word": "ruler", "english": "The ruler is from the office supply closet.", "thai": "ไม้บรรทัดนี้มาจากตู้เก็บของในออฟฟิศ"}
{"word": "ruler", "english": "I dropped my ruler in the library.", "thai": "ฉันทำไม้บรรทัดตกในห้องสมุด"}
{"word": "ruler", "english": "The ruler is too cheap to measure well.", "thai": "ไม้บรรทัดนี้ถูกเกินไปที่จะวัดได้ดี"}
{"word": "ruler", "english": "I need a ruler for my writing project.", "thai": "ฉันต้องการไม้บรรทัดสำหรับโปรเจกต์การเขียน"}
{"word": "ruler", "english": "The ruler is from my old school.", "thai": "ไม้บรรทัดนี้มาจากโรงเรียนเก่าของฉัน"}
{"word": "ruler", "english": "I’m using a ruler to draw a graph.", "thai": "ฉันใช้ไม้บรรทัดเพื่อวาดกราฟ"}
{"word": "ruler", "english": "The ruler is too flimsy for this task.", "thai": "ไม้บรรทัดนี้บอบบางเกินไปสำหรับงานนี้"}
{"word": "ruler", "english": "I need a ruler for my language class.", "thai": "ฉันต้องการไม้บรรทัดสำหรับชั้นเรียนภาษา"}
{"word": "ruler", "english": "The ruler is from my teacher’s desk.", "thai": "ไม้บรรทัดนี้มาจากโต๊ะของครู"}
{"word": "ruler", "english": "I found a ruler in the guest room.", "thai": "ฉันเจอไม้บรรทัดในห้องรับแขก"}
{"word": "ruler", "english": "The ruler is too scratched to use.", "thai": "ไม้บรรทัดนี้มีรอยขีดข่วนเกินไปที่จะใช้"}
{"word": "ruler", "english": "I need a ruler for my new job.", "thai": "ฉันต้องการไม้บรรทัดสำหรับงานใหม่"}
{"word": "ruler", "english": "The ruler is from my grandma’s house.", "thai": "ไม้บรรทัดนี้มาจากบ้านย่า"}
{"word": "ruler", "english": "I’m using a ruler to measure my notebook.", "thai": "ฉันใช้ไม้บรรทัดเพื่อวัดสมุดบันทึก"}
{"word": "ruler", "english": "The ruler is too short for my project.", "thai": "ไม้บรรทัดนี้สั้นเกินไปสำหรับโปรเจกต์ของฉัน"}
{"word": "ruler", "english": "I need a ruler for my online classes.", "thai": "ฉันต้องการไม้บรรทัดสำหรับชั้นเรียนออนไลน์"}
{"word": "ruler", "english": "The ruler is from my friend’s house.", "thai": "ไม้บรรทัดนี้มาจากบ้านเพื่อน"}
{"word": "ruler", "english": "I dropped my ruler in the meeting room.", "thai": "ฉันทำไม้บรรทัดตกในห้องประชุม"}
{"word": "ruler", "english": "The ruler is too expensive for me.", "thai": "ไม้บรรทัดนี้แพงเกินไปสำหรับฉัน"}
{"word": "ruler", "english": "I need a ruler for my study nook.", "thai": "ฉันต้องการไม้บรรทัดสำหรับมุมเรียน"}
{"word": "ruler", "english": "The ruler is from the hotel.", "thai": "ไม้บรรทัดนี้มาจากโรงแรม"}
{"word": "ruler", "english": "I’m using a ruler to draw a table.", "thai": "ฉันใช้ไม้บรรทัดเพื่อวาดตาราง"}
{"word": "ruler", "english": "The ruler is too flimsy to measure well.", "thai": "ไม้บรรทัดนี้บอบบางเกินไปที่จะวัดได้ดี"}
{"word": "ruler", "english": "I need a ruler for my art homework.", "thai": "ฉันต้องการไม้บรรทัดสำหรับการบ้านศิลปะ"}
{"word": "ruler", "english": "The ruler is from my old apartment.", "thai": "ไม้บรรทัดนี้มาจากอพาร์ตเมนต์เก่าของฉัน"}
{"word": "ruler", "english": "I found a ruler in the storage closet.", "thai": "ฉันเจอไม้บรรทัดในตู้เก็บของ"}
{"word": "ruler", "english": "The ruler is too old to keep.", "thai": "ไม้บรรทัดนี้เก่าเกินไปที่จะเก็บไว้"}
{"word": "ruler", "english": "I need a ruler for my craft class.", "thai": "ฉันต้องการไม้บรรทัดสำหรับชั้นเรียนงานฝีมือ"}
{"word": "ruler", "english": "The ruler is from my brother’s desk.", "thai": "ไม้บรรทัดนี้มาจากโต๊ะของน้องชาย"}
{"word": "ruler", "english": "I’m using a ruler to measure my poster.", "thai": "ฉันใช้ไม้บรรทัดเพื่อวัดโปสเตอร์"}
{"word": "ruler", "english": "The ruler is too short for my drawing.", "thai": "ไม้บรรทัดนี้สั้นเกินไปสำหรับภาพวาดของฉัน"}
{"word": "ruler", "english": "I need a ruler for my study materials.", "thai": "ฉันต้องการไม้บรรทัดสำหรับอุปกรณ์การเรียน"}
{"word": "ruler", "english": "The ruler is from the bookstore.", "thai": "ไม้บรรทัดนี้มาจากร้านหนังสือ"}
{"word": "ruler", "english": "I dropped my ruler in the storage room.", "thai": "ฉันทำไม้บรรทัดตกในห้องเก็บของ"}
{"word": "ruler", "english": "The ruler is too flexible for my needs.", "thai": "ไม้บรรทัดนี้ยืดหยุ่นเกินไปสำหรับความต้องการของฉัน"}
{"word": "ruler", "english": "I need a ruler for my new course.", "thai": "ฉันต้องการไม้บรรทัดสำหรับคอร์สใหม่"}
{"word": "ruler", "english": "The ruler is from my mom’s desk.", "thai": "ไม้บรรทัดนี้มาจากโต๊ะของแม่"}
{"word": "ruler", "english": "I’m using a ruler to draw a line.", "thai": "ฉันใช้ไม้บรรทัดเพื่อวาดเส้น"}
{"word": "ruler", "english": "The ruler is too scratched for my liking.", "thai": "ไม้บรรทัดนี้มีรอยขีดข่วนเกินไปสำหรับฉัน"}
{"word": "ruler", "english": "I need a ruler for my writing class.", "thai": "ฉันต้องการไม้บรรทัดสำหรับชั้นเรียนการเขียน"}
{"word": "ruler", "english": "The ruler is from my friend’s desk.", "thai": "ไม้บรรทัดนี้มาจากโต๊ะของเพื่อน"}
{"word": "ruler", "english": "I found a ruler in the conference room.", "thai": "ฉันเจอไม้บรรทัดในห้องประชุม"}
{"word": "ruler", "english": "The ruler is too short for my project.", "thai": "ไม้บรรทัดนี้สั้นเกินไปสำหรับโปรเจกต์ของฉัน"}
{"word": "ruler", "english": "I need a ruler for my online course.", "thai": "ฉันต้องการไม้บรรทัดสำหรับคอร์สออนไลน์"}
{"word": "ruler", "english": "The ruler is from my old house.", "thai": "ไม้บรรทัดนี้มาจากบ้านเก่าของฉัน"}
{"word": "ruler", "english": "I’m using a ruler to measure my book.", "thai": "ฉันใช้ไม้บรรทัดเพื่อวัดหนังสือ"}
{"word": "ruler", "english": "The ruler is too old to measure well.", "thai": "ไม้บรรทัดนี้เก่าเกินไปที่จะวัดได้ดี"}
