{"word":"spark","english":"Her speech will spark new interest in the project.","thai":"คำพูดของเธอจะจุดประกายความสนใจใหม่ในโครงการ"}
{"word":"interest","english":"His keen interest in coding led to a tech career.","thai":"ความสนใจอย่างมากของเขาในการเขียนโค้ดนำไปสู่การทำงานในวงการเทคโนโลยี"}
{"word":"led","english":"Her guidance led the team to victory.","thai":"คำแนะนำของเธอนำทีมไปสู่ชัยชนะ"}
{"word":"team","english":"The team worked together to finish the task.","thai":"ทีมทำงานร่วมกันเพื่อให้งานเสร็จ"}
{"word":"worked","english":"She worked hard to earn her promotion.","thai":"เธอทำงานหนักเพื่อให้ได้เลื่อนตำแหน่ง"}
{"word":"earn","english":"You can earn extra cash by freelancing online.","thai":"คุณสามารถหาเงินพิเศษได้โดยการทำงานฟรีแลนซ์ออนไลน์"}
{"word":"cash","english":"I need some cash to buy concert tickets.","thai":"ฉันต้องการเงินสดเพื่อซื้อตั๋วคอนเสิร์ต"}
{"word":"buy","english":"Let’s buy fresh ingredients for dinner tonight.","thai":"มาซื้อวัตถุดิบสดๆ สำหรับมื้อเย็นคืนนี้กันเถอะ"}
{"word":"fresh","english":"The fresh breeze made the hike enjoyable.","thai":"สายลมสดชื่นทำให้การเดินป่ามีความสุข"}
{"word":"made","english":"His joke made everyone laugh out loud.","thai":"มุกตลกของเขาทำให้ทุกคนหัวเราะดังลั่น"}
{"word":"laugh","english":"Her silly antics always make me laugh.","thai":"การแสดงตลกๆ ของเธอทำให้ฉันหัวเราะได้เสมอ"}
{"word":"silly","english":"Don’t be silly, that plan won’t work!","thai":"อย่าโง่เลย แผนนั้นใช้ไม่ได้หรอก!"}
{"word":"plan","english":"We need to plan the party carefully.","thai":"เราต้องวางแผนงานปาร์ตี้อย่างรอบคอบ"}
{"word":"carefully","english":"She carefully crafted a heartfelt letter.","thai":"เธอประดิษฐ์จดหมายที่จริงใจอย่างระมัดระวัง"}
{"word":"crafted","english":"He crafted a wooden chair by hand.","thai":"เขาประดิษฐ์เก้าอี้ไม้ด้วยมือ"}
{"word":"hand","english":"Can you give me a hand with this box?","thai":"ช่วยฉันยกกล่องนี้หน่อยได้ไหม?"}
{"word":"give up","english":"Don’t give up on your dreams so easily.","thai":"อย่ายอมแพ้กับความฝันของคุณง่ายๆ"}
{"word":"dreams","english":"Her dreams of traveling the world came true.","thai":"ความฝันของเธอที่จะเดินทางรอบโลกเป็นจริง"}
{"word":"traveling","english":"Traveling abroad opens your mind to new cultures.","thai":"การเดินทางไปต่างประเทศเปิดใจให้รู้จักวัฒนธรรมใหม่ๆ"}
{"word":"mind","english":"Keep an open mind when meeting new people.","thai":"จงเปิดใจเมื่อพบปะผู้คนใหม่ๆ"}
{"word":"open","english":"Can you open the window? It’s stuffy here.","thai":"ช่วยเปิดหน้าต่างหน่อยได้ไหม? มันอบอ้าวตรงนี้"}
{"word":"stuffy","english":"This stuffy room needs some fresh air.","thai":"ห้องอับนี้ต้องการอากาศบริสุทธิ์"}
{"word":"air","english":"The crisp air signaled the start of fall.","thai":"อากาศเย็นสดใสบ่งบอกถึงการเริ่มต้นของฤดูใบไม้ร่วง"}
{"word":"start","english":"Let’s start the meeting with a quick recap.","thai":"มาเริ่มการประชุมด้วยการสรุปสั้นๆ กันเถอะ"}
{"word":"quick","english":"I need a quick snack before the game.","thai":"ฉันต้องการของว่างเร็วๆ ก่อนแข่ง"}
{"word":"snack","english":"A healthy snack boosts your energy.","thai":"ของว่างที่ดีต่อสุขภาพช่วยเพิ่มพลังงาน"}
{"word":"energy","english":"Her boundless energy inspires everyone around her.","thai":"พลังงานอันไร้ขีดจำกัดของเธอสร้างแรงบันดาลใจให้ทุกคนรอบตัว"}
{"word":"inspires","english":"Great art inspires deep emotions in viewers.","thai":"ศิลปะที่ยอดเยี่ยมสร้างแรงบันดาลใจให้เกิดอารมณ์ลึกซึ้งในผู้ชม"}
{"word":"deep","english":"Their deep friendship lasted for decades.","thai":"มิตรภาพอันลึกซึ้งของพวกเขายืนยาวหลายทศวรรษ"}
{"word":"lasted","english":"The movie lasted longer than I expected.","thai":"หนังเรื่องนี้ยาวนานกว่าที่ฉันคาดไว้"}
{"word":"expected","english":"The results exceeded what we expected.","thai":"ผลลัพธ์เกินกว่าที่เราคาดหวังไว้"}
{"word":"results","english":"Hard work yields great results over time.","thai":"การทำงานหนักให้ผลลัพธ์ที่ดีเมื่อเวลาผ่านไป"}
{"word":"yields","english":"This farm yields fresh produce every season.","thai":"ฟาร์มนี้ให้ผลผลิตสดใหม่ทุกฤดูกาล"}
{"word":"produce","english":"We produce handmade goods with care.","thai":"เราผลิตสินค้าแฮนด์เมดด้วยความใส่ใจ"}
{"word":"care","english":"Take care when crossing the busy street.","thai":"ระวังเมื่อข้ามถนนที่พลุกพล่าน"}
{"word":"crossing","english":"Crossing the bridge at night feels magical.","thai":"การข้ามสะพานตอนกลางคืนรู้สึกเหมือนมีมนต์ขลัง"}
{"word":"feels","english":"It feels great to finish a tough project.","thai":"รู้สึกดีมากที่ได้ทำงานยากๆ เสร็จ"}
{"word":"finish","english":"Let’s finish this puzzle before dinner.","thai":"มาทำปริศนานี้ให้เสร็จก่อนมื้อเย็นกันเถอะ"}
{"word":"puzzle","english":"Solving this puzzle takes real focus.","thai":"การแก้ปริศนานี้ต้องใช้สมาธิจริงๆ"}
{"word":"focus","english":"Stay focused during the final exam.","thai":"จดจ่อในช่วงสอบปลายภาค"}
{"word":"stay","english":"Can you stay late to help with this?","thai":"อยู่ดึกหน่อยเพื่อช่วยเรื่องนี้ได้ไหม?"}
{"word":"help","english":"I could use some help with this recipe.","thai":"ฉันต้องการความช่วยเหลือกับสูตรอาหารนี้หน่อย"}
{"word":"recipe","english":"This recipe calls for fresh herbs.","thai":"สูตรอาหารนี้ต้องการสมุนไพรสด"}
{"word":"calls","english":"She calls her mom every Sunday evening.","thai":"เธอโทรหาแม่ทุกเย็นวันอาทิตย์"}
{"word":"evening","english":"The evening breeze feels so relaxing.","thai":"สายลมยามเย็นรู้สึกผ่อนคลายมาก"}
{"word":"relaxing","english":"A relaxing bath helps me unwind.","thai":"การอาบน้ำผ่อนคลายช่วยให้ฉันคลายเครียด"}
{"word":"unwind","english":"Let’s unwind with a movie tonight.","thai":"มาคลายเครียดด้วยการดูหนังคืนนี้กันเถอะ"}
{"word":"movie","english":"That movie turned out to be a hit.","thai":"หนังเรื่องนั้นกลายเป็นที่นิยม"}
{"word":"turned out","english":"The party turned out better than planned.","thai":"งานปาร์ตี้นี้ดีเกินกว่าที่วางแผนไว้"}
{"word":"better","english":"This coffee tastes better than the last one.","thai":"กาแฟนี้อร่อยกว่าครั้งที่แล้ว"}
{"word":"tastes","english":"This dish tastes amazing with extra spices.","thai":"จานนี้รสชาติเยี่ยมเมื่อเติมเครื่องเทศเพิ่ม"}
{"word":"amazing","english":"Her performance was absolutely amazing.","thai":"การแสดงของเธอยอดเยี่ยมมาก"}
{"word":"performance","english":"His performance at work earned him a bonus.","thai":"ผลงานของเขาที่ทำงานทำให้เขาได้โบนัส"}
{"word":"bonus","english":"The company gave everyone a holiday bonus.","thai":"บริษัทให้โบนัสวันหยุดแก่ทุกคน"}
{"word":"holiday","english":"We’re planning a holiday trip to the beach.","thai":"เรากำลังวางแผนทริปวันหยุดไปชายหาด"}
{"word":"trip","english":"The road trip was full of surprises.","thai":"ทริปขับรถเต็มไปด้วยเรื่องเซอร์ไพรส์"}
{"word":"full","english":"My schedule is full this week.","thai":"ตารางของฉันแน่นมากสัปดาห์นี้"}
{"word":"schedule","english":"Can we schedule a meeting for tomorrow?","thai":"เราจะนัดประชุมพรุ่งนี้ได้ไหม?"}
{"word":"meeting","english":"The meeting ran longer than expected.","thai":"การประชุมยาวนานกว่าที่คาดไว้"}
{"word":"ran","english":"She ran her fastest mile this morning.","thai":"เธอวิ่งไมล์เร็วที่สุดเช้านี้"}
{"word":"fastest","english":"This is the fastest route to the airport.","thai":"นี่เป็นเส้นทางที่เร็วที่สุดไปสนามบิน"}
{"word":"route","english":"The scenic route offers stunning views.","thai":"เส้นทางชมวิวมีทิวทัศน์ที่สวยงาม"}
{"word":"views","english":"Her views on the topic sparked debate.","thai":"มุมมองของเธอในหัวข้อนี้จุดประเด็นถกเถียง"}
{"word":"debate","english":"The debate team practiced all weekend.","thai":"ทีมโต้วาทีฝึกซ้อมตลอดสุดสัปดาห์"}
{"word":"practiced","english":"He practiced his speech in front of a mirror.","thai":"เขาฝึกซ้อมคำพูดหน้ากระจก"}
{"word":"speech","english":"Her speech moved the entire audience.","thai":"คำพูดของเธอทำให้ผู้ฟังทั้งหมดประทับใจ"}
{"word":"moved","englishMoved to a new city, she started fresh.","thai":"ย้ายไปเมืองใหม่ เธอเริ่มต้นใหม่"}
{"word":"city","english":"The city buzzes with energy at night.","thai":"เมืองนี้เต็มไปด้วยพลังงานในตอนกลางคืน"}
{"word":"buzzes","english":"The cafe buzzes with chatter every morning.","thai":"ร้านกาแฟคราคร่ำไปด้วยเสียงพูดคุยทุกเช้า"}
{"word":"chatter","english":"Their cheerful chatter brightened the room.","thai":"เสียงพูดคุยร่าเริงของพวกเขาทำให้ห้องสว่างไสว"}
{"word":"brightened","english":"Her smile brightened everyone’s day.","thai":"รอยยิ้มของเธอทำให้วันของทุกคนสดใส"}
{"word":"smile","english":"A warm smile can break the ice.","thai":"รอยยิ้มอบอุ่นสามารถละลายน้ำแข็งได้"}
{"word":"break","english":"Let’s break for lunch in an hour.","thai":"มาพักกินข้าวเที่ยงในอีกหนึ่งชั่วโมง"}
{"word":"lunch","english":"I packed a healthy lunch for work.","thai":"ฉันเตรียมอาหารกลางวันเพื่อสุขภาพไปทำงาน"}
{"word":"healthy","english":"A healthy lifestyle improves your mood.","thai":"วิถีชีวิตเพื่อสุขภาพช่วยปรับปรุงอารมณ์"}
{"word":"mood","english":"Her good mood was contagious.","thai":"อารมณ์ดีของเธอติดต่อกันได้"}
{"word":"contagious","english":"Laughter is contagious in a happy crowd.","thai":"เสียงหัวเราะติดต่อกันได้ในฝูงชนที่ร่าเริง"}
{"word":"happy","english":"The happy kids played in the park.","thai":"เด็กๆ ที่มีความสุขเล่นในสวนสาธารณะ"}
{"word":"played","english":"They played board games all night.","thai":"พวกเขาเล่นเกมกระดานทั้งคืน"}
{"word":"games","english":"Video games are his favorite hobby.","thai":"วิดีโอเกมเป็นงานอดิเรกที่เขาชอบที่สุด"}
{"word":"hobby","english":"Photography is a rewarding hobby.","thai":"การถ่ายภาพเป็นงานอดิเรกที่คุ้มค่า"}
{"word":"rewarding","english":"Volunteering feels incredibly rewarding.","thai":"การเป็นอาสาสมัครรู้สึกคุ้มค่ามาก"}
{"word":"feels","english":"It feels amazing to help others.","thai":"รู้สึกยอดเยี่ยมที่ได้ช่วยเหลือผู้อื่น"}
{"word":"help","english":"Can you help me fix this computer?","thai":"ช่วยฉันซ่อมคอมพิวเตอร์นี้ได้ไหม?"}
{"word":"fix","english":"I need to fix my bike’s flat tire.","thai":"ฉันต้องซ่อมยางแบนของจักรยาน"}
{"word":"tire","english":"This long hike will tire you out.","thai":"การเดินป่าที่ยาวนานนี้จะทำให้คุณเหนื่อย"}
{"word":"tire out","english":"Playing with kids can tire you out fast.","thai":"การเล่นกับเด็กๆ ทำให้เหนื่อยเร็ว"}
{"word":"fast","english":"He runs fast but needs more stamina.","thai":"เขาวิ่งเร็วแต่ต้องการความอึดมากกว่านี้"}
{"word":"stamina","english":"Building stamina takes consistent effort.","thai":"การสร้างความอึดต้องใช้ความพยายามอย่างสม่ำเสมอ"}
{"word":"effort","english":"Her effort in class paid off big.","thai":"ความพยายามของเธอในชั้นเรียนได้ผลตอบแทนมหาศาล"}
{"word":"paid off","english":"Studying hard paid off with great grades.","thai":"การเรียนหนักได้ผลตอบแทนด้วยเกรดดี"}
{"word":"grades","english":"Good grades open doors to top colleges.","thai":"เกรดดีเปิดประตูสู่มหาวิทยาลัยชั้นนำ"}
{"word":"open","english":"Let’s open a bottle of wine tonight.","thai":"มาเปิดขวดไวน์คืนนี้กันเถอะ"}
{"word":"wine","english":"This red wine pairs well with steak.","thai":"ไวน์แดงนี้เข้ากันดีกับสเต๊ก"}
{"word":"pairs","english":"That shirt pairs nicely with those jeans.","thai":"เสื้อตัวนั้นเข้ากันดีกับกางเกงยีนส์"}
{"word":"nicely","english":"She sings so nicely at the karaoke bar.","thai":"เธอร้องเพลงได้ไพเราะมากที่บาร์คาราโอเกะ"}
{"word":"sings","english":"He sings his heart out every weekend.","thai":"เขาร้องเพลงสุดใจทุกสุดสัปดาห์"}
{"word":"weekend","english":"I love to relax on the weekend with a good book.","thai":"ฉันชอบพักผ่อนในวันหยุดสุดสัปดาห์พร้อมหนังสือดีๆ"}
{"word":"relax","english":"A hot bath helps me relax after a long day.","thai":"การอาบน้ำร้อนช่วยให้ฉันผ่อนคลายหลังจากวันยาวนาน"}
{"word":"long","english":"The long hike through the forest was breathtaking.","thai":"การเดินป่าที่ยาวนานผ่านป่าไม้ชวนตื่นตะลึง"}
{"word":"breathtaking","english":"The view from the mountain was absolutely breathtaking.","thai":"วิวจากยอดเขานั้นตื่นตาตื่นใจมาก"}
{"word":"view","english":"The hotel room had a stunning ocean view.","thai":"ห้องพักในโรงแรมมีวิวทะเลที่สวยงาม"}
{"word":"stunning","english":"Her stunning performance earned a standing ovation.","thai":"การแสดงที่ยอดเยี่ยมของเธอได้รับการปรบมือยืน"}
{"word":"earned","english":"He earned respect by always being honest.","thai":"เขาได้รับความเคารพด้วยการซื่อสัตย์เสมอ"}
{"word":"honest","english":"Being honest builds stronger relationships.","thai":"การซื่อสัตย์สร้างความสัมพันธ์ที่แข็งแกร่งยิ่งขึ้น"}
{"word":"builds","english":"This app builds your skills through daily practice.","thai":"แอปนี้ช่วยพัฒนาทักษะของคุณผ่านการฝึกฝนทุกวัน"}
{"word":"skills","english":"Her cooking skills impress everyone at the party.","thai":"ทักษะการทำอาหารของเธอทำให้ทุกคนในงานปาร์ตี้ประทับใจ"}
{"word":"impress","english":"You can impress your boss with a solid presentation.","thai":"คุณสามารถสร้างความประทับใจให้เจ้านายด้วยการนำเสนอที่ยอดเยี่ยม"}
{"word":"presentation","english":"The presentation ran smoothly despite technical issues.","thai":"การนำเสนอดำเนินไปอย่างราบรื่นแม้มีปัญหาทางเทคนิค"}
{"word":"ran","english":"She ran into an old friend at the mall.","thai":"เธอบังเอิญเจอเพื่อนเก่าที่ห้างสรรพสินค้า"}
{"word":"run into","english":"You might run into trouble without a backup plan.","thai":"คุณอาจเจอปัญหาถ้าไม่มีแผนสำรอง"}
{"word":"trouble","english":"He got into trouble for missing the deadline.","thai":"เขาเดือดร้อนเพราะพลาดกำหนดเวลา"}
{"word":"missed","english":"I missed the bus and had to walk home.","thai":"ฉันตกรถบัสและต้องเดินกลับบ้าน"}
{"word":"walk","english":"A morning walk boosts my energy for the day.","thai":"การเดินตอนเช้าช่วยเพิ่มพลังงานให้ฉันตลอดทั้งวัน"}
{"word":"energy","english":"Her boundless energy keeps the team motivated.","thai":"พลังงานอันไร้ขีดจำกัดของเธอทำให้ทีมมีแรงจูงใจ"}
{"word":"motivated","english":"Staying motivated is key to achieving goals.","thai":"การรักษาแรงจูงใจเป็นกุญแจสู่การบรรลุเป้าหมาย"}
{"word":"goals","english":"Setting clear goals helps you stay focused.","thai":"การตั้งเป้าหมายที่ชัดเจนช่วยให้คุณมีสมาธิ"}
{"word":"focused","english":"She stayed focused during the intense debate.","thai":"เธอยังคงมีสมาธิระหว่างการโต้วาทีที่ดุเดือด"}
{"word":"debate","english":"The debate over policy changes heated up quickly.","thai":"การถกเถียงเรื่องการเปลี่ยนแปลงนโยบายร้อนแรงขึ้นอย่างรวดเร็ว"}
{"word":"heated","english":"The heated argument ended with an apology.","thai":"การโต้แย้งที่รุนแรงจบลงด้วยคำขอโทษ"}
{"word":"apology","english":"His sincere apology mended their friendship.","thai":"คำขอโทษที่จริงใจของเขาซ่อมแซมมิตรภาพของพวกเขา"}
{"word":"friendship","english":"Their friendship grew stronger over the years.","thai":"มิตรภาพของพวกเขาแข็งแกร่งขึ้นตลอดหลายปี"}
{"word":"grew","english":"The small startup grew into a global brand.","thai":"สตาร์ทอัพเล็กๆ เติบโตเป็นแบรนด์ระดับโลก"}
{"word":"brand","english":"This brand makes the best running shoes.","thai":"แบรนด์นี้ทำรองเท้าวิ่งที่ดีที่สุด"}
{"word":"running","english":"Running daily improves your heart health.","thai":"การวิ่งทุกวันช่วยให้หัวใจแข็งแรง"}
{"word":"health","english":"Good health is worth more than wealth.","thai":"สุขภาพดีมีค่ามากกว่าเงินทอง"}
{"word":"wealth","english":"Her wealth of knowledge amazed the students.","thai":"ความรู้มากมายของเธอทำให้เด็กๆ ทึ่ง"}
{"word":"amazed","english":"The magic trick amazed the entire audience.","thai":"กลเม็ดมายากลทำให้ผู้ชมทั้งหมดตื่นตะลึง"}
{"word":"audience","english":"The audience cheered loudly for the band.","thai":"ผู้ชมโห่ร้องดังลั่นให้วงดนตรี"}
{"word":"cheered","english":"We cheered as the team scored a goal.","thai":"เราส่งเสียงเชียร์เมื่อทีมทำประตูได้"}
{"word":"scored","english":"She scored high on the final exam.","thai":"เธอได้คะแนนสูงในข้อสอบปลายภาค"}
{"word":"exam","english":"Studying smart is key to passing the exam.","thai":"การเรียนอย่างฉลาดเป็นกุญแจสู่การสอบผ่าน"}
{"word":"passing","english":"Passing the driving test felt like a victory.","thai":"การสอบผ่านใบขับขี่รู้สึกเหมือนชัยชนะ"}
{"word":"victory","english":"The team celebrated their hard-earned victory.","thai":"ทีมเฉลิมฉลองชัยชนะที่ได้มาอย่างยากลำบาก"}
{"word":"celebrated","english":"We celebrated her birthday with a big party.","thai":"เราเฉลิมฉลองวันเกิดของเธอด้วยงานปาร์ตี้ใหญ่"}
{"word":"party","english":"The party lasted until midnight with great music.","thai":"งานปาร์ตี้ยาวนานถึงเที่ยงคืนพร้อมดนตรีสุดเจ๋ง"}
{"word":"music","english":"Live music makes any event more fun.","thai":"ดนตรีสดทำให้ทุกงานสนุกยิ่งขึ้น"}
{"word":"fun","english":"Playing board games is always fun with friends.","thai":"การเล่นเกมกระดานกับเพื่อนๆ สนุกเสมอ"}
{"word":"friends","english":"My friends always know how to cheer me up.","thai":"เพื่อนๆ ของฉันรู้วิธีทำให้ฉันร่าเริงขึ้นเสมอ"}
{"word":"cheer up","english":"A funny movie can cheer you up instantly.","thai":"หนังตลกสามารถทำให้คุณร่าเริงขึ้นได้ทันที"}
{"word":"funny","english":"His funny jokes cracked everyone up.","thai":"มุกตลกของเขาทำให้ทุกคนขำกลิ้ง"}
{"word":"cracked up","english":"We cracked up at her hilarious impression.","thai":"เราขำกลิ้งกับการเลียนแบบที่ตลกมากของเธอ"}
{"word":"hilarious","english":"The comedian’s hilarious routine went viral.","thai":"การแสดงตลกของนักแสดงตลกนั้นดังไปทั่ว"}
{"word":"viral","english":"Her dance video went viral on social media.","thai":"วิดีโอเต้นของเธอดังเปรี้ยงบนโซเชียลมีเดีย"}
{"word":"social","english":"Social gatherings help build strong connections.","thai":"การพบปะสังสรรค์ช่วยสร้างความสัมพันธ์ที่แข็งแกร่ง"}
{"word":"connections","english":"Networking events create valuable connections.","thai":"งานเน็ตเวิร์กกิ้งสร้างความสัมพันธ์ที่มีค่า"}
{"word":"valuable","english":"This antique watch is incredibly valuable.","thai":"นาฬิกาโบราณเรือนนี้มีค่ามาก"}
{"word":"watch","english":"I watch cooking shows to learn new recipes.","thai":"ฉันดูรายการทำอาหารเพื่อเรียนรู้สูตรใหม่ๆ"}
{"word":"learn","english":"You can learn a lot from your mistakes.","thai":"คุณสามารถเรียนรู้ได้มากจากความผิดพลาด"}
{"word":"mistakes","english":"Making mistakes is part of growing up.","thai":"การทำผิดพลาดเป็นส่วนหนึ่งของการเติบโต"}
{"word":"growing up","english":"Growing up in a small town shaped her values.","thai":"การเติบโตในเมืองเล็กๆ หล่อหลอมค่านิยมของเธอ"}
{"word":"values","english":"Her strong values guide her decisions.","thai":"ค่านิยมที่แข็งแกร่งของเธอเป็นแนวทางในการตัดสินใจ"}
{"word":"guide","english":"This map will guide us to the campsite.","thai":"แผนที่นี้จะนำทางเราไปยังที่ตั้งแคมป์"}
{"word":"campsite","english":"The campsite was quiet under the starry sky.","thai":"ที่ตั้งแคมป์เงียบสงบใต้ท้องฟ้าที่เต็มไปด้วยดวงดาว"}
{"word":"quiet","english":"A quiet evening at home feels so peaceful.","thai":"เย็นวันหนึ่งที่เงียบสงบที่บ้านรู้สึกสงบมาก"}
{"word":"peaceful","english":"The peaceful garden is perfect for meditation.","thai":"สวนที่เงียบสงบเหมาะสำหรับการนั่งสมาธิ"}
{"word":"meditation","english":"Daily meditation calms the mind and soul.","thai":"การนั่งสมาธิทุกวันช่วยให้จิตใจและวิญญาณสงบ"}
{"word":"calms","english":"Her soft voice calms everyone in the room.","thai":"น้ำเสียงนุ่มนวลของเธอทำให้ทุกคนในห้องสงบลง"}
{"word":"voice","english":"His powerful voice filled the concert hall.","thai":"น้ำเสียงอันทรงพลังของเขาดังก้องทั่วหอคอนเสิร์ต"}
{"word":"filled","english":"The room filled with laughter during the game.","thai":"ห้องเต็มไปด้วยเสียงหัวเราะระหว่างเล่นเกม"}
{"word":"laughter","english":"Her infectious laughter brightened the mood.","thai":"เสียงหัวเราะที่ติดต่อกันได้ของเธอทำให้อารมณ์ดีขึ้น"}
{"word":"mood","english":"A good playlist can lift your mood instantly.","thai":"เพลย์ลิสต์ดีๆ สามารถยกระดับอารมณ์ของคุณได้ทันที"}
{"word":"lift","english":"Can you help me lift this heavy box?","thai":"ช่วยฉันยกกล่องหนักๆ นี้หน่อยได้ไหม?"}
{"word":"heavy","english":"This heavy jacket keeps me warm in winter.","thai":"แจ็คเก็ตหนักๆ ตัวนี้ทำให้ฉันอบอุ่นในฤดูหนาว"}
{"word":"warm","english":"A warm cup of tea soothes my nerves.","thai":"ชาร้อนสักถ้วยช่วยปลอบประสาทของฉัน"}
{"word":"soothes","english":"Soft music soothes the baby to sleep.","thai":"ดนตรีเบาๆ ช่วยกล่อมทารกให้หลับ"}
{"word":"sleep","english":"I need more sleep to feel refreshed.","thai":"ฉันต้องการนอนมากกว่านี้เพื่อรู้สึกสดชื่น"}
{"word":"refreshed","english":"A cold shower leaves you feeling refreshed.","thai":"การอาบน้ำเย็นทำให้คุณรู้สึกสดชื่น"}
{"word":"shower","english":"The sudden shower caught us by surprise.","thai":"ฝนที่ตกลงมาทันทีทันใดทำให้เราแปลกใจ"}
{"word":"surprise","english":"Her birthday party was a complete surprise.","thai":"งานวันเกิดของเธอเป็นเซอร์ไพรส์โดยสมบูรณ์"}
{"word":"complete","english":"I need to complete this report by tonight.","thai":"ฉันต้องทำรายงานนี้ให้เสร็จภายในคืนนี้"}
{"word":"report","english":"The news report covered the local festival.","thai":"รายงานข่าวครอบคลุมเทศกาลท้องถิ่น"}
{"word":"festival","english":"The music festival drew a huge crowd.","thai":"เทศกาลดนตรีดึงดูดฝูงชนจำนวนมาก"}
{"word":"crowd","english":"The crowd cheered as the fireworks lit up the sky.","thai":"ฝูงชนโห่ร้องเมื่อดอกไม้ไฟสว่างไสวบนท้องฟ้า"}
{"word":"lit up","english":"Her smile lit up the entire room.","thai":"รอยยิ้มของเธอทำให้ทั้งห้องสว่างไสว"}
{"word":"smile","english":"A genuine smile can make someone’s day.","thai":"รอยยิ้มที่จริงใจสามารถทำให้วันของใครบางคนดีขึ้น"}
{"word":"genuine","english":"His genuine kindness won everyone’s trust.","thai":"ความเมตตาที่แท้จริงของเขาชนะใจทุกคน"}
{"word":"trust","english":"Building trust takes time and effort.","thai":"การสร้างความไว้วางใจต้องใช้เวลาและความพยายาม"}
{"word":"effort","english":"Her effort in the project was outstanding.","thai":"ความพยายามของเธอในโครงการนั้นโดดเด่น"}
{"word":"outstanding","english":"The chef’s outstanding dishes amazed the guests.","thai":"อาหารที่ยอดเยี่ยมของเชฟทำให้แขกทึ่ง"}
{"word":"dishes","english":"I need to wash the dishes after dinner.","thai":"ฉันต้องล้างจานหลังอาหารเย็น"}
{"word":"wash","english":"Can you wash the car this weekend?","thai":"ล้างรถวันหยุดสุดสัปดาห์นี้ได้ไหม?"}
{"word":"car","english":"The car broke down on the highway.","thai":"รถเสียบนทางหลวง"}
{"word":"break down","english":"Don’t let stress break you down.","thai":"อย่าให้ความเครียดทำลายคุณ"}
{"word":"stress","english":"Work stress can affect your health.","thai":"ความเครียดจากงานอาจส่งผลต่อสุขภาพของคุณ"}
{"word":"affect","english":"Her words deeply affect how I see things.","thai":"คำพูดของเธอมีผลอย่างมากต่อมุมมองของฉัน"}
{"word":"see","english":"I can’t wait to see the new art exhibit.","thai":"ฉันรอไม่ไหวที่จะไปดูนิทรรศการศิลปะใหม่"}
{"word":"exhibit","english":"The museum’s exhibit showcased rare artifacts.","thai":"นิทรรศการของพิพิธภัณฑ์แสดงโบราณวัตถุหายาก"}
{"word":"rare","english":"Finding rare coins is a collector’s dream.","thai":"การหาเหรียญหายากคือความฝันของนักสะสม"}
{"word":"dream","english":"Her dream to travel the world came true.","thai":"ความฝันของเธอที่จะเดินทางรอบโลกเป็นจริง"}
