{"word": "sign up", "english": "I need to sign up for the new streaming service.", "thai": "ฉันต้องสมัครใช้บริการสตรีมมิ่งใหม่"}
{"word": "sign up", "english": "Did you sign up for the yoga class yet?", "thai": "คุณสมัครเรียนโยคะหรือยัง?"}
{"word": "sign up", "english": "She forgot to sign up for the conference.", "thai": "เธอลืมสมัครเข้าร่วมการประชุม"}
{"word": "sign up", "english": "They’re offering a discount if you sign up today.", "thai": "พวกเขาให้ส่วนลดถ้าคุณสมัครวันนี้"}
{"word": "sign up", "english": "I’m going to sign up for a gym membership.", "thai": "ฉันจะสมัครสมาชิกยิม"}
{"word": "sign up", "english": "You should sign up for the newsletter.", "thai": "คุณควรสมัครรับจดหมายข่าว"}
{"word": "sign up", "english": "He signed up for the cooking workshop.", "thai": "เขาสมัครเข้าร่วมเวิร์กช็อปทำอาหาร"}
{"word": "sign up", "english": "We need to sign up for the volunteer program.", "thai": "เราต้องสมัครเข้าร่วมโปรแกรมอาสาสมัคร"}
{"word": "sign up", "english": "Can you help me sign up for this online course?", "thai": "คุณช่วยฉันสมัครคอร์สออนไลน์นี้ได้ไหม?"}
{"word": "sign up", "english": "She’s excited to sign up for the dance class.", "thai": "เธอตื่นเต้นที่จะสมัครเรียนเต้น"}
{"word": "sign up", "english": "I didn’t sign up for this kind of stress!", "thai": "ฉันไม่ได้สมัครมาเพื่อความเครียดแบบนี้!"}
{"word": "sign up", "english": "They signed up for the charity run.", "thai": "พวกเขาสมัครเข้าร่วมวิ่งการกุศล"}
{"word": "sign up", "english": "You have to sign up to get the free trial.", "thai": "คุณต้องสมัครเพื่อรับการทดลองใช้ฟรี"}
{"word": "sign up", "english": "He’s planning to sign up for the book club.", "thai": "เขาวางแผนจะสมัครเข้าชมรมหนังสือ"}
{"word": "sign up", "english": "I signed up for the webinar last night.", "thai": "ฉันสมัครเข้าร่วมเว็บบินาร์เมื่อคืนนี้"}
{"word": "sign up", "english": "Why don’t you sign up for the art workshop?", "thai": "ทำไมคุณไม่สมัครเข้าร่วมเวิร์กช็อปศิลปะล่ะ?"}
{"word": "sign up", "english": "She signed up for a new email account.", "thai": "เธอสมัครบัญชีอีเมลใหม่"}
{"word": "sign up", "english": "We should sign up for the hiking trip.", "thai": "เราควรสมัครเข้าร่วมทริปเดินป่า"}
{"word": "sign up", "english": "He didn’t want to sign up for extra shifts.", "thai": "เขาไม่อยากสมัครทำงานกะพิเศษ"}
{"word": "sign up", "english": "I’m trying to sign up for the loyalty program.", "thai": "ฉันกำลังพยายามสมัครโปรแกรมสมาชิก"}
{"word": "sign up", "english": "They signed up for the parenting seminar.", "thai": "พวกเขาสมัครเข้าร่วมสัมมนาการเลี้ยงลูก"}
{"word": "sign up", "english": "You need to sign up by Friday to join.", "thai": "คุณต้องสมัครภายในวันศุกร์เพื่อเข้าร่วม"}
{"word": "sign up", "english": "I signed up for a photography course.", "thai": "ฉันสมัครเรียนคอร์สถ่ายภาพ"}
{"word": "sign up", "english": "She’s going to sign up for the marathon.", "thai": "เธอจะสมัครวิ่งมาราธอน"}
{"word": "sign up", "english": "He signed up for the coding bootcamp.", "thai": "เขาสมัครเข้าร่วมค่ายเรียนโค้ด"}
{"word": "sign up", "english": "We signed up for the wine tasting event.", "thai": "เราสมัครเข้าร่วมงานชิมไวน์"}
{"word": "sign up", "english": "I forgot to sign up for the guest list.", "thai": "ฉันลืมสมัครเข้ารายชื่อแขก"}
{"word": "sign up", "english": "They’re asking people to sign up for the survey.", "thai": "พวกเขาขอให้คนสมัครเข้าร่วมแบบสำรวจ"}
{"word": "sign up", "english": "I need to sign up for a new phone plan.", "thai": "ฉันต้องสมัครแผนโทรศัพท์ใหม่"}
{"word": "sign up", "english": "She signed up for the fitness challenge.", "thai": "เธอสมัครเข้าร่วมความท้าทายด้านฟิตเนส"}
{"word": "sign up", "english": "He’s too shy to sign up for the talent show.", "thai": "เขาเขินเกินกว่าจะสมัครเข้าร่วมการแสดงความสามารถ"}
{"word": "sign up", "english": "We should sign up for the community cleanup.", "thai": "เราควรสมัครเข้าร่วมการทำความสะอาดชุมชน"}
{"word": "sign up", "english": "I signed up for the language exchange program.", "thai": "ฉันสมัครเข้าร่วมโปรแกรมแลกเปลี่ยนภาษา"}
{"word": "sign up", "english": "You can sign up for the app on their website.", "thai": "คุณสามารถสมัครใช้แอปได้ที่เว็บไซต์ของพวกเขา"}
{"word": "sign up", "english": "She didn’t sign up for the group project.", "thai": "เธอไม่ได้สมัครเข้าร่วมโปรเจกต์กลุ่ม"}
{"word": "sign up", "english": "They signed up for the science fair.", "thai": "พวกเขาสมัครเข้าร่วมงานวิทยาศาสตร์"}
{"word": "sign up", "english": "I’m going to sign up for the chess club.", "thai": "ฉันจะสมัครเข้าชมรมหมากรุก"}
{"word": "sign up", "english": "He signed up for the mentorship program.", "thai": "เขาสมัครเข้าร่วมโปรแกรมพี่เลี้ยง"}
{"word": "sign up", "english": "We need to sign up for the workshop soon.", "thai": "เราต้องสมัครเข้าร่วมเวิร์กช็อปเร็ว ๆ นี้"}
{"word": "sign up", "english": "She signed up for a free trial of the software.", "thai": "เธอสมัครทดลองใช้ซอฟต์แวร์ฟรี"}
{"word": "sign up", "english": "I forgot to sign up for the company picnic.", "thai": "ฉันลืมสมัครเข้าร่วมงานปิกนิกของบริษัท"}
{"word": "sign up", "english": "They’re encouraging everyone to sign up for the vote.", "thai": "พวกเขาสนับสนุนให้ทุกคนสมัครลงคะแนน"}
{"word": "sign up", "english": "I signed up for the online fitness program.", "thai": "ฉันสมัครเข้าร่วมโปรแกรมฟิตเนสออนไลน์"}
{"word": "sign up", "english": "You should sign up for the rewards program.", "thai": "คุณควรสมัครเข้าร่วมโปรแกรมรางวัล"}
{"word": "sign up", "english": "He signed up for the poetry reading event.", "thai": "เขาสมัครเข้าร่วมงานอ่านบทกวี"}
{"word": "sign up", "english": "We signed up for the local theater group.", "thai": "เราสมัครเข้าร่วมกลุ่มโรงละครท้องถิ่น"}
{"word": "sign up", "english": "I need to sign up for the parenting class.", "thai": "ฉันต้องสมัครเรียนชั้นเรียนการเลี้ยงลูก"}
{"word": "sign up", "english": "She signed up for the knitting circle.", "thai": "เธอสมัครเข้าร่วมวงถักนิตติ้ง"}
{"word": "sign up", "english": "They signed up for the adventure tour.", "thai": "พวกเขาสมัครเข้าร่วมทัวร์ผจญภัย"}
{"word": "sign up", "english": "I’m going to sign up for the writing contest.", "thai": "ฉันจะสมัครเข้าร่วมการแข่งขันเขียน"}
{"word": "sign up", "english": "He didn’t sign up for the team tryouts.", "thai": "เขาไม่ได้สมัครเข้าร่วมการคัดเลือกทีม"}
{"word": "sign up", "english": "We should sign up for the baking class.", "thai": "เราควรสมัครเรียนชั้นเรียนอบขนม"}
{"word": "sign up", "english": "She signed up for the meditation retreat.", "thai": "เธอสมัครเข้าร่วมการฝึกสมาธิ"}
{"word": "sign up", "english": "I signed up for the newsletter yesterday.", "thai": "ฉันสมัครรับจดหมายข่าวเมื่อวานนี้"}
{"word": "sign up", "english": "They signed up for the startup incubator.", "thai": "พวกเขาสมัครเข้าร่วมโปรแกรมบ่มเพาะสตาร์ทอัพ"}
{"word": "sign up", "english": "You need to sign up to access the platform.", "thai": "คุณต้องสมัครเพื่อเข้าถึงแพลตฟอร์ม"}
{"word": "sign up", "english": "He signed up for the film festival pass.", "thai": "เขาสมัครซื้อบัตรเทศกาลภาพยนตร์"}
{"word": "sign up", "english": "I’m thinking about signing up for the debate team.", "thai": "ฉันกำลังคิดจะสมัครเข้าทีมโต้วาที"}
{"word": "sign up", "english": "She signed up for the pottery workshop.", "thai": "เธอสมัครเข้าร่วมเวิร์กช็อปเครื่องปั้นดินเผา"}
{"word": "sign up", "english": "We signed up for the community garden project.", "thai": "เราสมัครเข้าร่วมโปรเจกต์สวนชุมชน"}
{"word": "sign up", "english": "I need to sign up for the online seminar.", "thai": "ฉันต้องสมัครเข้าร่วมสัมมนาออนไลน์"}
{"word": "sign up", "english": "They signed up for the pet adoption event.", "thai": "พวกเขาสมัครเข้าร่วมงานรับเลี้ยงสัตว์เลี้ยง"}
{"word": "sign up", "english": "She’s going to sign up for the choir.", "thai": "เธอจะสมัครเข้าร่วมคณะนักร้องประสานเสียง"}
{"word": "sign up", "english": "I signed up for the hiking club last week.", "thai": "ฉันสมัครเข้าชมรมเดินป่าเมื่อสัปดาห์ที่แล้ว"}
{"word": "sign up", "english": "He didn’t sign up for the study group.", "thai": "เขาไม่ได้สมัครเข้าร่วมกลุ่มเรียน"}
{"word": "sign up", "english": "We should sign up for the cooking competition.", "thai": "เราควรสมัครเข้าร่วมการแข่งขันทำอาหาร"}
{"word": "sign up", "english": "I signed up for the virtual book club.", "thai": "ฉันสมัครเข้าร่วมชมรมหนังสือออนไลน์"}
{"word": "sign up", "english": "She signed up for the fitness bootcamp.", "thai": "เธอสมัครเข้าร่วมค่ายฟิตเนส"}
{"word": "sign up", "english": "They signed up for the language course.", "thai": "พวกเขาสมัครเรียนคอร์สภาษา"}
{"word": "sign up", "english": "I’m going to sign up for the art exhibition.", "thai": "ฉันจะสมัครเข้าร่วมนิทรรศการศิลปะ"}
{"word": "sign up", "english": "He signed up for the volunteer trip abroad.", "thai": "เขาสมัครเข้าร่วมทริปอาสาสมัครต่างประเทศ"}
{"word": "sign up", "english": "We need to sign up for the holiday event.", "thai": "เราต้องสมัครเข้าร่วมงานวันหยุด"}
{"word": "sign up", "english": "She signed up for the online tutoring service.", "thai": "เธอสมัครใช้บริการสอนออนไลน์"}
{"word": "sign up", "english": "I forgot to sign up for the fitness class.", "thai": "ฉันลืมสมัครเรียนชั้นเรียนฟิตเนส"}
{"word": "sign up", "english": "They signed up for the environmental campaign.", "thai": "พวกเขาสมัครเข้าร่วมแคมเปญสิ่งแวดล้อม"}
{"word": "sign up", "english": "You should sign up for the mentorship session.", "thai": "คุณควรสมัครเข้าร่วมเซสชันพี่เลี้ยง"}
{"word": "sign up", "english": "I signed up for the weekly yoga sessions.", "thai": "ฉันสมัครเข้าร่วมเซสชันโยคะรายสัปดาห์"}
{"word": "sign up", "english": "She signed up for the leadership program.", "thai": "เธอสมัครเข้าร่วมโปรแกรมผู้นำ"}
{"word": "sign up", "english": "We signed up for the local charity drive.", "thai": "เราสมัครเข้าร่วมงานระดมทุนการกุศลท้องถิ่น"}
{"word": "sign up", "english": "He’s going to sign up for the startup pitch.", "thai": "เขาจะสมัครเข้าร่วมการนำเสนอสตาร์ทอัพ"}
{"word": "sign up", "english": "I need to sign up for the music lessons.", "thai": "ฉันต้องสมัครเรียนดนตรี"}
{"word": "sign up", "english": "They signed up for the annual festival.", "thai": "พวกเขาสมัครเข้าร่วมเทศกาลประจำปี"}
{"word": "sign up", "english": "She signed up for the creative writing course.", "thai": "เธอสมัครเรียนคอร์สเขียนเชิงสร้างสรรค์"}
{"word": "sign up", "english": "I’m thinking about signing up for the dance team.", "thai": "ฉันกำลังคิดจะสมัครเข้าทีมเต้น"}
{"word": "sign up", "english": "He signed up for the astronomy club.", "thai": "เขาสมัครเข้าชมรมดาราศาสตร์"}
{"word": "sign up", "english": "We should sign up for the film screening.", "thai": "เราควรสมัครเข้าร่วมการฉายภาพยนตร์"}
{"word": "sign up", "english": "I signed up for the weekly book discussion.", "thai": "ฉันสมัครเข้าร่วมการสนทนาหนังสือรายสัปดาห์"}
{"word": "sign up", "english": "She signed up for the gardening workshop.", "thai": "เธอสมัครเข้าร่วมเวิร์กช็อปทำสวน"}
{"word": "sign up", "english": "They signed up for the coding competition.", "thai": "พวกเขาสมัครเข้าร่วมการแข่งขันโค้ด"}
{"word": "sign up", "english": "I need to sign up for the online platform.", "thai": "ฉันต้องสมัครใช้แพลตฟอร์มออนไลน์"}
{"word": "sign up", "english": "He signed up for the public speaking class.", "thai": "เขาสมัครเรียนชั้นเรียนการพูดในที่สาธารณะ"}
{"word": "sign up", "english": "We signed up for the virtual cooking class.", "thai": "เราสมัครเรียนชั้นเรียนทำอาหารออนไลน์"}
{"word": "sign up", "english": "She’s going to sign up for the chess tournament.", "thai": "เธอจะสมัครเข้าร่วมการแข่งขันหมากรุก"}
{"word": "sign up", "english": "I signed up for the photography contest.", "thai": "ฉันสมัครเข้าร่วมการแข่งขันถ่ายภาพ"}
{"word": "sign up", "english": "They signed up for the team-building retreat.", "thai": "พวกเขาสมัครเข้าร่วมการฝึกอบรมสร้างทีม"}
{"word": "sign up", "english": "I’m going to sign up for the fitness app.", "thai": "ฉันจะสมัครใช้แอปฟิตเนส"}
{"word": "sign up", "english": "She signed up for the virtual art class.", "thai": "เธอสมัครเรียนชั้นเรียนศิลปะออนไลน์"}
{"word": "drop off", "english": "Can you drop off the kids at school?", "thai": "คุณช่วยไปส่งเด็ก ๆ ที่โรงเรียนได้ไหม?"}
{"word": "drop off", "english": "I need to drop off this package at the post office.", "thai": "ฉันต้องไปส่งพัสดุนี้ที่ไปรษณีย์"}
{"word": "drop off", "english": "She dropped off the books at the library.", "thai": "เธอไปส่งหนังสือที่ห้องสมุด"}
{"word": "drop off", "english": "Sales have started to drop off this month.", "thai": "ยอดขายเริ่มลดลงในเดือนนี้"}
{"word": "drop off", "english": "He’s going to drop off the car at the mechanic.", "thai": "เขาจะไปส่งรถที่ช่าง"}
{"word": "drop off", "english": "I’ll drop off the groceries at your place later.", "thai": "ฉันจะไปส่งของชำที่บ้านคุณทีหลัง"}
{"word": "drop off", "english": "The bus will drop off passengers at the next stop.", "thai": "รถบัสจะไปส่งผู้โดยสารที่ป้ายถัดไป"}
{"word": "drop off", "english": "My energy levels drop off in the afternoon.", "thai": "ระดับพลังงานของฉันลดลงในช่วงบ่าย"}
{"word": "drop off", "english": "Can you drop off my dry cleaning?", "thai": "คุณช่วยไปส่งเสื้อผ้าซักแห้งของฉันได้ไหม?"}
{"word": "drop off", "english": "They dropped off the donations at the shelter.", "thai": "พวกเขาไปส่งของบริจาคที่ศูนย์พักพิง"}
{"word": "drop off", "english": "I noticed a drop off in website traffic.", "thai": "ฉันสังเกตเห็นการลดลงของการเข้าชมเว็บไซต์"}
{"word": "drop off", "english": "She’s going to drop off the keys with the landlord.", "thai": "เธอจะไปส่งกุญแจให้เจ้าของบ้าน"}
{"word": "drop off", "english": "He dropped off his resume at the office.", "thai": "เขาไปส่งเรซูเม่ที่สำนักงาน"}
{"word": "drop off", "english": "The delivery guy will drop off the pizza soon.", "thai": "คนส่งของจะไปส่งพิซซ่าในไม่ช้า"}
{"word": "drop off", "english": "Attendance tends to drop off after the holidays.", "thai": "จำนวนผู้เข้าร่วมมักจะลดลงหลังวันหยุด"}
{"word": "drop off", "english": "I’ll drop off your jacket at your house.", "thai": "ฉันจะไปส่งแจ็คเก็ตที่บ้านคุณ"}
{"word": "drop off", "english": "The taxi dropped off the tourists at the hotel.", "thai": "แท็กซี่ไปส่งนักท่องเที่ยวที่โรงแรม"}
{"word": "drop off", "english": "Her performance has dropped off lately.", "thai": "ผลงานของเธอลดลงในช่วงนี้"}
{"word": "drop off", "english": "Can you drop off these documents at the bank?", "thai": "คุณช่วยไปส่งเอกสารเหล่านี้ที่ธนาคารได้ไหม?"}
{"word": "drop off", "english": "He dropped off the kids at soccer practice.", "thai": "เขาไปส่งเด็ก ๆ ที่ซ้อมฟุตบอล"}
{"word": "drop off", "english": "The package was dropped off this morning.", "thai": "พัสดุถูกส่งมาเมื่อเช้านี้"}
{"word": "drop off", "english": "I need to drop off some clothes at the thrift store.", "thai": "ฉันต้องไปส่งเสื้อผ้าที่ร้านมือสอง"}
{"word": "drop off", "english": "Business tends to drop off in the winter.", "thai": "ธุรกิจมักจะลดลงในช่วงฤดูหนาว"}
{"word": "drop off", "english": "She dropped off a gift for the party.", "thai": "เธอไปส่งของขวัญสำหรับงานปาร์ตี้"}
{"word": "drop off", "english": "Can you drop off my laptop at the repair shop?", "thai": "คุณช่วยไปส่งแล็ปท็อปของฉันที่ร้านซ่อมได้ไหม?"}
{"word": "drop off", "english": "He’s going to drop off the equipment at the gym.", "thai": "เขาจะไปส่งอุปกรณ์ที่ยิม"}
{"word": "drop off", "english": "The number of visitors dropped off after the event.", "thai": "จำนวนผู้เยี่ยมชมลดลงหลังงาน"}
{"word": "drop off", "english": "I’ll drop off the forms at the school office.", "thai": "ฉันจะไปส่งแบบฟอร์มที่สำนักงานโรงเรียน"}
{"word": "drop off", "english": "She dropped off her old furniture at the donation center.", "thai": "เธอไปส่งเฟอร์นิเจอร์เก่าที่ศูนย์บริจาค"}
{"word": "drop off", "english": "The driver will drop off the supplies tomorrow.", "thai": "คนขับจะไปส่งอุปกรณ์พรุ่งนี้"}
{"word": "drop off", "english": "My motivation tends to drop off after lunch.", "thai": "แรงจูงใจของฉันมักจะลดลงหลังอาหารกลางวัน"}
{"word": "drop off", "english": "Can you drop off the kids at their friend’s house?", "thai": "คุณช่วยไปส่งเด็ก ๆ ที่บ้านเพื่อนได้ไหม?"}
{"word": "drop off", "english": "He dropped off the payment at the office.", "thai": "เขาไปส่งเงินที่สำนักงาน"}
{"word": "drop off", "english": "The courier dropped off the package at the wrong address.", "thai": "คนส่งของไปส่งพัสดุผิดที่อยู่"}
{"word": "drop off", "english": "Sales always drop off during the rainy season.", "thai": "ยอดขายมักจะลดลงในช่วงฤดูฝน"}
{"word": "drop off", "english": "I’ll drop off the books at your place tonight.", "thai": "ฉันจะไปส่งหนังสือที่บ้านคุณคืนนี้"}
{"word": "drop off", "english": "She dropped off her dog at the groomer.", "thai": "เธอไปส่งหมาไปที่ร้านตัดแต่งขน"}
{"word": "drop off", "english": "The delivery service dropped off my order yesterday.", "thai": "บริการจัดส่งไปส่งคำสั่งซื้อของฉันเมื่อวาน"}
{"word": "drop off", "english": "His grades started to drop off this semester.", "thai": "เกรดของเขาเริ่มลดลงในภาคเรียนนี้"}
{"word": "drop off", "english": "Can you drop off this letter at the mailbox?", "thai": "คุณช่วยไปส่งจดหมายนี้ที่ตู้จดหมายได้ไหม?"}
{"word": "drop off", "english": "They dropped off the food at the community center.", "thai": "พวกเขาไปส่งอาหารที่ศูนย์ชุมชน"}
{"word": "drop off", "english": "I noticed a drop off in customer complaints.", "thai": "ฉันสังเกตเห็นการลดลงของการร้องเรียนจากลูกค้า"}
{"word": "drop off", "english": "She’s going to drop off the kids at daycare.", "thai": "เธอจะไปส่งเด็ก ๆ ที่ศูนย์รับเลี้ยงเด็ก"}
{"word": "drop off", "english": "He dropped off his old phone at the recycling center.", "thai": "เขาไปส่งโทรศัพท์เก่าที่ศูนย์รีไซเคิล"}
{"word": "drop off", "english": "The bus driver dropped off the team at the stadium.", "thai": "คนขับรถบัสไปส่งทีมที่สนามกีฬา"}
{"word": "drop off", "english": "Orders tend to drop off around the holidays.", "thai": "คำสั่งซื้อมักจะลดลงในช่วงวันหยุด"}
{"word": "drop off", "english": "I’ll drop off the cake at the party venue.", "thai": "ฉันจะไปส่งเค้กที่สถานที่จัดงานปาร์ตี้"}
{"word": "drop off", "english": "She dropped off her application at the college.", "thai": "เธอไปส่งใบสมัครที่วิทยาลัย"}
{"word": "drop off", "english": "Can you drop off these flyers at the store?", "thai": "คุณช่วยไปส่งใบปลิวเหล่านี้ที่ร้านได้ไหม?"}
{"word": "drop off", "english": "He’s going to drop off the tools at the workshop.", "thai": "เขาจะไปส่งเครื่องมือที่เวิร์กช็อป"}
{"word": "drop off", "english": "The number of applicants dropped off this year.", "thai": "จำนวนผู้สมัครลดลงในปีนี้"}
{"word": "drop off", "english": "I dropped off the kids at their grandparents’ house.", "thai": "ฉันไปส่งเด็ก ๆ ที่บ้านปู่ย่า"}
{"word": "drop off", "english": "She dropped off a care package at the hospital.", "thai": "เธอไปส่งชุดของขวัญที่โรงพยาบาล"}
{"word": "drop off", "english": "The delivery guy dropped off the wrong order.", "thai": "คนส่งของไปส่งคำสั่งซื้อผิด"}
{"word": "drop off", "english": "My focus tends to drop off after long meetings.", "thai": "สมาธิของฉันมักจะลดลงหลังการประชุมยาว"}
{"word": "drop off", "english": "Can you drop off my bag at the hotel?", "thai": "คุณช่วยไปส่งกระเป๋าของฉันที่โรงแรมได้ไหม?"}
{"word": "drop off", "english": "They dropped off the supplies at the construction site.", "thai": "พวกเขาไปส่งอุปกรณ์ที่ไซต์ก่อสร้าง"}
{"word": "drop off", "english": "I’ll drop off the report at your desk tomorrow.", "thai": "ฉันจะไปส่งรายงานที่โต๊ะคุณพรุ่งนี้"}
{"word": "drop off", "english": "Her enthusiasm dropped off after the first week.", "thai": "ความกระตือรือร้นของเธอลดลงหลังสัปดาห์แรก"}
{"word": "drop off", "english": "He dropped off the package at the neighbor’s house.", "thai": "เขาไปส่งพัสดุที่บ้านเพื่อนบ้าน"}
{"word": "drop off", "english": "The driver will drop off the group at the museum.", "thai": "คนขับจะไปส่งกลุ่มที่พิพิธภัณฑ์"}
{"word": "drop off", "english": "Sales dropped off sharply after the promotion ended.", "thai": "ยอดขายลดลงอย่างมากหลังโปรโมชันสิ้นสุด"}
{"word": "drop off", "english": "I’ll drop off the kids at the park.", "thai": "ฉันจะไปส่งเด็ก ๆ ที่สวนสาธารณะ"}
{"word": "drop off", "english": "She dropped off her old clothes at the charity shop.", "thai": "เธอไปส่งเสื้อผ้าเก่าที่ร้านการกุศล"}
{"word": "drop off", "english": "Can you drop off this box at the storage unit?", "thai": "คุณช่วยไปส่งกล่องนี้ที่หน่วยเก็บของได้ไหม?"}
{"word": "drop off", "english": "He dropped off the keys at the rental office.", "thai": "เขาไปส่งกุญแจที่สำนักงานให้เช่า"}
{"word": "drop off", "english": "The number of volunteers dropped off this month.", "thai": "จำนวนอาสาสมัครลดลงในเดือนนี้"}
{"word": "drop off", "english": "I’ll drop off the food at the shelter later.", "thai": "ฉันจะไปส่งอาหารที่ศูนย์พักพิงทีหลัง"}
{"word": "drop off", "english": "She dropped off her bike at the repair shop.", "thai": "เธอไปส่งจักรยานที่ร้านซ่อม"}
{"word": "drop off", "english": "The courier dropped off the documents this morning.", "thai": "คนส่งของไปส่งเอกสารเมื่อเช้านี้"}
{"word": "drop off", "english": "Productivity tends to drop off in the summer.", "thai": "ผลผลิตมักจะลดลงในช่วงฤดูร้อน"}
{"word": "drop off", "english": "Can you drop off the kids at their music lesson?", "thai": "คุณช่วยไปส่งเด็ก ๆ ที่เรียนดนตรีได้ไหม?"}
{"word": "drop off", "english": "He dropped off the equipment at the school.", "thai": "เขาไปส่งอุปกรณ์ที่โรงเรียน"}
{"word": "drop off", "english": "I noticed a drop off in team morale.", "thai": "ฉันสังเกตเห็นการลดลงของขวัญกำลังใจทีม"}
{"word": "drop off", "english": "She’s going to drop off the cake at the bakery.", "thai": "เธอจะไปส่งเค้กที่ร้านเบเกอรี่"}
{"word": "drop off", "english": "The driver dropped off the passengers at the airport.", "thai": "คนขับไปส่งผู้โดยสารที่สนามบิน"}
{"word": "drop off", "english": "Sales dropped off after the new competitor arrived.", "thai": "ยอดขายลดลงหลังคู่แข่งใหม่เข้ามา"}
{"word": "drop off", "english": "I’ll drop off the gifts at the party.", "thai": "ฉันจะไปส่งของขวัญที่งานปาร์ตี้"}
{"word": "drop off", "english": "She dropped off her laptop at the tech store.", "thai": "เธอไปส่งแล็ปท็อปที่ร้านเทคโนโลยี"}
{"word": "drop off", "english": "Can you drop off these books at the bookstore?", "thai": "คุณช่วยไปส่งหนังสือเหล่านี้ที่ร้านหนังสือได้ไหม?"}
{"word": "drop off", "english": "He dropped off the supplies at the event venue.", "thai": "เขาไปส่งอุปกรณ์ที่สถานที่จัดงาน"}
{"word": "drop off", "english": "The number of sign-ups dropped off this week.", "thai": "จำนวนการสมัครลดลงในสัปดาห์นี้"}
{"word": "drop off", "english": "I’ll drop off the package at the courier service.", "thai": "ฉันจะไปส่งพัสดุที่บริการขนส่ง"}
{"word": "drop off", "english": "She dropped off her kids at summer camp.", "thai": "เธอไปส่งเด็ก ๆ ที่ค่ายฤดูร้อน"}
{"word": "drop off", "english": "The delivery guy dropped off the flowers this afternoon.", "thai": "คนส่งของไปส่งดอกไม้ช่วงบ่ายนี้"}
{"word": "drop off", "english": "His interest in the project dropped off quickly.", "thai": "ความสนใจในโปรเจกต์ของเขาลดลงอย่างรวดเร็ว"}
{"word": "drop off", "english": "Can you drop off the paperwork at the lawyer’s office?", "thai": "คุณช่วยไปส่งเอกสารที่สำนักงานทนายได้ไหม?"}
{"word": "drop off", "english": "They dropped off the old toys at the orphanage.", "thai": "พวกเขาไปส่งของเล่นเก่าที่สถานเลี้ยงเด็กกำพร้า"}
{"word": "drop off", "english": "I’ll drop off the kids at their dance class.", "thai": "ฉันจะไปส่งเด็ก ๆ ที่เรียนเต้น"}
{"word": "drop off", "english": "She dropped off her application at the job fair.", "thai": "เธอไปส่งใบสมัครที่งานหางาน"}
{"word": "drop off", "english": "The bus will drop off the students at the museum.", "thai": "รถบัสจะไปส่งนักเรียนที่พิพิธภัณฑ์"}
{"word": "drop off", "english": "Customer inquiries dropped off after the holidays.", "thai": "การสอบถามจากลูกค้าลดลงหลังวันหยุด"}
{"word": "drop off", "english": "He dropped off the tools at the hardware store.", "thai": "เขาไปส่งเครื่องมือที่ร้านฮาร์ดแวร์"}
{"word": "drop off", "english": "I’ll drop off the donation at the charity event.", "thai": "ฉันจะไปส่งของบริจาคที่งานการกุศล"}
{"word": "drop off", "english": "She dropped off her cat at the vet.", "thai": "เธอไปส่งแมวที่คลินิกสัตวแพทย์"}
{"word": "drop off", "english": "Can you drop off the package at the shipping center?", "thai": "คุณช่วยไปส่งพัสดุที่ศูนย์ขนส่งได้ไหม?"}
{"word": "drop off", "english": "The driver dropped off the group at the theater.", "thai": "คนขับไปส่งกลุ่มที่โรงละคร"}
{"word": "drop off", "english": "My productivity dropped off after the long weekend.", "thai": "ผลผลิตของฉันลดลงหลังวันหยุดยาว"}
{"word": "drop off", "english": "I’ll drop off the keys at the real estate office.", "thai": "ฉันจะไปส่งกุญแจที่สำนักงานอสังหาริมทรัพย์"}
{"word": "pick up", "english": "Can you pick up the kids from school?", "thai": "คุณช่วยไปรับเด็ก ๆ จากโรงเรียนได้ไหม?"}
{"word": "pick up", "english": "I need to pick up my dry cleaning today.", "thai": "ฉันต้องไปรับเสื้อผ้าซักแห้งวันนี้"}
{"word": "pick up", "english": "Sales started to pick up after the campaign.", "thai": "ยอดขายเริ่มเพิ่มขึ้นหลังแคมเปญ"}
{"word": "pick up", "english": "She picked up the package from the post office.", "thai": "เธอไปรับพัสดุจากไปรษณีย์"}
{"word": "pick up", "english": "He’s going to pick up some groceries on the way home.", "thai": "เขาจะไปรับของชำระหว่างทางกลับบ้าน"}
{"word": "pick up", "english": "I’ll pick up the phone when she calls.", "thai": "ฉันจะรับโทรศัพท์เมื่อเธอโทรมา"}
{"word": "pick up", "english": "The economy is starting to pick up.", "thai": "เศรษฐกิจเริ่มฟื้นตัว"}
{"word": "pick up", "english": "Can you pick up my prescription at the pharmacy?", "thai": "คุณช่วยไปรับยาตามใบสั่งที่ร้านขายยาได้ไหม?"}
{"word": "pick up", "english": "He picked up a new language while traveling.", "thai": "เขาเรียนรู้ภาษาใหม่ระหว่างเดินทาง"}
{"word": "pick up", "english": "I forgot to pick up the tickets for the concert.", "thai": "ฉันลืมไปรับตั๋วคอนเสิร์ต"}
{"word": "pick up", "english": "She’s going to pick up her friend from the airport.", "thai": "เธอจะไปรับเพื่อนจากสนามบิน"}
{"word": "pick up", "english": "Business has really picked up this month.", "thai": "ธุรกิจดีขึ้นมากในเดือนนี้"}
{"word": "pick up", "english": "I’ll pick up some coffee on my way to work.", "thai": "ฉันจะไปรับกาแฟระหว่างทางไปทำงาน"}
{"word": "pick up", "english": "He picked up the kids from soccer practice.", "thai": "เขาไปรับเด็ก ๆ จากซ้อมฟุตบอล"}
{"word": "pick up", "english": "The weather is starting to pick up.", "thai": "สภาพอากาศเริ่มดีขึ้น"}
{"word": "pick up", "english": "Can you pick up the cake for the party?", "thai": "คุณช่วยไปรับเค้กสำหรับงานปาร์ตี้ได้ไหม?"}
{"word": "pick up", "english": "She picked up some new skills at the workshop.", "thai": "เธอเรียนรู้ทักษะใหม่ ๆ จากเวิร์กช็อป"}
{"word": "pick up", "english": "I need to pick up my car from the mechanic.", "thai": "ฉันต้องไปรับรถจากช่าง"}
{"word": "pick up", "english": "He’s trying to pick up a new hobby.", "thai": "เขากำลังพยายามเริ่มงานอดิเรกใหม่"}
{"word": "pick up", "english": "The delivery guy will pick up the return package tomorrow.", "thai": "คนส่งของจะไปรับพัสดุคืนพรุ่งนี้"}
{"word": "pick up", "english": "My mood always picks up after a good workout.", "thai": "อารมณ์ของฉันดีขึ้นเสมอหลังออกกำลังกาย"}
{"word": "pick up", "english": "She picked up the kids’ toys from the floor.", "thai": "เธอเก็บของเล่นเด็ก ๆ จากพื้น"}
{"word": "pick up", "english": "I’ll pick up the tab for dinner tonight.", "thai": "ฉันจะจ่ายค่าอาหารคืนนี้"}
{"word": "pick up", "english": "He picked up some Spanish from his coworkers.", "thai": "เขาเรียนรู้ภาษาสเปนจากเพื่อนร่วมงาน"}
{"word": "pick up", "english": "Can you pick up some milk on your way home?", "thai": "คุณช่วยไปรับนมระหว่างทางกลับบ้านได้ไหม?"}
{"word": "pick up", "english": "The team’s performance picked up in the second half.", "thai": "ผลงานของทีมดีขึ้นในครึ่งหลัง"}
{"word": "pick up", "english": "She’s going to pick up her diploma from the university.", "thai": "เธอจะไปรับวุฒิบัตรจากมหาวิทยาลัย"}
{"word": "pick up", "english": "I need to pick up my glasses from the optometrist.", "thai": "ฉันต้องไปรับแว่นจากร้านแว่นตา"}
{"word": "pick up", "english": "He picked up a bad habit from his friends.", "thai": "เขาได้นิสัยไม่ดีจากเพื่อน"}
{"word": "pick up", "english": "The bus will pick up passengers at the next stop.", "thai": "รถบัสจะไปรับผู้โดยสารที่ป้ายถัดไป"}
{"word": "pick up", "english": "My energy levels pick up after a good night’s sleep.", "thai": "ระดับพลังงานของฉันเพิ่มขึ้นหลังนอนหลับดี"}
{"word": "pick up", "english": "Can you pick up my laptop from the repair shop?", "thai": "คุณช่วยไปรับแล็ปท็อปจากร้านซ่อมได้ไหม?"}
{"word": "pick up", "english": "She picked up the phone but no one was there.", "thai": "เธอรับโทรศัพท์แต่ไม่มีใครอยู่"}
{"word": "pick up", "english": "I’ll pick up some flowers for the party.", "thai": "ฉันจะไปรับดอกไม้สำหรับงานปาร์ตี้"}
{"word": "pick up", "english": "He picked up a few tricks from the cooking class.", "thai": "เขาเรียนรู้เทคนิคบางอย่างจากชั้นเรียนทำอาหาร"}
{"word": "pick up", "english": "The market is starting to pick up again.", "thai": "ตลาดเริ่มฟื้นตัวอีกครั้ง"}
{"word": "pick up", "english": "I forgot to pick up the dry cleaning yesterday.", "thai": "ฉันลืมไปรับเสื้อผ้าซักแห้งเมื่อวาน"}
{"word": "pick up", "english": "She’s going to pick up her parents from the train station.", "thai": "เธอจะไปรับพ่อแม่จากสถานีรถไฟ"}
{"word": "pick up", "english": "Can you pick up some snacks for the meeting?", "thai": "คุณช่วยไปรับของว่างสำหรับการประชุมได้ไหม?"}
{"word": "pick up", "english": "He picked up the kids from their friend’s house.", "thai": "เขาไปรับเด็ก ๆ จากบ้านเพื่อน"}
{"word": "pick up", "english": "The pace of the project is starting to pick up.", "thai": "ความคืบหน้าของโปรเจกต์เริ่มเร็วขึ้น"}
{"word": "pick up", "english": "I’ll pick up the keys from the real estate office.", "thai": "ฉันจะไปรับกุญแจจากสำนักงานอสังหาริมทรัพย์"}
{"word": "pick up", "english": "She picked up some French while living abroad.", "thai": "เธอเรียนรู้ภาษาฝรั่งเศสขณะอยู่นอกประเทศ"}
{"word": "pick up", "english": "Can you pick up the pizza on your way over?", "thai": "คุณช่วยไปรับพิซซ่าระหว่างทางมาได้ไหม?"}
{"word": "pick up", "english": "His health started to pick up after the treatment.", "thai": "สุขภาพของเขาเริ่มดีขึ้นหลังการรักษา"}
{"word": "pick up", "english": "I need to pick up my order from the store.", "thai": "ฉันต้องไปรับคำสั่งซื้อจากร้าน"}
{"word": "pick up", "english": "She picked up a new recipe from her mom.", "thai": "เธอได้สูตรอาหารใหม่จากแม่"}
{"word": "pick up", "english": "The taxi will pick up the guests at the hotel.", "thai": "แท็กซี่จะไปรับแขกที่โรงแรม"}
{"word": "pick up", "english": "My mood picked up after hearing the good news.", "thai": "อารมณ์ของฉันดีขึ้นหลังได้ยินข่าวดี"}
{"word": "pick up", "english": "Can you pick up some supplies for the project?", "thai": "คุณช่วยไปรับอุปกรณ์สำหรับโปรเจกต์ได้ไหม?"}
{"word": "pick up", "english": "He picked up the kids from daycare.", "thai": "เขาไปรับเด็ก ๆ จากศูนย์รับเลี้ยงเด็ก"}
{"word": "pick up", "english": "The team’s morale is starting to pick up.", "thai": "ขวัญกำลังใจของทีมเริ่มดีขึ้น"}
{"word": "pick up", "english": "I’ll pick up the documents from the office.", "thai": "ฉันจะไปรับเอกสารจากสำนักงาน"}
{"word": "pick up", "english": "She picked up some tips from the seminar.", "thai": "เธอได้เคล็ดลับจากสัมมนา"}
{"word": "pick up", "english": "Can you pick up my jacket from the cleaner’s?", "thai": "คุณช่วยไปรับแจ็คเก็ตจากร้านซักแห้งได้ไหม?"}
{"word": "pick up", "english": "He picked up a guitar and started playing.", "thai": "เขาหยิบกีตาร์และเริ่มเล่น"}
{"word": "pick up", "english": "The economy picked up after the new policies.", "thai": "เศรษฐกิจฟื้นตัวหลังนโยบายใหม่"}
{"word": "pick up", "english": "I’ll pick up some lunch for the team.", "thai": "ฉันจะไปรับอาหารกลางวันให้ทีม"}
{"word": "pick up", "english": "She picked up the kids from their music lesson.", "thai": "เธอไปรับเด็ก ๆ จากเรียนดนตรี"}
{"word": "pick up", "english": "Business is starting to pick up this season.", "thai": "ธุรกิจเริ่มดีขึ้นในฤดูกาลนี้"}
{"word": "pick up", "english": "Can you pick up the cake from the bakery?", "thai": "คุณช่วยไปรับเค้กจากร้านเบเกอรี่ได้ไหม?"}
{"word": "pick up", "english": "He picked up some coding skills online.", "thai": "เขาเรียนรู้ทักษะการเขียนโค้ดออนไลน์"}
{"word": "pick up", "english": "I need to pick up my bike from the shop.", "thai": "ฉันต้องไปรับจักรยานจากร้าน"}
{"word": "pick up", "english": "The party started to pick up after midnight.", "thai": "งานปาร์ตี้เริ่มคึกคักหลังเที่ยงคืน"}
{"word": "pick up", "english": "She’s going to pick up her brother from the station.", "thai": "เธอจะไปรับน้องชายจากสถานี"}
{"word": "pick up", "english": "Can you pick up some drinks for the barbecue?", "thai": "คุณช่วยไปรับเครื่องดื่มสำหรับงานบาร์บีคิวได้ไหม?"}
{"word": "pick up", "english": "He picked up the phone but it was a wrong number.", "thai": "เขารับโทรศัพท์แต่เป็นเบอร์ผิด"}
{"word": "pick up", "english": "The market picked up after the holidays.", "thai": "ตลาดฟื้นตัวหลังวันหยุด"}
{"word": "pick up", "english": "I’ll pick up the kids from their friend’s party.", "thai": "ฉันจะไปรับเด็ก ๆ จากงานปาร์ตี้เพื่อน"}
{"word": "pick up", "english": "She picked up a few phrases in Italian.", "thai": "เธอเรียนรู้วลีภาษาอิตาลีสองสามคำ"}
{"word": "pick up", "english": "Can you pick up my order from the restaurant?", "thai": "คุณช่วยไปรับคำสั่งซื้อจากร้านอาหารได้ไหม?"}
{"word": "pick up", "english": "His grades started to pick up this semester.", "thai": "เกรดของเขาเริ่มดีขึ้นในภาคเรียนนี้"}
{"word": "pick up", "english": "I need to pick up some supplies from the store.", "thai": "ฉันต้องไปรับอุปกรณ์จากร้าน"}
{"word": "pick up", "english": "She picked up the kids from summer camp.", "thai": "เธอไปรับเด็ก ๆ จากค่ายฤดูร้อน"}
{"word": "pick up", "english": "The game started to pick up in the final quarter.", "thai": "เกมเริ่มตื่นเต้นในควอเตอร์สุดท้าย"}
{"word": "pick up", "english": "Can you pick up my package from the neighbor?", "thai": "คุณช่วยไปรับพัสดุจากเพื่อนบ้านได้ไหม?"}
{"word": "pick up", "english": "He picked up some photography tips online.", "thai": "เขาเรียนรู้เคล็ดลับการถ่ายภาพออนไลน์"}
{"word": "pick up", "english": "I’ll pick up the kids from their dance class.", "thai": "ฉันจะไปรับเด็ก ๆ จากเรียนเต้น"}
{"word": "pick up", "english": "The business picked up after the new ad.", "thai": "ธุรกิจดีขึ้นหลังโฆษณาใหม่"}
{"word": "pick up", "english": "She’s going to pick up her dog from the groomer.", "thai": "เธอจะไปรับหมาจากร้านตัดแต่งขน"}
{"word": "pick up", "english": "Can you pick up some books from the library?", "thai": "คุณช่วยไปรับหนังสือจากห้องสมุดได้ไหม?"}
{"word": "pick up", "english": "He picked up a new workout routine.", "thai": "เขาเริ่มต้นการออกกำลังกายใหม่"}
{"word": "pick up", "english": "The event started to pick up after the speech.", "thai": "งานเริ่มคึกคักหลังการกล่าวสุนทรพจน์"}
{"word": "pick up", "english": "I’ll pick up the flowers from the florist.", "thai": "ฉันจะไปรับดอกไม้จากร้านดอกไม้"}
{"word": "pick up", "english": "She picked up some yoga techniques at the retreat.", "thai": "เธอเรียนรู้เทคนิคโยคะจากค่ายฝึก"}
{"word": "pick up", "english": "Can you pick up my suit from the tailor?", "thai": "คุณช่วยไปรับชุดสูทจากช่างตัดเสื้อได้ไหม?"}
{"word": "pick up", "english": "The team’s energy picked up after the break.", "thai": "พลังของทีมเพิ่มขึ้นหลังพัก"}
{"word": "pick up", "english": "I need to pick up my order from the bakery.", "thai": "ฉันต้องไปรับคำสั่งซื้อจากร้านเบเกอรี่"}
{"word": "pick up", "english": "He picked up the kids from their grandparents’ house.", "thai": "เขาไปรับเด็ก ๆ จากบ้านปู่ย่า"}
{"word": "pick up", "english": "The market is expected to pick up next quarter.", "thai": "คาดว่าตลาดจะฟื้นตัวในไตรมาสหน้า"}
{"word": "pick up", "english": "Can you pick up some decorations for the party?", "thai": "คุณช่วยไปรับของตกแต่งสำหรับงานปาร์ตี้ได้ไหม?"}
{"word": "pick up", "english": "She picked up a few dance moves at the class.", "thai": "เธอเรียนรู้ท่าเต้นสองสามท่าจากชั้นเรียน"}
{"word": "pick up", "english": "I’ll pick up the equipment from the gym.", "thai": "ฉันจะไปรับอุปกรณ์จากยิม"}
{"word": "pick up", "english": "His confidence picked up after the success.", "thai": "ความมั่นใจของเขาเพิ่มขึ้นหลังความสำเร็จ"}
{"word": "pick up", "english": "Can you pick up my shoes from the repair shop?", "thai": "คุณช่วยไปรับรองเท้าจากร้านซ่อมได้ไหม?"}
{"word": "pick up", "english": "She picked up the kids from their art class.", "thai": "เธอไปรับเด็ก ๆ จากเรียนศิลปะ"}
{"word": "pick up", "english": "The project’s momentum is starting to pick up.", "thai": "โมเมนตัมของโปรเจกต์เริ่มเพิ่มขึ้น"}
{"word": "pick up", "english": "I’ll pick up some wine for dinner.", "thai": "ฉันจะไปรับไวน์สำหรับอาหารเย็น"}
{"word": "sign out", "english": "Please sign out before leaving the system.", "thai": "กรุณาลงชื่อออกก่อนออกจากระบบ"}
{"word": "sign out", "english": "I forgot to sign out of my account last night.", "thai": "ฉันลืมลงชื่อออกจากบัญชีของฉันเมื่อคืนนี้"}
{"word": "sign out", "english": "You need to sign out to secure your session.", "thai": "คุณต้องลงชื่อออกเพื่อรักษาความปลอดภัยของเซสชัน"}
{"word": "sign out", "english": "Can you sign out of the app for me?", "thai": "คุณช่วยลงชื่อออกจากแอปให้ฉันได้ไหม"}
{"word": "sign out", "english": "I always sign out of my email on shared computers.", "thai": "ฉันมักจะลงชื่อออกจากอีเมลในคอมพิวเตอร์ที่ใช้ร่วมกัน"}
{"word": "sign out", "english": "Did you sign out of the portal after class?", "thai": "คุณลงชื่อออกจากพอร์ทัลหลังเลิกเรียนหรือเปล่า"}
{"word": "sign out", "english": "Make sure to sign out when you're done.", "thai": "อย่าลืมลงชื่อออกเมื่อคุณทำเสร็จแล้ว"}
{"word": "sign out", "english": "The system will automatically sign out after ten minutes.", "thai": "ระบบจะลงชื่อออกโดยอัตโนมัติหลังจากสิบนาที"}
{"word": "sign out", "english": "Why didn’t you sign out of the website?", "thai": "ทำไมคุณไม่ลงชื่อออกจากเว็บไซต์"}
{"word": "sign out", "english": "I’ll sign out now to keep my account safe.", "thai": "ฉันจะลงชื่อออกตอนนี้เพื่อรักษาความปลอดภัยของบัญชี"}
{"word": "sign out", "english": "You can sign out from the settings menu.", "thai": "คุณสามารถลงชื่อออกได้จากเมนูการตั้งค่า"}
{"word": "sign out", "english": "She forgot to sign out of her work computer.", "thai": "เธอลืมลงชื่อออกจากคอมพิวเตอร์ทำงานของเธอ"}
{"word": "sign out", "english": "Always sign out of public devices.", "thai": "ลงชื่อออกจากอุปกรณ์สาธารณะเสมอ"}
{"word": "sign out", "english": "I need to sign out before switching users.", "thai": "ฉันต้องลงชื่อออกก่อนเปลี่ยนผู้ใช้"}
{"word": "sign out", "english": "The app prompts you to sign out after updates.", "thai": "แอปจะแจ้งให้คุณลงชื่อออกหลังจากการอัปเดต"}
{"word": "sign out", "english": "Don’t forget to sign out of the network.", "thai": "อย่าลืมลงชื่อออกจากเครือข่าย"}
{"word": "sign out", "english": "He didn’t sign out, so his account was compromised.", "thai": "เขาไม่ได้ลงชื่อออก ทำให้บัญชีของเขาถูกบุกรุก"}
{"word": "sign out", "english": "I’ll sign out and let you use the computer.", "thai": "ฉันจะลงชื่อออกและให้คุณใช้คอมพิวเตอร์"}
{"word": "sign out", "english": "You should sign out to avoid unauthorized access.", "thai": "คุณควรลงชื่อออกเพื่อป้องกันการเข้าถึงโดยไม่ได้รับอนุญาต"}
{"word": "sign out", "english": "The library system requires you to sign out.", "thai": "ระบบห้องสมุดกำหนดให้คุณลงชื่อออก"}
{"word": "sign out", "english": "Can someone help me sign out of this device?", "thai": "มีใครช่วยฉันลงชื่อออกจากอุปกรณ์นี้ได้ไหม"}
{"word": "sign out", "english": "I’ll sign out of all devices remotely.", "thai": "ฉันจะลงชื่อออกจากทุกอุปกรณ์จากระยะไกล"}
{"word": "sign out", "english": "She needs to sign out before closing the app.", "thai": "เธอต้องลงชื่อออกก่อนปิดแอป"}
{"word": "sign out", "english": "The software makes it easy to sign out.", "thai": "ซอฟต์แวร์ทำให้การลงชื่อออกง่ายขึ้น"}
{"word": "sign out", "english": "You didn’t sign out of the shared account.", "thai": "คุณไม่ได้ลงชื่อออกจากบัญชีที่ใช้ร่วมกัน"}
{"word": "sign out", "english": "I always sign out to protect my privacy.", "thai": "ฉันลงชื่อออกเสมอเพื่อปกป้องความเป็นส่วนตัว"}
{"word": "sign out", "english": "The system forces you to sign out after inactivity.", "thai": "ระบบจะบังคับให้คุณลงชื่อออกหลังจากไม่มีการใช้งาน"}
{"word": "sign out", "english": "Please sign out of the guest account.", "thai": "กรุณาลงชื่อออกจากบัญชีแขก"}
{"word": "sign out", "english": "He forgot to sign out of the VPN.", "thai": "เขาลืมลงชื่อออกจาก VPN"}
{"word": "sign out", "english": "I’ll sign out so you can log in.", "thai": "ฉันจะลงชื่อออกเพื่อให้คุณเข้าสู่ระบบได้"}
{"word": "sign out", "english": "The app won’t let me sign out properly.", "thai": "แอปไม่ยอมให้ฉันลงชื่อออกอย่างถูกต้อง"}
{"word": "sign out", "english": "You need to sign out to refresh the session.", "thai": "คุณต้องลงชื่อออกเพื่อรีเฟรชเซสชัน"}
{"word": "sign out", "english": "I forgot to sign out of the school’s system.", "thai": "ฉันลืมลงชื่อออกจากระบบของโรงเรียน"}
{"word": "sign out", "english": "Sign out now to avoid any issues.", "thai": "ลงชื่อออกตอนนี้เพื่อหลีกเลี่ยงปัญหา"}
{"word": "sign out", "english": "The website prompts you to sign out securely.", "thai": "เว็บไซต์แจ้งให้คุณลงชื่อออกอย่างปลอดภัย"}
{"word": "sign out", "english": "She didn’t sign out, and someone used her account.", "thai": "เธอไม่ได้ลงชื่อออก และมีคนใช้บัญชีของเธอ"}
{"word": "sign out", "english": "You can sign out from the user profile page.", "thai": "คุณสามารถลงชื่อออกได้จากหน้าบัญชีผู้ใช้"}
{"word": "sign out", "english": "I need to sign out of my social media.", "thai": "ฉันต้องลงชื่อออกจากโซเชียลมีเดียของฉัน"}
{"word": "sign out", "english": "The system will sign out inactive users.", "thai": "ระบบจะลงชื่อออกผู้ใช้ที่ไม่มีการใช้งาน"}
{"word": "sign out", "english": "Please sign out of the admin panel.", "thai": "กรุณาลงชื่อออกจากแผงควบคุมผู้ดูแลระบบ"}
{"word": "sign out", "english": "I’ll sign out to clear the cache.", "thai": "ฉันจะลงชื่อออกเพื่อล้างแคช"}
{"word": "sign out", "english": "You forgot to sign out of the cloud service.", "thai": "คุณลืมลงชื่อออกจากบริการคลาวด์"}
{"word": "sign out", "english": "The app requires you to sign out manually.", "thai": "แอปกำหนดให้คุณลงชื่อออกด้วยตัวเอง"}
{"word": "sign out", "english": "He needs to sign out of the remote desktop.", "thai": "เขาต้องลงชื่อออกจากเดสก์ท็อประยะไกล"}
{"word": "sign out", "english": "I always sign out of banking apps.", "thai": "ฉันลงชื่อออกจากแอปธนาคารเสมอ"}
{"word": "sign out", "english": "The platform lets you sign out from all sessions.", "thai": "แพลตฟอร์มอนุญาตให้คุณลงชื่อออกจากทุกเซสชัน"}
{"word": "sign out", "english": "Don’t sign out until you save your work.", "thai": "อย่าลงชื่อออกจนกว่าคุณจะบันทึกงาน"}
{"word": "sign out", "english": "She tried to sign out but got an error.", "thai": "เธอพยายามลงชื่อออกแต่เกิดข้อผิดพลาด"}
{"word": "sign out", "english": "You can sign out with one click.", "thai": "คุณสามารถลงชื่อออกได้ด้วยคลิกเดียว"}
{"word": "sign out", "english": "I need to sign out of my streaming account.", "thai": "ฉันต้องลงชื่อออกจากบัญชีสตรีมมิ่งของฉัน"}
{"word": "sign out", "english": "The system will sign out if you’re idle.", "thai": "ระบบจะลงชื่อออกหากคุณไม่ได้ใช้งาน"}
{"word": "sign out", "english": "Please sign out to protect your data.", "thai": "กรุณาลงชื่อออกเพื่อปกป้องข้อมูลของคุณ"}
{"word": "sign out", "english": "He forgot to sign out of the shared tablet.", "thai": "เขาลืมลงชื่อออกจากแท็บเล็ตที่ใช้ร่วมกัน"}
{"word": "sign out", "english": "I’ll sign out and restart the device.", "thai": "ฉันจะลงชื่อออกและรีสตาร์ทอุปกรณ์"}
{"word": "sign out", "english": "You should sign out of unused accounts.", "thai": "คุณควรลงชื่อออกจากบัญชีที่ไม่ได้ใช้งาน"}
{"word": "sign out", "english": "The app crashed before I could sign out.", "thai": "แอปขัดข้องก่อนที่ฉันจะลงชื่อออก"}
{"word": "sign out", "english": "Sign out to prevent session conflicts.", "thai": "ลงชื่อออกเพื่อป้องกันความขัดแย้งของเซสชัน"}
{"word": "sign out", "english": "I need to sign out of my work email.", "thai": "ฉันต้องลงชื่อออกจากอีเมลงานของฉัน"}
{"word": "sign out", "english": "The system requires you to sign out daily.", "thai": "ระบบกำหนดให้คุณลงชื่อออกทุกวัน"}
{"word": "sign out", "english": "She didn’t sign out, causing a security issue.", "thai": "เธอไม่ได้ลงชื่อออก ทำให้เกิดปัญหาด้านความปลอดภัย"}
{"word": "sign out", "english": "You can sign out from the account settings.", "thai": "คุณสามารถลงชื่อออกได้จากตั้งค่าบัญชี"}
{"word": "sign out", "english": "I forgot to sign out of the guest Wi-Fi.", "thai": "ฉันลืมลงชื่อออกจาก Wi-Fi สำหรับแขก"}
{"word": "sign out", "english": "The app will sign out after a timeout.", "thai": "แอปจะลงชื่อออกหลังจากหมดเวลา"}
{"word": "sign out", "english": "Please sign out to free up the license.", "thai": "กรุณาลงชื่อออกเพื่อปลดล็อกใบอนุญาต"}
{"word": "sign out", "english": "He needs to sign out of the test server.", "thai": "เขาต้องลงชื่อออกจากเซิร์ฟเวอร์ทดสอบ"}
{"word": "sign out", "english": "I’ll sign out to switch to another profile.", "thai": "ฉันจะลงชื่อออกเพื่อเปลี่ยนไปใช้โปรไฟล์อื่น"}
{"word": "sign out", "english": "You forgot to sign out of the online course.", "thai": "คุณลืมลงชื่อออกจากคอร์สออนไลน์"}
{"word": "sign out", "english": "The system will sign out at midnight.", "thai": "ระบบจะลงชื่อออกตอนเที่ยงคืน"}
{"word": "sign out", "english": "Sign out now to avoid data loss.", "thai": "ลงชื่อออกตอนนี้เพื่อป้องกันการสูญเสียข้อมูล"}
{"word": "sign out", "english": "She tried to sign out but the button was disabled.", "thai": "เธอพยายามลงชื่อออกแต่ปุ่มถูกปิดใช้งาน"}
{"word": "sign out", "english": "You can sign out from the mobile app.", "thai": "คุณสามารถลงชื่อออกได้จากแอปมือถือ"}
{"word": "sign out", "english": "I need to sign out of my cloud storage.", "thai": "ฉันต้องลงชื่อออกจากที่เก็บข้อมูลบนคลาวด์"}
{"word": "sign out", "english": "The system prompts you to sign out after updates.", "thai": "ระบบแจ้งให้คุณลงชื่อออกหลังจากการอัปเดต"}
{"word": "sign out", "english": "Please sign out of the training platform.", "thai": "กรุณาลงชื่อออกจากแพลตฟอร์มการฝึกอบรม"}
{"word": "sign out", "english": "He forgot to sign out of the virtual meeting.", "thai": "เขาลืมลงชื่อออกจากประชุมเสมือน"}
{"word": "sign out", "english": "I’ll sign out to reset the connection.", "thai": "ฉันจะลงชื่อออกเพื่อรีเซ็ตการเชื่อมต่อ"}
{"word": "sign out", "english": "You should sign out of temporary accounts.", "thai": "คุณควรลงชื่อออกจากบัญชีชั่วคราว"}
{"word": "sign out", "english": "The app won’t sign out without an internet connection.", "thai": "แอปจะไม่ลงชื่อออกหากไม่มีอินเทอร์เน็ต"}
{"word": "sign out", "english": "Sign out to clear your browsing data.", "thai": "ลงชื่อออกเพื่อล้างข้อมูลการท่องเว็บของคุณ"}
{"word": "sign out", "english": "I need to sign out of my gaming account.", "thai": "ฉันต้องลงชื่อออกจากบัญชีเกมของฉัน"}
{"word": "sign out", "english": "The system will sign out after maintenance.", "thai": "ระบบจะลงชื่อออกหลังจากการบำรุงรักษา"}
{"word": "sign out", "english": "Please sign out to update your profile.", "thai": "กรุณาลงชื่อออกเพื่ออัปเดตโปรไฟล์ของคุณ"}
{"word": "sign out", "english": "He didn’t sign out, and his session expired.", "thai": "เขาไม่ได้ลงชื่อออก และเซสชันของเขาหมดอายุ"}
{"word": "sign out", "english": "I’ll sign out and check for updates.", "thai": "ฉันจะลงชื่อออกและตรวจสอบการอัปเดต"}
{"word": "sign out", "english": "You forgot to sign out of the payment app.", "thai": "คุณลืมลงชื่อออกจากแอปการชำระเงิน"}
{"word": "sign out", "english": "The system requires you to sign out weekly.", "thai": "ระบบกำหนดให้คุณลงชื่อออกทุกสัปดาห์"}
{"word": "sign out", "english": "She needs to sign out of the shared drive.", "thai": "เธอต้องลงชื่อออกจากไดรฟ์ที่ใช้ร่วมกัน"}
{"word": "sign out", "english": "You can sign out from the security settings.", "thai": "คุณสามารถลงชื่อออกได้จากตั้งค่าความปลอดภัย"}
{"word": "sign out", "english": "I forgot to sign out of the library system.", "thai": "ฉันลืมลงชื่อออกจากระบบห้องสมุด"}
{"word": "sign out", "english": "The app will sign out if you close it.", "thai": "แอปจะลงชื่อออกหากคุณปิดมัน"}
{"word": "sign out", "english": "Please sign out to secure your information.", "thai": "กรุณาลงชื่อออกเพื่อรักษาความปลอดภัยของข้อมูล"}
{"word": "sign out", "english": "He needs to sign out of the testing app.", "thai": "เขาต้องลงชื่อออกจากแอปทดสอบ"}
{"word": "sign out", "english": "I’ll sign out to free up system resources.", "thai": "ฉันจะลงชื่อออกเพื่อปลดปล่อยทรัพยากรระบบ"}
{"word": "sign out", "english": "You should sign out of all active sessions.", "thai": "คุณควรลงชื่อออกจากทุกเซสชันที่ใช้งานอยู่"}
{"word": "sign out", "english": "The system will sign out after a reboot.", "thai": "ระบบจะลงชื่อออกหลังจากรีบูต"}
{"word": "sign out", "english": "Sign out now to apply the changes.", "thai": "ลงชื่อออกตอนนี้เพื่อใช้การเปลี่ยนแปลง"}
{"word": "sign out", "english": "She forgot to sign out of the group chat.", "thai": "เธอลืมลงชื่อออกจากแชทกลุ่ม"}
{"word": "sign out", "english": "You can sign out from the logout button.", "thai": "คุณสามารถลงชื่อออกได้จากปุ่มออกจากระบบ"}
{"word": "sign out", "english": "I need to sign out of my fitness app.", "thai": "ฉันต้องลงชื่อออกจากแอปฟิตเนสของฉัน"}
{"word": "log off", "english": "Please log off the system before leaving.", "thai": "กรุณาออกจากระบบก่อนออก"}
{"word": "log off", "english": "I forgot to log off my computer last night.", "thai": "ฉันลืมออกจากระบบคอมพิวเตอร์เมื่อคืนนี้"}
{"word": "log off", "english": "You need to log off to secure your account.", "thai": "คุณต้องออกจากระบบเพื่อรักษาความปลอดภัยของบัญชี"}
{"word": "log off", "english": "Can you log off the app for me?", "thai": "คุณช่วยออกจากแอปให้ฉันได้ไหม"}
{"word": "log off", "english": "I always log off from shared devices.", "thai": "ฉันออกจากระบบอุปกรณ์ที่ใช้ร่วมกันเสมอ"}
{"word": "log off", "english": "Did you log off the network after work?", "thai": "คุณออกจากระบบเครือข่ายหลังเลิกงานหรือเปล่า"}
{"word": "log off", "english": "Make sure to log off when you're done.", "thai": "อย่าลืมออกจากระบบเมื่อคุณทำเสร็จแล้ว"}
{"word": "log off", "english": "The system will automatically log off after inactivity.", "thai": "ระบบจะออกจากระบบโดยอัตโนมัติเมื่อไม่มีการใช้งาน"}
{"word": "log off", "english": "Why didn’t you log off the website?", "thai": "ทำไมคุณไม่ออกจากระบบเว็บไซต์"}
{"word": "log off", "english": "I’ll log off now to keep my data safe.", "thai": "ฉันจะออกจากระบบตอนนี้เพื่อรักษาความปลอดภัยของข้อมูล"}
{"word": "log off", "english": "You can log off from the user menu.", "thai": "คุณสามารถออกจากระบบได้จากเมนูผู้ใช้"}
{"word": "log off", "english": "She forgot to log off her work laptop.", "thai": "เธอลืมออกจากระบบแล็ปท็อปทำงานของเธอ"}
{"word": "log off", "english": "Always log off from public computers.", "thai": "ออกจากระบบคอมพิวเตอร์สาธารณะเสมอ"}
{"word": "log off", "english": "I need to log off before switching accounts.", "thai": "ฉันต้องออกจากระบบก่อนเปลี่ยนบัญชี"}
{"word": "log off", "english": "The app prompts you to log off after updates.", "thai": "แอปจะแจ้งให้คุณออกจากระบบหลังจากการอัปเดต"}
{"word": "log off", "english": "Don’t forget to log off the server.", "thai": "อย่าลืมออกจากระบบเซิร์ฟเวอร์"}
{"word": "log off", "english": "He didn’t log off, so his session was hacked.", "thai": "เขาไม่ออกจากระบบ ทำให้เซสชันของเขาถูกแฮ็ก"}
{"word": "log off", "english": "I’ll log off and let you use the device.", "thai": "ฉันจะออกจากระบบและให้คุณใช้อุปกรณ์"}
{"word": "log off", "english": "You should log off to prevent unauthorized access.", "thai": "คุณควรออกจากระบบเพื่อป้องกันการเข้าถึงโดยไม่ได้รับอนุญาต"}
{"word": "log off", "english": "The system requires you to log off daily.", "thai": "ระบบกำหนดให้คุณออกจากระบบทุกวัน"}
{"word": "log off", "english": "Can someone help me log off this device?", "thai": "มีใครช่วยฉันออกจากระบบอุปกรณ์นี้ได้ไหม"}
{"word": "log off", "english": "I’ll log off from all devices remotely.", "thai": "ฉันจะออกจากระบบทุกอุปกรณ์จากระยะไกล"}
{"word": "log off", "english": "She needs to log off before closing the program.", "thai": "เธอต้องออกจากระบบก่อนปิดโปรแกรม"}
{"word": "log off", "english": "The software makes it simple to log off.", "thai": "ซอฟต์แวร์ทำให้การออกจากระบบง่ายขึ้น"}
{"word": "log off", "english": "You didn’t log off the shared account.", "thai": "คุณไม่ออกจากระบบบัญชีที่ใช้ร่วมกัน"}
{"word": "log off", "english": "I always log off to protect my information.", "thai": "ฉันออกจากระบบเสมอเพื่อปกป้องข้อมูลของฉัน"}
{"word": "log off", "english": "The system forces you to log off after a timeout.", "thai": "ระบบจะบังคับให้คุณออกจากระบบหลังจากหมดเวลา"}
{"word": "log off", "english": "Please log off the guest profile.", "thai": "กรุณาออกจากระบบโปรไฟล์แขก"}
{"word": "log off", "english": "He forgot to log off the VPN.", "thai": "เขาลืมออกจากระบบ VPN"}
{"word": "log off", "english": "I’ll log off so you can sign in.", "thai": "ฉันจะออกจากระบบเพื่อให้คุณเข้าสู่ระบบได้"}
{"word": "log off", "english": "The app won’t let me log off properly.", "thai": "แอปไม่ยอมให้ฉันออกจากระบบอย่างถูกต้อง"}
{"word": "log off", "english": "You need to log off to refresh your session.", "thai": "คุณต้องออกจากระบบเพื่อรีเฟรชเซสชัน"}
{"word": "log off", "english": "I forgot to log off the school’s network.", "thai": "ฉันลืมออกจากระบบเครือข่ายของโรงเรียน"}
{"word": "log off", "english": "Log off now to avoid any problems.", "thai": "ออกจากระบบตอนนี้เพื่อหลีกเลี่ยงปัญหา"}
{"word": "log off", "english": "The website prompts you to log off securely.", "thai": "เว็บไซต์แจ้งให้คุณออกจากระบบอย่างปลอดภัย"}
{"word": "log off", "english": "She didn’t log off, and someone accessed her account.", "thai": "เธอไม่ออกจากระบบ และมีคนเข้าถึงบัญชีของเธอ"}
{"word": "log off", "english": "You can log off from the account settings.", "thai": "คุณสามารถออกจากระบบได้จากตั้งค่าบัญชี"}
{"word": "log off", "english": "I need to log off my social media account.", "thai": "ฉันต้องออกจากระบบบัญชีโซเชียลมีเดียของฉัน"}
{"word": "log off", "english": "The system will log off inactive users.", "thai": "ระบบจะออกจากระบบผู้ใช้ที่ไม่มีการใช้งาน"}
{"word": "log off", "english": "Please log off the admin console.", "thai": "กรุณาออกจากระบบคอนโซลผู้ดูแล"}
{"word": "log off", "english": "I’ll log off to clear the system cache.", "thai": "ฉันจะออกจากระบบเพื่อล้างแคชของระบบ"}
{"word": "log off", "english": "You forgot to log off the cloud platform.", "thai": "คุณลืมออกจากระบบแพลตฟอร์มคลาวด์"}
{"word": "log off", "english": "The app requires you to log off manually.", "thai": "แอปกำหนดให้คุณออกจากระบบด้วยตัวเอง"}
{"word": "log off", "english": "He needs to log off the remote server.", "thai": "เขาต้องออกจากระบบเซิร์ฟเวอร์ระยะไกล"}
{"word": "log off", "english": "I always log off banking apps after use.", "thai": "ฉันออกจากระบบแอปธนาคารหลังใช้งานเสมอ"}
{"word": "log off", "english": "The platform lets you log off all sessions.", "thai": "แพลตฟอร์มอนุญาตให้คุณออกจากระบบทุกเซสชัน"}
{"word": "log off", "english": "Don’t log off until you save your changes.", "thai": "อย่าออกจากระบบจนกว่าคุณจะบันทึกการเปลี่ยนแปลง"}
{"word": "log off", "english": "She tried to log off but got an error.", "thai": "เธอพยายามออกจากระบบแต่เกิดข้อผิดพลาด"}
{"word": "log off", "english": "You can log off with a single click.", "thai": "คุณสามารถออกจากระบบได้ด้วยคลิกเดียว"}
{"word": "log off", "english": "I need to log off my streaming service.", "thai": "ฉันต้องออกจากระบบบริการสตรีมมิ่งของฉัน"}
{"word": "log off", "english": "The system will log off if you’re idle.", "thai": "ระบบจะออกจากระบบหากคุณไม่ได้ใช้งาน"}
{"word": "log off", "english": "Please log off to protect your privacy.", "thai": "กรุณาออกจากระบบเพื่อปกป้องความเป็นส่วนตัว"}
{"word": "log off", "english": "He forgot to log off the shared device.", "thai": "เขาลืมออกจากระบบอุปกรณ์ที่ใช้ร่วมกัน"}
{"word": "log off", "english": "I’ll log off and reboot the computer.", "thai": "ฉันจะออกจากระบบและรีบูตคอมพิวเตอร์"}
{"word": "log off", "english": "You should log off unused accounts.", "thai": "คุณควรออกจากระบบบัญชีที่ไม่ได้ใช้งาน"}
{"word": "log off", "english": "The app crashed before I could log off.", "thai": "แอปขัดข้องก่อนที่ฉันจะออกจากระบบ"}
{"word": "log off", "english": "Log off to prevent session conflicts.", "thai": "ออกจากระบบเพื่อป้องกันความขัดแย้งของเซสชัน"}
{"word": "log off", "english": "I need to log off my work account.", "thai": "ฉันต้องออกจากระบบบัญชีงานของฉัน"}
{"word": "log off", "english": "The system requires you to log off weekly.", "thai": "ระบบกำหนดให้คุณออกจากระบบทุกสัปดาห์"}
{"word": "log off", "english": "She didn’t log off, causing a security breach.", "thai": "เธอไม่ออกจากระบบ ทำให้เกิดการละเมิดความปลอดภัย"}
{"word": "log off", "english": "You can log off from the security settings.", "thai": "คุณสามารถออกจากระบบได้จากตั้งค่าความปลอดภัย"}
{"word": "log off", "english": "I forgot to log off the guest Wi-Fi.", "thai": "ฉันลืมออกจากระบบ Wi-Fi สำหรับแขก"}
{"word": "log off", "english": "The app will log off after a timeout.", "thai": "แอปจะออกจากระบบหลังจากหมดเวลา"}
{"word": "log off", "english": "Please log off to free up resources.", "thai": "กรุณาออกจากระบบเพื่อปลดปล่อยทรัพยากร"}
{"word": "log off", "english": "He needs to log off the test server.", "thai": "เขาต้องออกจากระบบเซิร์ฟเวอร์ทดสอบ"}
{"word": "log off", "english": "I’ll log off to switch to another user.", "thai": "ฉันจะออกจากระบบเพื่อเปลี่ยนไปใช้ผู้ใช้อื่น"}
{"word": "log off", "english": "You forgot to log off the online platform.", "thai": "คุณลืมออกจากระบบแพลตฟอร์มออนไลน์"}
{"word": "log off", "english": "The system will log off at midnight.", "thai": "ระบบจะออกจากระบบตอนเที่ยงคืน"}
{"word": "log off", "english": "Log off now to avoid data loss.", "thai": "ออกจากระบบตอนนี้เพื่อป้องกันการสูญเสียข้อมูล"}
{"word": "log off", "english": "She tried to log off but the button was disabled.", "thai": "เธอพยายามออกจากระบบแต่ปุ่มถูกปิดใช้งาน"}
{"word": "log off", "english": "You can log off from the mobile app.", "thai": "คุณสามารถออกจากระบบได้จากแอปมือถือ"}
{"word": "log off", "english": "I need to log off my cloud account.", "thai": "ฉันต้องออกจากระบบบัญชีคลาวด์ของฉัน"}
{"word": "log off", "english": "The system prompts you to log off after updates.", "thai": "ระบบแจ้งให้คุณออกจากระบบหลังจากการอัปเดต"}
{"word": "log off", "english": "Please log off the training platform.", "thai": "กรุณาออกจากระบบแพลตฟอร์มการฝึกอบรม"}
{"word": "log off", "english": "He forgot to log off the virtual session.", "thai": "เขาลืมออกจากระบบเซสชันเสมือน"}
{"word": "log off", "english": "I’ll log off to reset the connection.", "thai": "ฉันจะออกจากระบบเพื่อรีเซ็ตการเชื่อมต่อ"}
{"word": "log off", "english": "You should log off temporary accounts.", "thai": "คุณควรออกจากระบบบัญชีชั่วคราว"}
{"word": "log off", "english": "The app won’t log off without internet.", "thai": "แอปจะไม่ออกจากระบบหากไม่มีอินเทอร์เน็ต"}
{"word": "log off", "english": "Log off to clear your session data.", "thai": "ออกจากระบบเพื่อล้างข้อมูลเซสชันของคุณ"}
{"word": "log off", "english": "I need to log off my gaming profile.", "thai": "ฉันต้องออกจากระบบโปรไฟล์เกมของฉัน"}
{"word": "log off", "english": "The system will log off after maintenance.", "thai": "ระบบจะออกจากระบบหลังจากการบำรุงรักษา"}
{"word": "log off", "english": "Please log off to update your settings.", "thai": "กรุณาออกจากระบบเพื่ออัปเดตการตั้งค่าของคุณ"}
{"word": "log off", "english": "He didn’t log off, and his session timed out.", "thai": "เขาไม่ออกจากระบบ และเซสชันของเขาหมดเวลา"}
{"word": "log off", "english": "I’ll log off and check for updates.", "thai": "ฉันจะออกจากระบบและตรวจสอบการอัปเดต"}
{"word": "log off", "english": "You forgot to log off the payment system.", "thai": "คุณลืมออกจากระบบระบบชำระเงิน"}
{"word": "log off", "english": "The system requires you to log off monthly.", "thai": "ระบบกำหนดให้คุณออกจากระบบทุกเดือน"}
{"word": "log off", "english": "She needs to log off the shared drive.", "thai": "เธอต้องออกจากระบบไดรฟ์ที่ใช้ร่วมกัน"}
{"word": "log off", "english": "You can log off from the logout button.", "thai": "คุณสามารถออกจากระบบได้จากปุ่มออกจากระบบ"}
{"word": "log off", "english": "I forgot to log off the library system.", "thai": "ฉันลืมออกจากระบบระบบห้องสมุด"}
{"word": "log off", "english": "The app will log off if you close it.", "thai": "แอปจะออกจากระบบหากคุณปิดมัน"}
{"word": "log off", "english": "Please log off to secure your data.", "thai": "กรุณาออกจากระบบเพื่อรักษาความปลอดภัยของข้อมูล"}
{"word": "log off", "english": "He needs to log off the testing app.", "thai": "เขาต้องออกจากระบบแอปทดสอบ"}
{"word": "log off", "english": "I’ll log off to free up system resources.", "thai": "ฉันจะออกจากระบบเพื่อปลดปล่อยทรัพยากรระบบ"}
{"word": "log off", "english": "You should log off all active sessions.", "thai": "คุณควรออกจากระบบทุกเซสชันที่ใช้งานอยู่"}
{"word": "log off", "english": "The system will log off after a reboot.", "thai": "ระบบจะออกจากระบบหลังจากรีบูต"}
{"word": "log off", "english": "Log off now to apply the changes.", "thai": "ออกจากระบบตอนนี้เพื่อใช้การเปลี่ยนแปลง"}
{"word": "log off", "english": "She forgot to log off the group account.", "thai": "เธอลืมออกจากระบบบัญชีกลุ่ม"}
{"word": "log off", "english": "You can log off from the user dashboard.", "thai": "คุณสามารถออกจากระบบได้จากแดชบอร์ดผู้ใช้"}
{"word": "log off", "english": "I need to log off my fitness tracker app.", "thai": "ฉันต้องออกจากระบบแอปติดตามฟิตเนสของฉัน"}
{"word": "shut down", "english": "Please shut down the computer before leaving.", "thai": "กรุณาปิดคอมพิวเตอร์ก่อนออก"}
{"word": "shut down", "english": "I forgot to shut down my laptop last night.", "thai": "ฉันลืมปิดแล็ปท็อปเมื่อคืนนี้"}
{"word": "shut down", "english": "You need to shut down the system to install updates.", "thai": "คุณต้องปิดระบบเพื่อติดตั้งการอัปเดต"}
{"word": "shut down", "english": "Can you shut down the server for maintenance?", "thai": "คุณช่วยปิดเซิร์ฟเวอร์เพื่อบำรุงรักษาได้ไหม"}
{"word": "shut down", "english": "The factory had to shut down due to a power outage.", "thai": "โรงงานต้องปิดตัวลงเนื่องจากไฟฟ้าดับ"}
{"word": "shut down", "english": "Did you shut down the machine after using it?", "thai": "คุณปิดเครื่องหลังจากใช้งานหรือเปล่า"}
{"word": "shut down", "english": "Make sure to shut down all devices before the storm.", "thai": "อย่าลืมปิดอุปกรณ์ทั้งหมดก่อนพายุ"}
{"word": "shut down", "english": "The program will shut down automatically after saving.", "thai": "โปรแกรมจะปิดโดยอัตโนมัติหลังจากบันทึก"}
{"word": "shut down", "english": "Why did they shut down the old website?", "thai": "ทำไมพวกเขาถึงปิดเว็บไซต์เก่า"}
{"word": "shut down", "english": "I’ll shut down the system to fix the issue.", "thai": "ฉันจะปิดระบบเพื่อแก้ไขปัญหา"}
{"word": "shut down", "english": "You can shut down the app from the settings.", "thai": "คุณสามารถปิดแอปได้จากตั้งค่า"}
{"word": "shut down", "english": "She forgot to shut down her tablet.", "thai": "เธอลืมปิดแท็บเล็ตของเธอ"}
{"word": "shut down", "english": "Always shut down the equipment after use.", "thai": "ปิดอุปกรณ์ทุกครั้งหลังใช้งาน"}
{"word": "shut down", "english": "I need to shut down before installing new software.", "thai": "ฉันต้องปิดระบบก่อนติดตั้งซอฟต์แวร์ใหม่"}
{"word": "shut down", "english": "The computer prompts you to shut down after updates.", "thai": "คอมพิวเตอร์แจ้งให้คุณปิดระบบหลังจากการอัปเดต"}
{"word": "shut down", "english": "Don’t shut down the server without warning.", "thai": "อย่าปิดเซิร์ฟเวอร์โดยไม่แจ้งเตือน"}
{"word": "shut down", "english": "He didn’t shut down, so the system crashed.", "thai": "เขาไม่ได้ปิดระบบ ทำให้ระบบขัดข้อง"}
{"word": "shut down", "english": "I’ll shut down and restart the device.", "thai": "ฉันจะปิดและรีสตาร์ทอุปกรณ์"}
{"word": "shut down", "english": "You should shut down to save power.", "thai": "คุณควรปิดระบบเพื่อประหยัดพลังงาน"}
{"word": "shut down", "english": "The plant was shut down for safety reasons.", "thai": "โรงงานถูกปิดด้วยเหตุผลด้านความปลอดภัย"}
{"word": "shut down", "english": "Can someone shut down the mainframe?", "thai": "มีใครปิดเมนเฟรมได้ไหม"}
{"word": "shut down", "english": "I’ll shut down all devices remotely.", "thai": "ฉันจะปิดอุปกรณ์ทั้งหมดจากระยะไกล"}
{"word": "shut down", "english": "She needs to shut down before leaving the office.", "thai": "เธอต้องปิดระบบก่อนออกจากสำนักงาน"}
{"word": "shut down", "english": "The software makes it easy to shut down.", "thai": "ซอฟต์แวร์ทำให้การปิดระบบง่ายขึ้น"}
{"word": "shut down", "english": "You didn’t shut down the shared computer.", "thai": "คุณไม่ได้ปิดคอมพิวเตอร์ที่ใช้ร่วมกัน"}
{"word": "shut down", "english": "I always shut down to prevent overheating.", "thai": "ฉันปิดระบบเสมอเพื่อป้องกันความร้อนสูงเกิน"}
{"word": "shut down", "english": "The system will shut down after a timeout.", "thai": "ระบบจะปิดลงหลังจากหมดเวลา"}
{"word": "shut down", "english": "Please shut down the guest computer.", "thai": "กรุณาปิดคอมพิวเตอร์สำหรับแขก"}
{"word": "shut down", "english": "He forgot to shut down the router.", "thai": "เขาลืมปิดเราเตอร์"}
{"word": "shut down", "english": "I’ll shut down so you can use the device.", "thai": "ฉันจะปิดระบบเพื่อให้คุณใช้อุปกรณ์"}
{"word": "shut down", "english": "The app won’t shut down properly.", "thai": "แอปไม่ปิดอย่างถูกต้อง"}
{"word": "shut down", "english": "You need to shut down to apply updates.", "thai": "คุณต้องปิดระบบเพื่อใช้การอัปเดต"}
{"word": "shut down", "english": "I forgot to shut down the school’s system.", "thai": "ฉันลืมปิดระบบของโรงเรียน"}
{"word": "shut down", "english": "Shut down now to avoid any issues.", "thai": "ปิดระบบตอนนี้เพื่อหลีกเลี่ยงปัญหา"}
{"word": "shut down", "english": "The website was shut down for maintenance.", "thai": "เว็บไซต์ถูกปิดเพื่อบำรุงรักษา"}
{"word": "shut down", "english": "She didn’t shut down, and the battery drained.", "thai": "เธอไม่ได้ปิดระบบ และแบตเตอรี่หมด"}
{"word": "shut down", "english": "You can shut down from the control panel.", "thai": "คุณสามารถปิดระบบได้จากแผงควบคุม"}
{"word": "shut down", "english": "I need to shut down my gaming console.", "thai": "ฉันต้องปิดคอนโซลเกมของฉัน"}
{"word": "shut down", "english": "The system will shut down inactive devices.", "thai": "ระบบจะปิดอุปกรณ์ที่ไม่มีการใช้งาน"}
{"word": "shut down", "english": "Please shut down the admin system.", "thai": "กรุณาปิดระบบผู้ดูแล"}
{"word": "shut down", "english": "I’ll shut down to clear the memory.", "thai": "ฉันจะปิดระบบเพื่อล้างหน่วยความจำ"}
{"word": "shut down", "english": "You forgot to shut down the cloud server.", "thai": "คุณลืมปิดเซิร์ฟเวอร์คลาวด์"}
{"word": "shut down", "english": "The app requires you to shut down manually.", "thai": "แอปกำหนดให้คุณปิดระบบด้วยตัวเอง"}
{"word": "shut down", "english": "He needs to shut down the test machine.", "thai": "เขาต้องปิดเครื่องทดสอบ"}
{"word": "shut down", "english": "I always shut down my phone at night.", "thai": "ฉันปิดโทรศัพท์ทุกคืน"}
{"word": "shut down", "english": "The platform lets you shut down remotely.", "thai": "แพลตฟอร์มอนุญาตให้คุณปิดระบบจากระยะไกล"}
{"word": "shut down", "english": "Don’t shut down until you save your work.", "thai": "อย่าปิดระบบจนกว่าคุณจะบันทึกงาน"}
{"word": "shut down", "english": "She tried to shut down but got an error.", "thai": "เธอพยายามปิดระบบแต่เกิดข้อผิดพลาด"}
{"word": "shut down", "english": "You can shut down with one click.", "thai": "คุณสามารถปิดระบบได้ด้วยคลิกเดียว"}
{"word": "shut down", "english": "I need to shut down my streaming device.", "thai": "ฉันต้องปิดอุปกรณ์สตรีมมิ่งของฉัน"}
{"word": "shut down", "english": "The system will shut down if it overheats.", "thai": "ระบบจะปิดลงหากร้อนเกินไป"}
{"word": "shut down", "english": "Please shut down to protect the hardware.", "thai": "กรุณาปิดระบบเพื่อปกป้องฮาร์ดแวร์"}
{"word": "shut down", "english": "He forgot to shut down the shared printer.", "thai": "เขาลืมปิดเครื่องพิมพ์ที่ใช้ร่วมกัน"}
{"word": "shut down", "english": "I’ll shut down and check the connections.", "thai": "ฉันจะปิดระบบและตรวจสอบการเชื่อมต่อ"}
{"word": "shut down", "english": "You should shut down unused devices.", "thai": "คุณควรปิดอุปกรณ์ที่ไม่ได้ใช้งาน"}
{"word": "shut down", "english": "The app crashed before I could shut down.", "thai": "แอปขัดข้องก่อนที่ฉันจะปิดระบบ"}
{"word": "shut down", "english": "Shut down to prevent system errors.", "thai": "ปิดระบบเพื่อป้องกันข้อผิดพลาดของระบบ"}
{"word": "shut down", "english": "I need to shut down my work computer.", "thai": "ฉันต้องปิดคอมพิวเตอร์ทำงานของฉัน"}
{"word": "shut down", "english": "The system requires you to shut down weekly.", "thai": "ระบบกำหนดให้คุณปิดระบบทุกสัปดาห์"}
{"word": "shut down", "english": "She didn’t shut down, causing a malfunction.", "thai": "เธอไม่ได้ปิดระบบ ทำให้เกิดการทำงานผิดพลาด"}
{"word": "shut down", "english": "You can shut down from the power menu.", "thai": "คุณสามารถปิดระบบได้จากเมนูพลังงาน"}
{"word": "shut down", "english": "I forgot to shut down the network hub.", "thai": "ฉันลืมปิดฮับเครือข่าย"}
{"word": "shut down", "english": "The app will shut down after a timeout.", "thai": "แอปจะปิดลงหลังจากหมดเวลา"}
{"word": "shut down", "english": "Please shut down to free up resources.", "thai": "กรุณาปิดระบบเพื่อปลดปล่อยทรัพยากร"}
{"word": "shut down", "english": "He needs to shut down the test server.", "thai": "เขาต้องปิดเซิร์ฟเวอร์ทดสอบ"}
{"word": "shut down", "english": "I’ll shut down to switch to another device.", "thai": "ฉันจะปิดระบบเพื่อเปลี่ยนไปใช้อุปกรณ์อื่น"}
{"word": "shut down", "english": "You forgot to shut down the online system.", "thai": "คุณลืมปิดระบบออนไลน์"}
{"word": "shut down", "english": "The system will shut down at midnight.", "thai": "ระบบจะปิดลงตอนเที่ยงคืน"}
{"word": "shut down", "english": "Shut down now to avoid data loss.", "thai": "ปิดระบบตอนนี้เพื่อป้องกันการสูญเสียข้อมูล"}
{"word": "shut down", "english": "She tried to shut down but the system froze.", "thai": "เธอพยายามปิดระบบแต่ระบบค้าง"}
{"word": "shut down", "english": "You can shut down from the mobile app.", "thai": "คุณสามารถปิดระบบได้จากแอปมือถือ"}
{"word": "shut down", "english": "I need to shut down my cloud service.", "thai": "ฉันต้องปิดบริการคลาวด์ของฉัน"}
{"word": "shut down", "english": "The system prompts you to shut down after updates.", "thai": "ระบบแจ้งให้คุณปิดระบบหลังจากการอัปเดต"}
{"word": "shut down", "english": "Please shut down the training equipment.", "thai": "กรุณาปิดอุปกรณ์ฝึกอบรม"}
{"word": "shut down", "english": "He forgot to shut down the virtual machine.", "thai": "เขาลืมปิดเครื่องเสมือน"}
{"word": "shut down", "english": "I’ll shut down to reset the network.", "thai": "ฉันจะปิดระบบเพื่อรีเซ็ตเครือข่าย"}
{"word": "shut down", "english": "You should shut down temporary systems.", "thai": "คุณควรปิดระบบชั่วคราว"}
{"word": "shut down", "english": "The app won’t shut down without internet.", "thai": "แอปจะไม่ปิดลงหากไม่มีอินเทอร์เน็ต"}
{"word": "shut down", "english": "Shut down to clear system errors.", "thai": "ปิดระบบเพื่อล้างข้อผิดพลาดของระบบ"}
{"word": "shut down", "english": "I need to shut down my smart TV.", "thai": "ฉันต้องปิดสมาร์ททีวีของฉัน"}
{"word": "shut down", "english": "The system will shut down after maintenance.", "thai": "ระบบจะปิดลงหลังจากการบำรุงรักษา"}
{"word": "shut down", "english": "Please shut down to update the firmware.", "thai": "กรุณาปิดระบบเพื่ออัปเดตเฟิร์มแวร์"}
{"word": "shut down", "english": "He didn’t shut down, and the session crashed.", "thai": "เขาไม่ได้ปิดระบบ และเซสชันขัดข้อง"}
{"word": "shut down", "english": "I’ll shut down and check for viruses.", "thai": "ฉันจะปิดระบบและตรวจสอบไวรัส"}
{"word": "shut down", "english": "You forgot to shut down the payment system.", "thai": "คุณลืมปิดระบบชำระเงิน"}
{"word": "shut down", "english": "The system requires you to shut down monthly.", "thai": "ระบบกำหนดให้คุณปิดระบบทุกเดือน"}
{"word": "shut down", "english": "She needs to shut down the shared workstation.", "thai": "เธอต้องปิดเวิร์กสเตชันที่ใช้ร่วมกัน"}
{"word": "shut down", "english": "You can shut down from the system tray.", "thai": "คุณสามารถปิดระบบได้จากถาดระบบ"}
{"word": "shut down", "english": "I forgot to shut down the lab equipment.", "thai": "ฉันลืมปิดอุปกรณ์ในห้องปฏิบัติการ"}
{"word": "shut down", "english": "The app will shut down if you force quit.", "thai": "แอปจะปิดลงหากคุณบังคับออก"}
{"word": "shut down", "english": "Please shut down to save energy.", "thai": "กรุณาปิดระบบเพื่อประหยัดพลังงาน"}
{"word": "shut down", "english": "He needs to shut down the testing device.", "thai": "เขาต้องปิดอุปกรณ์ทดสอบ"}
{"word": "shut down", "english": "I’ll shut down to free up memory.", "thai": "ฉันจะปิดระบบเพื่อปลดปล่อยหน่วยความจำ"}
{"word": "shut down", "english": "You should shut down all active devices.", "thai": "คุณควรปิดอุปกรณ์ที่ใช้งานอยู่ทั้งหมด"}
{"word": "shut down", "english": "The system will shut down after a reboot.", "thai": "ระบบจะปิดลงหลังจากรีบูต"}
{"word": "shut down", "english": "Shut down now to apply the settings.", "thai": "ปิดระบบตอนนี้เพื่อใช้การตั้งค่า"}
{"word": "shut down", "english": "She forgot to shut down the group server.", "thai": "เธอลืมปิดเซิร์ฟเวอร์กลุ่ม"}
{"word": "shut down", "english": "You can shut down from the user interface.", "thai": "คุณสามารถปิดระบบได้จากส่วนต่อประสานผู้ใช้"}
{"word": "shut down", "english": "I need to shut down my fitness tracker.", "thai": "ฉันต้องปิดอุปกรณ์ติดตามฟิตเนสของฉัน"}
{"word": "come back", "english": "I hope you come back soon from your trip.", "thai": "ฉันหวังว่าคุณจะกลับมาเร็ว ๆ นี้จากทริปของคุณ"}
{"word": "come back", "english": "Will you come back to the party later?", "thai": "คุณจะกลับมาที่งานปาร์ตี้ทีหลังไหม"}
{"word": "come back", "english": "The memories of that day always come back to me.", "thai": "ความทรงจำของวันนั้นมักจะย้อนกลับมาหาฉัน"}
{"word": "come back", "english": "Why did you come back so late last night?", "thai": "ทำไมคุณถึงกลับมาดึกมากเมื่อคืนนี้"}
{"word": "come back", "english": "If you leave, please come back before dinner.", "thai": "ถ้าคุณออกไป โปรดกลับมาก่อนมื้อเย็น"}
{"word": "come back", "english": "The old trends seem to come back every few years.", "thai": "เทรนด์เก่า ๆ ดูเหมือนจะกลับมาทุก ๆ สองสามปี"}
{"word": "come back", "english": "Come back here, you forgot your keys!", "thai": "กลับมาที่นี่ คุณลืมกุญแจ!"}
{"word": "come back", "english": "I’ll come back to the store if they restock.", "thai": "ฉันจะกลับมาร้านนี้ถ้าพวกเขาเติมสต็อก"}
{"word": "come back", "english": "She didn’t come back after the argument.", "thai": "เธอไม่ได้กลับมาหลังจากการโต้เถียง"}
{"word": "come back", "english": "Can you come back to the meeting in an hour?", "thai": "คุณกลับมาเข้าร่วมประชุมในอีกหนึ่งชั่วโมงได้ไหม"}
{"word": "come back", "english": "The pain tends to come back when it’s cold.", "thai": "ความเจ็บปวดมักจะกลับมาเมื่ออากาศหนาว"}
{"word": "come back", "english": "Come back when you’re ready to talk.", "thai": "กลับมาเมื่อคุณพร้อมที่จะคุย"}
{"word": "come back", "english": "I saw him come back to the house around noon.", "thai": "ฉันเห็นเขากลับมาที่บ้านประมาณเที่ยง"}
{"word": "come back", "english": "The show will come back after the commercial break.", "thai": "รายการจะกลับมาหลังจากพักโฆษณา"}
{"word": "come back", "english": "Don’t come back until you’ve apologized.", "thai": "อย่ากลับมาจนกว่าคุณจะขอโทษ"}
{"word": "come back", "english": "Her smile always makes my heart come back to life.", "thai": "รอยยิ้มของเธอมักทำให้หัวใจฉันกลับมามีชีวิต"}
{"word": "come back", "english": "I’ll come back to this topic later in the discussion.", "thai": "ฉันจะกลับมาพูดถึงหัวข้อนี้ในภายหลังในการสนทนา"}
{"word": "come back", "english": "The team managed to come back from a huge deficit.", "thai": "ทีมสามารถกลับมาจากการขาดดุลครั้งใหญ่"}
{"word": "come back", "english": "Come back to bed, it’s too early!", "thai": "กลับมานอนบนเตียง ยังเช้าเกินไป!"}
{"word": "come back", "english": "The smell of that perfume makes old memories come back.", "thai": "กลิ่นน้ำหอมนั้นทำให้ความทรงจำเก่าย้อนกลับมา"}
{"word": "come back", "english": "He promised to come back with an answer by tomorrow.", "thai": "เขาสัญญาว่าจะกลับมาพร้อมคำตอบภายในวันพรุ่งนี้"}
{"word": "come back", "english": "Why do you always come back to that old argument?", "thai": "ทำไมคุณถึงย้อนกลับไปที่การโต้เถียงเก่านั้นเสมอ"}
{"word": "come back", "english": "Come back when you’ve made up your mind.", "thai": "กลับมาเมื่อคุณตัดสินใจได้แล้ว"}
{"word": "come back", "english": "The kids will come back home after school.", "thai": "เด็ก ๆ จะกลับบ้านหลังเลิกเรียน"}
{"word": "come back", "english": "I hope the sun will come back out this afternoon.", "thai": "ฉันหวังว่าดวงอาทิตย์จะกลับมาส่องในช่วงบ่ายนี้"}
{"word": "come back", "english": "She’ll come back stronger after this setback.", "thai": "เธอจะกลับมาแข็งแกร่งขึ้นหลังจากความพ่ายแพ้นี้"}
{"word": "come back", "english": "Come back to the table, dinner’s ready!", "thai": "กลับมาที่โต๊ะ อาหารเย็นพร้อมแล้ว!"}
{"word": "come back", "english": "Those feelings come back every time I hear that song.", "thai": "ความรู้สึกเหล่านั้นย้อนกลับมาทุกครั้งที่ฉันได้ยินเพลงนั้น"}
{"word": "come back", "english": "I’ll come back to pick you up at eight.", "thai": "ฉันจะกลับมารับคุณตอนสองทุ่ม"}
{"word": "come back", "english": "The dog always comes back when I call him.", "thai": "สุนัขมักจะกลับมาเมื่อฉันเรียกมัน"}
{"word": "come back", "english": "Come back inside, it’s starting to rain!", "thai": "กลับเข้ามาข้างใน ฝนเริ่มตกแล้ว!"}
{"word": "come back", "english": "The fashion of the 90s is starting to come back.", "thai": "แฟชั่นยุค 90 เริ่มกลับมาแล้ว"}
{"word": "come back", "english": "I’ll come back with the documents tomorrow.", "thai": "ฉันจะกลับมาพร้อมเอกสารในวันพรุ่งนี้"}
{"word": "come back", "english": "He didn’t come back after leaving for the store.", "thai": "เขาไม่ได้กลับมาหลังจากออกไปที่ร้าน"}
{"word": "come back", "english": "Come back to reality, you’re daydreaming again!", "thai": "กลับมาสู่ความเป็นจริง คุณกำลังฝันกลางวันอีกแล้ว!"}
{"word": "come back", "english": "The symptoms might come back if you stop the treatment.", "thai": "อาการอาจกลับมาถ้าคุณหยุดการรักษา"}
{"word": "come back", "english": "I’ll come back to check on you later.", "thai": "ฉันจะกลับมาดูคุณทีหลัง"}
{"word": "come back", "english": "Why does that memory always come back to haunt me?", "thai": "ทำไมความทรงจำนั้นถึงย้อนกลับมาหลอกหลอนฉันเสมอ"}
{"word": "come back", "english": "Come back here, we need to talk!", "thai": "กลับมาที่นี่ เราต้องคุยกัน!"}
{"word": "come back", "english": "The team needs to come back stronger in the second half.", "thai": "ทีมต้องกลับมาแข็งแกร่งขึ้นในครึ่งหลัง"}
{"word": "come back", "english": "I’ll come back to the gym after my injury heals.", "thai": "ฉันจะกลับไปยิมหลังจากอาการบาดเจ็บหาย"}
{"word": "come back", "english": "Those old games always come back to mind when I visit.", "thai": "เกมเก่า ๆ เหล่านั้นย้อนกลับมาในความทรงจำเมื่อฉันมาเยือน"}
{"word": "come back", "english": "Come back to the group, we’re leaving soon!", "thai": "กลับมาที่กลุ่ม เราจะออกเดินทางเร็ว ๆ นี้!"}
{"word": "come back", "english": "The movie will come back on after this ad.", "thai": "ภาพยนตร์จะกลับมาหลังจากโฆษณานี้"}
{"word": "come back", "english": "I hope you come back with good news.", "thai": "ฉันหวังว่าคุณจะกลับมาพร้อมข่าวดี"}
{"word": "come back", "english": "The pain might come back if you overdo it.", "thai": "ความเจ็บปวดอาจกลับมาถ้าคุณหักโหมเกินไป"}
{"word": "come back", "english": "Come back to the car, we’re late!", "thai": "กลับมาที่รถ เราไปสายแล้ว!"}
{"word": "come back", "english": "Her confidence started to come back after the talk.", "thai": "ความมั่นใจของเธอเริ่มกลับมาหลังจากการพูดคุย"}
{"word": "come back", "english": "I’ll come back to this project next week.", "thai": "ฉันจะกลับมาทำโปรเจกต์นี้สัปดาห์หน้า"}
{"word": "come back", "english": "The birds come back every spring to this tree.", "thai": "นกกลับมาที่ต้นไม้นี้ทุกฤดูใบไม้ผลิ"}
{"word": "come back", "english": "Come back when you’ve cooled off a bit.", "thai": "กลับมาเมื่อคุณเย็นลงสักหน่อย"}
{"word": "come back", "english": "The signal should come back once we’re in range.", "thai": "สัญญาณน่าจะกลับมาเมื่อเราอยู่ในระยะ"}
{"word": "come back", "english": "I’ll come back to the office after lunch.", "thai": "ฉันจะกลับไปที่ออฟฟิศหลังอาหารเที่ยง"}
{"word": "come back", "english": "The old TV shows always come back in reruns.", "thai": "รายการทีวีเก่า ๆ มักจะกลับมาในรอบฉายซ้ำ"}
{"word": "come back", "english": "Come back to the kitchen, the food’s getting cold!", "thai": "กลับมาที่ครัว อาหารเริ่มเย็นแล้ว!"}
{"word": "come back", "english": "The feeling of joy will come back with time.", "thai": "ความรู้สึกยินดีจะกลับมาพร้อมกับเวลา"}
{"word": "come back", "english": "I saw her come back to the park this morning.", "thai": "ฉันเห็นเธอกลับมาที่สวนสาธารณะเช้านี้"}
{"word": "come back", "english": "Come back to the meeting, we need your input!", "thai": "กลับมาที่ประชุม เราต้องการความเห็นของคุณ!"}
{"word": "come back", "english": "The team made an epic come back in the final minutes.", "thai": "ทีมทำการกลับมาอย่างยิ่งใหญ่ในนาทีสุดท้าย"}
{"word": "come back", "english": "I’ll come back with the change in a minute.", "thai": "ฉันจะกลับมาพร้อมเงินทอนในอีกนาที"}
{"word": "come back", "english": "Those childhood games come back to me sometimes.", "thai": "เกมในวัยเด็กย้อนกลับมาหาฉันบางครั้ง"}
{"word": "come back", "english": "Come back to the campfire, it’s getting dark!", "thai": "กลับมาที่กองไฟ มันเริ่มมืดแล้ว!"}
{"word": "come back", "english": "The app will come back online after maintenance.", "thai": "แอปจะกลับมาออนไลน์หลังจากการบำรุงรักษา"}
{"word": "come back", "english": "I hope you come back to visit us soon.", "thai": "ฉันหวังว่าคุณจะกลับมาเยี่ยมเราเร็ว ๆ นี้"}
{"word": "come back", "english": "The fever might come back if you don’t rest.", "thai": "ไข้บูอาจกลับมาถ้าคุณไม่พักผ่อน"}
{"word": "come back", "english": "Come back to the room, we’re starting the game!", "thai": "กลับมาที่ห้อง เราเริ่มเกมแล้ว!"}
{"word": "come back", "english": "Her strength will come back with proper care.", "thai": "ความแข็งแกร่งของเธอจะกลับมาด้วยการดูแลที่เหมาะสม"}
{"word": "come back", "english": "I’ll come back to the library this afternoon.", "thai": "ฉันจะกลับไปที่ห้องสมุดบ่ายนี้"}
{"word": "come back", "english": "The old styles always come back into fashion.", "thai": "สไตล์เก่า ๆ มักจะกลับมาเป็นแฟชั่น"}
{"word": "come back", "english": "Come back to the couch, the movie’s starting!", "thai": "กลับมาที่โซฟา หนังเริ่มแล้ว!"}
{"word": "come back", "english": "The memories of summer come back every year.", "thai": "ความทรงจำของฤดูร้อนย้อนกลับมาทุกปี"}
{"word": "come back", "english": "I’ll come back with the pizza in twenty minutes.", "thai": "ฉันจะกลับมาพร้อมพิซซ่าในยี่สิบนาที"}
{"word": "come back", "english": "The signal will come back when we’re closer to town.", "thai": "สัญญาณจะกลับมาเมื่อเราเข้าใกล้เมือง"}
{"word": "come back", "english": "Come back to the team, we need you!", "thai": "กลับมาที่ทีม เราต้องการคุณ!"}
{"word": "come back", "english": "The band plans to come back for another tour.", "thai": "วงดนตรีวางแผนจะกลับมาทัวร์อีกครั้ง"}
{"word": "come back", "english": "I’ll come back to the park with my dog tomorrow.", "thai": "ฉันจะกลับไปที่สวนสาธารณะพร้อมสุนัขของฉันพรุ่งนี้"}
{"word": "come back", "english": "The good vibes always come back at this festival.", "thai": "ความรู้สึกดี ๆ มักจะกลับมาที่งานเทศกาลนี้"}
{"word": "come back", "english": "Come back to the stage, the crowd loves you!", "thai": "กลับมาที่เวที ผู้ชมรักคุณ!"}
{"word": "come back", "english": "The old songs come back to me when I’m alone.", "thai": "เพลงเก่า ๆ ย้อนกลับมาหาฉันเมื่อฉันอยู่คนเดียว"}
{"word": "come back", "english": "I’ll come back to the shop if they lower the price.", "thai": "ฉันจะกลับไปที่ร้านถ้าพวกเขาลดราคา"}
{"word": "come back", "english": "The power should come back on soon.", "thai": "ไฟน่าจะกลับมาเร็ว ๆ นี้"}
{"word": "come back", "english": "Come back to the picnic, we saved you a spot!", "thai": "กลับมาที่ปิกนิก เราเก็บที่ไว้ให้คุณ!"}
{"word": "come back", "english": "The old habits tend to come back under stress.", "thai": "นิสัยเก่า ๆ มักจะกลับมาเมื่ออยู่ภายใต้ความเครียด"}
{"word": "come back", "english": "I’ll come back to the conversation after my call.", "thai": "ฉันจะกลับมาที่การสนทนาหลังจากโทรศัพท์"}
{"word": "come back", "english": "The flowers come back every year in this garden.", "thai": "ดอกไม้กลับมาในสวนนี้ทุกปี"}
{"word": "come back", "english": "Come back to the bar, we’re having fun!", "thai": "กลับมาที่บาร์ เรากำลังสนุก!"}
{"word": "come back", "english": "The feeling of hope will come back with time.", "thai": "ความรู้สึกหวังจะกลับมาพร้อมกับเวลา"}
{"word": "come back", "english": "I’ll come back to the studio next month.", "thai": "ฉันจะกลับไปที่สตูดิโอเดือนหน้า"}
{"word": "come back", "english": "The old arguments always come back during holidays.", "thai": "การโต้เถียงเก่า ๆ มักจะกลับมาในช่วงวันหยุด"}
{"word": "come back", "english": "Come back to the field, the game’s not over!", "thai": "กลับมาที่สนาม เกมยังไม่จบ!"}
{"word": "come back", "english": "The app should come back after the update.", "thai": "แอปน่าจะกลับมาหลังจากการอัปเดต"}
{"word": "come back", "english": "I hope you come back with some snacks!", "thai": "ฉันหวังว่าคุณจะกลับมาพร้อมของว่าง!"}
{"word": "come back", "english": "The memories of home come back when I cook this dish.", "thai": "ความทรงจำของบ้านย้อนกลับมาเมื่อฉันทำอาหารจานนี้"}
{"word": "come back", "english": "Come back to the table, we’re about to eat!", "thai": "กลับมาที่โต๊ะ เรากำลังจะกินข้าว!"}
{"word": "come back", "english": "Her energy will come back after some rest.", "thai": "พลังของเธอจะกลับมาหลังจากพักผ่อน"}
{"word": "come back", "english": "I’ll come back to the topic in our next meeting.", "thai": "ฉันจะกลับมาที่หัวข้อนี้ในการประชุมครั้งหน้า"}
{"word": "come back", "english": "The old traditions come back every festival season.", "thai": "ประเพณีเก่า ๆ กลับมาในทุกฤดูกาลเทศกาล"}
{"word": "come back", "english": "Come back to the dance floor, the music’s great!", "thai": "กลับมาที่ฟลอร์เต้นรำ ดนตรีดีมาก!"}
{"word": "come back", "english": "The internet should come back after the storm passes.", "thai": "อินเทอร์เน็ตน่าจะกลับมาหลังจากพายุผ่านไป"}
{"word": "get back", "english": "I need to get back to work before the deadline.", "thai": "ฉันต้องกลับไปทำงานก่อนถึงกำหนดเวลา"}
{"word": "get back", "english": "Can you get back to me with the details later?", "thai": "คุณจะกลับมาตอบฉันพร้อมรายละเอียดทีหลังได้ไหม"}
{"word": "get back", "english": "We should get back home before it gets dark.", "thai": "เราควรกลับบ้านก่อนที่มันจะมืด"}
{"word": "get back", "english": "I’ll get back to you after I check my schedule.", "thai": "ฉันจะกลับมาตอบคุณหลังจากเช็คตารางของฉัน"}
{"word": "get back", "english": "Let’s get back to the main topic of the meeting.", "thai": "กลับไปที่หัวข้อหลักของการประชุมกันเถอะ"}
{"word": "get back", "english": "I’m trying to get back in shape after the holidays.", "thai": "ฉันพยายามกลับมาฟิตหลังวันหยุด"}
{"word": "get back", "english": "Get back here, you forgot your phone!", "thai": "กลับมาที่นี่ คุณลืมโทรศัพท์!"}
{"word": "get back", "english": "She needs to get back to her routine after the trip.", "thai": "เธอต้องกลับไปสู่วิถีชีวิตประจำวันหลังจากทริป"}
{"word": "get back", "english": "I’ll get back to the office by noon.", "thai": "ฉันจะกลับไปที่ออฟฟิศตอนเที่ยง"}
{"word": "get back", "english": "We can get back to the game after dinner.", "thai": "เราจะกลับไปเล่นเกมหลังอาหารเย็น"}
{"word": "get back", "english": "He’s trying to get back on his feet after the loss.", "thai": "เขาพยายามกลับมายืนหยัดหลังจากความสูญเสีย"}
{"word": "get back", "english": "Get back to your seat, the show’s starting!", "thai": "กลับไปที่ที่นั่งของคุณ รายการเริ่มแล้ว!"}
{"word": "get back", "english": "I’ll get back to studying once I finish this call.", "thai": "ฉันจะกลับไปเรียนต่อเมื่อโทรศัพท์นี้เสร็จ"}
{"word": "get back", "english": "Can we get back to the plan we discussed earlier?", "thai": "เราจะกลับไปที่แผนที่เราคุยกันก่อนหน้านี้ได้ไหม"}
{"word": "get back", "english": "I want to get back to my hometown this summer.", "thai": "ฉันอยากกลับไปที่บ้านเกิดฤดูร้อนนี้"}
{"word": "get back", "english": "Get back to the kitchen, the food’s burning!", "thai": "กลับไปที่ครัว อาหารกำลังไหม้!"}
{"word": "get back", "english": "She’ll get back to her old self soon.", "thai": "เธอจะกลับมาเป็นตัวของตัวเองในไม่ช้า"}
{"word": "get back", "english": "I need to get back to the gym this week.", "thai": "ฉันต้องกลับไปยิมสัปดาห์นี้"}
{"word": "get back", "english": "Let’s get back together for coffee next month.", "thai": "มานัดเจอกันดื่มกาแฟเดือนหน้าดีกว่า"}
{"word": "get back", "english": "I’ll get back to you with the final decision tomorrow.", "thai": "ฉันจะกลับมาตอบคุณพร้อมการตัดสินใจขั้นสุดท้ายพรุ่งนี้"}
{"word": "get back", "english": "We need to get back to basics with this project.", "thai": "เราต้องกลับไปที่พื้นฐานกับโปรเจกต์นี้"}
{"word": "get back", "english": "Get back to the car, it’s starting to rain!", "thai": "กลับไปที่รถ ฝนเริ่มตกแล้ว!"}
{"word": "get back", "english": "He’s hoping to get back into music after the break.", "thai": "เขาหวังว่าจะกลับมาเล่นดนตรีหลังจากหยุดพัก"}
{"word": "get back", "english": "I’ll get back to the book once I have more time.", "thai": "ฉันจะกลับไปอ่านหนังสือเมื่อมีเวลามากขึ้น"}
{"word": "get back", "english": "Get back to the table, dinner’s ready!", "thai": "กลับไปที่โต๊ะ อาหารเย็นพร้อมแล้ว!"}
{"word": "get back", "english": "She’s trying to get back her confidence after the setback.", "thai": "เธอกำลังพยายามกู้ความมั่นใจคืนหลังจากความพ่ายแพ้"}
{"word": "get back", "english": "I’ll get back to the store to grab some milk.", "thai": "ฉันจะกลับไปที่ร้านเพื่อซื้อนม"}
{"word": "get back", "english": "Let’s get back to the movie, it’s getting good!", "thai": "กลับไปดูหนังกันเถอะ มันเริ่มสนุกแล้ว!"}
{"word": "get back", "english": "I need to get back to my emails before the end of the day.", "thai": "ฉันต้องกลับไปเช็คอีเมลก่อนสิ้นวัน"}
{"word": "get back", "english": "Get back to the group, we’re leaving soon!", "thai": "กลับไปที่กลุ่ม เราจะออกเดินทางเร็ว ๆ นี้!"}
{"word": "get back", "english": "He’s planning to get back to hiking next weekend.", "thai": "เขาวางแผนจะกลับไปเดินป่าสุดสัปดาห์หน้า"}
{"word": "get back", "english": "I’ll get back to you after I talk to my boss.", "thai": "ฉันจะกลับมาตอบคุณหลังจากคุยกับเจ้านาย"}
{"word": "get back", "english": "We should get back to the park before it closes.", "thai": "เราควรกลับไปที่สวนสาธารณะก่อนมันปิด"}
{"word": "get back", "english": "Get back to your homework, it’s due tomorrow!", "thai": "กลับไปทำการบ้านของคุณ มันถึงกำหนดส่งพรุ่งนี้!"}
{"word": "get back", "english": "I’m trying to get back into reading novels.", "thai": "ฉันพยายามกลับมาอ่านนิยาย"}
{"word": "get back", "english": "Let’s get back to the conversation we started earlier.", "thai": "กลับไปที่การสนทนาที่เราเริ่มไว้ก่อนหน้านี้"}
{"word": "get back", "english": "I’ll get back to the project after this break.", "thai": "ฉันจะกลับไปทำโปรเจกต์หลังจากพักนี้"}
{"word": "get back", "english": "Get back to the field, the game’s not over!", "thai": "กลับไปที่สนาม เกมยังไม่จบ!"}
{"word": "get back", "english": "She needs to get back to her studies before the exam.", "thai": "เธอต้องกลับไปเรียนก่อนสอบ"}
{"word": "get back", "english": "I’ll get back to the city by evening.", "thai": "ฉันจะกลับไปที่เมืองตอนเย็น"}
{"word": "get back", "english": "Let’s get back to practicing for the show.", "thai": "กลับไปซ้อมสำหรับการแสดงกันเถอะ"}
{"word": "get back", "english": "Get back to the couch, the game’s on!", "thai": "กลับไปที่โซฟา เกมเริ่มแล้ว!"}
{"word": "get back", "english": "I’m hoping to get back to painting this weekend.", "thai": "ฉันหวังว่าจะกลับไปวาดภาพสุดสัปดาห์นี้"}
{"word": "get back", "english": "I’ll get back to you with the report by Monday.", "thai": "ฉันจะกลับมาตอบคุณพร้อมรายงานในวันจันทร์"}
{"word": "get back", "english": "We need to get back to the trail before sunset.", "thai": "เราต้องกลับไปที่เส้นทางก่อนพระอาทิตย์ตก"}
{"word": "get back", "english": "Get back to the kitchen, we need help!", "thai": "กลับไปที่ครัว เราต้องการความช่วยเหลือ!"}
{"word": "get back", "english": "He’s trying to get back into running after the injury.", "thai": "เขาพยายามกลับไปวิ่งหลังจากบาดเจ็บ"}
{"word": "get back", "english": "I’ll get back to the library to return these books.", "thai": "ฉันจะกลับไปที่ห้องสมุดเพื่อคืนหนังสือเหล่านี้"}
{"word": "get back", "english": "Let’s get back to the party, it’s getting lively!", "thai": "กลับไปที่ปาร์ตี้กันเถอะ มันเริ่มคึกคักแล้ว!"}
{"word": "get back", "english": "I need to get back to my workout routine.", "thai": "ฉันต้องกลับไปสู่วงจรการออกกำลังกาย"}
{"word": "get back", "english": "Get back to the meeting, we’re discussing your idea!", "thai": "กลับไปที่ประชุม เรากำลังคุยเกี่ยวกับไอเดียของคุณ!"}
{"word": "get back", "english": "I’ll get back to the store for some groceries later.", "thai": "ฉันจะกลับไปที่ร้านเพื่อซื้อของชำทีหลัง"}
{"word": "get back", "english": "She’s hoping to get back to dancing after the break.", "thai": "เธอหวังว่าจะกลับไปเต้นหลังจากหยุดพัก"}
{"word": "get back", "english": "Let’s get back to the plan before we lose focus.", "thai": "กลับไปที่แผนก่อนที่เราจะเสียสมาธิ"}
{"word": "get back", "english": "I’ll get back to the office after this appointment.", "thai": "ฉันจะกลับไปที่ออฟฟิศหลังจากการนัดหมายนี้"}
{"word": "get back", "english": "Get back to the stage, the audience is waiting!", "thai": "กลับไปที่เวที ผู้ชมกำลังรอ!"}
{"word": "get back", "english": "I’m trying to get back to my meditation practice.", "thai": "ฉันพยายามกลับไปฝึกสมาธิ"}
{"word": "get back", "english": "I’ll get back to you with the prices tomorrow.", "thai": "ฉันจะกลับมาตอบคุณพร้อมราคาในวันพรุ่งนี้"}
{"word": "get back", "english": "We should get back to the beach before it gets crowded.", "thai": "เราควรกลับไปที่ชายหาดก่อนที่มันจะแออัด"}
{"word": "get back", "english": "Get back to the classroom, the lesson’s starting!", "thai": "กลับไปที่ห้องเรียน บทเรียนเริ่มแล้ว!"}
{"word": "get back", "english": "He’s trying to get back to his old hobbies.", "thai": "เขาพยายามกลับไปทำงานอดิเรกเก่า ๆ"}
{"word": "get back", "english": "I’ll get back to the garden to finish planting.", "thai": "ฉันจะกลับไปที่สวนเพื่อปลูกต้นไม้ให้เสร็จ"}
{"word": "get back", "english": "Let’s get back to the book club discussion.", "thai": "กลับไปที่การสนทนาของชมรมหนังสือ"}
{"word": "get back", "english": "Get back to the bar, we’re ordering drinks!", "thai": "กลับไปที่บาร์ เรากำลังสั่งเครื่องดื่ม!"}
{"word": "get back", "english": "I’m hoping to get back to writing this month.", "thai": "ฉันหวังว่าจะกลับมาเขียนในเดือนนี้"}
{"word": "get back", "english": "I’ll get back to you after I review the contract.", "thai": "ฉันจะกลับมาตอบคุณหลังจากทบทวนสัญญา"}
{"word": "get back", "english": "We need to get back to the campsite before dark.", "thai": "เราต้องกลับไปที่แคมป์ก่อนมืด"}
{"word": "get back", "english": "Get back to the dance floor, the music’s awesome!", "thai": "กลับไปที่ฟลอร์เต้นรำ ดนตรีเจ๋งมาก!"}
{"word": "get back", "english": "She’s trying to get back to her yoga routine.", "thai": "เธอกำลังพยายามกลับไปสู่วงจรโยคะ"}
{"word": "get back", "english": "I’ll get back to the shop to pick up the order.", "thai": "ฉันจะกลับไปที่ร้านเพื่อรับออเดอร์"}
{"word": "get back", "english": "Let’s get back to the drawing board with this idea.", "thai": "กลับไปที่กระดานวาดเขียนกับไอเดียนี้"}
{"word": "get back", "english": "Get back to the pool, the race is starting!", "thai": "กลับไปที่สระ การแข่งขันเริ่มแล้ว!"}
{"word": "get back", "english": "I’m trying to get back to learning Spanish.", "thai": "ฉันพยายามกลับไปเรียนภาษาสเปน"}
{"word": "get back", "english": "I’ll get back to you with feedback by tonight.", "thai": "ฉันจะกลับมาตอบคุณพร้อมฟีดแบ็กคืนนี้"}
{"word": "get back", "english": "We should get back to the museum before it closes.", "thai": "เราควรกลับไปที่พิพิธภัณฑ์ก่อนมันปิด"}
{"word": "get back", "english": "Get back to the yard, the kids are playing!", "thai": "กลับไปที่สนาม เด็ก ๆ กำลังเล่น!"}
{"word": "get back", "english": "He’s hoping to get back to cycling this spring.", "thai": "เขาหวังว่าจะกลับไปปั่นจักรยานฤดูใบไม้ผลินี้"}
{"word": "get back", "english": "I’ll get back to the kitchen to finish cooking.", "thai": "ฉันจะกลับไปที่ครัวเพื่อทำอาหารให้เสร็จ"}
{"word": "get back", "english": "Let’s get back to the rehearsal, we’re running late!", "thai": "กลับไปที่การซ้อม เราเริ่มสายแล้ว!"}
{"word": "get back", "english": "Get back to the table, we’re starting dessert!", "thai": "กลับไปที่โต๊ะ เราเริ่มของหวานแล้ว!"}
{"word": "get back", "english": "I’m trying to get back to my morning runs.", "thai": "ฉันพยายามกลับไปวิ่งตอนเช้า"}
{"word": "get back", "english": "I’ll get back to you after I check the inventory.", "thai": "ฉันจะกลับมาตอบคุณหลังจากเช็คสินค้าคงคลัง"}
{"word": "get back", "english": "We need to get back to the hotel before the storm.", "thai": "เราต้องกลับไปที่โรงแรมก่อนพายุ"}
{"word": "get back", "english": "Get back to the studio, the session’s starting!", "thai": "กลับไปที่สตูดิโอ เซสชันเริ่มแล้ว!"}
{"word": "get back", "english": "She’s trying to get back to her normal sleep schedule.", "thai": "เธอกำลังพยายามกลับไปสู่วงจรการนอนปกติ"}
{"word": "get back", "english": "I’ll get back to the park to walk the dog.", "thai": "ฉันจะกลับไปที่สวนสาธารณะเพื่อพาสุนัขไปเดิน"}
{"word": "get back", "english": "Let’s get back to the script before we forget.", "thai": "กลับไปที่บทก่อนที่เราจะลืม"}
{"word": "get back", "english": "Get back to the campfire, it’s getting cold!", "thai": "กลับไปที่กองไฟ มันเริ่มหนาวแล้ว!"}
{"word": "get back", "english": "I’m hoping to get back to gardening this weekend.", "thai": "ฉันหวังว่าจะกลับไปทำสวนสุดสัปดาห์นี้"}
{"word": "get back", "english": "I’ll get back to you with the schedule tomorrow.", "thai": "ฉันจะกลับมาตอบคุณพร้อมตารางในวันพรุ่งนี้"}
{"word": "get back", "english": "We should get back to the lake before it gets busy.", "thai": "เราควรกลับไปที่ทะเลสาบก่อนที่มันจะวุ่นวาย"}
{"word": "get back", "english": "Get back to the gym, your trainer’s waiting!", "thai": "กลับไปที่ยิม เทรนเนอร์ของคุณกำลังรอ!"}
{"word": "get back", "english": "He’s trying to get back to his old workout routine.", "thai": "เขาพยายามกลับไปสู่วงจรการออกกำลังกายเก่า"}
{"word": "get back", "english": "I’ll get back to the office to finish the report.", "thai": "ฉันจะกลับไปที่ออฟฟิศเพื่อทำรายงานให้เสร็จ"}
{"word": "get back", "english": "Let’s get back to the picnic, everyone’s there!", "thai": "กลับไปที่ปิกนิก ทุกคนอยู่ที่นั่น!"}
{"word": "get back", "english": "Get back to the board, we’re brainstorming!", "thai": "กลับไปที่กระดาน เรากำลังระดมความคิด!"}
{"word": "get back", "english": "I’m trying to get back to my journaling habit.", "thai": "ฉันพยายามกลับไปสู่นิสัยการเขียนบันทึก"}
{"word": "get back", "english": "I’ll get back to you after I confirm the details.", "thai": "ฉันจะกลับมาตอบคุณหลังจากยืนยันรายละเอียด"}
{"word": "get back", "english": "We need to get back to the trailhead before night.", "thai": "เราต้องกลับไปที่จุดเริ่มต้นเส้นทางก่อนค่ำ"}
{"word": "get back", "english": "Get back to the party, it’s just getting started!", "thai": "กลับไปที่ปาร์ตี้ มันเพิ่งเริ่ม!"}
{"word": "settle down", "english": "I think it’s time for us to settle down and start a family.", "thai": "ฉันคิดว่าได้เวลาที่เราจะตั้งรกรากและเริ่มต้นครอบครัวแล้ว"}
{"word": "settle down", "english": "Can you kids settle down and stop running around?", "thai": "เด็ก ๆ สงบลงและหยุดวิ่งไปมาได้ไหม"}
{"word": "settle down", "english": "She wants to settle down in a small town someday.", "thai": "เธออยากตั้งรกรากในเมืองเล็ก ๆ สักวันหนึ่ง"}
{"word": "settle down", "english": "Let’s settle down and watch a movie tonight.", "thai": "มาสงบลงและดูหนังคืนนี้กันเถอะ"}
{"word": "settle down", "english": "He’s not ready to settle down; he loves traveling too much.", "thai": "เขายังไม่พร้อมที่จะตั้งรกราก เขาชอบเดินทางมากเกินไป"}
{"word": "settle down", "english": "The class needs to settle down before the lesson starts.", "thai": "ชั้นเรียนต้องสงบลงก่อนที่บทเรียนจะเริ่ม"}
{"word": "settle down", "english": "I hope things settle down at work after this project.", "thai": "ฉันหวังว่าทุกอย่างจะสงบลงที่ทำงานหลังจากโปรเจกต์นี้"}
{"word": "settle down", "english": "Settle down, everyone, the meeting is about to begin!", "thai": "สงบลงทุกคน การประชุมกำลังจะเริ่ม!"}
{"word": "settle down", "english": "She’s looking for someone to settle down with.", "thai": "เธอกำลังมองหาคนที่จะตั้งรกรากด้วย"}
{"word": "settle down", "english": "The dog will settle down once it gets used to the new house.", "thai": "สุนัขจะสงบลงเมื่อมันชินกับบ้านใหม่"}
{"word": "settle down", "english": "Let’s settle down with some tea and talk.", "thai": "มานั่งสงบ ๆ ดื่มชาและคุยกัน"}
{"word": "settle down", "english": "I’m ready to settle down after years of moving around.", "thai": "ฉันพร้อมที่จะตั้งรกรากหลังจากย้ายไปมาหลายปี"}
{"word": "settle down", "english": "Can you settle down and focus on your homework?", "thai": "คุณสงบลงและโฟกัสที่การบ้านได้ไหม"}
{"word": "settle down", "english": "They decided to settle down in the countryside.", "thai": "พวกเขาตัดสินใจตั้งรกรากในชนบท"}
{"word": "settle down", "english": "The crowd needs to settle down before the concert starts.", "thai": "ฝูงชนต้องสงบลงก่อนที่คอนเสิร์ตจะเริ่ม"}
{"word": "settle down", "english": "Settle down, it’s just a small misunderstanding!", "thai": "สงบลง มันแค่ความเข้าใจผิดเล็กน้อย!"}
{"word": "settle down", "english": "I want to settle down somewhere with a nice view.", "thai": "ฉันอยากตั้งรกรากที่ไหนสักแห่งที่มีวิวสวย"}
{"word": "settle down", "english": "The kids will settle down once they’re tired.", "thai": "เด็ก ๆ จะสงบลงเมื่อพวกเขาเหนื่อย"}
{"word": "settle down", "english": "He’s too young to settle down right now.", "thai": "เขายังเด็กเกินไปที่จะตั้งรกรากตอนนี้"}
{"word": "settle down", "english": "Let’s settle down in the living room for a chat.", "thai": "มานั่งสงบ ๆ ในห้องนั่งเล่นเพื่อคุยกัน"}
{"word": "settle down", "english": "The storm should settle down by this evening.", "thai": "พายุควรสงบลงภายในเย็นนี้"}
{"word": "settle down", "english": "She’s hoping to settle down after finishing school.", "thai": "เธอหวังว่าจะตั้งรกรากหลังจากเรียนจบ"}
{"word": "settle down", "english": "Settle down, we’re trying to watch the game!", "thai": "สงบลง เรากำลังพยายามดูเกม!"}
{"word": "settle down", "english": "I need things to settle down before I make a decision.", "thai": "ฉันต้องการให้ทุกอย่างสงบลงก่อนตัดสินใจ"}
{"word": "settle down", "english": "They want to settle down near the beach.", "thai": "พวกเขาอยากตั้งรกรากใกล้ชายหาด"}
{"word": "settle down", "english": "Can everyone settle down so we can start the presentation?", "thai": "ทุกคนสงบลงเพื่อที่เราจะเริ่มนำเสนอได้ไหม"}
{"word": "settle down", "english": "The baby will settle down after a warm bath.", "thai": "ทารกจะสงบลงหลังจากอาบน้ำอุ่น"}
{"word": "settle down", "english": "I’m not ready to settle down in one place yet.", "thai": "ฉันยังไม่พร้อมที่จะตั้งรกรากในที่เดียว"}
{"word": "settle down", "english": "Settle down, it’s not worth getting upset over!", "thai": "สงบลง มันไม่คุ้มที่จะเสียใจ!"}
{"word": "settle down", "english": "They plan to settle down after their world tour.", "thai": "พวกเขาวางแผนจะตั้งรกรากหลังจากทัวร์รอบโลก"}
{"word": "settle down", "english": "The room needs to settle down before the speaker arrives.", "thai": "ห้องต้องสงบลงก่อนที่ผู้พูดจะมาถึง"}
{"word": "settle down", "english": "I want to settle down with someone who shares my values.", "thai": "ฉันอยากตั้งรกรากกับคนที่แบ่งปันค่านิยมของฉัน"}
{"word": "settle down", "english": "The wind should settle down by the afternoon.", "thai": "ลมควรสงบลงภายในช่วงบ่าย"}
{"word": "settle down", "english": "Settle down, we’re just joking around!", "thai": "สงบลง เราแค่ล้อเล่น!"}
{"word": "settle down", "english": "She’s ready to settle down and buy a house.", "thai": "เธอพร้อมที่จะตั้งรกรากและซื้อบ้าน"}
{"word": "settle down", "english": "The students need to settle down for the exam.", "thai": "นักเรียนต้องสงบลงเพื่อสอบ"}
{"word": "settle down", "english": "I hope the argument will settle down soon.", "thai": "ฉันหวังว่าการโต้เถียงจะสงบลงเร็ว ๆ นี้"}
{"word": "settle down", "english": "Let’s settle down with some popcorn and a movie.", "thai": "มานั่งสงบ ๆ กับป๊อปคอร์นและหนัง"}
{"word": "settle down", "english": "He’s not the type to settle down anytime soon.", "thai": "เขาไม่ใช่คนที่จะตั้งรกรากในเร็ว ๆ นี้"}
{"word": "settle down", "english": "The crowd will settle down once the show begins.", "thai": "ฝูงชนจะสงบลงเมื่อการแสดงเริ่ม"}
{"word": "settle down", "english": "I want to settle down in a quiet neighborhood.", "thai": "ฉันอยากตั้งรกรากในย่านที่เงียบสงบ"}
{"word": "settle down", "english": "Settle down, the teacher’s about to speak!", "thai": "สงบลง ครูกำลังจะพูด!"}
{"word": "settle down", "english": "They’re planning to settle down after the wedding.", "thai": "พวกเขาวางแผนจะตั้งรกรากหลังงานแต่ง"}
{"word": "settle down", "english": "The noise should settle down after midnight.", "thai": "เสียงรบกวนควรสงบลงหลังเที่ยงคืน"}
{"word": "settle down", "english": "Can you settle down and listen for a minute?", "thai": "คุณสงบลงและฟังสักครู่ได้ไหม"}
{"word": "settle down", "english": "She dreams of settling down in a cozy cabin.", "thai": "เธอฝันที่จะตั้งรกรากในกระท่อมแสนอบอุ่น"}
{"word": "settle down", "english": "The team needs to settle down and focus on the game.", "thai": "ทีมต้องสงบลงและโฟกัสที่เกม"}
{"word": "settle down", "english": "I’ll settle down once I find the right place.", "thai": "ฉันจะตั้งรกรากเมื่อพบสถานที่ที่เหมาะสม"}
{"word": "settle down", "english": "Settle down, we’re trying to have a serious talk!", "thai": "สงบลง เรากำลังพยายามคุยเรื่องจริงจัง!"}
{"word": "settle down", "english": "The kids will settle down after storytime.", "thai": "เด็ก ๆ จะสงบลงหลังเวลานิทาน"}
{"word": "settle down", "english": "He wants to settle down but hasn’t found the right person.", "thai": "เขาอยากตั้งรกรากแต่ยังไม่เจอคนที่ใช่"}
{"word": "settle down", "english": "Let’s settle down by the fireplace tonight.", "thai": "มานั่งสงบ ๆ ข้างเตาผิงคืนนี้"}
{"word": "settle down", "english": "The excitement will settle down after the announcement.", "thai": "ความตื่นเต้นจะสงบลงหลังจากการประกาศ"}
{"word": "settle down", "english": "Settle down, the movie’s about to start!", "thai": "สงบลง หนังกำลังจะเริ่ม!"}
{"word": "settle down", "english": "She’s ready to settle down and focus on her career.", "thai": "เธอพร้อมที่จะตั้งรกรากและโฟกัสที่อาชีพ"}
{"word": "settle down", "english": "The audience needs to settle down for the performance.", "thai": "ผู้ชมต้องสงบลงเพื่อการแสดง"}
{"word": "settle down", "english": "I hope things settle down after this busy week.", "thai": "ฉันหวังว่าทุกอย่างจะสงบลงหลังจากสัปดาห์ที่วุ่นวายนี้"}
{"word": "settle down", "english": "They want to settle down in a place with good schools.", "thai": "พวกเขาอยากตั้งรกรากในที่ที่มีโรงเรียนดี"}
{"word": "settle down", "english": "Can you settle down and stop fidgeting?", "thai": "คุณสงบลงและหยุดกระสับกระส่ายได้ไหม"}
{"word": "settle down", "english": "The puppy will settle down after some playtime.", "thai": "ลูกสุนัขจะสงบลงหลังจากเล่นสักพัก"}
{"word": "settle down", "english": "I’m not ready to settle down in one city yet.", "thai": "ฉันยังไม่พร้อมที่จะตั้งรกรากในเมืองเดียว"}
{"word": "settle down", "english": "Settle down, it’s just a game!", "thai": "สงบลง มันแค่เกม!"}
{"word": "settle down", "english": "They hope to settle down after years of travel.", "thai": "พวกเขาหวังว่าจะตั้งรกรากหลังจากเดินทางมาหลายปี"}
{"word": "settle down", "english": "The classroom will settle down once the teacher arrives.", "thai": "ห้องเรียนจะสงบลงเมื่อครูมาถึง"}
{"word": "settle down", "english": "I want to settle down somewhere warm and sunny.", "thai": "ฉันอยากตั้งรกรากที่ไหนสักแห่งที่อบอุ่นและมีแดด"}
{"word": "settle down", "english": "Settle down, we’re trying to read here!", "thai": "สงบลง เรากำลังพยายามอ่านที่นี่!"}
{"word": "settle down", "english": "She’s planning to settle down after her promotion.", "thai": "เธอวางแผนจะตั้งรกรากหลังจากได้เลื่อนตำแหน่ง"}
{"word": "settle down", "english": "The chaos should settle down after the event.", "thai": "ความโกลาหลควรสงบลงหลังจากงาน"}
{"word": "settle down", "english": "Can you settle down and help with the dishes?", "thai": "คุณสงบลงและช่วยล้างจานได้ไหม"}
{"word": "settle down", "english": "They’re ready to settle down and build a home.", "thai": "พวกเขาพร้อมที่จะตั้งรกรากและสร้างบ้าน"}
{"word": "settle down", "english": "The kids need to settle down before bedtime.", "thai": "เด็ก ๆ ต้องสงบลงก่อนเข้านอน"}
{"word": "settle down", "english": "He’s not sure when he’ll settle down.", "thai": "เขาไม่แน่ใจว่าเขาจะตั้งรกรากเมื่อไหร่"}
{"word": "settle down", "english": "Let’s settle down with a good book this evening.", "thai": "มานั่งสงบ ๆ กับหนังสือดี ๆ คืนนี้"}
{"word": "settle down", "english": "The tension will settle down after the discussion.", "thai": "ความตึงเครียดจะสงบลงหลังจากการสนทนา"}
{"word": "settle down", "english": "Settle down, we’re just having fun!", "thai": "สงบลง เราแค่สนุกกัน!"}
{"word": "settle down", "english": "She wants to settle down in a big city.", "thai": "เธออยากตั้งรกรากในเมืองใหญ่"}
{"word": "settle down", "english": "The group needs to settle down for the workshop.", "thai": "กลุ่มต้องสงบลงเพื่อเวิร์กช็อป"}
{"word": "settle down", "english": "I hope the situation will settle down soon.", "thai": "ฉันหวังว่าสถานการณ์จะสงบลงเร็ว ๆ นี้"}
{"word": "settle down", "english": "They’re looking to settle down near their family.", "thai": "พวกเขากำลังมองหาที่จะตั้งรกรากใกล้ครอบครัว"}
{"word": "settle down", "english": "Can you settle down and finish your work?", "thai": "คุณสงบลงและทำงานให้เสร็จได้ไหม"}
{"word": "settle down", "english": "The cat will settle down once it feels safe.", "thai": "แมวจะสงบลงเมื่อมันรู้สึกปลอดภัย"}
{"word": "settle down", "english": "I’m too restless to settle down right now.", "thai": "ฉันกระสับกระส่ายเกินไปที่จะตั้งรกรากตอนนี้"}
{"word": "settle down", "english": "Settle down, the lecture’s about to begin!", "thai": "สงบลง การบรรยายกำลังจะเริ่ม!"}
{"word": "settle down", "english": "They plan to settle down after saving enough money.", "thai": "พวกเขาวางแผนจะตั้งรกรากหลังจากเก็บเงินได้พอ"}
{"word": "settle down", "english": "The noise will settle down once the kids go to bed.", "thai": "เสียงรบกวนจะสงบลงเมื่อเด็ก ๆ เข้านอน"}
{"word": "settle down", "english": "Let’s settle down and plan the trip.", "thai": "มานั่งสงบ ๆ และวางแผนการเดินทาง"}
{"word": "settle down", "english": "The team should settle down after the coach’s talk.", "thai": "ทีมควรสงบลงหลังจากการพูดคุยของโค้ช"}
{"word": "settle down", "english": "I want to settle down in a place with mountains.", "thai": "ฉันอยากตั้งรกรากในที่ที่มีภูเขา"}
{"word": "settle down", "english": "Settle down, we’re just playing a game!", "thai": "สงบลง เราแค่เล่นเกม!"}
{"word": "settle down", "english": "She’s hoping to settle down after her travels.", "thai": "เธอหวังว่าจะตั้งรกรากหลังจากการเดินทาง"}
{"word": "settle down", "english": "The room will settle down once the music starts.", "thai": "ห้องจะสงบลงเมื่อดนตรีเริ่ม"}
{"word": "settle down", "english": "I need to settle down and focus on my goals.", "thai": "ฉันต้องสงบลงและโฟกัสที่เป้าหมาย"}
{"word": "settle down", "english": "They’re ready to settle down and start a new chapter.", "thai": "พวกเขาพร้อมที่จะตั้งรกรากและเริ่มบทใหม่"}
{"word": "settle down", "english": "Can you settle down and stop making noise?", "thai": "คุณสงบลงและหยุดส่งเสียงได้ไหม"}
{"word": "settle down", "english": "The baby will settle down with a lullaby.", "thai": "ทารกจะสงบลงด้วยเพลงกล่อม"}
{"word": "settle down", "english": "I’m not ready to settle down and get married yet.", "thai": "ฉันยังไม่พร้อมที่จะตั้งรกรากและแต่งงาน"}
{"word": "settle down", "english": "Settle down, we’re trying to enjoy the moment!", "thai": "สงบลง เรากำลังพยายามสนุกกับช่วงเวลานี้!"}
{"word": "settle down", "english": "They want to settle down in a peaceful village.", "thai": "พวกเขาอยากตั้งรกรากในหมู่บ้านที่เงียบสงบ"}
{"word": "settle down", "english": "The excitement will settle down after the party.", "thai": "ความตื่นเต้นจะสงบลงหลังจากปาร์ตี้"}
{"word": "shop around", "english": "I like to shop around before buying a new phone.", "thai": "ฉันชอบเดินดูของก่อนซื้อโทรศัพท์ใหม่"}
{"word": "shop around", "english": "You should shop around to find the best car deal.", "thai": "คุณควรดูหลาย ๆ ที่เพื่อหาดีลรถที่ดีที่สุด"}
{"word": "shop around", "english": "We decided to shop around for a cheaper flight.", "thai": "เราตัดสินใจดูหลาย ๆ ที่เพื่อหาตั๋วเครื่องบินที่ถูกกว่า"}
{"word": "shop around", "english": "She loves to shop around at thrift stores.", "thai": "เธอชอบเดินดูของในร้านมือสอง"}
{"word": "shop around", "english": "Let's shop around for some new furniture.", "thai": "มาเดินดูเฟอร์นิเจอร์ใหม่กันเถอะ"}
{"word": "shop around", "english": "He told me to shop around for better insurance rates.", "thai": "เขาบอกให้ฉันดูหลาย ๆ ที่เพื่อหาอัตราประกันที่ดีกว่า"}
{"word": "shop around", "english": "They shop around every Black Friday for deals.", "thai": "พวกเขาเดินดูของทุกวัน Black Friday เพื่อหาดีล"}
{"word": "shop around", "english": "I need to shop around for a good laptop.", "thai": "ฉันต้องดูหลาย ๆ ที่เพื่อหาแล็ปท็อปดี ๆ"}
{"word": "shop around", "english": "Why don’t you shop around for a better price?", "thai": "ทำไมคุณไม่ลองดูที่อื่นเพื่อหาค่าราคาที่ดีกว่า?"}
{"word": "shop around", "english": "We shop around to save money on groceries.", "thai": "เราเดินดูของเพื่อประหยัดเงินค่าของชำ"}
{"word": "shop around", "english": "She’s been shopping around for wedding dresses.", "thai": "เธอกำลังดูชุดแต่งงานจากหลาย ๆ ที่"}
{"word": "shop around", "english": "I’ll shop around before picking a new TV.", "thai": "ฉันจะดูหลาย ๆ ที่ก่อนเลือกทีวีใหม่"}
{"word": "shop around", "english": "He likes to shop around for vintage records.", "thai": "เขาชอบดูแผ่นเสียงวินเทจจากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "Let’s shop around for some cool gifts.", "thai": "มาเดินดูของขวัญเจ๋ง ๆ กันเถอะ"}
{"word": "shop around", "english": "You can shop around for cheaper textbooks.", "thai": "คุณสามารถดูหนังสือเรียนที่ถูกกว่าจากหลาย ๆ ที่"}
{"word": "shop around", "english": "They shop around for the best mortgage rates.", "thai": "พวกเขาดูอัตราดอกเบี้ยสินเชื่อที่อยู่อาศัยจากหลาย ๆ ที่"}
{"word": "shop around", "english": "I’m going to shop around for a new jacket.", "thai": "ฉันจะไปดูแจ็คเก็ตใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "She shops around to find unique jewelry.", "thai": "เธอดูเครื่องประดับที่ไม่เหมือนใครจากหลาย ๆ ที่"}
{"word": "shop around", "english": "We should shop around for a better hotel deal.", "thai": "เราควรดูดีลโรงแรมที่ดีกว่าจากหลาย ๆ ที่"}
{"word": "shop around", "english": "He’s shopping around for a new bike.", "thai": "เขากำลังดูจักรยานใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "I always shop around before buying electronics.", "thai": "ฉันมักจะดูของจากหลาย ๆ ที่ก่อนซื้อเครื่องใช้ไฟฟ้า"}
{"word": "shop around", "english": "Let’s shop around for some camping gear.", "thai": "มาเดินดูอุปกรณ์แคมป์ปิ้งกันเถอะ"}
{"word": "shop around", "english": "She shops around for organic produce.", "thai": "เธอดูผักผลไม้ organic จากหลาย ๆ ที่"}
{"word": "shop around", "english": "They’re shopping around for a new car.", "thai": "พวกเขากำลังดูรถใหม่จากหลาย ๆ ที่"}
{"word": "shop around", "english": "I shop around to get the best deals online.", "thai": "ฉันดูของออนไลน์จากหลาย ๆ ที่เพื่อหาดีลที่ดีที่สุด"}
{"word": "shop around", "english": "You should shop around for a better loan.", "thai": "คุณควรดูเงินกู้จากหลาย ๆ ที่เพื่อหาตัวเลือกที่ดีกว่า"}
{"word": "shop around", "english": "He shops around for rare comic books.", "thai": "เขาดูการ์ตูนหายากจากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "We need to shop around for a new fridge.", "thai": "เราต้องดูตู้เย็นใหม่จากหลาย ๆ ที่"}
{"word": "shop around", "english": "She’s shopping around for a prom dress.", "thai": "เธอกำ look ดูชุดงานพรอมจากหลาย ๆ ที่"}
{"word": "shop around", "english": "I’ll shop around for some new shoes.", "thai": "ฉันจะดูรองเท้าใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "They shop around for holiday decorations.", "thai": "พวกเขาดูของตกแต่งวันหยุดจากหลาย ๆ ที่"}
{"word": "shop around", "english": "Let’s shop around for a good deal on tires.", "thai": "มาเดินดูยางรถยนต์ในราคาดี ๆ กันเถอะ"}
{"word": "shop around", "english": "I shop around for the best coffee beans.", "thai": "ฉันดูเมล็ดกาแฟที่ดีที่สุดจากหลาย ๆ ที่"}
{"word": "shop around", "english": "She shops around for handmade crafts.", "thai": "เธอดูงานฝีมือทำมือจากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "He’s shopping around for a new guitar.", "thai": "เขากำลังดูกีตาร์ใหม่จากหลาย ๆ ที่"}
{"word": "shop around", "english": "We should shop around for a better internet plan.", "thai": "เราควรดูแผนอินเทอร์เน็ตที่ดีกว่าจากหลาย ๆ ที่"}
{"word": "shop around", "english": "I’m going to shop around for a new mattress.", "thai": "ฉันจะไปดูที่นอนใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "They shop around for eco-friendly products.", "thai": "พวกเขาดูผลิตภัณฑ์ที่เป็นมิตรกับสิ่งแวดล้อมจากหลาย ๆ ที่"}
{"word": "shop around", "english": "Let’s shop around for some art supplies.", "thai": "มาเดินดูอุปกรณ์ศิลปะกันเถอะ"}
{"word": "shop around", "english": "She shops around for vintage clothing.", "thai": "เธอดูเสื้อผ้าวินเทจจากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "I shop around to find the best wine.", "thai": "ฉันดูไวน์ที่ดีที่สุดจากหลาย ๆ ที่"}
{"word": "shop around", "english": "He’s shopping around for a new watch.", "thai": "เขากำลังดูนาฬิกาใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "We shop around for affordable appliances.", "thai": "เราเดินดูเครื่องใช้ไฟฟ้าราคาไม่แพงจากหลาย ๆ ที่"}
{"word": "shop around", "english": "You should shop around for a better phone plan.", "thai": "คุณควรดูแผนโทรศัพท์ที่ดีกว่าจากหลาย ๆ ที่"}
{"word": "shop around", "english": "I’ll shop around for some new headphones.", "thai": "ฉันจะดูหูฟังใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "She shops around for unique home decor.", "thai": "เธอดูของตกแต่งบ้านที่ไม่เหมือนใครจากหลาย ๆ ที่"}
{"word": "shop around", "english": "Let’s shop around for a good deal on a couch.", "thai": "มาเดินดูโซฟาในราคาดี ๆ กันเถอะ"}
{"word": "shop around", "english": "They shop around for the best travel packages.", "thai": "พวกเขาดูแพ็คเกจท่องเที่ยวที่ดีที่สุดจากหลาย ๆ ที่"}
{"word": "shop around", "english": "I shop around for quality pet supplies.", "thai": "ฉันดูอุปกรณ์สัตว์เลี้ยงคุณภาพดีจากหลาย ๆ ที่"}
{"word": "shop around", "english": "He’s shopping around for a new camera.", "thai": "เขากำลังดูกล้องใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "We should shop around for a cheaper gym membership.", "thai": "เราควรดูสมาชิกยิมที่ถูกกว่าจากหลาย ๆ ที่"}
{"word": "shop around", "english": "She shops around for sustainable clothing.", "thai": "เธอดูเสื้อผ้าที่ยั่งยืนจากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "I’m going to shop around for a new backpack.", "thai": "ฉันจะไปดูเป้ใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "They shop around for the best baby gear.", "thai": "พวกเขาดูอุปกรณ์เด็กที่ดีที่สุดจากหลาย ๆ ที่"}
{"word": "shop around", "english": "Let’s shop around for some new curtains.", "thai": "มาเดินดูผ้าม่านใหม่กันเถอะ"}
{"word": "shop around", "english": "I shop around for high-quality tools.", "thai": "ฉันดูเครื่องมือคุณภาพสูงจากหลาย ๆ ที่"}
{"word": "shop around", "english": "She’s shopping around for a new tablet.", "thai": "เธอกำลังดูแท็บเล็ตใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "We shop around for the best holiday deals.", "thai": "เราเดินดูดีลวันหยุดที่ดีที่สุดจากหลาย ๆ ที่"}
{"word": "shop around", "english": "He shops around for rare sneakers.", "thai": "เขาดูรองเท้าผ้าใบหายากจากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "I’ll shop around for a better credit card.", "thai": "ฉันจะดูบัตรเครดิตที่ดีกว่าจากหลาย ๆ ที่"}
{"word": "shop around", "english": "They shop around for organic skincare products.", "thai": "พวกเขาดูผลิตภัณฑ์ดูแลผิว organic จากหลาย ๆ ที่"}
{"word": "shop around", "english": "Let’s shop around for some new appliances.", "thai": "มาเดินดูเครื่องใช้ไฟฟ้าใหม่กันเถอะ"}
{"word": "shop around", "english": "She shops around for designer bags.", "thai": "เธอดูกระเป๋าแบรนด์เนมจากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "I shop around for the best craft supplies.", "thai": "ฉันดูอุปกรณ์งานฝีมือที่ดีที่สุดจากหลาย ๆ ที่"}
{"word": "shop around", "english": "He’s shopping around for a new monitor.", "thai": "เขากำลังดูจอภาพใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "We should shop around for a better cable plan.", "thai": "เราควรดูแผนเคเบิลที่ดีกว่าจากหลาย ๆ ที่"}
{"word": "shop around", "english": "I’m going to shop around for a new printer.", "thai": "ฉันจะไปดูเครื่องพิมพ์ใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "They shop around for sustainable furniture.", "thai": "พวกเขาดูเฟอร์นิเจอร์ที่ยั่งยืนจากหลาย ๆ ที่"}
{"word": "shop around", "english": "Let’s shop around for some new bedding.", "thai": "มาเดินดูเครื่องนอนใหม่กันเถอะ"}
{"word": "shop around", "english": "She shops around for artisanal cheeses.", "thai": "เธอดูชีสทำมือจากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "I shop around for the best bike accessories.", "thai": "ฉันดูอุปกรณ์จักรยานที่ดีที่สุดจากหลาย ๆ ที่"}
{"word": "shop around", "english": "He’s shopping around for a new desk.", "thai": "เขากำลังดูโต๊ะใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "We shop around for eco-friendly cleaning products.", "thai": "เราเดินดูผลิตภัณฑ์ทำความสะอาดที่เป็นมิตรกับสิ่งแวดล้อมจากหลาย ๆ ที่"}
{"word": "shop around", "english": "You should shop around for a better car lease.", "thai": "คุณควรดูสัญญาเช่ารถที่ดีกว่าจากหลาย ๆ ที่"}
{"word": "shop around", "english": "I’ll shop around for some new cookware.", "thai": "ฉันจะดูเครื่องครัวใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "She shops around for unique candles.", "thai": "เธอดูเทียนที่ไม่เหมือนใครจากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "Let’s shop around for a good deal on paint.", "thai": "มาเดินดูสีในราคาดี ๆ กันเถอะ"}
{"word": "shop around", "english": "They shop around for the best pet food.", "thai": "พวกเขาดูอาหารสัตว์เลี้ยงที่ดีที่สุดจากหลาย ๆ ที่"}
{"word": "shop around", "english": "I shop around for quality camping equipment.", "thai": "ฉันดูอุปกรณ์แคมป์ปิ้งคุณภาพดีจากหลาย ๆ ที่"}
{"word": "shop around", "english": "He’s shopping around for a new phone case.", "thai": "เขากำลังดูเคสโทรศัพท์ใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "We should shop around for a better streaming service.", "thai": "เราควรดูบริการสตรีมมิ่งที่ดีกว่าจากหลาย ๆ ที่"}
{"word": "shop around", "english": "She shops around for handmade soaps.", "thai": "เธอดูสบู่ทำมือจากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "I’m going to shop around for a new lamp.", "thai": "ฉันจะไปดูโคมไฟใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "They shop around for the best wine deals.", "thai": "พวกเขาดูดีลไวน์ที่ดีที่สุดจากหลาย ๆ ที่"}
{"word": "shop around", "english": "Let’s shop around for some new rugs.", "thai": "มาเดินดูพรมใหม่กันเถอะ"}
{"word": "shop around", "english": "I shop around for organic spices.", "thai": "ฉันดูเครื่องเทศ organic จากหลาย ๆ ที่"}
{"word": "shop around", "english": "She’s shopping around for a new purse.", "thai": "เธอกำลังดูกระเป๋าใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "We shop around for the best fitness gear.", "thai": "เราเดินดูอุปกรณ์ออกกำลังกายที่ดีที่สุดจากหลาย ๆ ที่"}
{"word": "shop around", "english": "He shops around for collectible figures.", "thai": "เขาดูฟิกเกอร์สะสมจากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "I’ll shop around for a better vacuum cleaner.", "thai": "ฉันจะดูเครื่องดูดฝุ่นที่ดีกว่าจากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "They shop around for artisanal bread.", "thai": "พวกเขาดูขนมปังทำมือจากหลาย ๆ ที่"}
{"word": "shop around", "english": "Let’s shop around for some new wall art.", "thai": "มาเดินดูงานศิลปะติดผนังใหม่กันเถอะ"}
{"word": "shop around", "english": "She shops around for eco-friendly toys.", "thai": "เธอดูของเล่นที่เป็นมิตรกับสิ่งแวดล้อมจากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "I shop around for the best hiking gear.", "thai": "ฉันดูอุปกรณ์เดินป่าที่ดีที่สุดจากหลาย ๆ ที่"}
{"word": "shop around", "english": "He’s shopping around for a new speaker.", "thai": "เขากำลังดูลำโพงใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "We should shop around for a better energy plan.", "thai": "เราควรดูแผนพลังงานที่ดีกว่าจากหลาย ๆ ที่"}
{"word": "shop around", "english": "I’m going to shop around for a new coffee maker.", "thai": "ฉันจะไปดูเครื่องชงกาแฟใหม่จากหลาย ๆ ร้าน"}
{"word": "shop around", "english": "They shop around for sustainable kitchenware.", "thai": "พวกเขาดูเครื่องครัวที่ยั่งยืนจากหลาย ๆ ที่"}
{"word": "shop around", "english": "Let’s shop around for some new patio furniture.", "thai": "มาเดินดูเฟอร์นิเจอร์นอกบ้านใหม่กันเถอะ"}
{"word": "shop around", "english": "She shops around for handmade pottery.", "thai": "เธอดูเครื่องปั้นดินเผาทำมือจากหลาย ๆ ร้าน"}
{"word": "pay off", "english": "I hope my hard work will pay off soon.", "thai": "ฉันหวังว่าความพยายามของฉันจะได้ผลตอบแทนเร็ว ๆ นี้"}
{"word": "pay off", "english": "Saving money now will pay off in the future.", "thai": "การประหยัดเงินตอนนี้จะได้ผลตอบแทนในอนาคต"}
{"word": "pay off", "english": "Her investment in stocks finally paid off.", "thai": "การลงทุนในหุ้นของเธอได้ผลตอบแทนในที่สุด"}
{"word": "pay off", "english": "Studying every night is starting to pay off.", "thai": "การเรียนทุกคืนเริ่มได้ผลตอบแทนแล้ว"}
{"word": "pay off", "english": "His persistence at the gym paid off with great results.", "thai": "ความพยายามในยิมของเขาได้ผลตอบแทนด้วยผลลัพธ์ที่ยอดเยี่ยม"}
{"word": "pay off", "english": "I’m working overtime to pay off my student loans.", "thai": "ฉันทำงานล่วงเวลาเพื่อชำระหนี้เงินกู้ยืมเพื่อการศึกษา"}
{"word": "pay off", "english": "All that practice will pay off during the game.", "thai": "การฝึกซ้อมทั้งหมดนั้นจะได้ผลตอบแทนในระหว่างการแข่งขัน"}
{"word": "pay off", "english": "She hopes her new business will pay off soon.", "thai": "เธอหวังว่าธุรกิจใหม่ของเธอจะได้ผลตอบแทนเร็ว ๆ นี้"}
{"word": "pay off", "english": "Years of saving helped pay off their mortgage.", "thai": "การออมเงินหลายปีช่วยให้พวกเขาชำระหนี้จำนองได้"}
{"word": "pay off", "english": "His networking efforts really paid off with a new job.", "thai": "ความพยายามในการสร้างเครือข่ายของเขาได้ผลตอบแทนด้วยงานใหม่"}
{"word": "pay off", "english": "I’m trying to pay off my credit card debt.", "thai": "ฉันกำลังพยายามชำระหนี้บัตรเครดิต"}
{"word": "pay off", "english": "Her dedication to training paid off with a medal.", "thai": "ความทุ่มเทในการฝึกซ้อมของเธอได้ผลตอบแทนด้วยเหรียญรางวัล"}
{"word": "pay off", "english": "Let’s see if this marketing strategy pays off.", "thai": "มาดูกันว่ากลยุทธ์การตลาดนี้จะได้ผลตอบแทนหรือไม่"}
{"word": "pay off", "english": "He worked hard to pay off his car loan.", "thai": "เขาทำงานหนักเพื่อชำระหนี้สินเชื่อรถยนต์"}
{"word": "pay off", "english": "All that studying paid off with straight A’s.", "thai": "การเรียนหนักทั้งหมดนั้นได้ผลตอบแทนด้วยเกรด A ล้วน"}
{"word": "pay off", "english": "Their teamwork paid off in the championship.", "thai": "การทำงานเป็นทีมของพวกเขาได้ผลตอบแทนในการแข่งขันชิงแชมป์"}
{"word": "pay off", "english": "I’m saving every penny to pay off my debts.", "thai": "ฉันเก็บเงินทุกบาทเพื่อชำระหนี้"}
{"word": "pay off", "english": "Her patience with the project finally paid off.", "thai": "ความอดทนของเธอกับโปรเจกต์นี้ได้ผลตอบแทนในที่สุด"}
{"word": "pay off", "english": "Investing in training will pay off for the company.", "thai": "การลงทุนในการฝึกอบรมจะได้ผลตอบแทนสำหรับบริษัท"}
{"word": "pay off", "english": "He hopes his side hustle will pay off soon.", "thai": "เขาหวังว่างานเสริมของเขาจะได้ผลตอบแทนเร็ว ๆ นี้"}
{"word": "pay off", "english": "Years of effort paid off with a promotion.", "thai": "ความพยายามหลายปีได้ผลตอบแทนด้วยการเลื่อนตำแหน่ง"}
{"word": "pay off", "english": "I’m trying to pay off my medical bills.", "thai": "ฉันกำลังพยายามชำระค่ารักษาพยาบาล"}
{"word": "pay off", "english": "Her consistent practice paid off in the recital.", "thai": "การฝึกซ้อมอย่างสม่ำเสมอของเธอได้ผลตอบแทนในการแสดง"}
{"word": "pay off", "english": "Saving for a house will pay off one day.", "thai": "การเก็บเงินซื้อบ้านจะได้ผลตอบแทนสักวัน"}
{"word": "pay off", "english": "His gamble on crypto paid off big time.", "thai": "การเสี่ยงลงทุนในคริปโตของเขาได้ผลตอบแทนมหาศาล"}
{"word": "pay off", "english": "I need to pay off this loan by next year.", "thai": "ฉันต้องชำระหนี้เงินกู้นี้ภายในปีหน้า"}
{"word": "pay off", "english": "Her volunteering paid off with new connections.", "thai": "การเป็นอาสาสมัครของเธอได้ผลตอบแทนด้วยการสร้างความสัมพันธ์ใหม่"}
{"word": "pay off", "english": "All that prep work paid off for the event.", "thai": "การเตรียมงานทั้งหมดนั้นได้ผลตอบแทนสำหรับงานอีเวนต์"}
{"word": "pay off", "english": "He’s working two jobs to pay off his house.", "thai": "เขาทำงานสองงานเพื่อชำระหนี้บ้าน"}
{"word": "pay off", "english": "Her studying abroad paid off with fluency.", "thai": "การเรียนต่อต่างประเทศของเธอได้ผลตอบแทนด้วยความคล่องแคล่ว"}
{"word": "pay off", "english": "I hope this course will pay off in my career.", "thai": "ฉันหวังว่าคอร์สนี้จะได้ผลตอบแทนในอาชีพของฉัน"}
{"word": "pay off", "english": "Their renovations paid off when they sold the house.", "thai": "การปรับปรุงบ้านของพวกเขาได้ผลตอบแทนเมื่อขายบ้าน"}
{"word": "pay off", "english": "I’m budgeting tightly to pay off my car.", "thai": "ฉันกำลังจัดการงบประมาณอย่างรัดกุมเพื่อชำระหนี้รถ"}
{"word": "pay off", "english": "His long hours paid off with a big bonus.", "thai": "การทำงานชั่วโมงยาวของเขาได้ผลตอบแทนด้วยโบนัสก้อนโต"}
{"word": "pay off", "english": "She’s trying to pay off her store credit card.", "thai": "เธอกำลังพยายามชำระหนี้บัตรเครดิตร้านค้า"}
{"word": "pay off", "english": "All that training paid off in the marathon.", "thai": "การฝึกซ้อมทั้งหมดนั้นได้ผลตอบแทนในมาราธอน"}
{"word": "pay off", "english": "Investing in solar panels will pay off long-term.", "thai": "การลงทุนในแผงโซลาร์จะได้ผลตอบแทนในระยะยาว"}
{"word": "pay off", "english": "He hopes his startup will pay off eventually.", "thai": "เขาหวังว่าสตาร์ทอัพของเขาจะได้ผลตอบแทนในที่สุด"}
{"word": "pay off", "english": "I’m working hard to pay off my personal loan.", "thai": "ฉันทำงานหนักเพื่อชำระหนี้ส่วนตัว"}
{"word": "pay off", "english": "Her public speaking practice paid off at the conference.", "thai": "การฝึกพูดในที่สาธารณะของเธอได้ผลตอบแทนในงานประชุม"}
{"word": "pay off", "english": "Saving for retirement will pay off later.", "thai": "การเก็บเงินเพื่อเกษียณจะได้ผลตอบแทนในภายหลัง"}
{"word": "pay off", "english": "His bold decision paid off with huge profits.", "thai": "การตัดสินใจที่กล้าของเขาได้ผลตอบแทนด้วยกำไรมหาศาล"}
{"word": "pay off", "english": "I need to pay off my overdue bills soon.", "thai": "ฉันต้องชำระบิลที่ค้างชำระเร็ว ๆ นี้"}
{"word": "pay off", "english": "Her mentorship paid off with a scholarship.", "thai": "การให้คำปรึกษาของเธอได้ผลตอบแทนด้วยทุนการศึกษา"}
{"word": "pay off", "english": "All that coding practice paid off with a job offer.", "thai": "การฝึกเขียนโค้ดทั้งหมดนั้นได้ผลตอบแทนด้วยข้อเสนองาน"}
{"word": "pay off", "english": "He’s saving aggressively to pay off his mortgage.", "thai": "เขากำลังเก็บเงินอย่างจริงจังเพื่อชำระหนี้จำนอง"}
{"word": "pay off", "english": "Her diet changes paid off with better health.", "thai": "การเปลี่ยนแปลงอาหารของเธอได้ผลตอบแทนด้วยสุขภาพที่ดีขึ้น"}
{"word": "pay off", "english": "I hope this investment will pay off in a year.", "thai": "ฉันหวังว่าการลงทุนนี้จะได้ผลตอบแทนในหนึ่งปี"}
{"word": "pay off", "english": "Their teamwork paid off with a successful project.", "thai": "การทำงานเป็นทีมของพวกเขาได้ผลตอบแทนด้วยโปรเจกต์ที่สำเร็จ"}
{"word": "pay off", "english": "I’m cutting expenses to pay off my loans.", "thai": "ฉันกำลังลดค่าใช้จ่ายเพื่อชำระหนี้เงินกู้"}
{"word": "pay off", "english": "His extra shifts paid off with a new car.", "thai": "การทำงานกะพิเศษของเขาได้ผลตอบแทนด้วยรถใหม่"}
{"word": "pay off", "english": "She’s working to pay off her business debt.", "thai": "เธอกำลังทำงานเพื่อชำระหนี้ธุรกิจ"}
{"word": "pay off", "english": "All that rehearsal paid off in the play.", "thai": "การซ้อมทั้งหมดนั้นได้ผลตอบแทนในการแสดงละคร"}
{"word": "pay off", "english": "Investing in education will pay off for you.", "thai": "การลงทุนในการศึกษาจะได้ผลตอบแทนสำหรับคุณ"}
{"word": "pay off", "english": "He hopes his blog will pay off with ad revenue.", "thai": "เขาหวังว่าบล็อกของเขาจะได้ผลตอบแทนด้วยรายได้จากโฆษณา"}
{"word": "pay off", "english": "I’m trying to pay off my car by summer.", "thai": "ฉันกำลังพยายามชำระหนี้รถภายในฤดูร้อน"}
{"word": "pay off", "english": "Her networking paid off with a great contact.", "thai": "การสร้างเครือข่ายของเธอได้ผลตอบแทนด้วยผู้ติดต่อที่ดี"}
{"word": "pay off", "english": "All that effort paid off with a new client.", "thai": "ความพยายามทั้งหมดนั้นได้ผลตอบแทนด้วยลูกค้าใหม่"}
{"word": "pay off", "english": "He’s working weekends to pay off his debts.", "thai": "เขาทำงานวันหยุดเพื่อชำระหนี้"}
{"word": "pay off", "english": "Her language studies paid off during her trip.", "thai": "การเรียนภาษาของเธอได้ผลตอบแทนระหว่างการเดินทาง"}
{"word": "pay off", "english": "I hope this training will pay off at work.", "thai": "ฉันหวังว่าการฝึกอบรมนี้จะได้ผลตอบแทนที่ทำงาน"}
{"word": "pay off", "english": "Their home upgrades paid off at the sale.", "thai": "การอัพเกรดบ้านของพวกเขาได้ผลตอบแทนเมื่อขาย"}
{"word": "pay off", "english": "I’m hustling to pay off my student debt.", "thai": "ฉันกำลังเร่งทำงานเพื่อชำระหนี้เงินกู้ยืมเพื่อการศึกษา"}
{"word": "pay off", "english": "His early mornings paid off with a raise.", "thai": "การตื่นเช้าของเขาได้ผลตอบแทนด้วยการขึ้นเงินเดือน"}
{"word": "pay off", "english": "She’s saving to pay off her credit card.", "thai": "เธอกำลังเก็บเงินเพื่อชำระหนี้บัตรเครดิต"}
{"word": "pay off", "english": "All that practice paid off in the tournament.", "thai": "การฝึกซ้อมทั้งหมดนั้นได้ผลตอบแทนในการแข่งขัน"}
{"word": "pay off", "english": "Investing in stocks might pay off later.", "thai": "การลงทุนในหุ้นอาจได้ผลตอบแทนในภายหลัง"}
{"word": "pay off", "english": "He hopes his app will pay off financially.", "thai": "เขาหวังว่าแอปของเขาจะได้ผลตอบแทนทางการเงิน"}
{"word": "pay off", "english": "I’m working extra to pay off my mortgage.", "thai": "ฉันทำงานพิเศษเพื่อชำระหนี้จำนอง"}
{"word": "pay off", "english": "Her art classes paid off with an exhibition.", "thai": "ชั้นเรียนศิลปะของเธอได้ผลตอบแทนด้วยนิทรรศการ"}
{"word": "pay off", "english": "Saving small amounts will pay off over time.", "thai": "การเก็บเงินจำนวนเล็กน้อยจะได้ผลตอบแทนเมื่อเวลาผ่านไป"}
{"word": "pay off", "english": "His risky move paid off with a big win.", "thai": "การเคลื่อนไหวที่เสี่ยงของเขาได้ผลตอบแทนด้วยชัยชนะครั้งใหญ่"}
{"word": "pay off", "english": "I need to pay off my phone bill soon.", "thai": "ฉันต้องชำระบิลโทรศัพท์เร็ว ๆ นี้"}
{"word": "pay off", "english": "Her charity work paid off with recognition.", "thai": "งานการกุศลของเธอได้ผลตอบแทนด้วยการยอมรับ"}
{"word": "pay off", "english": "All that studying paid off with a scholarship.", "thai": "การเรียนหนักทั้งหมดนั้นได้ผลตอบแทนด้วยทุนการศึกษา"}
{"word": "pay off", "english": "He’s budgeting to pay off his car loan.", "thai": "เขากำลังจัดการงบประมาณเพื่อชำระหนี้สินเชื่อรถยนต์"}
{"word": "pay off", "english": "Her fitness routine paid off with more energy.", "thai": "กิจวัตรการออกกำลังกายของเธอได้ผลตอบแทนด้วยพลังงานที่มากขึ้น"}
{"word": "pay off", "english": "I hope this project will pay off for us.", "thai": "ฉันหวังว่าโปรเจกต์นี้จะได้ผลตอบแทนสำหรับเรา"}
{"word": "pay off", "english": "Their hard work paid off with a contract.", "thai": "ความพยายามของพวกเขาได้ผลตอบแทนด้วยสัญญา"}
{"word": "pay off", "english": "I’m saving to pay off my personal debts.", "thai": "ฉันกำลังเก็บเงินเพื่อชำระหนี้ส่วนตัว"}
{"word": "pay off", "english": "His late nights paid off with a promotion.", "thai": "การทำงานดึกของเขาได้ผลตอบแทนด้วยการเลื่อนตำแหน่ง"}
{"word": "pay off", "english": "She’s trying to pay off her store loan.", "thai": "เธอกำลังพยายามชำระหนี้ร้านค้า"}
{"word": "pay off", "english": "All that effort paid off in the competition.", "thai": "ความพยายามทั้งหมดนั้นได้ผลตอบแทนในการแข่งขัน"}
{"word": "pay off", "english": "Investing in skills will pay off in your career.", "thai": "การลงทุนในทักษะจะได้ผลตอบแทนในอาชีพของคุณ"}
{"word": "pay off", "english": "He hopes his podcast will pay off soon.", "thai": "เขาหวังว่าพอดแคสต์ของเขาจะได้ผลตอบแทนเร็ว ๆ นี้"}
{"word": "pay off", "english": "I’m working to pay off my credit debt.", "thai": "ฉันกำลังทำงานเพื่อชำระหนี้บัตรเครดิต"}
{"word": "pay off", "english": "Her writing practice paid off with a book deal.", "thai": "การฝึกเขียนของเธอได้ผลตอบแทนด้วยสัญญาหนังสือ"}
{"word": "pay off", "english": "Saving for a car will pay off soon.", "thai": "การเก็บเงินซื้อรถจะได้ผลตอบแทนเร็ว ๆ นี้"}
{"word": "pay off", "english": "His bold strategy paid off with new clients.", "thai": "กลยุทธ์ที่กล้าของเขาได้ผลตอบแทนด้วยลูกค้าใหม่"}
{"word": "pay off", "english": "I need to pay off my utility bills.", "thai": "ฉันต้องชำระบิลค่าสาธารณูปโภค"}
{"word": "pay off", "english": "Her community work paid off with an award.", "thai": "งานชุมชนของเธอได้ผลตอบแทนด้วยรางวัล"}
{"word": "pay off", "english": "All that prep paid off for the presentation.", "thai": "การเตรียมการทั้งหมดนั้นได้ผลตอบแทนสำหรับการนำเสนอ"}
{"word": "pay off", "english": "He’s working hard to pay off his house loan.", "thai": "เขาทำงานหนักเพื่อชำระหนี้สินเชื่อบ้าน"}
{"word": "pay off", "english": "Her yoga practice paid off with flexibility.", "thai": "การฝึกโยคะของเธอได้ผลตอบแทนด้วยความยืดหยุ่น"}
{"word": "pay off", "english": "I hope this plan will pay off for the team.", "thai": "ฉันหวังว่าแผนนี้จะได้ผลตอบแทนสำหรับทีม"}
{"word": "pay off", "english": "Their collaboration paid off with a big sale.", "thai": "การทำงานร่วมกันของพวกเขาได้ผลตอบแทนด้วยยอดขายก้อนโต"}
{"word": "pay off", "english": "I’m cutting back to pay off my debts.", "thai": "ฉันกำลังลดค่าใช้จ่ายเพื่อชำระหนี้"}
{"word": "pay off", "english": "His extra hours paid off with a new laptop.", "thai": "การทำงานพิเศษของเขาได้ผลตอบแทนด้วยแล็ปท็อปใหม่"}
{"word": "pay off", "english": "She’s working to pay off her school loan.", "thai": "เธอกำลังทำงานเพื่อชำระหนี้เงินกู้ยืมเพื่อการศึกษา"}
{"word": "pay off", "english": "All that training paid off in the race.", "thai": "การฝึกซ้อมทั้งหมดนั้นได้ผลตอบแทนในการแข่งขัน"}
{"word": "pay off", "english": "Investing in bonds might pay off later.", "thai": "การลงทุนในพันธบัตรอาจได้ผลตอบแทนในภายหลัง"}
{"word": "pay off", "english": "He hopes his YouTube channel will pay off.", "thai": "เขาหวังว่าช่อง YouTube ของเขาจะได้ผลตอบแทน"}
{"word": "pay off", "english": "I’m saving to pay off my business loan.", "thai": "ฉันกำลังเก็บเงินเพื่อชำระหนี้เงินกู้ธุรกิจ"}
