{"word": "advertisement", "english": "I saw an advertisement for a new phone on TV last night.", "thai": "เมื่อคืนฉันเห็นโฆษณาโทรศัพท์รุ่นใหม่ทางทีวี"}
{"word": "advertisement", "english": "The advertisement in the magazine caught my attention.", "thai": "โฆษณาในนิตยสารดึงดูดความสนใจของฉัน"}
{"word": "advertisement", "english": "She created a catchy advertisement for her small business.", "thai": "เธอสร้างโฆษณาที่น่าสนใจสำหรับธุรกิจขนาดเล็กของเธอ"}
{"word": "advertisement", "english": "That advertisement on the billboard is really colorful.", "thai": "โฆษณาบนป้ายโฆษณานั้นสีสันสดใสมาก"}
{"word": "advertisement", "english": "I skipped the advertisement before the YouTube video.", "thai": "ฉันข้ามโฆษณาก่อนวิดีโอบนยูทูป"}
{"word": "advertisement", "english": "The company spent a lot on their new advertisement campaign.", "thai": "บริษัทใช้เงินจำนวนมากในแคมเปญโฆษณาใหม่ของพวกเขา"}
{"word": "advertisement", "english": "Did you see the advertisement for the concert downtown?", "thai": "คุณเห็นโฆษณาคอนเสิร์ตในตัวเมืองหรือเปล่า"}
{"word": "advertisement", "english": "The advertisement said the sale ends tomorrow.", "thai": "โฆษณาบอกว่าการลดราคาจะสิ้นสุดในวันพรุ่งนี้"}
{"word": "advertisement", "english": "He works in creating advertisement content for brands.", "thai": "เขาทำงานในการสร้างเนื้อหาโฆษณาให้กับแบรนด์"}
{"word": "advertisement", "english": "The radio advertisement was playing all day.", "thai": "โฆษณาทางวิทยุเล่นทั้งวัน"}
{"word": "advertisement", "english": "I found a job through an advertisement online.", "thai": "ฉันหางานได้จากโฆษณาออนไลน์"}
{"word": "advertisement", "english": "The advertisement for the car was misleading.", "thai": "โฆษณารถยนต์นั้นทำให้เข้าใจผิด"}
{"word": "advertisement", "english": "She ignored the advertisement pop-up on her screen.", "thai": "เธอเพิกเฉยต่อโฆษณาแบบป๊อปอัพบนหน้าจอ"}
{"word": "advertisement", "english": "The advertisement featured a famous actor.", "thai": "โฆษณานั้นมีนักแสดงชื่อดัง"}
{"word": "advertisement", "english": "I don’t trust every advertisement I see online.", "thai": "ฉันไม่เชื่อโฆษณาทุกอันที่เห็นออนไลน์"}
{"word": "advertisement", "english": "The advertisement was so funny I watched it twice.", "thai": "โฆษณานั้นตลกมากจนฉันดูสองรอบ"}
{"word": "advertisement", "english": "They placed an advertisement in the local newspaper.", "thai": "พวกเขาลงโฆษณาในหนังสือพิมพ์ท้องถิ่น"}
{"word": "advertisement", "english": "The advertisement promised free shipping this week.", "thai": "โฆษณาสัญญาว่าจะจัดส่งฟรีในสัปดาห์นี้"}
{"word": "advertisement", "english": "He clicked on the advertisement by mistake.", "thai": "เขาเผลอคลิกโฆษณาโดยไม่ได้ตั้งใจ"}
{"word": "advertisement", "english": "The advertisement was aimed at young adults.", "thai": "โฆษณานั้นมุ่งเป้าไปที่วัยรุ่น"}
{"word": "advertisement", "english": "I heard an advertisement for a new restaurant on the radio.", "thai": "ฉันได้ยินโฆษณาร้านอาหารใหม่ทางวิทยุ"}
{"word": "advertisement", "english": "The advertisement showed a happy family using the product.", "thai": "โฆษณาแสดงภาพครอบครัวที่มีความสุขใช้ผลิตภัณฑ์"}
{"word": "advertisement", "english": "She designed an advertisement for the charity event.", "thai": "เธอออกแบบโฆษณาสำหรับงานการกุศล"}
{"word": "advertisement", "english": "The advertisement was too long to hold my interest.", "thai": "โฆษณานั้นยาวเกินไปจนฉันเสียความสนใจ"}
{"word": "advertisement", "english": "I saw an advertisement for a gym membership discount.", "thai": "ฉันเห็นโฆษณาส่วนลดสมาชิกยิม"}
{"word": "advertisement", "english": "The advertisement used bright colors to stand out.", "thai": "โฆษณาใช้สีสันสดใสเพื่อให้โดดเด่น"}
{"word": "advertisement", "english": "He wrote the script for the TV advertisement.", "thai": "เขาเขียนบทสำหรับโฆษณาทางทีวี"}
{"word": "advertisement", "english": "The advertisement was shared all over social media.", "thai": "โฆษณานั้นถูกแชร์ไปทั่วโซเชียลมีเดีย"}
{"word": "advertisement", "english": "I didn’t like the music in that advertisement.", "thai": "ฉันไม่ชอบเพลงในโฆษณานั้น"}
{"word": "advertisement", "english": "The advertisement claimed the product was eco-friendly.", "thai": "โฆษณาอ้างว่าผลิตภัณฑ์นั้นเป็นมิตรกับสิ่งแวดล้อม"}
{"word": "advertisement", "english": "She starred in a national advertisement campaign.", "thai": "เธอแสดงในแคมเปญโฆษณาระดับชาติ"}
{"word": "advertisement", "english": "The advertisement was filmed in a tropical location.", "thai": "โฆษณานั้นถูกถ่ายทำในสถานที่เขตร้อน"}
{"word": "advertisement", "english": "I got annoyed by the same advertisement playing repeatedly.", "thai": "ฉันรำคาญโฆษณาเดิมที่เล่นซ้ำๆ"}
{"word": "advertisement", "english": "The advertisement targeted pet owners specifically.", "thai": "โฆษณานั้นมุ่งเป้าไปที่เจ้าของสัตว์เลี้ยงโดยเฉพาะ"}
{"word": "advertisement", "english": "He responded to an advertisement for a used car.", "thai": "เขาตอบรับโฆษณารถมือสอง"}
{"word": "advertisement", "english": "The advertisement was banned for being too controversial.", "thai": "โฆษณานั้นถูกแบนเพราะมีความขัดแย้งเกินไป"}
{"word": "advertisement", "english": "I found the advertisement quite persuasive.", "thai": "ฉันพบว่าโฆษณานั้นค่อนข้างโน้มน้าวใจ"}
{"word": "advertisement", "english": "The advertisement was displayed on the bus stop.", "thai": "โฆษณานั้นถูกแสดงที่ป้ายรถเมล์"}
{"word": "advertisement", "english": "She wrote a review about the advertisement’s effectiveness.", "thai": "เธอเขียนรีวิวเกี่ยวกับประสิทธิภาพของโฆษณา"}
{"word": "advertisement", "english": "The advertisement had a clear call to action.", "thai": "โฆษณานั้นมีคำกระตุ้นการตัดสินใจที่ชัดเจน"}
{"word": "advertisement", "english": "I saw an advertisement for a new app on my phone.", "thai": "ฉันเห็นโฆษณาแอปใหม่บนโทรศัพท์ของฉัน"}
{"word": "advertisement", "english": "The advertisement was short but memorable.", "thai": "โฆษณานั้นสั้นแต่จดจำได้"}
{"word": "advertisement", "english": "He complained about the advertisement being too loud.", "thai": "เขาบ่นว่าโฆษณานั้นดังเกินไป"}
{"word": "advertisement", "english": "The advertisement was part of a global campaign.", "thai": "โฆษณานั้นเป็นส่วนหนึ่งของแคมเปญระดับโลก"}
{"word": "advertisement", "english": "I didn’t understand the message of the advertisement.", "thai": "ฉันไม่เข้าใจข้อความของโฆษณา"}
{"word": "advertisement", "english": "The advertisement appeared during the football game.", "thai": "โฆษณานั้นปรากฏระหว่างการแข่งขันฟุตบอล"}
{"word": "advertisement", "english": "She shared the advertisement on her social media.", "thai": "เธอแชร์โฆษณานั้นบนโซเชียลมีเดียของเธอ"}
{"word": "advertisement", "english": "The advertisement was aimed at promoting tourism.", "thai": "โฆษณานั้นมุ่งส่งเสริมการท่องเที่ยว"}
{"word": "advertisement", "english": "I found an advertisement for a job fair in my email.", "thai": "ฉันพบโฆษณางานแฟร์ในอีเมลของฉัน"}
{"word": "advertisement", "english": "The advertisement used humor to attract viewers.", "thai": "โฆษณานั้นใช้ความตลกเพื่อดึงดูดผู้ชม"}
{"word": "advertisement", "english": "He was hired to direct the advertisement shoot.", "thai": "เขาถูกจ้างให้กำกับการถ่ายทำโฆษณา"}
{"word": "advertisement", "english": "The advertisement was posted on the company’s website.", "thai": "โฆษณานั้นถูกโพสต์บนเว็บไซต์ของบริษัท"}
{"word": "advertisement", "english": "I ignored the advertisement in the sidebar.", "thai": "ฉันเพิกเฉยต่อโฆษณาที่แถบด้านข้าง"}
{"word": "advertisement", "english": "The advertisement was about a new skincare product.", "thai": "โฆษณานั้นเกี่ยวกับผลิตภัณฑ์ดูแลผิวใหม่"}
{"word": "advertisement", "english": "She criticized the advertisement for being unrealistic.", "thai": "เธอวิจารณ์โฆษณานั้นว่าไม่สมจริง"}
{"word": "advertisement", "english": "The advertisement was shown before the movie started.", "thai": "โฆษณานั้นถูกแสดงก่อนภาพยนตร์เริ่ม"}
{"word": "advertisement", "english": "I liked the creativity in that advertisement.", "thai": "ฉันชอบความคิดสร้างสรรค์ในโฆษณานั้น"}
{"word": "advertisement", "english": "The advertisement was targeted at parents.", "thai": "โฆษณานั้นมุ่งเป้าไปที่พ่อแม่"}
{"word": "advertisement", "english": "He saw an advertisement for a travel agency online.", "thai": "เขาเห็นโฆษณาของบริษัทท่องเที่ยวออนไลน์"}
{"word": "advertisement", "english": "The advertisement was too repetitive for my taste.", "thai": "โฆษณานั้นซ้ำซากเกินไปสำหรับรสนิยมของฉัน"}
{"word": "advertisement", "english": "She was inspired by the advertisement to buy the product.", "thai": "เธอได้รับแรงบันดาลใจจากโฆษณาให้ซื้อผลิตภัณฑ์"}
{"word": "advertisement", "english": "The advertisement was in black and white for effect.", "thai": "โฆษณานั้นเป็นขาวดำเพื่อสร้างเอฟเฟกต์"}
{"word": "advertisement", "english": "I heard an advertisement for a charity on the radio.", "thai": "ฉันได้ยินโฆษณาการกุศลทางวิทยุ"}
{"word": "advertisement", "english": "The advertisement was removed after complaints.", "thai": "โฆษณานั้นถูกลบหลังจากมีข้อร้องเรียน"}
{"word": "advertisement", "english": "He designed the logo used in the advertisement.", "thai": "เขาออกแบบโลโก้ที่ใช้ในโฆษณา"}
{"word": "advertisement", "english": "The advertisement went viral online.", "thai": "โฆษณานั้นกลายเป็นไวรัลในออนไลน์"}
{"word": "advertisement", "english": "I saw an advertisement for a new coffee shop.", "thai": "ฉันเห็นโฆษณาร้านกาแฟใหม่"}
{"word": "advertisement", "english": "The advertisement was confusing to some viewers.", "thai": "โฆษณานั้นทำให้ผู้ชมบางคนสับสน"}
{"word": "advertisement", "english": "She got a discount because of the advertisement.", "thai": "เธอได้ส่วนลดเพราะโฆษณา"}
{"word": "advertisement", "english": "The advertisement was broadcast during prime time.", "thai": "โฆษณานั้นถูกออกอากาศในช่วงไพรม์ไทม์"}
{"word": "advertisement", "english": "I clicked the advertisement to learn more.", "thai": "ฉันคลิกโฆษณาเพื่อดูข้อมูลเพิ่มเติม"}
{"word": "advertisement", "english": "The advertisement was part of a holiday campaign.", "thai": "โฆษณานั้นเป็นส่วนหนึ่งของแคมเปญวันหยุด"}
{"word": "advertisement", "english": "He found the advertisement annoying but effective.", "thai": "เขาพบว่าโฆษณานั้นน่ารำคาญแต่ได้ผล"}
{"word": "advertisement", "english": "The advertisement was printed in the Sunday paper.", "thai": "โฆษณานั้นถูกพิมพ์ในหนังสือพิมพ์วันอาทิตย์"}
{"word": "advertisement", "english": "I saw an advertisement for a pet adoption event.", "thai": "ฉันเห็นโฆษณางานรับเลี้ยงสัตว์เลี้ยง"}
{"word": "advertisement", "english": "The advertisement used a popular song.", "thai": "โฆษณานั้นใช้เพลงยอดนิยม"}
{"word": "advertisement", "english": "She was hired to model for the advertisement.", "thai": "เธอถูกจ้างให้เป็นนางแบบสำหรับโฆษณา"}
{"word": "advertisement", "english": "The advertisement was too flashy for my liking.", "thai": "โฆษณานั้นฉูดฉาดเกินไปสำหรับรสนิยมของฉัน"}
{"word": "advertisement", "english": "I responded to an advertisement for a roommate.", "thai": "ฉันตอบรับโฆษณาหาคู่หอ"}
{"word": "advertisement", "english": "The advertisement promoted a new clothing line.", "thai": "โฆษณานั้นโปรโมทคอลเลกชันเสื้อผ้าใหม่"}
{"word": "advertisement", "english": "He skipped the advertisement on the streaming app.", "thai": "เขาข้ามโฆษณาบนแอปสตรีมมิ่ง"}
{"word": "advertisement", "english": "The advertisement was displayed at the mall.", "thai": "โฆษณานั้นถูกแสดงที่ห้างสรรพสินค้า"}
{"word": "advertisement", "english": "I found the advertisement very informative.", "thai": "ฉันพบว่าโฆษณานั้นให้ข้อมูลมาก"}
{"word": "advertisement", "english": "The advertisement was created by a local agency.", "thai": "โฆษณานั้นถูกสร้างโดยเอเจนซี่ท้องถิ่น"}
{"word": "advertisement", "english": "She saw an advertisement for a cooking class.", "thai": "เธอเห็นโฆษณาคลาสเรียนทำอาหาร"}
{"word": "advertisement", "english": "The advertisement was criticized for false claims.", "thai": "โฆษณานั้นถูกวิจารณ์ว่ามีการอ้างที่ไม่จริง"}
{"word": "advertisement", "english": "I noticed an advertisement on the subway.", "thai": "ฉันสังเกตเห็นโฆษณาบนรถไฟใต้ดิน"}
{"word": "advertisement", "english": "The advertisement was part of a viral marketing stunt.", "thai": "โฆษณานั้นเป็นส่วนหนึ่งของกลยุทธ์การตลาดแบบไวรัล"}
{"word": "advertisement", "english": "He wrote a jingle for the advertisement.", "thai": "เขาแต่งเพลงจิงเกิ้ลสำหรับโฆษณา"}
{"word": "advertisement", "english": "The advertisement was aimed at tech enthusiasts.", "thai": "โฆษณานั้นมุ่งเป้าไปที่ผู้ที่ชื่นชอบเทคโนโลยี"}
{"word": "advertisement", "english": "I saw an advertisement for a new movie.", "thai": "ฉันเห็นโฆษณาภาพยนตร์ใหม่"}
{"word": "advertisement", "english": "The advertisement was played before the podcast.", "thai": "โฆษณานั้นถูกเล่นก่อนพอดแคสต์"}
{"word": "advertisement", "english": "She created an advertisement for her online store.", "thai": "เธอสร้างโฆษณาสำหรับร้านค้าออนไลน์ของเธอ"}
{"word": "advertisement", "english": "The advertisement was too vague to understand.", "thai": "โฆษณานั้นคลุมเครือเกินกว่าจะเข้าใจ"}
{"word": "advertisement", "english": "I liked the humor in the advertisement.", "thai": "ฉันชอบความตลกในโฆษณานั้น"}
{"word": "advertisement", "english": "The advertisement was shown during the Super Bowl.", "thai": "โฆษณานั้นถูกแสดงในช่วงซูเปอร์โบวล์"}
{"word": "advertisement", "english": "He ignored the advertisement on the website.", "thai": "เขาเพิกเฉยต่อโฆษณาบนเว็บไซต์"}
{"word": "advertisement", "english": "The advertisement was for a local charity event.", "thai": "โฆษณานั้นสำหรับงานการกุศลท้องถิ่น"}
{"word": "budget", "english": "I need to stick to my budget this month.", "thai": "ฉันต้องยึดตามงบประมาณของฉันในเดือนนี้"}
{"word": "budget", "english": "The company exceeded its budget for the project.", "thai": "บริษัทใช้จ่ายเกินงบประมาณสำหรับโครงการนี้"}
{"word": "budget", "english": "She created a budget to save for a vacation.", "thai": "เธอสร้างงบประมาณเพื่อเก็บเงินไปเที่ยว"}
{"word": "budget", "english": "We’re on a tight budget for the wedding.", "thai": "เรามีงบประมาณจำกัดสำหรับงานแต่งงาน"}
{"word": "budget", "english": "The city council approved the new budget.", "thai": "สภาเมืองอนุมัติงบประมาณใหม่"}
{"word": "budget", "english": "He’s looking for a budget-friendly car.", "thai": "เขากำลังมองหารถที่ประหยัดงบ"}
{"word": "budget", "english": "I went over my budget buying groceries.", "thai": "ฉันใช้จ่ายเกินงบประมาณตอนซื้อของชำ"}
{"word": "budget", "english": "The movie was made on a low budget.", "thai": "ภาพยนตร์เรื่องนี้สร้างด้วยงบประมาณต่ำ"}
{"word": "budget", "english": "She’s good at managing her monthly budget.", "thai": "เธอเก่งในการจัดการงบประมาณรายเดือน"}
{"word": "budget", "english": "The school’s budget was cut this year.", "thai": "งบประมาณของโรงเรียนถูกตัดในปีนี้"}
{"word": "budget", "english": "We need to discuss the budget for the event.", "thai": "เราต้องหารือเกี่ยวกับงบประมาณสำหรับงานนี้"}
{"word": "budget", "english": "He’s trying to find a budget hotel for the trip.", "thai": "เขากำลังหาโรงแรมราคาประหยัดสำหรับการเดินทาง"}
{"word": "budget", "english": "The budget includes funds for new equipment.", "thai": "งบประมาณรวมถึงเงินสำหรับอุปกรณ์ใหม่"}
{"word": "budget", "english": "I’m on a strict budget until payday.", "thai": "ฉันอยู่ในงบประมาณที่เข้มงวดจนถึงวันเงินเดือน"}
{"word": "budget", "english": "The government proposed a balanced budget.", "thai": "รัฐบาลเสนองบประมาณที่สมดุล"}
{"word": "budget", "english": "She adjusted her budget to cover unexpected costs.", "thai": "เธอปรับงบประมาณเพื่อครอบคลุมค่าใช้จ่ายที่ไม่คาดคิด"}
{"word": "budget", "english": "The project is still within budget.", "thai": "โครงการนี้ยังอยู่ในงบประมาณ"}
{"word": "budget", "english": "I found a budget app to track my spending.", "thai": "ฉันพบแอปงบประมาณเพื่อติดตามการใช้จ่าย"}
{"word": "budget", "english": "The budget for marketing has been increased.", "thai": "งบประมาณสำหรับการตลาดถูกเพิ่มขึ้น"}
{"word": "budget", "english": "He’s always looking for budget travel deals.", "thai": "เขามักจะมองหาข้อเสนอการเดินทางราคาประหยัด"}
{"word": "budget", "english": "We need to allocate the budget carefully.", "thai": "เราต้องจัดสรรงบประมาณอย่างระมัดระวัง"}
{"word": "budget", "english": "The budget deficit is a big concern.", "thai": "การขาดดุลงบประมาณเป็นปัญหาใหญ่"}
{"word": "budget", "english": "She planned her budget for the holidays.", "thai": "เธอวางแผนงบประมาณสำหรับวันหยุด"}
{"word": "budget", "english": "The film went way over its budget.", "thai": "ภาพยนตร์เรื่องนี้ใช้จ่ายเกินงบประมาณมาก"}
{"word": "budget", "english": "I’m trying to stay within my food budget.", "thai": "ฉันพยายามอยู่ในงบประมาณสำหรับอาหาร"}
{"word": "budget", "english": "The budget cuts affected the library.", "thai": "การตัดงบประมาณส่งผลต่อห้องสมุด"}
{"word": "budget", "english": "He’s working with a limited budget for renovations.", "thai": "เขาทำงานด้วยงบประมาณจำกัดสำหรับการปรับปรุง"}
{"word": "budget", "english": "The budget meeting is scheduled for tomorrow.", "thai": "การประชุมงบประมาณมีกำหนดในวันพรุ่งนี้"}
{"word": "budget", "english": "She found a dress within her budget.", "thai": "เธอพบชุดที่อยู่ในงบประมาณของเธอ"}
{"word": "budget", "english": "The budget was approved without changes.", "thai": "งบประมาณได้รับการอนุมัติโดยไม่มีการเปลี่ยนแปลง"}
{"word": "budget", "english": "I need a budget plan for next year.", "thai": "ฉันต้องการแผนงบประมาณสำหรับปีหน้า"}
{"word": "budget", "english": "The team stayed under budget for the project.", "thai": "ทีมนี้ใช้จ่ายต่ำกว่างบประมาณสำหรับโครงการ"}
{"word": "budget", "english": "He’s on a budget but still wants to eat out.", "thai": "เขาอยู่ในงบประมาณแต่ยังอยากกินข้าวนอกบ้าน"}
{"word": "budget", "english": "The budget for the festival was too small.", "thai": "งบประมาณสำหรับเทศกาลนั้นน้อยเกินไป"}
{"word": "budget", "english": "She’s teaching me how to make a budget.", "thai": "เธอกำลังสอนฉันเกี่ยวกับการทำงบประมาณ"}
{"word": "budget", "english": "The budget airline has cheaper flights.", "thai": "สายการบินราคาประหยัดมีเที่ยวบินที่ถูกกว่า"}
{"word": "budget", "english": "We’re reviewing the budget for next quarter.", "thai": "เรากำลังทบทวนงบประมาณสำหรับไตรมาสหน้า"}
{"word": "budget", "english": "I overspent my budget on clothes this month.", "thai": "ฉันใช้จ่ายเกินงบประมาณสำหรับเสื้อผ้าในเดือนนี้"}
{"word": "budget", "english": "The budget proposal was rejected by the board.", "thai": "ข้อเสนองบประมาณถูกคณะกรรมการปฏิเสธ"}
{"word": "budget", "english": "He’s looking for budget furniture for his apartment.", "thai": "เขากำลังมองหาเฟอร์นิเจอร์ราคาประหยัดสำหรับอพาร์ตเมนต์"}
{"word": "budget", "english": "The budget includes money for employee training.", "thai": "งบประมาณรวมถึงเงินสำหรับการฝึกอบรมพนักงาน"}
{"word": "budget", "english": "I’m trying to budget for a new phone.", "thai": "ฉันกำลังพยายามจัดงบประมาณสำหรับโทรศัพท์ใหม่"}
{"word": "budget", "english": "The department’s budget was reduced by 10%.", "thai": "งบประมาณของแผนกถูกลดลง 10%"}
{"word": "budget", "english": "She’s great at finding budget-friendly recipes.", "thai": "เธอเก่งในการหาสูตรอาหารที่ประหยัดงบ"}
{"word": "budget", "english": "The budget for the campaign was finalized today.", "thai": "งบประมาณสำหรับแคมเปญได้รับการสรุปในวันนี้"}
{"word": "budget", "english": "I need to review my budget before shopping.", "thai": "ฉันต้องทบทวนงบประมาณก่อนไปช้อปปิ้ง"}
{"word": "budget", "english": "The budget shortfall caused some delays.", "thai": "การขาดแคลนงบประมาณทำให้เกิดความล่าช้า"}
{"word": "budget", "english": "He created a budget to manage his debt.", "thai": "เขาสร้างงบประมาณเพื่อจัดการหนี้"}
{"word": "budget", "english": "The budget allows for some extra spending.", "thai": "งบประมาณอนุญาตให้มีการใช้จ่ายเพิ่มเติม"}
{"word": "budget", "english": "I’m shopping for budget gifts this year.", "thai": "ฉันกำลังซื้อของขวัญราคาประหยัดในปีนี้"}
{"word": "budget", "english": "The budget was discussed at the town hall.", "thai": "งบประมาณถูกหารือในที่ประชุมชุมชน"}
{"word": "budget", "english": "She’s sticking to a budget for her wedding dress.", "thai": "เธอยึดตามงบประมาณสำหรับชุดแต่งงาน"}
{"word": "budget", "english": "The budget for the park renovation was approved.", "thai": "งบประมาณสำหรับการปรับปรุงสวนสาธารณะได้รับการอนุมัติ"}
{"word": "budget", "english": "I need to cut my budget for eating out.", "thai": "ฉันต้องลดงบประมาณสำหรับการกินข้าวนอกบ้าน"}
{"word": "budget", "english": "The budget crisis affected public services.", "thai": "วิกฤตงบประมาณส่งผลต่อบริการสาธารณะ"}
{"word": "budget", "english": "He’s working on a budget for his startup.", "thai": "เขากำลังทำงานเกี่ยวกับงบประมาณสำหรับสตาร์ทอัพ"}
{"word": "budget", "english": "The budget for the trip is almost gone.", "thai": "งบประมาณสำหรับการเดินทางเกือบหมดแล้ว"}
{"word": "budget", "english": "She’s looking for a budget planner app.", "thai": "เธอกำลังมองหาแอปวางแผนงบประมาณ"}
{"word": "budget", "english": "The budget was stretched thin this year.", "thai": "งบประมาณถูกยืดจนตึงในปีนี้"}
{"word": "budget", "english": "I found a budget-friendly restaurant downtown.", "thai": "ฉันพบร้านอาหารราคาประหยัดในตัวเมือง"}
{"word": "budget", "english": "The budget committee meets every month.", "thai": "คณะกรรมการงบประมาณประชุมทุกเดือน"}
{"word": "budget", "english": "He exceeded his budget for car repairs.", "thai": "เขาใช้จ่ายเกินงบประมาณสำหรับการซ่อมรถ"}
{"word": "budget", "english": "The budget for the event was underestimated.", "thai": "งบประมาณสำหรับงานนี้ถูกประเมินต่ำเกินไป"}
{"word": "budget", "english": "I’m trying to budget for a new laptop.", "thai": "ฉันกำลังพยายามจัดงบประมาณสำหรับแล็ปท็อปใหม่"}
{"word": "budget", "english": "The budget was finalized after long discussions.", "thai": "งบประมาณได้รับการสรุปหลังจากการหารือยาวนาน"}
{"word": "budget", "english": "She’s on a budget but still loves fashion.", "thai": "เธออยู่ในงบประมาณแต่ยังรักแฟชัน"}
{"word": "budget", "english": "The budget for the school trip was approved.", "thai": "งบประมาณสำหรับการทัศนศึกษาของโรงเรียนได้รับการอนุมัติ"}
{"word": "budget", "english": "I need to balance my budget better.", "thai": "ฉันต้องปรับสมดุงบประมาณให้ดีขึ้น"}
{"word": "budget", "english": "The budget for the concert was too high.", "thai": "งบประมาณสำหรับคอนเสิร์ตสูงเกินไป"}
{"word": "budget", "english": "He’s searching for budget travel destinations.", "thai": "เขากำลังค้นหาจุดหมายการเดินทางราคาประหยัด"}
{"word": "budget", "english": "The budget was allocated for new uniforms.", "thai": "งบประมาณถูกจัดสรรสำหรับชุดยูนิฟอร์มใหม่"}
{"word": "budget", "english": "I’m cutting my budget for entertainment.", "thai": "ฉันกำลังลดงบประมาณสำหรับความบันเทิง"}
{"word": "budget", "english": "The budget proposal needs more details.", "thai": "ข้อเสนองบประมาณต้องการรายละเอียดเพิ่มเติม"}
{"word": "budget", "english": "She found a budget way to decorate her home.", "thai": "เธอพบวิธีประหยัดในการตกแต่งบ้าน"}
{"word": "budget", "english": "The budget for the film was surprisingly low.", "thai": "งบประมาณสำหรับภาพยนตร์นั้นต่ำอย่างน่าประหลาดใจ"}
{"word": "budget", "english": "I need to check my budget before buying.", "thai": "ฉันต้องตรวจสอบงบประมาณก่อนซื้อ"}
{"word": "budget", "english": "The budget was discussed in the meeting.", "thai": "งบประมาณถูกหารือในที่ประชุม"}
{"word": "budget", "english": "He’s trying to budget for a new car.", "thai": "เขากำลังพยายามจัดงบประมาณสำหรับรถใหม่"}
{"word": "budget", "english": "The budget for the party was reasonable.", "thai": "งบประมาณสำหรับงานปาร์ตี้สมเหตุสมผล"}
{"word": "budget", "english": "She’s using a spreadsheet to track her budget.", "thai": "เธอใช้สเปรดชีตเพื่อติดตามงบประมาณ"}
{"word": "budget", "english": "The budget cuts impacted the staff.", "thai": "การตัดงบประมาณส่งผลต่อพนักงาน"}
{"word": "budget", "english": "I’m looking for budget-friendly vacation ideas.", "thai": "ฉันกำลังมองหาไอเดียวันหยุดที่ประหยัดงบ"}
{"word": "budget", "english": "The budget was reviewed by the finance team.", "thai": "งบประมาณได้รับการทบทวนโดยทีมการเงิน"}
{"word": "budget", "english": "He’s sticking to a budget for his project.", "thai": "เขายึดตามงบประมาณสำหรับโครงการของเขา"}
{"word": "budget", "english": "The budget for the campaign was sufficient.", "thai": "งบประมาณสำหรับแคมเปญเพียงพอ"}
{"word": "budget", "english": "I overspent my budget on holiday gifts.", "thai": "ฉันใช้จ่ายเกินงบประมาณสำหรับของขวัญวันหยุด"}
{"word": "budget", "english": "The budget airline had great deals.", "thai": "สายการบินราคาประหยัดมีข้อเสนอดีๆ"}
{"word": "budget", "english": "She’s trying to budget for her college expenses.", "thai": "เธอกำลังพยายามจัดงบประมาณสำหรับค่าใช้จ่ายในวิทยาลัย"}
{"word": "budget", "english": "The budget was a topic at the meeting.", "thai": "งบประมาณเป็นหัวข้อในที่ประชุม"}
{"word": "budget", "english": "I found a budget hotel for the weekend.", "thai": "ฉันพบโรงแรมราคาประหยัดสำหรับสุดสัปดาห์"}
{"word": "budget", "english": "The budget for the event was well-planned.", "thai": "งบประมาณสำหรับงานนี้วางแผนมาดี"}
{"word": "budget", "english": "He’s working within a tight budget.", "thai": "เขาทำงานภายในงบประมาณที่จำกัด"}
{"word": "budget", "english": "The budget for the school was increased.", "thai": "งบประมาณสำหรับโรงเรียนถูกเพิ่มขึ้น"}
{"word": "budget", "english": "I need to adjust my budget for rent.", "thai": "ฉันต้องปรับงบประมาณสำหรับค่าเช่า"}
{"word": "budget", "english": "The budget for the trip was flexible.", "thai": "งบประมาณสำหรับการเดินทางยืดหยุ่น"}
{"word": "budget", "english": "She’s on a budget but still enjoys life.", "thai": "เธออยู่ในงบประมาณแต่ยังสนุกกับชีวิต"}
{"word": "budget", "english": "The budget was the main issue in the debate.", "thai": "งบประมาณเป็นประเด็นหลักในการถกเถียง"}
{"word": "budget", "english": "I’m trying to find budget-friendly groceries.", "thai": "ฉันกำลังพยายามหาของชำที่ประหยัดงบ"}
{"word": "budget", "english": "The budget for the project was realistic.", "thai": "งบประมาณสำหรับโครงการนี้สมจริง"}
{"word": "budget", "english": "He reviewed his budget before the purchase.", "thai": "เขาทบทวนงบประมาณก่อนการซื้อ"}
{"word": "expense", "english": "I need to track my expense for this month.", "thai": "ฉันต้องติดตามค่าใช้จ่ายของฉันในเดือนนี้"}
{"word": "expense", "english": "The company covered the travel expense for the trip.", "thai": "บริษัทครอบคลุมค่าใช้จ่ายในการเดินทางสำหรับทริปนี้"}
{"word": "expense", "english": "She’s worried about the expense of college tuition.", "thai": "เธอกังวลเกี่ยวกับค่าใช้จ่ายของค่าเล่าเรียนมหาวิทยาลัย"}
{"word": "expense", "english": "The repair was a big expense for us.", "thai": "การซ่อมแซมเป็นค่าใช้จ่ายที่ใหญ่สำหรับเรา"}
{"word": "expense", "english": "He claimed the meal as a business expense.", "thai": "เขาอ้างค่าอาหารเป็นค่าใช้จ่ายทางธุรกิจ"}
{"word": "expense", "english": "We split the expense of the vacation rental.", "thai": "เราแบ่งค่าใช้จ่ายของที่พักตากอากาศ"}
{"word": "expense", "english": "The wedding was a huge expense for her family.", "thai": "งานแต่งงานเป็นค่าใช้จ่ายมหาศาลสำหรับครอบครัวของเธอ"}
{"word": "expense", "english": "I’m trying to cut down on my daily expense.", "thai": "ฉันกำลังพยายามลดค่าใช้จ่ายประจำวัน"}
{"word": "expense", "english": "The project went over budget due to unexpected expense.", "thai": "โครงการเกินงบประมาณเนื่องจากค่าใช้จ่ายที่ไม่คาดคิด"}
{"word": "expense", "english": "She recorded every expense in her notebook.", "thai": "เธอบันทึกทุกค่าใช้จ่ายในสมุดบันทึกของเธอ"}
{"word": "expense", "english": "The expense of childcare is overwhelming.", "thai": "ค่าใช้จ่ายในการดูแลเด็กนั้นหนักหนา"}
{"word": "expense", "english": "He didn’t want to spare any expense for the party.", "thai": "เขาไม่อยากประหยัดค่าใช้จ่ายใดๆ สำหรับงานปาร์ตี้"}
{"word": "expense", "english": "The expense report needs to be submitted by Friday.", "thai": "รายงานค่าใช้จ่ายต้องยื่นภายในวันศุกร์"}
{"word": "expense", "english": "I was shocked by the expense of the new phone.", "thai": "ฉันตกใจกับค่าใช้จ่ายของโทรศัพท์ใหม่"}
{"word": "expense", "english": "The company reduced its marketing expense this year.", "thai": "บริษัทลดค่าใช้จ่ายด้านการตลาดในปีนี้"}
{"word": "expense", "english": "She saved money by cutting her travel expense.", "thai": "เธอประหยัดเงินโดยลดค่าใช้จ่ายในการเดินทาง"}
{"word": "expense", "english": "The expense of moving to a new city was high.", "thai": "ค่าใช้จ่ายในการย้ายไปเมืองใหม่นั้นสูง"}
{"word": "expense", "english": "He’s keeping track of his expense on an app.", "thai": "เขาติดตามค่าใช้จ่ายของเขาผ่านแอป"}
{"word": "expense", "english": "The medical expense was covered by insurance.", "thai": "ค่าใช้จ่ายทางการแพทย์ได้รับการคุ้มครองโดยประกัน"}
{"word": "expense", "english": "I need to justify this expense to my boss.", "thai": "ฉันต้องอธิบายค่าใช้จ่ายนี้ให้เจ้านาย"}
{"word": "expense", "english": "The expense of the car repair was unexpected.", "thai": "ค่าใช้จ่ายในการซ่อมรถนั้นไม่คาดคิด"}
{"word": "expense", "english": "She’s trying to minimize her monthly expense.", "thai": "เธอกำลังพยายามลดค่าใช้จ่ายรายเดือน"}
{"word": "expense", "english": "The expense for the event was well-planned.", "thai": "ค่าใช้จ่ายสำหรับงานนั้นวางแผนมาดี"}
{"word": "expense", "english": "He claimed his hotel stay as a work expense.", "thai": "เขาอ้างค่าที่พักโรงแรมเป็นค่าใช้จ่ายในการทำงาน"}
{"word": "expense", "english": "The renovation was a major expense for them.", "thai": "การปรับปรุงเป็นค่าใช้จ่ายหลักสำหรับพวกเขา"}
{"word": "expense", "english": "I’m trying to budget my expense better.", "thai": "ฉันกำลังพยายามจัดงบประมาณค่าใช้จ่ายให้ดีขึ้น"}
{"word": "expense", "english": "The expense of the new software was justified.", "thai": "ค่าใช้จ่ายของซอฟต์แวร์ใหม่นั้นสมเหตุสมผล"}
{"word": "expense", "english": "She covered the expense of the team’s lunch.", "thai": "เธอครอบคลุมค่าใช้จ่ายสำหรับมื้อกลางวันของทีม"}
{"word": "expense", "english": "The expense for the trip was shared equally.", "thai": "ค่าใช้จ่ายสำหรับทริปนี้แบ่งกันเท่าๆ"}
{"word": "expense", "english": "He’s worried about the expense of his surgery.", "thai": "เขากังวลเกี่ยวกับค่าใช้จ่ายของการผ่าตัด"}
{"word": "expense", "english": "The company is cutting back on travel expense.", "thai": "บริษัทกำลังลดค่าใช้จ่ายในการเดินทาง"}
{"word": "expense", "english": "I didn’t expect the expense of owning a pet.", "thai": "ฉันไม่คาดคิดถึงค่าใช้จ่ายในการเลี้ยงสัตว์"}
{"word": "expense", "english": "The expense for the conference was reimbursed.", "thai": "ค่าใช้จ่ายสำหรับการประชุมได้รับการชดเชย"}
{"word": "expense", "english": "She’s tracking her expense to save for a car.", "thai": "เธอกำลังติดตามค่าใช้จ่ายเพื่อเก็บเงินซื้อรถ"}
{"word": "expense", "english": "The expense of the new roof was significant.", "thai": "ค่าใช้จ่ายของหลังคาใหม่นั้นมาก"}
{"word": "expense", "english": "He submitted his expense report late.", "thai": "เขายื่นรายงานค่าใช้จ่ายช้า"}
{"word": "expense", "english": "The expense of dining out adds up quickly.", "thai": "ค่าใช้จ่ายในการกินข้าวนอกบ้านเพิ่มขึ้นอย่างรวดเร็ว"}
{"word": "expense", "english": "I need to reduce my entertainment expense.", "thai": "ฉันต้องลดค่าใช้จ่ายด้านความบันเทิง"}
{"word": "expense", "english": "The expense for the project was underestimated.", "thai": "ค่าใช้จ่ายสำหรับโครงการนี้ถูกประเมินต่ำเกินไป"}
{"word": "expense", "english": "She’s managing her expense with a spreadsheet.", "thai": "เธอจัดการค่าใช้จ่ายด้วยสเปรดชีต"}
{"word": "expense", "english": "The expense of the vacation was worth it.", "thai": "ค่าใช้จ่ายของการพักร้อนนั้นคุ้มค่า"}
{"word": "expense", "english": "He’s trying to limit his expense on hobbies.", "thai": "เขากำลังพยายามจำกัดค่าใช้จ่ายในงานอดิเรก"}
{"word": "expense", "english": "The expense for the party was split among friends.", "thai": "ค่าใช้จ่ายสำหรับงานปาร์ตี้ถูกแบ่งระหว่างเพื่อนๆ"}
{"word": "expense", "english": "I’m surprised by the expense of public transport.", "thai": "ฉันแปลกใจกับค่าใช้จ่ายของการขนส่งสาธารณะ"}
{"word": "expense", "english": "The company approved the expense for new computers.", "thai": "บริษัทอนุมัติค่าใช้จ่ายสำหรับคอมพิวเตอร์ใหม่"}
{"word": "expense", "english": "She’s cutting her expense to save money.", "thai": "เธอกำลังลดค่าใช้จ่ายเพื่อประหยัดเงิน"}
{"word": "expense", "english": "The expense of the training program was high.", "thai": "ค่าใช้จ่ายของโปรแกรมฝึกอบรมนั้นสูง"}
{"word": "expense", "english": "He’s keeping a record of every expense.", "thai": "เขากำลังบันทึกทุกค่าใช้จ่าย"}
{"word": "expense", "english": "The expense for the event was covered by sponsors.", "thai": "ค่าใช้จ่ายสำหรับงานนี้ได้รับการสนับสนุนจากสปอนเซอร์"}
{"word": "expense", "english": "I need to review my expense before the trip.", "thai": "ฉันต้องทบทวนค่าใช้จ่ายก่อนการเดินทาง"}
{"word": "expense", "english": "The expense of the new furniture was unexpected.", "thai": "ค่าใช้จ่ายของเฟอร์นิเจอร์ใหม่นั้นไม่คาดคิด"}
{"word": "expense", "english": "She claimed her flight as a business expense.", "thai": "เธออ้างค่าเครื่องบินเป็นค่าใช้จ่ายทางธุรกิจ"}
{"word": "expense", "english": "The expense of groceries has gone up.", "thai": "ค่าใช้จ่ายของของชำสูงขึ้น"}
{"word": "expense", "english": "He’s trying to budget his expense carefully.", "thai": "เขากำลังพยายามจัดงบประมาณค่าใช้จ่ายอย่างระมัดระวัง"}
{"word": "expense", "english": "The expense for the wedding dress was high.", "thai": "ค่าใช้จ่ายสำหรับชุดแต่งงานนั้นสูง"}
{"word": "expense", "english": "I’m tracking my expense to avoid overspending.", "thai": "ฉันกำลังติดตามค่าใช้จ่ายเพื่อหลีกเลี่ยงการใช้จ่ายเกิน"}
{"word": "expense", "english": "The expense of the repair was covered by warranty.", "thai": "ค่าใช้จ่ายของการซ่อมแซมได้รับการคุ้มครองโดยการรับประกัน"}
{"word": "expense", "english": "She’s worried about the expense of her car insurance.", "thai": "เธอกังวลเกี่ยวกับค่าใช้จ่ายของประกันรถยนต์"}
{"word": "expense", "english": "The expense for the conference was reasonable.", "thai": "ค่าใช้จ่ายสำหรับการประชุมนั้นสมเหตุสมผล"}
{"word": "expense", "english": "He’s cutting back on his expense for clothes.", "thai": "เขากำลังลดค่าใช้จ่ายสำหรับเสื้อผ้า"}
{"word": "expense", "english": "The expense of the trip was split between us.", "thai": "ค่าใช้จ่ายของทริปนี้ถูกแบ่งระหว่างเรา"}
{"word": "expense", "english": "I need to submit my expense receipts.", "thai": "ฉันต้องยื่นใบเสร็จค่าใช้จ่ายของฉัน"}
{"word": "expense", "english": "The expense of the new phone was worth it.", "thai": "ค่าใช้จ่ายของโทรศัพท์ใหม่นั้นคุ้มค่า"}
{"word": "expense", "english": "She’s managing her expense with a budget app.", "thai": "เธอจัดการค่าใช้จ่ายด้วยแอปงบประมาณ"}
{"word": "expense", "english": "The expense for the project was approved.", "thai": "ค่าใช้จ่ายสำหรับโครงการนี้ได้รับการอนุมัติ"}
{"word": "expense", "english": "He’s surprised by the expense of utilities.", "thai": "เขาประหลาดใจกับค่าใช้จ่ายของค่าสาธารณูปโภค"}
{"word": "expense", "english": "The expense of the vacation was well-planned.", "thai": "ค่าใช้จ่ายของการพักร้อนนั้นวางแผนมาดี"}
{"word": "expense", "english": "I’m trying to reduce my expense on subscriptions.", "thai": "ฉันกำลังพยายามลดค่าใช้จ่ายในการสมัครสมาชิก"}
{"word": "expense", "english": "The expense for the party was minimal.", "thai": "ค่าใช้จ่ายสำหรับงานปาร์ตี้นั้นน้อยมาก"}
{"word": "expense", "english": "She’s keeping track of her expense daily.", "thai": "เธอกำลังติดตามค่าใช้จ่ายของเธอทุกวัน"}
{"word": "expense", "english": "The expense of the new laptop was unexpected.", "thai": "ค่าใช้จ่ายของแล็ปท็อปใหม่นั้นไม่คาดคิด"}
{"word": "expense", "english": "He claimed his parking as a work expense.", "thai": "เขาอ้างค่าจอดรถเป็นค่าใช้จ่ายในการทำงาน"}
{"word": "expense", "english": "The expense of the event was covered by donations.", "thai": "ค่าใช้จ่ายของงานนี้ได้รับการสนับสนุนจากเงินบริจาค"}
{"word": "expense", "english": "I’m reviewing my expense for the month.", "thai": "ฉันกำลังทบทวนค่าใช้จ่ายของฉันสำหรับเดือนนี้"}
{"word": "expense", "english": "The expense of the repairs was too high.", "thai": "ค่าใช้จ่ายของการซ่อมแซมนั้นสูงเกินไป"}
{"word": "expense", "english": "She’s trying to lower her expense on groceries.", "thai": "เธอกำลังพยายามลดค่าใช้จ่ายของของชำ"}
{"word": "expense", "english": "The expense for the training was reimbursed.", "thai": "ค่าใช้จ่ายสำหรับการฝึกอบรมได้รับการชดเชย"}
{"word": "expense", "english": "He’s managing his expense with a budget.", "thai": "เขาจัดการค่าใช้จ่ายด้วยงบประมาณ"}
{"word": "expense", "english": "The expense of the new car was significant.", "thai": "ค่าใช้จ่ายของรถใหม่นั้นมาก"}
{"word": "expense", "english": "I need to cut my expense on dining out.", "thai": "ฉันต้องลดค่าใช้จ่ายในการกินข้าวนอกบ้าน"}
{"word": "expense", "english": "The expense for the trip was reasonable.", "thai": "ค่าใช้จ่ายสำหรับทริปนี้สมเหตุสมผล"}
{"word": "expense", "english": "She’s tracking her expense to save for a house.", "thai": "เธอกำลังติดตามค่าใช้จ่ายเพื่อเก็บเงินซื้อบ้าน"}
{"word": "expense", "english": "The expense of the party was split evenly.", "thai": "ค่าใช้จ่ายของงานปาร์ตี้ถูกแบ่งเท่าๆ กัน"}
{"word": "expense", "english": "He’s surprised by the expense of his phone bill.", "thai": "เขาประหลาดใจกับค่าใช้จ่ายของบิลโทรศัพท์"}
{"word": "expense", "english": "The expense for the conference was covered.", "thai": "ค่าใช้จ่ายสำหรับการประชุมได้รับการครอบคลุม"}
{"word": "expense", "english": "I’m trying to manage my expense better.", "thai": "ฉันกำลังพยายามจัดการค่าใช้จ่ายให้ดีขึ้น"}
{"word": "expense", "english": "The expense of the vacation was a bit high.", "thai": "ค่าใช้จ่ายของการพักร้อนนั้นสูงไปหน่อย"}
{"word": "expense", "english": "She’s cutting her expense on non-essentials.", "thai": "เธอกำลังลดค่าใช้จ่ายในสิ่งที่ไม่จำเป็น"}
{"word": "expense", "english": "The expense for the project was within budget.", "thai": "ค่าใช้จ่ายสำหรับโครงการนี้อยู่ในงบประมาณ"}
{"word": "expense", "english": "He’s keeping track of his expense for taxes.", "thai": "เขากำลังติดตามค่าใช้จ่ายสำหรับภาษี"}
{"word": "expense", "english": "The expense of the new equipment was justified.", "thai": "ค่าใช้จ่ายของอุปกรณ์ใหม่นั้นสมเหตุสมผล"}
{"word": "expense", "english": "I need to review my expense for the year.", "thai": "ฉันต้องทบทวนค่าใช้จ่ายของฉันสำหรับทั้งปี"}
{"word": "expense", "english": "The expense for the event was minimal.", "thai": "ค่าใช้จ่ายสำหรับงานนี้น้อยมาก"}
{"word": "expense", "english": "She’s managing her expense with an app.", "thai": "เธอจัดการค่าใช้จ่ายด้วยแอป"}
{"word": "expense", "english": "The expense of the trip was worth it.", "thai": "ค่าใช้จ่ายของทริปนี้คุ้มค่า"}
{"word": "expense", "english": "He’s trying to reduce his expense on utilities.", "thai": "เขากำลังพยายามลดค่าใช้จ่ายของค่าสาธารณูปโภค"}
{"word": "expense", "english": "The expense for the party was covered by friends.", "thai": "ค่าใช้จ่ายสำหรับงานปาร์ตี้ได้รับการสนับสนุนจากเพื่อนๆ"}
{"word": "expense", "english": "I’m shocked by the expense of my car repair.", "thai": "ฉันตกใจกับค่าใช้จ่ายของการซ่อมรถ"}
{"word": "expense", "english": "The expense of the new phone was reasonable.", "thai": "ค่าใช้จ่ายของโทรศัพท์ใหม่นั้นสมเหตุสมผล"}
{"word": "payment", "english": "I made a payment for my car loan yesterday.", "thai": "เมื่อวานฉันชำระเงินสำหรับสินเชื่อรถยนต์"}
{"word": "payment", "english": "The company is late on their payment to the vendor.", "thai": "บริษัทชำระเงินให้ผู้ขายช้า"}
{"word": "payment", "english": "She set up an automatic payment for her bills.", "thai": "เธอตั้งค่าการชำระเงินอัตโนมัติสำหรับบิลของเธอ"}
{"word": "payment", "english": "The payment for the order was processed today.", "thai": "การชำระเงินสำหรับคำสั่งซื้อได้รับการดำเนินการวันนี้"}
{"word": "payment", "english": "He missed the payment deadline for his rent.", "thai": "เขาเลยกำหนดชำระเงินค่าเช่า"}
{"word": "payment", "english": "I received a confirmation for my payment.", "thai": "ฉันได้รับการยืนยันสำหรับการชำระเงินของฉัน"}
{"word": "payment", "english": "The payment was split between three people.", "thai": "การชำระเงินถูกแบ่งระหว่างสามคน"}
{"word": "payment", "english": "She sent a payment through a mobile app.", "thai": "เธอส่งการชำระเงินผ่านแอปมือถือ"}
{"word": "payment", "english": "The payment for the service was due last week.", "thai": "การชำระเงินสำหรับบริการครบกำหนดเมื่อสัปดาห์ที่แล้ว"}
{"word": "payment", "english": "He made a partial payment on his credit card.", "thai": "เขาชำระเงินบางส่วนสำหรับบัตรเครดิตของเขา"}
{"word": "payment", "english": "The payment was declined due to insufficient funds.", "thai": "การชำระเงินถูกปฏิเสธเนื่องจากเงินไม่เพียงพอ"}
{"word": "payment", "english": "I need to check the status of my payment.", "thai": "ฉันต้องตรวจสอบสถานะการชำระเงินของฉัน"}
{"word": "payment", "english": "The payment plan helped her manage the cost.", "thai": "แผนการชำระเงินช่วยเธอจัดการค่าใช้จ่าย"}
{"word": "payment", "english": "He offered a cash payment for the furniture.", "thai": "เขาเสนอชำระเงินด้วยเงินสดสำหรับเฟอร์นิเจอร์"}
{"word": "payment", "english": "The payment was processed through PayPal.", "thai": "การชำระเงินถูกดำเนินการผ่าน PayPal"}
{"word": "payment", "english": "She forgot to make the payment for her subscription.", "thai": "เธอลืมชำระเงินสำหรับการสมัครสมาชิกของเธอ"}
{"word": "payment", "english": "The payment for the repair was covered by insurance.", "thai": "การชำระเงินสำหรับการซ่อมแซมได้รับการคุ้มครองโดยประกัน"}
{"word": "payment", "english": "I need to schedule a payment for my utilities.", "thai": "ฉันต้องกำหนดการชำระเงินสำหรับค่าสาธารณูปโภค"}
{"word": "payment", "english": "The payment was sent via bank transfer.", "thai": "การชำระเงินถูกส่งผ่านการโอนเงินธนาคาร"}
{"word": "payment", "english": "He disputed the payment amount with the contractor.", "thai": "เขาคัดค้านจำนวนเงินชำระกับผู้รับเหมา"}
{"word": "payment", "english": "The payment for the course was refunded.", "thai": "การชำระเงินสำหรับคอร์สได้รับการคืนเงิน"}
{"word": "payment", "english": "She made a payment using her debit card.", "thai": "เธอชำระเงินโดยใช้บัตรเดบิต"}
{"word": "payment", "english": "The payment was delayed due to a system error.", "thai": "การชำระเงินล่าช้าเนื่องจากข้อผิดพลาดของระบบ"}
{"word": "payment", "english": "I received a reminder about a missed payment.", "thai": "ฉันได้รับการแจ้งเตือนเกี่ยวกับการชำระเงินที่พลาด"}
{"word": "payment", "english": "The payment for the hotel was made in advance.", "thai": "การชำระเงินสำหรับโรงแรมถูกชำระล่วงหน้า"}
{"word": "payment", "english": "He set up a monthly payment for his loan.", "thai": "เขาตั้งค่าการชำระเงินรายเดือนสำหรับสินเชื่อของเขา"}
{"word": "payment", "english": "The payment was for the catering service.", "thai": "การชำระเงินสำหรับบริการจัดเลี้ยง"}
{"word": "payment", "english": "She confirmed the payment with a receipt.", "thai": "เธอยืนยันการชำระเงินด้วยใบเสร็จ"}
{"word": "payment", "english": "The payment was made through an online portal.", "thai": "การชำระเงินถูกทำผ่านพอร์ทัลออนไลน์"}
{"word": "payment", "english": "I need to make a payment for my phone bill.", "thai": "ฉันต้องชำระเงินสำหรับบิลโทรศัพท์"}
{"word": "payment", "english": "The payment for the order was completed yesterday.", "thai": "การชำระเงินสำหรับคำสั่งซื้อเสร็จสิ้นเมื่อวานนี้"}
{"word": "payment", "english": "He asked for an extension on the payment deadline.", "thai": "เขาขอขยายกำหนดเวลาการชำระเงิน"}
{"word": "payment", "english": "The payment was split into two installments.", "thai": "การชำระเงินถูกแบ่งเป็นสองงวด"}
{"word": "payment", "english": "She sent a payment for the freelance work.", "thai": "เธอส่งการชำระเงินสำหรับงานฟรีแลนซ์"}
{"word": "payment", "english": "The payment was processed without any issues.", "thai": "การชำระเงินถูกดำเนินการโดยไม่มีปัญหา"}
{"word": "payment", "english": "I need to verify the payment before shipping.", "thai": "ฉันต้องยืนยันการชำระเงินก่อนจัดส่ง"}
{"word": "payment", "english": "The payment for the subscription was automatic.", "thai": "การชำระเงินสำหรับการสมัครสมาชิกเป็นแบบอัตโนมัติ"}
{"word": "payment", "english": "He made a payment for the car insurance.", "thai": "เขาชำระเงินสำหรับประกันรถยนต์"}
{"word": "payment", "english": "The payment was sent to the wrong account.", "thai": "การชำระเงินถูกส่งไปยังบัญชีที่ผิด"}
{"word": "payment", "english": "She received a payment for her consulting services.", "thai": "เธอได้รับการชำระเงินสำหรับบริการให้คำปรึกษา"}
{"word": "payment", "english": "The payment for the event was made in cash.", "thai": "การชำระเงินสำหรับงานนั้นจ่ายด้วยเงินสด"}
{"word": "payment", "english": "I need to track my payment history.", "thai": "ฉันต้องติดตามประวัติการชำระเงินของฉัน"}
{"word": "payment", "english": "The payment was for the website hosting.", "thai": "การชำระเงินสำหรับการโฮสต์เว็บไซต์"}
{"word": "payment", "english": "He confirmed the payment with a bank receipt.", "thai": "เขายืนยันการชำระเงินด้วยใบเสร็จธนาคาร"}
{"word": "payment", "english": "The payment was due on the first of the month.", "thai": "การชำระเงินครบกำหนดในวันที่หนึ่งของเดือน"}
{"word": "payment", "english": "She made a payment for the online purchase.", "thai": "เธอชำระเงินสำหรับการซื้อของออนไลน์"}
{"word": "payment", "english": "The payment was refunded due to a cancellation.", "thai": "การชำระเงินได้รับการคืนเงินเนื่องจากการยกเลิก"}
{"word": "payment", "english": "I need to set up a payment plan for my loan.", "thai": "ฉันต้องตั้งค่าแผนการชำระเงินสำหรับสินเชื่อของฉัน"}
{"word": "payment", "english": "The payment for the repairs was covered.", "thai": "การชำระเงินสำหรับการซ่อมแซมได้รับการครอบคลุม"}
{"word": "payment", "english": "He sent a payment through a mobile banking app.", "thai": "เขาส่งการชำระเงินผ่านแอปธนาคารมือถือ"}
{"word": "payment", "english": "The payment was for the graphic design project.", "thai": "การชำระเงินสำหรับโครงการออกแบบกราฟิก"}
{"word": "payment", "english": "She missed a payment on her credit card.", "thai": "เธอพลาดการชำระเงินสำหรับบัตรเครดิต"}
{"word": "payment", "english": "The payment was processed in two days.", "thai": "การชำระเงินถูกดำเนินการในสองวัน"}
{"word": "payment", "english": "I need to make a payment for my gym membership.", "thai": "ฉันต้องชำระเงินสำหรับสมาชิกยิม"}
{"word": "payment", "english": "The payment for the catering was sent yesterday.", "thai": "การชำระเงินสำหรับการจัดเลี้ยงถูกส่งเมื่อวานนี้"}
{"word": "payment", "english": "He requested a payment receipt for his records.", "thai": "เขาขอใบเสร็จการชำระเงินเพื่อเก็บไว้เป็นหลักฐาน"}
{"word": "payment", "english": "The payment was made through a wire transfer.", "thai": "การชำระเงินถูกทำผ่านการโอนเงิน"}
{"word": "payment", "english": "She set up a recurring payment for her bills.", "thai": "เธอตั้งค่าการชำระเงินแบบประจำสำหรับบิลของเธอ"}
{"word": "payment", "english": "The payment for the software was automatic.", "thai": "การชำระเงินสำหรับซอฟต์แวร์เป็นแบบอัตโนมัติ"}
{"word": "payment", "english": "I need to confirm the payment before delivery.", "thai": "ฉันต้องยืนยันการชำระเงินก่อนจัดส่ง"}
{"word": "payment", "english": "The payment was for the event decorations.", "thai": "การชำระเงินสำหรับการตกแต่งงาน"}
{"word": "payment", "english": "He made a payment using his credit card.", "thai": "เขาชำระเงินโดยใช้บัตรเครดิต"}
{"word": "payment", "english": "The payment was delayed due to a bank issue.", "thai": "การชำระเงินล่าช้าเนื่องจากปัญหาของธนาคาร"}
{"word": "payment", "english": "She received a payment for her freelance project.", "thai": "เธอได้รับการชำระเงินสำหรับโครงการฟรีแลนซ์"}
{"word": "payment", "english": "The payment for the course was made in advance.", "thai": "การชำระเงินสำหรับคอร์สถูกชำระล่วงหน้า"}
{"word": "payment", "english": "I need to check my payment confirmation.", "thai": "ฉันต้องตรวจสอบการยืนยันการชำระเงินของฉัน"}
{"word": "payment", "english": "The payment was for the utility bill.", "thai": "การชำระเงินสำหรับบิลค่าสาธารณูปโภค"}
{"word": "payment", "english": "He sent a payment for the car repair.", "thai": "เขาส่งการชำระเงินสำหรับการซ่อมรถ"}
{"word": "payment", "english": "The payment was split into monthly installments.", "thai": "การชำระเงินถูกแบ่งเป็นงวดรายเดือน"}
{"word": "payment", "english": "She made a payment for the online subscription.", "thai": "เธอชำระเงินสำหรับการสมัครสมาชิกออนไลน์"}
{"word": "payment", "english": "The payment was processed through a secure system.", "thai": "การชำระเงินถูกดำเนินการผ่านระบบที่ปลอดภัย"}
{"word": "payment", "english": "I need to make a payment for my insurance.", "thai": "ฉันต้องชำระเงินสำหรับประกันของฉัน"}
{"word": "payment", "english": "The payment for the project was sent today.", "thai": "การชำระเงินสำหรับโครงการถูกส่งวันนี้"}
{"word": "payment", "english": "He received a payment for his consulting work.", "thai": "เขาได้รับการชำระเงินสำหรับงานให้คำปรึกษา"}
{"word": "payment", "english": "The payment was made in two parts.", "thai": "การชำระเงินถูกทำเป็นสองส่วน"}
{"word": "payment", "english": "She sent a payment for the photography session.", "thai": "เธอส่งการชำระเงินสำหรับการถ่ายภาพ"}
{"word": "payment", "english": "The payment was for the website development.", "thai": "การชำระเงินสำหรับการพัฒนาเว็บไซต์"}
{"word": "payment", "english": "I need to verify the payment amount.", "thai": "ฉันต้องยืนยันจำนวนเงินชำระ"}
{"word": "payment", "english": "The payment was sent to the supplier.", "thai": "การชำระเงินถูกส่งไปยังผู้จัดจำหน่าย"}
{"word": "payment", "english": "He made a payment for the hotel booking.", "thai": "เขาชำระเงินสำหรับการจองโรงแรม"}
{"word": "payment", "english": "The payment was processed without delay.", "thai": "การชำระเงินถูกดำเนินการโดยไม่ล่าช้า"}
{"word": "payment", "english": "She set up a payment for the gym membership.", "thai": "เธอตั้งค่าการชำระเงินสำหรับสมาชิกยิม"}
{"word": "payment", "english": "The payment for the order was confirmed.", "thai": "การชำระเงินสำหรับคำสั่งซื้อได้รับการยืนยัน"}
{"word": "payment", "english": "I need to make a payment for my rent.", "thai": "ฉันต้องชำระเงินสำหรับค่าเช่าของฉัน"}
{"word": "payment", "english": "The payment was for the training program.", "thai": "การชำระเงินสำหรับโปรแกรมฝึกอบรม"}
{"word": "payment", "english": "He sent a payment through a digital wallet.", "thai": "เขาส่งการชำระเงินผ่านกระเป๋าเงินดิจิทัล"}
{"word": "payment", "english": "The payment was for the event planning.", "thai": "การชำระเงินสำหรับการวางแผนงาน"}
{"word": "payment", "english": "She made a payment for the car rental.", "thai": "เธอชำระเงินสำหรับการเช่ารถ"}
{"word": "payment", "english": "The payment was processed through a bank app.", "thai": "การชำระเงินถูกดำเนินการผ่านแอปธนาคาร"}
{"word": "payment", "english": "I need to check the payment details.", "thai": "ฉันต้องตรวจสอบรายละเอียดการชำระเงิน"}
{"word": "payment", "english": "The payment for the software was refunded.", "thai": "การชำระเงินสำหรับซอฟต์แวร์ได้รับการคืนเงิน"}
{"word": "payment", "english": "He made a payment for the online course.", "thai": "เขาชำระเงินสำหรับคอร์สออนไลน์"}
{"word": "payment", "english": "The payment was sent to the wrong recipient.", "thai": "การชำระเงินถูกส่งไปยังผู้รับที่ผิด"}
{"word": "payment", "english": "She received a payment for her design work.", "thai": "เธอได้รับการชำระเงินสำหรับงานออกแบบ"}
{"word": "payment", "english": "The payment was for the utility services.", "thai": "การชำระเงินสำหรับบริการสาธารณูปโภค"}
{"word": "payment", "english": "I need to make a payment for my taxes.", "thai": "ฉันต้องชำระเงินสำหรับภาษีของฉัน"}
{"word": "payment", "english": "The payment was completed successfully.", "thai": "การชำระเงินเสร็จสมบูรณ์เรียบร้อย"}
{"word": "competitor", "english": "Our main competitor just launched a new product line.", "thai": "คู่แข่งหลักของเราเพิ่งเปิดตัวสายผลิตภัณฑ์ใหม่"}
{"word": "competitor", "english": "I saw their competitor advertising on TV last night.", "thai": "ฉันเห็นคู่แข่งของพวกเขาลงโฆษณาทางทีวีเมื่อคืนนี้"}
{"word": "competitor", "english": "We need to stay ahead of the competitor in this market.", "thai": "เราต้องนำหน้าคู่แข่งในตลาดนี้"}
{"word": "competitor", "english": "She’s a tough competitor in the chess tournament.", "thai": "เธอเป็นคู่แข่งที่แข็งแกร่งในการแข่งขันหมากรุก"}
{"word": "competitor", "english": "The competitor’s prices are lower, but our quality is better.", "thai": "ราคาของคู่แข่งต่ำกว่า แต่คุณภาพของเราดีกว่า"}
{"word": "competitor", "english": "Have you checked what the competitor is doing on social media?", "thai": "คุณเช็คหรือยังว่าคู่แข่งทำอะไรบนโซเชียลมีเดีย?"}
{"word": "competitor", "english": "That company is our biggest competitor right now.", "thai": "บริษัทนั้นเป็นคู่แข่งที่ใหญ่ที่สุดของเราตอนนี้"}
{"word": "competitor", "english": "He’s training hard to beat his competitor in the race.", "thai": "เขากำลังฝึกซ้อมอย่างหนักเพื่อเอาชนะคู่แข่งในการแข่งขัน"}
{"word": "competitor", "english": "The competitor’s new app has some cool features.", "thai": "แอปใหม่ของคู่แข่งมีฟีเจอร์ที่น่าสนใจ"}
{"word": "competitor", "english": "We’re analyzing the competitor’s marketing strategy.", "thai": "เรากำลังวิเคราะห์กลยุทธ์การตลาดของคู่แข่ง"}
{"word": "competitor", "english": "Their competitor just opened a store downtown.", "thai": "คู่แข่งของพวกเขาเพิ่งเปิดร้านในตัวเมือง"}
{"word": "competitor", "english": "I don’t think we should worry about that competitor.", "thai": "ฉันคิดว่าเราไม่ควรกังวลเกี่ยวกับคู่แข่งนั้น"}
{"word": "competitor", "english": "She’s a fierce competitor when it comes to debates.", "thai": "เธอเป็นคู่แข่งที่น่ากลัวเมื่อพูดถึงการโต้วาที"}
{"word": "competitor", "english": "The competitor’s website looks more user-friendly.", "thai": "เว็บไซต์ของคู่แข่งดูเป็นมิตรกับผู้ใช้มากกว่า"}
{"word": "competitor", "english": "We outperformed our competitor in sales this quarter.", "thai": "เราทำยอดขายได้ดีกว่าคู่แข่งในไตรมาสนี้"}
{"word": "competitor", "english": "Did you hear about the competitor’s new partnership?", "thai": "คุณได้ยินเกี่ยวกับการเป็นพันธมิตรใหม่ของคู่แข่งหรือยัง?"}
{"word": "competitor", "english": "That competitor always tries to copy our ideas.", "thai": "คู่แข่งนั้นมักจะพยายามเลียนแบบไอเดียของเรา"}
{"word": "competitor", "english": "He’s a strong competitor, but we’re ready for the challenge.", "thai": "เขาเป็นคู่แข่งที่แข็งแกร่ง แต่เราพร้อมรับความท้าทาย"}
{"word": "competitor", "english": "The competitor’s ad campaign is getting a lot of attention.", "thai": "แคมเปญโฆษณาของคู่แข่งได้รับความสนใจมาก"}
{"word": "competitor", "english": "We need to differentiate ourselves from the competitor.", "thai": "เราต้องสร้างความแตกต่างจากคู่แข่ง"}
{"word": "competitor", "english": "Their competitor is offering free shipping this month.", "thai": "คู่แข่งของพวกเขาให้บริการจัดส่งฟรีในเดือนนี้"}
{"word": "competitor", "english": "I admire how innovative that competitor is.", "thai": "ฉันชื่นชมที่คู่แข่งนั้นมีความคิดสร้างสรรค์"}
{"word": "competitor", "english": "The competitor’s product is cheaper, but it’s not as reliable.", "thai": "ผลิตภัณฑ์ของคู่แข่งถูกกว่า แต่ไม่น่าเชื่อถือเท่า"}
{"word": "competitor", "english": "She’s been studying her competitor’s techniques.", "thai": "เธอกำลังศึกษาวิธีการของคู่แข่ง"}
{"word": "competitor", "english": "We’re keeping an eye on the competitor’s next move.", "thai": "เรากำลังจับตาดูการเคลื่อนไหวครั้งต่อไปของคู่แข่ง"}
{"word": "competitor", "english": "That competitor has a loyal customer base.", "thai": "คู่แข่งนั้นมีฐานลูกค้าที่ภักดี"}
{"word": "competitor", "english": "The competitor’s store is always so crowded.", "thai": "ร้านของคู่แข่งมักจะแน่นไปด้วยผู้คน"}
{"word": "competitor", "english": "He lost to his competitor in the final round.", "thai": "เขาแพ้คู่แข่งในรอบสุดท้าย"}
{"word": "competitor", "english": "The competitor’s brand is really popular with teens.", "thai": "แบรนด์ของคู่แข่งได้รับความนิยมมากในหมู่วัยรุ่น"}
{"word": "competitor", "english": "We’re trying to learn from the competitor’s mistakes.", "thai": "เรากำลังพยายามเรียนรู้จากความผิดพลาดของคู่แข่ง"}
{"word": "competitor", "english": "Their competitor just got a big investment.", "thai": "คู่แข่งของพวกเขาเพิ่งได้รับการลงทุนก้อนใหญ่"}
{"word": "competitor", "english": "I can’t believe how fast the competitor is growing.", "thai": "ฉันไม่อยากเชื่อว่าคู่แข่งเติบโตเร็วขนาดนี้"}
{"word": "competitor", "english": "The competitor’s customer service is top-notch.", "thai": "การบริการลูกค้าของคู่แข่งยอดเยี่ยมมาก"}
{"word": "competitor", "english": "We’re meeting to discuss the competitor’s new strategy.", "thai": "เราจะประชุมเพื่อหารือเกี่ยวกับกลยุทธ์ใหม่ของคู่แข่ง"}
{"word": "competitor", "english": "She’s a friendly competitor, always cheering others on.", "thai": "เธอเป็นคู่แข่งที่เป็นมิตร คอยให้กำลังใจผู้อื่นเสมอ"}
{"word": "competitor", "english": "The competitor’s packaging is so eye-catching.", "thai": "บรรจุภัณฑ์ของคู่แข่งดูสะดุดตามาก"}
{"word": "competitor", "english": "We need to match the competitor’s discount offer.", "thai": "เราต้องเสนอส่วนลดให้เท่ากับคู่แข่ง"}
{"word": "competitor", "english": "He’s been spying on the competitor’s operations.", "thai": "เขากำลังสอดแนมการดำเนินงานของคู่แข่ง"}
{"word": "competitor", "english": "The competitor’s new store is right next to ours.", "thai": "ร้านใหม่ของคู่แข่งอยู่ติดกับร้านของเราเลย"}
{"word": "competitor", "english": "I heard the competitor is planning a big sale.", "thai": "ฉันได้ยินว่าคู่แข่งกำลังวางแผนจัดเซลใหญ่"}
{"word": "competitor", "english": "That competitor always seems one step ahead.", "thai": "คู่แข่งนั้นดูเหมือนจะนำหน้าหนึ่งก้าวเสมอ"}
{"word": "competitor", "english": "The competitor’s app crashed during their launch.", "thai": "แอปของคู่แข่งล่มระหว่างการเปิดตัว"}
{"word": "competitor", "english": "We’re more innovative than our closest competitor.", "thai": "เรามีความคิดสร้างสรรค์มากกว่าคู่แข่งที่ใกล้ที่สุด"}
{"word": "competitor", "english": "She beat her competitor by a narrow margin.", "thai": "เธอเอาชนะคู่แข่งด้วยคะแนนที่เฉียดฉิว"}
{"word": "competitor", "english": "The competitor’s reviews are mostly positive.", "thai": "รีวิวของคู่แข่งส่วนใหญ่เป็นบวก"}
{"word": "competitor", "english": "We’re launching a campaign to outshine the competitor.", "thai": "เรากำลังเปิดตัวแคมเปญเพื่อเอาชนะคู่แข่ง"}
{"word": "competitor", "english": "Their competitor is struggling to keep up.", "thai": "คู่แข่งของพวกเขากำลังพยายามตามให้ทัน"}
{"word": "competitor", "english": "I like how the competitor handles customer complaints.", "thai": "ฉันชอบวิธีที่คู่แข่งจัดการกับข้อร้องเรียนของลูกค้า"}
{"word": "competitor", "english": "The competitor’s logo got a major redesign.", "thai": "โลโก้ของคู่แข่งได้รับการออกแบบใหม่ครั้งใหญ่"}
{"word": "competitor", "english": "We’re studying the competitor’s supply chain.", "thai": "เรากำลังศึกษาห่วงโซ่อุปทานของคู่แข่ง"}
{"word": "competitor", "english": "He’s a young competitor with a lot of potential.", "thai": "เขาเป็นคู่แข่งรุ่นเยาว์ที่มีศักยภาพมาก"}
{"word": "competitor", "english": "The competitor’s product launch was a huge success.", "thai": "การเปิดตัวผลิตภัณฑ์ของคู่แข่งประสบความสำเร็จอย่างมาก"}
{"word": "competitor", "english": "We’re not afraid of the competitor’s new moves.", "thai": "เราไม่กลัวการเคลื่อนไหวใหม่ของคู่แข่ง"}
{"word": "competitor", "english": "Their competitor is targeting the same audience.", "thai": "คู่แข่งของพวกเขากำลังเจาะกลุ่มเป้าหมายเดียวกัน"}
{"word": "competitor", "english": "The competitor’s store has better lighting.", "thai": "ร้านของคู่แข่งมีแสงสว่างที่ดีกว่า"}
{"word": "competitor", "english": "She’s a fair competitor who plays by the rules.", "thai": "เธอเป็นคู่แข่งที่ยุติธรรมและเล่นตามกฎ"}
{"word": "competitor", "english": "The competitor’s website crashed during the sale.", "thai": "เว็บไซต์ของคู่แข่งล่มระหว่างการลดราคา"}
{"word": "competitor", "english": "We’re planning to undercut the competitor’s prices.", "thai": "เราวางแผนจะตัดราคาคู่แข่ง"}
{"word": "competitor", "english": "The competitor’s team is really talented.", "thai": "ทีมของคู่แข่งมีความสามารถมาก"}
{"word": "competitor", "english": "I’m impressed by the competitor’s new design.", "thai": "ฉันประทับใจกับการออกแบบใหม่ของคู่แข่ง"}
{"word": "competitor", "english": "Their competitor just hired a new CEO.", "thai": "คู่แข่งของพวกเขาเพิ่งจ้างซีอีโอคนใหม่"}
{"word": "competitor", "english": "We’re tracking the competitor’s sales data.", "thai": "เรากำลังติดตามข้อมูลยอดขายของคู่แข่ง"}
{"word": "competitor", "english": "The competitor’s campaign went viral online.", "thai": "แคมเปญของคู่แข่งกลายเป็นไวรัลในออนไลน์"}
{"word": "competitor", "english": "He’s a competitor who never gives up.", "thai": "เขาเป็นคู่แข่งที่ไม่เคยยอมแพ้"}
{"word": "competitor", "english": "The competitor’s product has a few flaws.", "thai": "ผลิตภัณฑ์ของคู่แข่งมีข้อบกพร่องเล็กน้อย"}
{"word": "competitor", "english": "We’re brainstorming ways to beat the competitor.", "thai": "เรากำลังระดมความคิดเพื่อเอาชนะคู่แข่ง"}
{"word": "competitor", "english": "Their competitor is expanding into new markets.", "thai": "คู่แข่งของพวกเขากำลังขยายสู่ตลาดใหม่"}
{"word": "competitor", "english": "The competitor’s delivery service is really fast.", "thai": "บริการจัดส่งของคู่แข่งเร็วมาก"}
{"word": "competitor", "english": "She’s a smart competitor with great instincts.", "thai": "เธอเป็นคู่แข่งที่ฉลาดและมีสัญชาตญาณดี"}
{"word": "competitor", "english": "The competitor’s new ad is all over the internet.", "thai": "โฆษณาใหม่ของคู่แข่งอยู่ทั่วอินเทอร์เน็ต"}
{"word": "competitor", "english": "We’re not worried about the competitor’s latest move.", "thai": "เราไม่กังวลเกี่ยวกับการเคลื่อนไหวล่าสุดของคู่แข่ง"}
{"word": "competitor", "english": "Their competitor has a better return policy.", "thai": "คู่แข่งของพวกเขามีนโยบายคืนสินค้าที่ดีกว่า"}
{"word": "competitor", "english": "The competitor’s store is closer to my house.", "thai": "ร้านของคู่แข่งอยู่ใกล้บ้านฉันมากกว่า"}
{"word": "competitor", "english": "He’s a competitor who always pushes the limits.", "thai": "เขาเป็นคู่แข่งที่พยายามผลักดันขีดจำกัดเสมอ"}
{"word": "competitor", "english": "The competitor’s app has a better interface.", "thai": "แอปของคู่แข่งมีอินเทอร์เฟซที่ดีกว่า"}
{"word": "competitor", "english": "We’re working to stay ahead of the competitor.", "thai": "เรากำลังพยายามนำหน้าคู่แข่ง"}
{"word": "competitor", "english": "Their competitor is gaining a lot of traction.", "thai": "คู่แข่งของพวกเขากำลังได้รับความนิยมมาก"}
{"word": "competitor", "english": "The competitor’s new product sold out in hours.", "thai": "ผลิตภัณฑ์ใหม่ของคู่แข่งขายหมดในไม่กี่ชั่วโมง"}
{"word": "competitor", "english": "She’s a competitor who’s always full of surprises.", "thai": "เธอเป็นคู่แข่งที่เต็มไปด้วยความประหลาดใจ"}
{"word": "competitor", "english": "The competitor’s prices are hard to beat.", "thai": "ราคาของคู่แข่งยากที่จะเอาชนะ"}
{"word": "competitor", "english": "We’re studying the competitor’s customer reviews.", "thai": "เรากำลังศึกษารีวิวลูกค้าของคู่แข่ง"}
{"word": "competitor", "english": "Their competitor just released a new update.", "thai": "คู่แข่งของพวกเขาเพิ่งปล่อยอัปเดตใหม่"}
{"word": "competitor", "english": "The competitor’s team won the award last year.", "thai": "ทีมของคู่แข่งได้รับรางวัลเมื่อปีที่แล้ว"}
{"word": "competitor", "english": "He’s a competitor with a lot of experience.", "thai": "เขาเป็นคู่แข่งที่มีประสบการณ์มาก"}
{"word": "competitor", "english": "The competitor’s ad was really creative.", "thai": "โฆษณาของคู่แข่งมีความคิดสร้างสรรค์มาก"}
{"word": "competitor", "english": "We’re not as big as our competitor, but we’re growing.", "thai": "เราไม่ได้ใหญ่เท่าคู่แข่ง แต่เรากำลังเติบโต"}
{"word": "competitor", "english": "Their competitor is offering a loyalty program.", "thai": "คู่แข่งของพวกเขาเสนอโปรแกรมสะสมคะแนน"}
{"word": "competitor", "english": "The competitor’s product has better reviews.", "thai": "ผลิตภัณฑ์ของคู่แข่งมีรีวิวที่ดีกว่า"}
{"word": "competitor", "english": "She’s a competitor who never backs down.", "thai": "เธอเป็นคู่แข่งที่ไม่เคยถอย"}
{"word": "competitor", "english": "The competitor’s store has a modern vibe.", "thai": "ร้านของคู่แข่งมีบรรยากาศทันสมัย"}
{"word": "competitor", "english": "We’re trying to innovate faster than the competitor.", "thai": "เรากำลังพยายามสร้างนวัตกรรมให้เร็วกว่าคู่แข่ง"}
{"word": "competitor", "english": "Their competitor just launched a new website.", "thai": "คู่แข่งของพวกเขาเพิ่งเปิดตัวเว็บไซต์ใหม่"}
{"word": "competitor", "english": "The competitor’s customer support is always available.", "thai": "ฝ่ายสนับสนุนลูกค้าของคู่แข่งพร้อมให้บริการตลอดเวลา"}
{"word": "competitor", "english": "He’s a competitor who plays fair but tough.", "thai": "เขาเป็นคู่แข่งที่เล่นอย่างยุติธรรมแต่แข็งแกร่ง"}
{"word": "competitor", "english": "The competitor’s new feature is a game-changer.", "thai": "ฟีเจอร์ใหม่ของคู่แข่งเปลี่ยนเกมได้เลย"}
{"word": "competitor", "english": "We’re learning from the competitor’s success.", "thai": "เรากำลังเรียนรู้จากความสำเร็จของคู่แข่ง"}
{"word": "competitor", "english": "Their competitor is planning a big expansion.", "thai": "คู่แข่งของพวกเขากำลังวางแผนขยายตัวครั้งใหญ่"}
{"word": "competitor", "english": "The competitor’s product is more eco-friendly.", "thai": "ผลิตภัณฑ์ของคู่แข่งเป็นมิตรกับสิ่งแวดล้อมมากกว่า"}
{"word": "competitor", "english": "She’s a competitor who always brings her A-game.", "thai": "เธอเป็นคู่แข่งที่มาพร้อมกับฟอร์มที่ดีที่สุดเสมอ"}
{"word": "strategy", "english": "We need a new strategy to boost our sales.", "thai": "เราต้องการกลยุทธ์ใหม่เพื่อเพิ่มยอดขาย"}
{"word": "strategy", "english": "Her strategy for winning the game was brilliant.", "thai": "กลยุทธ์ของเธอในการชนะเกมนั้นยอดเยี่ยม"}
{"word": "strategy", "english": "The company’s marketing strategy is really effective.", "thai": "กลยุทธ์การตลาดของบริษัทนั้นได้ผลมาก"}
{"word": "strategy", "english": "What’s your strategy for dealing with stress?", "thai": "กลยุทธ์ของคุณในการจัดการกับความเครียดคืออะไร?"}
{"word": "strategy", "english": "Their strategy focuses on customer loyalty.", "thai": "กลยุทธ์ของพวกเขาเน้นที่ความภักดีของลูกค้า"}
{"word": "strategy", "english": "He shared his strategy for saving money.", "thai": "เขาแบ่งปันกลยุทธ์ในการประหยัดเงิน"}
{"word": "strategy", "english": "The coach outlined a strategy for the next match.", "thai": "โค้ชวางกลยุทธ์สำหรับการแข่งขันนัดต่อไป"}
{"word": "strategy", "english": "Our team is working on a long-term strategy.", "thai": "ทีมของเรากำลังทำงานเกี่ยวกับกลยุทธ์ระยะยาว"}
{"word": "strategy", "english": "I think we should rethink our pricing strategy.", "thai": "ฉันคิดว่าเราควรทบทวนกลยุทธ์การตั้งราคา"}
{"word": "strategy", "english": "Her strategy for studying always gets her good grades.", "thai": "กลยุทธ์การเรียนของเธอทำให้ได้เกรดดีเสมอ"}
{"word": "strategy", "english": "The strategy they used in the campaign was creative.", "thai": "กลยุทธ์ที่พวกเขาใช้ในแคมเปญนั้นมีความคิดสร้างสรรค์"}
{"word": "strategy", "english": "What’s the best strategy for negotiating a deal?", "thai": "กลยุทธ์ที่ดีที่สุดสำหรับการเจรจาคืออะไร?"}
{"word": "strategy", "english": "Their strategy relies on social media advertising.", "thai": "กลยุทธ์ของพวกเขาขึ้นอยู่กับการโฆษณาบนโซเชียลมีเดีย"}
{"word": "strategy", "english": "He’s developing a strategy to grow his business.", "thai": "เขากำลังพัฒนากลยุทธ์เพื่อขยายธุรกิจ"}
{"word": "strategy", "english": "The team’s strategy paid off in the end.", "thai": "กลยุทธ์ของทีมได้ผลในที่สุด"}
{"word": "strategy", "english": "We need a strategy to attract younger customers.", "thai": "เราต้องการกลยุทธ์เพื่อดึงดูดลูกค้าวัยรุ่น"}
{"word": "strategy", "english": "Her strategy in debates is to stay calm.", "thai": "กลยุทธ์ของเธอในการโต้วาทีคือการสงบสติอารมณ์"}
{"word": "strategy", "english": "The company’s growth strategy is aggressive.", "thai": "กลยุทธ์การเติบโตของบริษัทนั้นค่อนข้างดุดัน"}
{"word": "strategy", "english": "I don’t think their strategy is working.", "thai": "ฉันคิดว่ากลยุทธ์ของพวกเขาไม่ได้ผล"}
{"word": "strategy", "english": "We’re discussing a new strategy for the project.", "thai": "เรากำลังหารือเกี่ยวกับกลยุทธ์ใหม่สำหรับโปรเจกต์"}
{"word": "strategy", "english": "His strategy for time management is so effective.", "thai": "กลยุทธ์การจัดการเวลาของเขามีประสิทธิภาพมาก"}
{"word": "strategy", "english": "The strategy involves cutting costs this quarter.", "thai": "กลยุทธ์นี้เกี่ยวข้องกับการลดต้นทุนในไตรมาสนี้"}
{"word": "strategy", "english": "She explained her strategy for solving the puzzle.", "thai": "เธออธิบายกลยุทธ์ในการแก้ปริศนา"}
{"word": "strategy", "english": "Their strategy is to expand into new markets.", "thai": "กลยุทธ์ของพวกเขาคือการขยายสู่ตลาดใหม่"}
{"word": "strategy", "english": "What’s your strategy for getting promoted?", "thai": "กลยุทธ์ของคุณในการเลื่อนตำแหน่งคืออะไร?"}
{"word": "strategy", "english": "The team’s strategy was to play defensively.", "thai": "กลยุทธ์ของทีมคือการเล่นแบบตั้งรับ"}
{"word": "strategy", "english": "We need a better strategy for customer retention.", "thai": "เราต้องการกลยุทธ์ที่ดีกว่าสำหรับการรักษาลูกค้า"}
{"word": "strategy", "english": "His strategy for the race was to pace himself.", "thai": "กลยุทธ์ของเขาในการแข่งขันคือการควบคุมจังหวะ"}
{"word": "strategy", "english": "The company’s strategy hinges on innovation.", "thai": "กลยุทธ์ของบริษัทขึ้นอยู่กับนวัตกรรม"}
{"word": "strategy", "english": "I like her strategy for handling tough questions.", "thai": "ฉันชอบกลยุทธ์ของเธอในการจัดการคำถามยากๆ"}
{"word": "strategy", "english": "Their strategy backfired and cost them the game.", "thai": "กลยุทธ์ของพวกเขาผิดพลาดและทำให้แพ้เกม"}
{"word": "strategy", "english": "We’re brainstorming a strategy for the launch.", "thai": "เรากำลังระดมความคิดสำหรับกลยุทธ์การเปิดตัว"}
{"word": "strategy", "english": "The strategy was to focus on quality over quantity.", "thai": "กลยุทธ์คือการเน้นคุณภาพมากกว่าปริมาณ"}
{"word": "strategy", "english": "What’s the strategy for dealing with complaints?", "thai": "กลยุทธ์ในการจัดการข้อร้องเรียนคืออะไร?"}
{"word": "strategy", "english": "Her strategy for networking is to be genuine.", "thai": "กลยุทธ์ของเธอในการสร้างเครือข่ายคือการเป็นตัวของตัวเอง"}
{"word": "strategy", "english": "The team’s strategy meeting lasted all day.", "thai": "การประชุมกลยุทธ์ของทีมกินเวลาทั้งวัน"}
{"word": "strategy", "english": "Our strategy is to offer free trials.", "thai": "กลยุทธ์ของเราคือการเสนอทดลองใช้ฟรี"}
{"word": "strategy", "english": "He’s revising his strategy for the next round.", "thai": "เขากำลังปรับปรุงกลยุทธ์สำหรับรอบต่อไป"}
{"word": "strategy", "english": "Their strategy for growth is risky but bold.", "thai": "กลยุทธ์การเติบโตของพวกเขามีความเสี่ยงแต่กล้าหาญ"}
{"word": "strategy", "english": "I need a strategy to balance work and life.", "thai": "ฉันต้องการกลยุทธ์เพื่อสร้างสมดุลระหว่างงานและชีวิต"}
{"word": "strategy", "english": "The strategy was to target younger audiences.", "thai": "กลยุทธ์คือการเจาะกลุ่มเป้าหมายที่เป็นวัยรุ่น"}
{"word": "strategy", "english": "She’s got a strategy for every situation.", "thai": "เธอมีกลยุทธ์สำหรับทุกสถานการณ์"}
{"word": "strategy", "english": "The company’s strategy shifted after the merger.", "thai": "กลยุทธ์ของบริษัทเปลี่ยนไปหลังจากการควบรวม"}
{"word": "strategy", "english": "His strategy for winning votes was grassroots.", "thai": "กลยุทธ์ของเขาในการชนะคะแนนคือการรณรงค์แบบพื้นฐาน"}
{"word": "strategy", "english": "We’re developing a strategy to reduce waste.", "thai": "เรากำลังพัฒนากลยุทธ์เพื่อลดของเสีย"}
{"word": "strategy", "english": "The strategy worked better than we expected.", "thai": "กลยุทธ์นั้นได้ผลดีกว่าที่เราคาดไว้"}
{"word": "strategy", "english": "What’s the strategy for handling competitors?", "thai": "กลยุทธ์ในการจัดการกับคู่แข่งคืออะไร?"}
{"word": "strategy", "english": "Her strategy for the exam was to prioritize key topics.", "thai": "กลยุทธ์ของเธอในการสอบคือการให้ความสำคัญกับหัวข้อหลัก"}
{"word": "strategy", "english": "Their strategy involves partnering with influencers.", "thai": "กลยุทธ์ของพวกเขาคือการร่วมงานกับอินฟลูเอนเซอร์"}
{"word": "strategy", "english": "The coach’s strategy was to tire out the opponents.", "thai": "กลยุทธ์ของโค้ชคือทำให้คู่ต่อสู้เหนื่อยล้า"}
{"word": "strategy", "english": "We need a strategy to improve our online presence.", "thai": "เราต้องการกลยุทธ์เพื่อปรับปรุงการปรากฏตัวทางออนไลน์"}
{"word": "strategy", "english": "His strategy for the debate was well-prepared.", "thai": "กลยุทธ์ของเขาในการโต้วาทีนั้นเตรียมพร้อมมาดี"}
{"word": "strategy", "english": "The strategy is to launch the product in phases.", "thai": "กลยุทธ์คือการเปิดตัวผลิตภัณฑ์เป็นระยะ"}
{"word": "strategy", "english": "She’s tweaking her strategy for better results.", "thai": "เธอกำลังปรับแต่งกลยุทธ์เพื่อผลลัพธ์ที่ดีขึ้น"}
{"word": "strategy", "english": "Their strategy for expansion is quite ambitious.", "thai": "กลยุทธ์การขยายตัวของพวกเขาค่อนข้างทะเยอทะยาน"}
{"word": "strategy", "english": "What’s your strategy for staying motivated?", "thai": "กลยุทธ์ของคุณในการรักษาแรงจูงใจคืออะไร?"}
{"word": "strategy", "english": "The team’s strategy relies on quick execution.", "thai": "กลยุทธ์ของทีมขึ้นอยู่กับการดำเนินการที่รวดเร็ว"}
{"word": "strategy", "english": "Our strategy is to focus on eco-friendly products.", "thai": "กลยุทธ์ของเราคือการเน้นผลิตภัณฑ์ที่เป็นมิตรกับสิ่งแวดล้อม"}
{"word": "strategy", "english": "He outlined a strategy for cutting expenses.", "thai": "เขาวางกลยุทธ์สำหรับการลดค่าใช้จ่าย"}
{"word": "strategy", "english": "The strategy was to surprise the competition.", "thai": "กลยุทธ์คือการทำให้คู่แข่งประหลาดใจ"}
{"word": "strategy", "english": "Her strategy for success is hard work and persistence.", "thai": "กลยุทธ์สู่ความสำเร็จของเธอคือการทำงานหนักและความพยายาม"}
{"word": "strategy", "english": "We’re evaluating the strategy’s effectiveness.", "thai": "เรากำลังประเมินประสิทธิภาพของกลยุทธ์"}
{"word": "strategy", "english": "Their strategy for customer engagement is innovative.", "thai": "กลยุทธ์ในการดึงดูดลูกค้าของพวกเขามีความคิดสร้างสรรค์"}
{"word": "strategy", "english": "The strategy didn’t go as planned.", "thai": "กลยุทธ์ไม่ได้เป็นไปตามที่วางแผนไว้"}
{"word": "strategy", "english": "What’s the strategy for increasing website traffic?", "thai": "กลยุทธ์ในการเพิ่มทราฟฟิกเว็บไซต์คืออะไร?"}
{"word": "strategy", "english": "His strategy for the game was to take risks.", "thai": "กลยุทธ์ของเขาในเกมคือการเสี่ยง"}
{"word": "strategy", "english": "The company’s strategy is to go global.", "thai": "กลยุทธ์ของบริษัทคือการขยายสู่ระดับโลก"}
{"word": "strategy", "english": "She’s got a solid strategy for career growth.", "thai": "เธอมีกลยุทธ์ที่แข็งแกร่งสำหรับการเติบโตในอาชีพ"}
{"word": "strategy", "english": "Their strategy was to offer exclusive deals.", "thai": "กลยุทธ์ของพวกเขาคือการเสนอดีลพิเศษ"}
{"word": "strategy", "english": "We need a strategy to handle supply chain issues.", "thai": "เราต้องการกลยุทธ์เพื่อจัดการปัญหาห่วงโซ่อุปทาน"}
{"word": "strategy", "english": "His strategy for the match was flawless.", "thai": "กลยุทธ์ของเขาในการแข่งขันนั้นไร้ที่ติ"}
{"word": "strategy", "english": "The strategy involves hiring more staff.", "thai": "กลยุทธ์นี้รวมถึงการจ้างพนักงานเพิ่ม"}
{"word": "strategy", "english": "What’s your strategy for staying organized?", "thai": "กลยุทธ์ของคุณในการจัดระเบียบคืออะไร?"}
{"word": "strategy", "english": "Their strategy for branding is bold and colorful.", "thai": "กลยุทธ์การสร้างแบรนด์ของพวกเขากล้าหาญและมีสีสัน"}
{"word": "strategy", "english": "The team’s strategy was to focus on teamwork.", "thai": "กลยุทธ์ของทีมคือการเน้นการทำงานเป็นทีม"}
{"word": "strategy", "english": "We’re implementing a strategy to reduce costs.", "thai": "เรากำลังดำเนินกลยุทธ์เพื่อลดต้นทุน"}
{"word": "strategy", "english": "Her strategy for the presentation was engaging.", "thai": "กลยุทธ์ของเธอในการนำเสนอนั้นน่าสนใจ"}
{"word": "strategy", "english": "The strategy is to target niche markets.", "thai": "กลยุทธ์คือการเจาะตลาดเฉพาะกลุ่ม"}
{"word": "strategy", "english": "He’s got a strategy for every challenge.", "thai": "เขามีกลยุทธ์สำหรับทุกความท้าทาย"}
{"word": "strategy", "english": "Their strategy for growth is data-driven.", "thai": "กลยุทธ์การเติบโตของพวกเขาใช้ข้อมูลเป็นตัวขับเคลื่อน"}
{"word": "strategy", "english": "The strategy was to launch early and iterate.", "thai": "กลยุทธ์คือการเปิดตัวเร็วและปรับปรุงต่อไป"}
{"word": "strategy", "english": "What’s the strategy for improving team morale?", "thai": "กลยุทธ์ในการเพิ่มขวัญกำลังใจของทีมคืออะไร?"}
{"word": "strategy", "english": "Her strategy for saving time is multitasking.", "thai": "กลยุทธ์ของเธอในการประหยัดเวลาคือการทำงานหลายอย่างพร้อมกัน"}
{"word": "strategy", "english": "The company’s strategy is customer-centric.", "thai": "กลยุทธ์ของบริษัทเน้นลูกค้าเป็นศูนย์กลาง"}
{"word": "strategy", "english": "His strategy for winning was to stay focused.", "thai": "กลยุทธ์ของเขาในการชนะคือการมีสมาธิ"}
{"word": "strategy", "english": "We’re refining our strategy based on feedback.", "thai": "เรากำลังปรับปรุงกลยุทธ์ตามคำติชม"}
{"word": "strategy", "english": "Their strategy for the campaign was aggressive.", "thai": "กลยุทธ์ของพวกเขาในแคมเปญนั้นดุดัน"}
{"word": "strategy", "english": "The strategy is to build a strong online community.", "thai": "กลยุทธ์คือการสร้างชุมชนออนไลน์ที่แข็งแกร่ง"}
{"word": "strategy", "english": "She’s adjusting her strategy for better outcomes.", "thai": "เธอกำลังปรับกลยุทธ์เพื่อผลลัพธ์ที่ดีขึ้น"}
{"word": "strategy", "english": "The team’s strategy was to take the lead early.", "thai": "กลยุทธ์ของทีมคือการขึ้นนำตั้งแต่แรก"}
{"word": "strategy", "english": "We need a strategy for handling negative reviews.", "thai": "เราต้องการกลยุทธ์ในการจัดการรีวิวเชิงลบ"}
{"word": "strategy", "english": "His strategy for success is staying consistent.", "thai": "กลยุทธ์สู่ความสำเร็จของเขาคือความสม่ำเสมอ"}
{"word": "strategy", "english": "The strategy involves collaborating with partners.", "thai": "กลยุทธ์นี้รวมถึงการร่วมงานกับพันธมิตร"}
{"word": "strategy", "english": "What’s your strategy for managing a tight budget?", "thai": "กลยุทธ์ของคุณในการจัดการงบประมาณจำกัดคืออะไร?"}
{"word": "strategy", "english": "Their strategy for the launch was well-executed.", "thai": "กลยุทธ์ในการเปิดตัวของพวกเขาดำเนินการได้ดี"}
{"word": "strategy", "english": "The strategy is to prioritize customer feedback.", "thai": "กลยุทธ์คือการให้ความสำคัญกับคำติชมของลูกค้า"}
{"word": "strategy", "english": "She’s got a clever strategy for avoiding conflict.", "thai": "เธอมีกลยุทธ์ที่ชาญฉลาดในการหลีกเลี่ยงความขัดแย้ง"}
{"word": "strategy", "english": "The company’s strategy is to stay innovative.", "thai": "กลยุทธ์ของบริษัทคือการรักษานวัตกรรม"}
{"word": "strategy", "english": "His strategy for the project saved us time.", "thai": "กลยุทธ์ของเขาในโปรเจกต์ช่วยประหยัดเวลา"}
{"word": "strategy", "english": "The strategy was to keep things simple.", "thai": "กลยุทธ์คือการทำให้ทุกอย่างเรียบง่าย"}
{"word": "goal", "english": "My goal is to run a marathon this year.", "thai": "เป้าหมายของฉันคือการวิ่งมาราธอนในปีนี้"}
{"word": "goal", "english": "The team scored a goal in the final minute.", "thai": "ทีมยิงประตูได้ในนาทีสุดท้าย"}
{"word": "goal", "english": "What’s your main goal for this project?", "thai": "เป้าหมายหลักของคุณสำหรับโปรเจกต์นี้คืออะไร?"}
{"word": "goal", "english": "Her goal is to become a doctor someday.", "thai": "เป้าหมายของเธอคือการเป็นหมอสักวันหนึ่ง"}
{"word": "goal", "english": "We’re working toward a common goal.", "thai": "เรากำลังทำงานเพื่อเป้าหมายร่วมกัน"}
{"word": "goal", "english": "He set a goal to save $5,000 by next year.", "thai": "เขาตั้งเป้าหมายว่าจะเก็บเงิน 5,000 ดอลลาร์ภายในปีหน้า"}
{"word": "goal", "english": "The goal of this campaign is to raise awareness.", "thai": "เป้าหมายของแคมเปญนี้คือการสร้างความตระหนัก"}
{"word": "goal", "english": "I’m so close to achieving my fitness goal!", "thai": "ฉันใกล้จะบรรลุเป้าหมายด้านฟิตเนสแล้ว!"}
{"word": "goal", "english": "Their goal is to expand the business globally.", "thai": "เป้าหมายของพวกเขาคือการขยายธุรกิจไปทั่วโลก"}
{"word": "goal", "english": "The goal was to finish the project by Friday.", "thai": "เป้าหมายคือการทำให้โปรเจกต์เสร็จภายในวันศุกร์"}
{"word": "goal", "english": "She scored the winning goal in overtime.", "thai": "เธอยิงประตูชัยในช่วงต่อเวลา"}
{"word": "goal", "english": "My goal this month is to read three books.", "thai": "เป้าหมายของฉันในเดือนนี้คือการอ่านหนังสือสามเล่ม"}
{"word": "goal", "english": "The company’s goal is to reduce carbon emissions.", "thai": "เป้าหมายของบริษัทคือการลดการปล่อยคาร์บอน"}
{"word": "goal", "english": "He missed the goal by just a few inches.", "thai": "เขายิงพลาดประตูไปแค่ไม่กี่นิ้ว"}
{"word": "goal", "english": "Our goal is to improve customer satisfaction.", "thai": "เป้าหมายของเราคือการปรับปรุงความพึงพอใจของลูกค้า"}
{"word": "goal", "english": "What’s your career goal for the next five years?", "thai": "เป้าหมายในอาชีพของคุณในอีกห้าปีข้างหน้าคืออะไร?"}
{"word": "goal", "english": "The goal of the meeting is to finalize the plan.", "thai": "เป้าหมายของการประชุมคือการสรุปแผน"}
{"word": "goal", "english": "She’s working hard to reach her weight loss goal.", "thai": "เธอกำลังพยายามอย่างหนักเพื่อบรรลุเป้าหมายการลดน้ำหนัก"}
{"word": "goal", "english": "The team’s goal is to win the championship.", "thai": "เป้าหมายของทีมคือการคว้าแชมป์"}
{"word": "goal", "english": "I set a goal to learn a new language this year.", "thai": "ฉันตั้งเป้าหมายว่าจะเรียนภาษาใหม่ในปีนี้"}
{"word": "goal", "english": "His shot went wide of the goal.", "thai": "การยิงของเขาเฉียดประตูไป"}
{"word": "goal", "english": "The goal is to make the app more user-friendly.", "thai": "เป้าหมายคือการทำให้แอปใช้งานง่ายขึ้น"}
{"word": "goal", "english": "She achieved her goal of getting straight A’s.", "thai": "เธอบรรลุเป้าหมายในการได้เกรด A ล้วน"}
{"word": "goal", "english": "Our goal is to raise $10,000 for charity.", "thai": "เป้าหมายของเราคือการระดมทุน 10,000 ดอลลาร์เพื่อการกุศล"}
{"word": "goal", "english": "The goal was blocked by the goalkeeper.", "thai": "ประตูถูกบล็อกโดยผู้รักษาประตู"}
{"word": "goal", "english": "My goal is to travel to Europe next summer.", "thai": "เป้าหมายของฉันคือการเดินทางไปยุโรปในฤดูร้อนหน้า"}
{"word": "goal", "english": "The goal of this training is to improve teamwork.", "thai": "เป้าหมายของการฝึกอบรมนี้คือการพัฒนาการทำงานเป็นทีม"}
{"word": "goal", "english": "He’s set a new goal to improve his public speaking.", "thai": "เขาตั้งเป้าหมายใหม่เพื่อพัฒนาทักษะการพูดในที่สาธารณะ"}
{"word": "goal", "english": "The team celebrated after scoring a goal.", "thai": "ทีมฉลองหลังจากยิงประตูได้"}
{"word": "goal", "english": "Her goal is to start her own business.", "thai": "เป้าหมายของเธอคือการเริ่มธุรกิจของตัวเอง"}
{"word": "goal", "english": "We’re on track to meet our sales goal.", "thai": "เราอยู่ในเส้นทางที่จะบรรลุเป้าหมายยอดขาย"}
{"word": "goal", "english": "The goal is to create a sustainable future.", "thai": "เป้าหมายคือการสร้างอนาคตที่ยั่งยืน"}
{"word": "goal", "english": "He kicked the ball straight into the goal.", "thai": "เขเตะบอลตรงเข้าประตู"}
{"word": "goal", "english": "My goal is to get better at time management.", "thai": "เป้าหมายของฉันคือการจัดการเวลาให้ดีขึ้น"}
{"word": "goal", "english": "The goal of the study is to understand consumer behavior.", "thai": "เป้าหมายของการศึกษาคือการเข้าใจพฤติกรรมผู้บริโภค"}
{"word": "goal", "english": "She’s so focused on her goal to graduate early.", "thai": "เธอจดจ่อกับเป้าหมายที่จะจบการศึกษาเร็วกว่ากำหนด"}
{"word": "goal", "english": "The goal is to finish the race in under an hour.", "thai": "เป้าหมายคือการจบการแข่งขันในเวลาน้อยกว่าหนึ่งชั่วโมง"}
{"word": "goal", "english": "Their goal was to build a stronger community.", "thai": "เป้าหมายของพวกเขาคือการสร้างชุมชนที่แข็งแกร่งขึ้น"}
{"word": "goal", "english": "The goal went in off a deflection.", "thai": "ประตูนั้นมาจากการแฉลบ"}
{"word": "goal", "english": "My goal is to pay off my student loans.", "thai": "เป้าหมายของฉันคือการชำระหนี้เงินกู้เพื่อการศึกษา"}
{"word": "goal", "english": "The goal of this app is to simplify daily tasks.", "thai": "เป้าหมายของแอปนี้คือการทำให้งานประจำวันง่ายขึ้น"}
{"word": "goal", "english": "He’s working toward his goal of becoming a chef.", "thai": "เขากำลังทำงานเพื่อเป้าหมายในการเป็นเชฟ"}
{"word": "goal", "english": "The goal is to increase our social media followers.", "thai": "เป้าหมายคือการเพิ่มผู้ติดตามบนโซเชียลมีเดีย"}
{"word": "goal", "english": "She scored a goal from halfway across the field.", "thai": "เธอยิงประตูจากครึ่งสนาม"}
{"word": "goal", "english": "Our goal is to make the event carbon-neutral.", "thai": "เป้าหมายของเราคือทำให้งานนี้เป็นกลางทางคาร์บอน"}
{"word": "goal", "english": "I set a goal to meditate every morning.", "thai": "ฉันตั้งเป้าหมายว่าจะนั่งสมาธิทุกเช้า"}
{"word": "goal", "english": "The goal of the workshop is to teach new skills.", "thai": "เป้าหมายของเวิร์กช็อปคือการสอนทักษะใหม่"}
{"word": "goal", "english": "He’s so close to reaching his fitness goal.", "thai": "เขาใกล้จะบรรลุเป้าหมายด้านฟิตเนสแล้ว"}
{"word": "goal", "english": "The team’s goal is to qualify for the playoffs.", "thai": "เป้าหมายของทีมคือการเข้ารอบเพลย์ออฟ"}
{"word": "goal", "english": "My goal is to learn how to code this year.", "thai": "เป้าหมายของฉันคือการเรียนรู้การเขียนโค้ดในปีนี้"}
{"word": "goal", "english": "The ball hit the post and missed the goal.", "thai": "บอลชนเสาและพลาดประตู"}
{"word": "goal", "english": "Her goal is to travel to every continent.", "thai": "เป้าหมายของเธอคือการเดินทางไปทุกทวีป"}
{"word": "goal", "english": "The goal is to reduce waste by 20 percent.", "thai": "เป้าหมายคือการลดของเสียลง 20 เปอร์เซ็นต์"}
{"word": "goal", "english": "He set a goal to improve his leadership skills.", "thai": "เขาตั้งเป้าหมายเพื่อพัฒนาทักษะความเป็นผู้นำ"}
{"word": "goal", "english": "The goal was disallowed due to offside.", "thai": "ประตูถูกปฏิเสธเพราะล้ำหน้า"}
{"word": "goal", "english": "Our goal is to launch the product by spring.", "thai": "เป้าหมายของเราคือการเปิดตัวผลิตภัณฑ์ภายในฤดูใบไม้ผลิ"}
{"word": "goal", "english": "She’s determined to achieve her academic goal.", "thai": "เธอมุ่งมั่นที่จะบรรลุเป้าหมายด้านการศึกษา"}
{"word": "goal", "english": "The goal of this initiative is to empower youth.", "thai": "เป้าหมายของโครงการนี้คือการเสริมพลังให้เยาวชน"}
{"word": "goal", "english": "I’m setting a goal to eat healthier this month.", "thai": "ฉันกำลังตั้งเป้าหมายที่จะกินอาหารเพื่อสุขภาพในเดือนนี้"}
{"word": "goal", "english": "The team’s goal is to finish in the top three.", "thai": "เป้าหมายของทีมคือการจบในอันดับสาม"}
{"word": "goal", "english": "His goal is to start a nonprofit organization.", "thai": "เป้าหมายของเขาคือการเริ่มต้นองค์กรไม่แสวงผลกำไร"}
{"word": "goal", "english": "The goal was scored in the first half.", "thai": "ประตูถูกยิงในครึ่งแรก"}
{"word": "goal", "english": "My goal is to declutter my entire house.", "thai": "เป้าหมายของฉันคือการจัดระเบียบทั้งบ้าน"}
{"word": "goal", "english": "The goal of the program is to promote diversity.", "thai": "เป้าหมายของโปรแกรมคือการส่งเสริมความหลากหลาย"}
{"word": "goal", "english": "She’s on track to meet her savings goal.", "thai": "เธอกำลังอยู่ในเส้นทางที่จะบรรลุเป้าหมายการออม"}
{"word": "goal", "english": "The goal is to make our website more accessible.", "thai": "เป้าหมายคือการทำให้เว็บไซต์ของเราเข้าถึงได้ง่ายขึ้น"}
{"word": "goal", "english": "He scored a goal with a header.", "thai": "เขายิงประตูด้วยการโหม่ง"}
{"word": "goal", "english": "My goal is to volunteer more this year.", "thai": "เป้าหมายของฉันคือการเป็นอาสาสมัครมากขึ้นในปีนี้"}
{"word": "goal", "english": "The goal of this meeting is to brainstorm ideas.", "thai": "เป้าหมายของการประชุมนี้คือการระดมความคิด"}
{"word": "goal", "english": "She set a goal to run five miles every day.", "thai": "เธอตั้งเป้าหมายว่าจะวิ่งห้าไมล์ทุกวัน"}
{"word": "goal", "english": "The team’s goal is to break the school record.", "thai": "เป้าหมายของทีมคือการทำลายสถิติโรงเรียน"}
{"word": "goal", "english": "His goal is to learn how to play the guitar.", "thai": "เป้าหมายของเขาคือการเรียนรู้วิธีเล่นกีตาร์"}
{"word": "goal", "english": "The goal was saved by an incredible dive.", "thai": "ประตูถูกเซฟด้วยการพุ่งตัวที่น่าทึ่ง"}
{"word": "goal", "english": "Our goal is to improve employee morale.", "thai": "เป้าหมายของเราคือการปรับปรุงขวัญกำลังใจของพนักงาน"}
{"word": "goal", "english": "She’s so focused on her goal to get promoted.", "thai": "เธอจดจ่อกับเป้าหมายในการเลื่อนตำแหน่ง"}
{"word": "goal", "english": "The goal of the campaign is to educate the public.", "thai": "เป้าหมายของแคมเปญคือการให้ความรู้แก่สาธารณชน"}
{"word": "goal", "english": "I set a goal to write a novel this year.", "thai": "ฉันตั้งเป้าหมายว่าจะเขียนนิยายในปีนี้"}
{"word": "goal", "english": "The goal was a long-range shot from midfield.", "thai": "ประตูนั้นเป็นการยิงไกลจากกลางสนาม"}
{"word": "goal", "english": "My goal is to spend more time with family.", "thai": "เป้าหมายของฉันคือการใช้เวลากับครอบครัวมากขึ้น"}
{"word": "goal", "english": "The goal is to reduce costs by 10 percent.", "thai": "เป้าหมายคือการลดต้นทุนลง 10 เปอร์เซ็นต์"}
{"word": "goal", "english": "He’s working toward his goal of becoming a pilot.", "thai": "เขากำลังทำงานเพื่อเป้าหมายในการเป็นนักบิน"}
{"word": "goal", "english": "The goal of this event is to foster networking.", "thai": "เป้าหมายของงานนี้คือการส่งเสริมการสร้างเครือข่าย"}
{"word": "goal", "english": "She achieved her goal of running a 5K.", "thai": "เธอบรรลุเป้าหมายในการวิ่ง 5 กิโลเมตร"}
{"word": "goal", "english": "The team’s goal is to win every home game.", "thai": "เป้าหมายของทีมคือการชนะทุกเกมในบ้าน"}
{"word": "goal", "english": "My goal is to master public speaking.", "thai": "เป้าหมายของฉันคือการเชี่ยวชาญการพูดในที่สาธารณะ"}
{"word": "goal", "english": "The goal was a penalty kick in the second half.", "thai": "ประตูนั้นมาจากการเตะลูกโทษในครึ่งหลัง"}
{"word": "goal", "english": "Her goal is to adopt a more sustainable lifestyle.", "thai": "เป้าหมายของเธอคือการใช้ชีวิตอย่างยั่งยืนมากขึ้น"}
{"word": "goal", "english": "The goal is to streamline our operations.", "thai": "เป้าหมายคือการทำให้การดำเนินงานของเราคล่องตัวขึ้น"}
{"word": "goal", "english": "He set a goal to bike across the state.", "thai": "เขาตั้งเป้าหมายที่จะปั่นจักรยานข้ามรัฐ"}
{"word": "goal", "english": "The goal of the study group is to ace the exam.", "thai": "เป้าหมายของกลุ่มเรียนคือการสอบได้คะแนนดีเยี่ยม"}
{"word": "goal", "english": "She’s halfway to her goal of saving $10,000.", "thai": "เธอไปถึงครึ่งทางของเป้าหมายการเก็บเงิน 10,000 ดอลลาร์"}
{"word": "goal", "english": "The goal was a beautiful free kick.", "thai": "ประตูนั้นเป็นการเตะฟรีคิกที่สวยงาม"}
{"word": "goal", "english": "Our goal is to make the product more affordable.", "thai": "เป้าหมายของเราคือการทำให้ผลิตภัณฑ์ราคาไม่แพงมากขึ้น"}
{"word": "goal", "english": "His goal is to retire by age 50.", "thai": "เป้าหมายของเขาคือการเกษียณตอนอายุ 50"}
{"word": "goal", "english": "The goal of this class is to build confidence.", "thai": "เป้าหมายของชั้นเรียนนี้คือการสร้างความมั่นใจ"}
{"word": "goal", "english": "She’s so driven to achieve her personal goal.", "thai": "เธอมุ่งมั่นมากที่จะบรรลุเป้าหมายส่วนตัว"}
{"word": "goal", "english": "The team’s goal is to go undefeated this season.", "thai": "เป้าหมายของทีมคือการไม่แพ้ใครในฤดูกาลนี้"}
{"word": "goal", "english": "My goal is to start a blog this month.", "thai": "เป้าหมายของฉันคือการเริ่มเขียนบล็อกในเดือนนี้"}
{"word": "goal", "english": "The goal was scored in stoppage time.", "thai": "ประตูถูกยิงในช่วงทดเวลาบาดเจ็บ"}
{"word": "goal", "english": "Her goal is to inspire others through her work.", "thai": "เป้าหมายของเธอคือการสร้างแรงบันดาลใจให้ผู้อื่นผ่านงานของเธอ"}
{"word": "objective", "english": "Our main objective is to increase sales this quarter.", "thai": "วัตถุประสงค์หลักของเราคือการเพิ่มยอดขายในไตรมาสนี้"}
{"word": "objective", "english": "The objective of this meeting is to finalize the budget.", "thai": "วัตถุประสงค์ของการประชุมนี้คือการสรุปงบประมาณ"}
{"word": "objective", "english": "Her objective is to finish the project by next week.", "thai": "วัตถุประสงค์ของเธอคือการทำให้โปรเจกต์เสร็จภายในสัปดาห์หน้า"}
{"word": "objective", "english": "What’s the primary objective of this campaign?", "thai": "วัตถุประสงค์หลักของแคมเปญนี้คืออะไร?"}
{"word": "objective", "english": "The team’s objective is to improve customer service.", "thai": "วัตถุประสงค์ของทีมคือการปรับปรุงการบริการลูกค้า"}
{"word": "objective", "english": "My objective this year is to learn a new skill.", "thai": "วัตถุประสงค์ของฉันในปีนี้คือการเรียนรู้ทักษะใหม่"}
{"word": "objective", "english": "The objective of the study is to analyze market trends.", "thai": "วัตถุประสงค์ของการศึกษาคือการวิเคราะห์แนวโน้มตลาด"}
{"word": "objective", "english": "He’s very focused on achieving his career objective.", "thai": "เขาจดจ่อกับการบรรลุวัตถุประสงค์ในอาชีพมาก"}
{"word": "objective", "english": "The objective is to reduce costs without sacrificing quality.", "thai": "วัตถุประสงค์คือการลดต้นทุนโดยไม่กระทบต่อคุณภาพ"}
{"word": "objective", "english": "She outlined the objective for the training session.", "thai": "เธอระบุวัตถุประสงค์สำหรับการฝึกอบรม"}
{"word": "objective", "english": "Our objective is to launch the product by summer.", "thai": "วัตถุประสงค์ของเราคือการเปิดตัวผลิตภัณฑ์ภายในฤดูร้อน"}
{"word": "objective", "english": "The objective of this exercise is to build teamwork.", "thai": "วัตถุประสงค์ของแบบฝึกหัดนี้คือการสร้างการทำงานเป็นทีม"}
{"word": "objective", "english": "What’s your personal objective for this year?", "thai": "วัตถุประสงค์ส่วนตัวของคุณในปีนี้คืออะไร?"}
{"word": "objective", "english": "The company’s objective is to go carbon-neutral.", "thai": "วัตถุประสงค์ของบริษัทคือการเป็นกลางทางคาร์บอน"}
{"word": "objective", "english": "His objective is to get promoted within a year.", "thai": "วัตถุประสงค์ของเขาคือการเลื่อนตำแหน่งภายในหนึ่งปี"}
{"word": "objective", "english": "The objective was to streamline the workflow.", "thai": "วัตถุประสงค์คือการทำให้ขั้นตอนการทำงานคล่องตัว"}
{"word": "objective", "english": "We’re working toward a shared objective.", "thai": "เรากำลังทำงานเพื่อวัตถุประสงค์ร่วมกัน"}
{"word": "objective", "english": "Her objective is to improve her public speaking.", "thai": "วัตถุประสงค์ของเธอคือการพัฒนาทักษะการพูดในที่สาธารณะ"}
{"word": "objective", "english": "The objective of the workshop is to teach coding.", "thai": "วัตถุประสงค์ของเวิร์กช็อปคือการสอนการเขียนโค้ด"}
{"word": "objective", "english": "Our objective is to attract more investors.", "thai": "วัตถุประสงค์ของเราคือการดึงดูดนักลงทุนเพิ่ม"}
{"word": "objective", "english": "The objective is to make the app more intuitive.", "thai": "วัตถุประสงค์คือการทำให้แอปใช้งานง่ายขึ้น"}
{"word": "objective", "english": "He set an objective to read 20 books this year.", "thai": "เขาตั้งวัตถุประสงค์ว่าจะอ่านหนังสือ 20 เล่มในปีนี้"}
{"word": "objective", "english": "The objective of this plan is to boost efficiency.", "thai": "วัตถุประสงค์ของแผนนี้คือการเพิ่มประสิทธิภาพ"}
{"word": "objective", "english": "She’s clear about her objective to start a business.", "thai": "เธอชัดเจนเกี่ยวกับวัตถุประสงค์ในการเริ่มธุรกิจ"}
{"word": "objective", "english": "The team’s objective is to meet the deadline.", "thai": "วัตถุประสงค์ของทีมคือการทำตามกำหนดเวลา"}
{"word": "objective", "english": "What’s the objective of this new initiative?", "thai": "วัตถุประสงค์ของโครงการใหม่นี้คืออะไร?"}
{"word": "objective", "english": "The objective is to create a safer workplace.", "thai": "วัตถุประสงค์คือการสร้างสถานที่ทำงานที่ปลอดภัยยิ่งขึ้น"}
{"word": "objective", "english": "My objective is to balance work and life better.", "thai": "วัตถุประสงค์ของฉันคือการสร้างสมดุลระหว่างงานและชีวิตให้ดีขึ้น"}
{"word": "objective", "english": "The objective of the survey is to gather feedback.", "thai": "วัตถุประสงค์ของแบบสำรวจคือการรวบรวมคำติชม"}
{"word": "objective", "english": "He’s working toward his objective of becoming a manager.", "thai": "เขากำลังทำงานเพื่อวัตถุประสงค์ในการเป็นผู้จัดการ"}
{"word": "objective", "english": "The objective was to improve employee morale.", "thai": "วัตถุประสงค์คือการปรับปรุงขวัญกำลังใจของพนักงาน"}
{"word": "objective", "english": "Her objective is to graduate with honors.", "thai": "วัตถุประสงค์ของเธอคือการจบการศึกษาด้วยเกียรตินิยม"}
{"word": "objective", "english": "The objective of this program is to promote diversity.", "thai": "วัตถุประสงค์ของโปรแกรมนี้คือการส่งเสริมความหลากหลาย"}
{"word": "objective", "english": "We need to align on a clear objective.", "thai": "เราต้องตกลงกันในวัตถุประสงค์ที่ชัดเจน"}
{"word": "objective", "english": "His objective is to save enough for a new car.", "thai": "วัตถุประสงค์ของเขาคือการเก็บเงินให้พอซื้อรถใหม่"}
{"word": "objective", "english": "The objective is to reduce waste by 15 percent.", "thai": "วัตถุประสงค์คือการลดของเสียลง 15 เปอร์เซ็นต์"}
{"word": "objective", "english": "She set an objective to run a half-marathon.", "thai": "เธอตั้งวัตถุประสงค์ว่าจะวิ่งฮาล์ฟมาราธอน"}
{"word": "objective", "english": "The objective of the campaign is to raise funds.", "thai": "วัตถุประสงค์ของแคมเปญคือการระดมทุน"}
{"word": "objective", "english": "Our objective is to enhance the user experience.", "thai": "วัตถุประสงค์ของเราคือการปรับปรุงประสบการณ์ผู้ใช้"}
{"word": "objective", "english": "The objective was to complete the audit on time.", "thai": "วัตถุประสงค์คือการทำให้การตรวจสอบเสร็จทันเวลา"}
{"word": "objective", "english": "What’s the objective behind this new policy?", "thai": "วัตถุประสงค์ของนโยบายใหม่นี้คืออะไร?"}
{"word": "objective", "english": "Her objective is to learn a new language fluently.", "thai": "วัตถุประสงค์ของเธอคือการเรียนรู้ภาษาใหม่ให้คล่อง"}
{"word": "objective", "english": "The team’s objective is to win the contract.", "thai": "วัตถุประสงค์ของทีมคือการได้สัญญา"}
{"word": "objective", "english": "My objective is to eat healthier this month.", "thai": "วัตถุประสงค์ของฉันคือการกินอาหารเพื่อสุขภาพในเดือนนี้"}
{"word": "objective", "english": "The objective of this class is to build confidence.", "thai": "วัตถุประสงค์ของชั้นเรียนนี้คือการสร้างความมั่นใจ"}
{"word": "objective", "english": "He’s focused on his objective to start a nonprofit.", "thai": "เขาจดจ่อกับวัตถุประสงค์ในการเริ่มองค์กรไม่แสวงผลกำไร"}
{"word": "objective", "english": "The objective is to make our product more affordable.", "thai": "วัตถุประสงค์คือการทำให้ผลิตภัณฑ์ของเราราคาไม่แพงมากขึ้น"}
{"word": "objective", "english": "She achieved her objective of getting a promotion.", "thai": "เธอบรรลุวัตถุประสงค์ในการเลื่อนตำแหน่ง"}
{"word": "objective", "english": "The objective of the event is to foster networking.", "thai": "วัตถุประสงค์ของงานคือการส่งเสริมการสร้างเครือข่าย"}
{"word": "objective", "english": "Our objective is to improve online engagement.", "thai": "วัตถุประสงค์ของเราคือการปรับปรุงการมีส่วนร่วมทางออนไลน์"}
{"word": "objective", "english": "The objective was to redesign the website.", "thai": "วัตถุประสงค์คือการออกแบบเว็บไซต์ใหม่"}
{"word": "objective", "english": "What’s the objective of this research project?", "thai": "วัตถุประสงค์ของโครงการวิจัยนี้คืออะไร?"}
{"word": "objective", "english": "His objective is to travel to 10 countries.", "thai": "วัตถุประสงค์ของเขาคือการเดินทางไป 10 ประเทศ"}
{"word": "objective", "english": "The objective is to train new employees faster.", "thai": "วัตถุประสงค์คือการฝึกอบรมพนักงานใหม่ให้เร็วขึ้น"}
{"word": "objective", "english": "She set an objective to meditate daily.", "thai": "เธอตั้งวัตถุประสงค์ว่าจะนั่งสมาธิทุกวัน"}
{"word": "objective", "english": "The objective of this strategy is to cut costs.", "thai": "วัตถุประสงค์ของกลยุทธ์นี้คือการลดต้นทุน"}
{"word": "objective", "english": "Our objective is to expand into new markets.", "thai": "วัตถุประสงค์ของเราคือการขยายสู่ตลาดใหม่"}
{"word": "objective", "english": "The objective was to improve team collaboration.", "thai": "วัตถุประสงค์คือการปรับปรุงการทำงานร่วมกันของทีม"}
{"word": "objective", "english": "Her objective is to master data analysis.", "thai": "วัตถุประสงค์ของเธอคือการเชี่ยวชาญการวิเคราะห์ข้อมูล"}
{"word": "objective", "english": "The objective of the program is to support startups.", "thai": "วัตถุประสงค์ของโปรแกรมคือการสนับสนุนสตาร์ทอัพ"}
{"word": "objective", "english": "My objective is to declutter my workspace.", "thai": "วัตถุประสงค์ของฉันคือการจัดระเบียบพื้นที่ทำงาน"}
{"word": "objective", "english": "The objective is to increase website traffic.", "thai": "วัตถุประสงค์คือการเพิ่มทราฟฟิกเว็บไซต์"}
{"word": "objective", "english": "He’s working toward his objective of becoming a chef.", "thai": "เขากำลังทำงานเพื่อวัตถุประสงค์ในการเป็นเชฟ"}
{"word": "objective", "english": "The objective of this task is to test the system.", "thai": "วัตถุประสงค์ของงานนี้คือการทดสอบระบบ"}
{"word": "objective", "english": "She’s on track to meet her fitness objective.", "thai": "เธอกำลังอยู่ในเส้นทางที่จะบรรลุวัตถุประสงค์ด้านฟิตเนส"}
{"word": "objective", "english": "The objective is to simplify the onboarding process.", "thai": "วัตถุประสงค์คือการทำให้กระบวนการต้อนรับพนักงานใหม่ง่ายขึ้น"}
{"word": "objective", "english": "What’s the objective of this marketing plan?", "thai": "วัตถุประสงค์ของแผนการตลาดนี้คืออะไร?"}
{"word": "objective", "english": "His objective is to retire early.", "thai": "วัตถุประสงค์ของเขาคือการเกษียณก่อนกำหนด"}
{"word": "objective", "english": "The objective was to enhance product quality.", "thai": "วัตถุประสงค์คือการปรับปรุงคุณภาพผลิตภัณฑ์"}
{"word": "objective", "english": "Her objective is to volunteer more this year.", "thai": "วัตถุประสงค์ของเธอคือการเป็นอาสาสมัครมากขึ้นในปีนี้"}
{"word": "objective", "english": "The objective of the study is to measure impact.", "thai": "วัตถุประสงค์ของการศึกษาคือการวัดผลกระทบ"}
{"word": "objective", "english": "Our objective is to build a stronger brand.", "thai": "วัตถุประสงค์ของเราคือการสร้างแบรนด์ที่แข็งแกร่งขึ้น"}
{"word": "objective", "english": "The objective is to foster a creative environment.", "thai": "วัตถุประสงค์คือการส่งเสริมสภาพแวดล้อมที่สร้างสรรค์"}
{"word": "objective", "english": "He set an objective to improve his coding skills.", "thai": "เขาตั้งวัตถุประสงค์เพื่อพัฒนาทักษะการเขียนโค้ด"}
{"word": "objective", "english": "The objective of this initiative is to empower youth.", "thai": "วัตถุประสงค์ของโครงการนี้คือการเสริมพลังให้เยาวชน"}
{"word": "objective", "english": "My objective is to spend more time outdoors.", "thai": "วัตถุประสงค์ของฉันคือการใช้เวลานอกบ้านมากขึ้น"}
{"word": "objective", "english": "The objective is to optimize our supply chain.", "thai": "วัตถุประสงค์คือการปรับปรุงห่วงโซ่อุปทานให้เหมาะสม"}
{"word": "objective", "english": "She’s committed to her objective of writing a book.", "thai": "เธอมุ่งมั่นในวัตถุประสงค์ในการเขียนหนังสือ"}
{"word": "objective", "english": "The objective was to increase social media engagement.", "thai": "วัตถุประสงค์คือการเพิ่มการมีส่วนร่วมบนโซเชียลมีเดีย"}
{"word": "objective", "english": "What’s the objective of this new software?", "thai": "วัตถุประสงค์ของซอฟต์แวร์ใหม่นี้คืออะไร?"}
{"word": "objective", "english": "His objective is to travel across Asia.", "thai": "วัตถุประสงค์ของเขาคือการเดินทางทั่วเอเชีย"}
{"word": "objective", "english": "The objective is to improve our response time.", "thai": "วัตถุประสงค์คือการปรับปรุงเวลาในการตอบสนอง"}
{"word": "objective", "english": "She set an objective to reduce her screen time.", "thai": "เธอตั้งวัตถุประสงค์เพื่อลดเวลาการใช้หน้าจอ"}
{"word": "objective", "english": "The objective of the event is to raise awareness.", "thai": "วัตถุประสงค์ของงานคือการสร้างความตระหนัก"}
{"word": "objective", "english": "Our objective is to enhance employee training.", "thai": "วัตถุประสงค์ของเราคือการปรับปรุงการฝึกอบรมพนักงาน"}
{"word": "objective", "english": "The objective was to launch a new product line.", "thai": "วัตถุประสงค์คือการเปิดตัวสายผลิตภัณฑ์ใหม่"}
{"word": "objective", "english": "Her objective is to improve her time management.", "thai": "วัตถุประสงค์ของเธอคือการพัฒนาการบริหารเวลา"}
{"word": "objective", "english": "The objective of this course is to teach leadership.", "thai": "วัตถุประสงค์ของหลักสูตรนี้คือการสอนความเป็นผู้นำ"}
{"word": "objective", "english": "My objective is to adopt a healthier lifestyle.", "thai": "วัตถุประสงค์ของฉันคือการใช้ชีวิตอย่างมีสุขภาพดีขึ้น"}
{"word": "objective", "english": "The objective is to make our services more accessible.", "thai": "วัตถุประสงค์คือการทำให้บริการของเราเข้าถึงได้ง่ายขึ้น"}
{"word": "objective", "english": "He’s working toward his objective of becoming a teacher.", "thai": "เขากำลังทำงานเพื่อวัตถุประสงค์ในการเป็นครู"}
{"word": "objective", "english": "The objective was to improve customer retention.", "thai": "วัตถุประสงค์คือการปรับปรุงการรักษาลูกค้า"}
{"word": "objective", "english": "She’s focused on her objective to run a 10K.", "thai": "เธอจดจ่อกับวัตถุประสงค์ในการวิ่ง 10 กิโลเมตร"}
{"word": "objective", "english": "The objective of this plan is to boost productivity.", "thai": "วัตถุประสงค์ของแผนนี้คือการเพิ่มผลผลิต"}
{"word": "objective", "english": "Our objective is to create a sustainable business model.", "thai": "วัตถุประสงค์ของเราคือการสร้างโมเดลธุรกิจที่ยั่งยืน"}
{"word": "objective", "english": "What’s the objective of this team-building activity?", "thai": "วัตถุประสงค์ของกิจกรรมสร้างทีมนี้คืออะไร?"}
{"word": "objective", "english": "His objective is to pay off his student loans.", "thai": "วัตถุประสงค์ของเขาคือการชำระหนี้เงินกู้เพื่อการศึกษา"}
{"word": "objective", "english": "The objective is to improve our brand’s visibility.", "thai": "วัตถุประสงค์คือการปรับปรุงการมองเห็นของแบรนด์"}
{"word": "objective", "english": "She set an objective to learn graphic design.", "thai": "เธอตั้งวัตถุประสงค์เพื่อเรียนรู้การออกแบบกราฟิก"}
{"word": "objective", "english": "The objective of the initiative is to support local talent.", "thai": "วัตถุประสงค์ของโครงการคือการสนับสนุนความสามารถในท้องถิ่น"}
{"word": "performance", "english": "Her performance in the play was outstanding.", "thai": "การแสดงของเธอในละครนั้นยอดเยี่ยม"}
{"word": "performance", "english": "We’re reviewing his performance from last quarter.", "thai": "เรากำลังตรวจสอบผลงานของเขาในไตรมาสที่แล้ว"}
{"word": "performance", "english": "The car’s performance is better than expected.", "thai": "สมรรถนะของรถดีกว่าที่คาดไว้"}
{"word": "performance", "english": "What did you think of the band’s performance?", "thai": "คุณคิดอย่างไรกับการแสดงของวงดนตรี?"}
{"word": "performance", "english": "His performance in the game won us the match.", "thai": "ผลงานของเขาในเกมทำให้เราชนะการแข่งขัน"}
{"word": "performance", "english": "The team’s performance has improved this season.", "thai": "ผลงานของทีมดีขึ้นในฤดูกาลนี้"}
{"word": "performance", "english": "I’m disappointed with my performance on the test.", "thai": "ฉันผิดหวังกับผลงานของตัวเองในการสอบ"}
{"word": "performance", "english": "The company’s stock performance is strong.", "thai": "ผลงานของหุ้นบริษัทแข็งแกร่ง"}
{"word": "performance", "english": "She gave a stellar performance at the concert.", "thai": "เธอแสดงได้อย่างยอดเยี่ยมในคอนเสิร์ต"}
{"word": "performance", "english": "We need to boost the app’s performance.", "thai": "เราต้องปรับปรุงสมรรถนะของแอป"}
{"word": "performance", "english": "His performance review is scheduled for next week.", "thai": "การประเมินผลงานของเขาจะมีขึ้นในสัปดาห์หน้า"}
{"word": "performance", "english": "The dancer’s performance captivated the audience.", "thai": "การแสดงของนักเต้นดึงดูดผู้ชม"}
{"word": "performance", "english": "The laptop’s performance is slowing down.", "thai": "สมรรถนะของแล็ปท็อปเริ่มช้าลง"}
{"word": "performance", "english": "Her performance in the interview was impressive.", "thai": "ผลงานของเธอในการสัมภาษณ์น่าประทับใจ"}
{"word": "performance", "english": "The team’s performance was lackluster this time.", "thai": "ผลงานของทีมครั้งนี้ค่อนข้างน่าผิดหวัง"}
{"word": "performance", "english": "I’m working on improving my work performance.", "thai": "ฉันกำลังพยายามปรับปรุงผลงานการทำงาน"}
{"word": "performance", "english": "The actor’s performance brought tears to my eyes.", "thai": "การแสดงของนักแสดงทำให้ฉันน้ำตาคลอ"}
{"word": "performance", "english": "We’re analyzing the system’s performance data.", "thai": "เรากำลังวิเคราะห์ข้อมูลสมรรถนะของระบบ"}
{"word": "performance", "english": "His performance in the race was record-breaking.", "thai": "ผลงานของเขาในการแข่งขันทำลายสถิติ"}
{"word": "performance", "english": "The software update improved performance significantly.", "thai": "การอัปเดตซอฟต์แวร์ช่วยปรับปรุงสมรรถนะอย่างมาก"}
{"word": "performance", "english": "She’s nervous about her performance in the recital.", "thai": "เธอกังวลเกี่ยวกับการแสดงของเธอในงานแสดงดนตรี"}
{"word": "performance", "english": "The company’s performance exceeded expectations.", "thai": "ผลงานของบริษัทเกินความคาดหมาย"}
{"word": "performance", "english": "His performance as team leader was inspiring.", "thai": "ผลงานของเขาในฐานะผู้นำทีมสร้างแรงบันดาลใจ"}
{"word": "performance", "english": "The phone’s battery performance is excellent.", "thai": "สมรรถนะแบตเตอรี่ของโทรศัพท์ยอดเยี่ยม"}
{"word": "performance", "english": "Her performance on the project earned her a promotion.", "thai": "ผลงานของเธอในโปรเจกต์ทำให้เธอได้เลื่อนตำแหน่ง"}
{"word": "performance", "english": "The play’s performance got a standing ovation.", "thai": "การแสดงละครได้รับการยืนปรบมือ"}
{"word": "performance", "english": "We’re tracking the team’s performance metrics.", "thai": "เรากำลังติดตามตัวชี้วัดผลงานของทีม"}
{"word": "performance", "english": "His performance in class has been inconsistent.", "thai": "ผลงานของเขาในชั้นเรียนไม่สม่ำเสมอ"}
{"word": "performance", "english": "The car’s performance on the track was flawless.", "thai": "สมรรถนะของรถในสนามแข่งนั้นไร้ที่ติ"}
{"word": "performance", "english": "She’s practicing for her piano performance.", "thai": "เธอกำลังฝึกซ้อมสำหรับการแสดงเปียโน"}
{"word": "performance", "english": "The fund’s performance has been steady this year.", "thai": "ผลงานของกองทุนคงที่ในปีนี้"}
{"word": "performance", "english": "His performance in the debate was persuasive.", "thai": "ผลงานของเขาในการโต้วาทีนั้นโน้มน้าวใจ"}
{"word": "performance", "english": "The app’s performance needs optimization.", "thai": "สมรรถนะของแอปต้องได้รับการปรับปรุง"}
{"word": "performance", "english": "Her performance in the audition was amazing.", "thai": "การแสดงของเธอในการออดิชันนั้นน่าทึ่ง"}
{"word": "performance", "english": "We’re evaluating employee performance annually.", "thai": "เรากำลังประเมินผลงานของพนักงานทุกปี"}
{"word": "performance", "english": "The team’s performance in the finals was epic.", "thai": "ผลงานของทีมในรอบชิงชนะเลิศนั้นยิ่งใหญ่"}
{"word": "performance", "english": "The device’s performance is top-notch.", "thai": "สมรรถนะของอุปกรณ์นั้นยอดเยี่ยม"}
{"word": "performance", "english": "His performance at work has been slipping.", "thai": "ผลงานของเขาที่ทำงานเริ่มแย่ลง"}
{"word": "performance", "english": "The singer’s performance was unforgettable.", "thai": "การแสดงของนักร้องนั้นน่าจดจำ"}
{"word": "performance", "english": "We’re optimizing the website’s performance.", "thai": "เรากำลังปรับปรุงสมรรถนะของเว็บไซต์"}
{"word": "performance", "english": "Her performance in the exam was exceptional.", "thai": "ผลงานของเธอในการสอบนั้นยอดเยี่ยม"}
{"word": "performance", "english": "The team’s performance needs a boost.", "thai": "ผลงานของทีมต้องการการกระตุ้น"}
{"word": "performance", "english": "His performance in the meeting impressed the boss.", "thai": "ผลงานของเขาในการประชุมทำให้เจ้านายประทับใจ"}
{"word": "performance", "english": "The show’s performance sold out in hours.", "thai": "การแสดงนั้นขายบัตรหมดภายในไม่กี่ชั่วโมง"}
{"word": "performance", "english": "The engine’s performance is incredible.", "thai": "สมรรถนะของเครื่องยนต์นั้นน่าทึ่ง"}
{"word": "performance", "english": "She’s preparing for her dance performance.", "thai": "เธอกำลังเตรียมตัวสำหรับการแสดงเต้นรำ"}
{"word": "performance", "english": "His performance metrics are above average.", "thai": "ตัวชี้วัดผลงานของเขาสูงกว่าค่าเฉลี่ย"}
{"word": "performance", "english": "The play’s performance was a huge success.", "thai": "การแสดงละครนั้นประสบความสำเร็จอย่างมาก"}
{"word": "performance", "english": "The system’s performance crashed during the test.", "thai": "สมรรถนะของระบบล่มระหว่างการทดสอบ"}
{"word": "performance", "english": "Her performance in the role was critically acclaimed.", "thai": "การแสดงของเธอในบทบาทนั้นได้รับคำชมอย่างมาก"}
{"word": "performance", "english": "We’re working to improve server performance.", "thai": "เรากำลังทำงานเพื่อปรับปรุงสมรรถนะของเซิร์ฟเวอร์"}
{"word": "performance", "english": "His performance in the tournament was stellar.", "thai": "ผลงานของเขาในการแข่งขันนั้นยอดเยี่ยม"}
{"word": "performance", "english": "The app’s performance is lagging on older devices.", "thai": "สมรรถนะของแอปช้าลงบนอุปกรณ์รุ่นเก่า"}
{"word": "performance", "english": "She delivered a powerful performance in the speech.", "thai": "เธอแสดงได้อย่างทรงพลังในการกล่าวสุนทรพจน์"}
{"word": "performance", "english": "The team’s performance was reviewed by the coach.", "thai": "ผลงานของทีมได้รับการตรวจสอบโดยโค้ช"}
{"word": "performance", "english": "The car’s performance on hills is impressive.", "thai": "สมรรถนะของรถบนทางลาดชันน่าประทับใจ"}
{"word": "performance", "english": "Her performance in the choir was beautiful.", "thai": "การแสดงของเธอในคณะนักร้องประสานเสียงนั้นสวยงาม"}
{"word": "performance", "english": "We’re monitoring the stock’s performance daily.", "thai": "เรากำลังติดตามผลงานของหุ้นทุกวัน"}
{"word": "performance", "english": "His performance in the presentation was confident.", "thai": "ผลงานของเขาในการนำเสนอนั้นมั่นใจ"}
{"word": "performance", "english": "The software’s performance needs an upgrade.", "thai": "สมรรถนะของซอฟต์แวร์ต้องการการอัปเกรด"}
{"word": "performance", "english": "The actor’s performance stole the show.", "thai": "การแสดงของนักแสดงนั้นโดดเด่นที่สุด"}
{"word": "performance", "english": "Her performance in the project was outstanding.", "thai": "ผลงานของเธอในโปรเจกต์นั้นยอดเยี่ยม"}
{"word": "performance", "english": "The team’s performance in practice was solid.", "thai": "ผลงานของทีมในการฝึกซ้อมนั้นแข็งแกร่ง"}
{"word": "performance", "english": "The phone’s performance is better after the update.", "thai": "สมรรถนะของโทรศัพท์ดีขึ้นหลังการอัปเดต"}
{"word": "performance", "english": "His performance in the play was hilarious.", "thai": "การแสดงของเขาในละครนั้นตลกมาก"}
{"word": "performance", "english": "We’re analyzing the campaign’s performance data.", "thai": "เรากำลังวิเคราะห์ข้อมูลผลงานของแคมเปญ"}
{"word": "performance", "english": "Her performance in the race earned her a medal.", "thai": "ผลงานของเธอในการแข่งขันทำให้ได้เหรียญ"}
{"word": "performance", "english": "The system’s performance is being optimized.", "thai": "สมรรถนะของระบบกำลังได้รับการปรับปรุง"}
{"word": "performance", "english": "His performance in the exam was disappointing.", "thai": "ผลงานของเขาในการสอบนั้นน่าผิดหวัง"}
{"word": "performance", "english": "The band’s performance was electric last night.", "thai": "การแสดงของวงเมื่อคืนนี้เต็มไปด้วยพลัง"}
{"word": "performance", "english": "We’re improving the website’s performance speed.", "thai": "เรากำลังปรับปรุงความเร็วสมรรถนะของเว็บไซต์"}
{"word": "performance", "english": "Her performance in the interview landed her the job.", "thai": "ผลงานของเธอในการสัมภาษณ์ทำให้เธอได้งาน"}
{"word": "performance", "english": "The team’s performance was affected by injuries.", "thai": "ผลงานของทีมได้รับผลกระทบจากอาการบาดเจ็บ"}
{"word": "performance", "english": "The device’s performance is reliable under pressure.", "thai": "สมรรถนะของอุปกรณ์นั้นน่าเชื่อถือภายใต้ความกดดัน"}
{"word": "performance", "english": "She’s rehearsing for her theater performance.", "thai": "เธอกำลังซ้อมสำหรับการแสดงละคร"}
{"word": "performance", "english": "His performance in sales has been exceptional.", "thai": "ผลงานของเขาในด้านยอดขายนั้นยอดเยี่ยม"}
{"word": "performance", "english": "The car’s performance in bad weather is great.", "thai": "สมรรถนะของรถในสภาพอากาศเลวร้ายนั้นยอดเยี่ยม"}
{"word": "performance", "english": "Her performance in the recital was flawless.", "thai": "การแสดงของเธอในงานแสดงดนตรีนั้นไร้ที่ติ"}
{"word": "performance", "english": "We’re assessing the program’s performance monthly.", "thai": "เรากำลังประเมินผลงานของโปรแกรมทุกเดือน"}
{"word": "performance", "english": "His performance in the game was clutch.", "thai": "ผลงานของเขาในเกมนั้นสำคัญมาก"}
{"word": "performance", "english": "The app’s performance is smooth on new devices.", "thai": "สมรรถนะของแอปนั้นลื่นไหลบนอุปกรณ์ใหม่"}
{"word": "performance", "english": "Her performance in the debate was compelling.", "thai": "การแสดงของเธอในการโต้วาทีนั้นน่าดึงดูด"}
{"word": "performance", "english": "The team’s performance needs more consistency.", "thai": "ผลงานของทีมต้องการความสม่ำเสมอมากกว่านี้"}
{"word": "performance", "english": "The system’s performance is under review.", "thai": "สมรรถนะของระบบกำลังอยู่ในระหว่างการตรวจสอบ"}
{"word": "performance", "english": "His performance in the role was award-worthy.", "thai": "การแสดงของเขาในบทบาทนั้นสมควรได้รับรางวัล"}
{"word": "performance", "english": "We’re upgrading hardware to boost performance.", "thai": "เรากำลังอัปเกรดฮาร์ดแวร์เพื่อเพิ่มสมรรถนะ"}
{"word": "performance", "english": "Her performance in the competition was inspiring.", "thai": "ผลงานของเธอในการแข่งขันนั้นสร้างแรงบันดาลใจ"}
{"word": "performance", "english": "The company’s financial performance is solid.", "thai": "ผลงานทางการเงินของบริษัทนั้นแข็งแกร่ง"}
{"word": "performance", "english": "His performance in training has been excellent.", "thai": "ผลงานของเขาในการฝึกซ้อมนั้นยอดเยี่ยม"}
{"word": "performance", "english": "The singer’s live performance was breathtaking.", "thai": "การแสดงสดของนักร้องนั้นน่าตื่นตะลึง"}
{"word": "performance", "english": "We’re tweaking the app to improve performance.", "thai": "เรากำลังปรับแต่งแอปเพื่อปรับปรุงสมรรถนะ"}
{"word": "performance", "english": "Her performance in the class was top-tier.", "thai": "ผลงานของเธอในชั้นเรียนนั้นอยู่ในระดับสูง"}
{"word": "performance", "english": "The team’s performance in the playoffs was epic.", "thai": "ผลงานของทีมในรอบเพลย์ออฟนั้นยิ่งใหญ่"}
{"word": "performance", "english": "The device’s performance is best in its class.", "thai": "สมรรถนะของอุปกรณ์นั้นดีที่สุดในประเภท"}
{"word": "performance", "english": "His performance in the project was commendable.", "thai": "ผลงานของเขาในโปรเจกต์นั้นน่าสรรเสริญ"}
{"word": "performance", "english": "The play’s performance drew a huge crowd.", "thai": "การแสดงละครนั้นดึงดูดผู้ชมจำนวนมาก"}
{"word": "performance", "english": "We’re monitoring the system’s performance closely.", "thai": "เรากำลังติดตามสมรรถนะของระบบอย่างใกล้ชิด"}
{"word": "performance", "english": "Her performance in the audition was perfect.", "thai": "การแสดงของเธอในการออดิชันนั้นสมบูรณ์แบบ"}
{"word": "travel", "english": "I love to travel to new countries every year.", "thai": "ฉันรักที่จะเดินทางไปยังประเทศใหม่ๆ ทุกปี"}
{"word": "travel", "english": "We plan to travel across Europe next summer.", "thai": "เราวางแผนที่จะเดินทางไปทั่วยุโรปในฤดูร้อนหน้า"}
{"word": "travel", "english": "Do you prefer to travel by train or plane?", "thai": "คุณชอบเดินทางโดยรถไฟหรือเครื่องบินมากกว่ากัน?"}
{"word": "travel", "english": "She decided to travel alone to find herself.", "thai": "เธอตัดสินใจเดินทางคนเดียวเพื่อค้นหาตัวเอง"}
{"word": "travel", "english": "Travel can be expensive if you don’t plan ahead.", "thai": "การเดินทางอาจมีค่าใช้จ่ายสูงถ้าคุณไม่วางแผนล่วงหน้า"}
{"word": "travel", "english": "He’s too busy to travel this month.", "thai": "เขายุ่งเกินกว่าจะเดินทางในเดือนนี้"}
{"word": "travel", "english": "Let’s travel to the beach for the weekend.", "thai": "ไปเดินทางไปชายหาดกันในสุดสัปดาห์นี้เถอะ"}
{"word": "travel", "english": "I need a new suitcase for my travel plans.", "thai": "ฉันต้องการกระเป๋าเดินใบใหม่สำหรับแผนการเดินทางของฉัน"}
{"word": "travel", "english": "They travel for work almost every week.", "thai": "พวกเขาเดินทางเพื่อทำงานเกือบทุกสัปดาห์"}
{"word": "travel", "english": "Travel broadens your perspective on life.", "thai": "การเดินทางทำให้มุมมองต่อชีวิตของคุณกว้างขึ้น"}
{"word": "travel", "english": "We should travel light to save on baggage fees.", "thai": "เราควรเดินทางแบบสัมภาระน้อยเพื่อประหยัดค่าธรรมเนียมกระเป๋า"}
{"word": "travel", "english": "Her dream is to travel the world on a yacht.", "thai": "ความฝันของเธอคือการเดินทางรอบโลกด้วยเรือยอชต์"}
{"word": "travel", "english": "I don’t travel often, but I enjoy it when I do.", "thai": "ฉันไม่ค่อยเดินทางบ่อย แต่ฉันสนุกเมื่อได้เดินทาง"}
{"word": "travel", "english": "He wrote a blog about his travel adventures.", "thai": "เขาเขียนบล็อกเกี่ยวกับการผจญภัยในการเดินทางของเขา"}
{"word": "travel", "english": "Travel restrictions made our plans complicated.", "thai": "ข้อจำกัดการเดินทางทำให้แผนของเรายุ่งยาก"}
{"word": "travel", "english": "She uses a travel app to book her flights.", "thai": "เธอใช้แอปเดินทางเพื่อจองตั๋วเครื่องบิน"}
{"word": "travel", "english": "We love to travel to historical sites.", "thai": "เรารักที่จะเดินทางไปยังสถานที่ทางประวัติศาสตร์"}
{"word": "travel", "english": "Travel safely, and let me know when you arrive!", "thai": "เดินทางอย่างปลอดภัย และแจ้งให้ฉันรู้เมื่อคุณถึง!"}
{"word": "travel", "english": "I can’t wait to travel with my best friend.", "thai": "ฉันรอไม่ไหวที่จะเดินทางกับเพื่อนสนิทของฉัน"}
{"word": "travel", "english": "They offer travel insurance for unexpected delays.", "thai": "พวกเขาเสนอประกันการเดินทางสำหรับความล่าช้าที่ไม่คาดคิด"}
{"word": "travel", "english": "Travel blogs inspire me to visit new places.", "thai": "บล็อกการเดินทางสร้างแรงบันดาลใจให้ฉันไปเยือนสถานที่ใหม่ๆ"}
{"word": "travel", "english": "He needs a visa to travel to that country.", "thai": "เขาต้องการวีซ่าเพื่อเดินทางไปยังประเทศนั้น"}
{"word": "travel", "english": "We travel to see our family every holiday.", "thai": "เราเดินทางไปหาครอบครัวทุกวันหยุด"}
{"word": "travel", "english": "Her job requires her to travel internationally.", "thai": "งานของเธอต้องการให้เธอเดินทางไปต่างประเทศ"}
{"word": "travel", "english": "I want to travel somewhere tropical this year.", "thai": "ฉันอยากเดินทางไปที่ไหนสักแห่งที่มีอากาศร้อนในปีนี้"}
{"word": "travel", "english": "Travel agents can help plan your trip.", "thai": "ตัวแทนการเดินทางสามารถช่วยวางแผนการเดินทางของคุณ"}
{"word": "travel", "english": "We always travel with a first-aid kit.", "thai": "เราเดินทางพร้อมชุดปฐมพยาบาลเสมอ"}
{"word": "travel", "english": "She loves to travel with her camera.", "thai": "เธอรักที่จะเดินทางพร้อมกล้องถ่ายรูปของเธอ"}
{"word": "travel", "english": "Travel can be exhausting but so rewarding.", "thai": "การเดินทางอาจเหนื่อยแต่ก็ให้ผลตอบแทนที่คุ้มค่า"}
{"word": "travel", "english": "They travel to attend music festivals.", "thai": "พวกเขาเดินทางเพื่อเข้าร่วมงานเทศกาลดนตรี"}
{"word": "travel", "english": "I don’t have the budget to travel right now.", "thai": "ตอนนี้ฉันไม่มีงบประมาณที่จะเดินทาง"}
{"word": "travel", "english": "He likes to travel off the beaten path.", "thai": "เขาชอบเดินทางไปในที่ที่ไม่ค่อยมีคนไป"}
{"word": "travel", "english": "Travel guides help us find hidden gems.", "thai": "คู่มือการเดินทางช่วยเราค้นหาสถานที่ลับๆ"}
{"word": "travel", "english": "We need to travel early to avoid traffic.", "thai": "เราต้องเดินทางแต่เช้าเพื่อหลีกเลี่ยงการจราจร"}
{"word": "travel", "english": "She’s saving money to travel to Asia.", "thai": "เธอกำลังเก็บเงินเพื่อเดินทางไปเอเชีย"}
{"word": "travel", "english": "Travel teaches you to adapt to new situations.", "thai": "การเดินทางสอนให้คุณปรับตัวเข้ากับสถานการณ์ใหม่ๆ"}
{"word": "travel", "english": "I always pack snacks when I travel.", "thai": "ฉันมักจะแพ็คของว่างเมื่อเดินทาง"}
{"word": "travel", "english": "They travel to volunteer in remote areas.", "thai": "พวกเขาเดินทางเพื่อไปเป็นอาสาสมัครในพื้นที่ห่างไกล"}
{"word": "travel", "english": "Travel photos bring back so many memories.", "thai": "ภาพถ่ายการเดินทางทำให้หวนนึกถึงความทรงจำมากมาย"}
{"word": "travel", "english": "He forgot his passport and couldn’t travel.", "thai": "เขาลืมพาสปอร์ตและไม่สามารถเดินทางได้"}
{"word": "travel", "english": "We travel to escape the daily grind.", "thai": "เราเดินทางเพื่อหนีจากความวุ่นวายในชีวิตประจำวัน"}
{"word": "travel", "english": "Travel makes me appreciate home more.", "thai": "การเดินทางทำให้ฉันรู้สึกซาบซึ้งในบ้านมากขึ้น"}
{"word": "travel", "english": "She wants to travel to every continent.", "thai": "เธออยากเดินทางไปทุกทวีป"}
{"word": "travel", "english": "We travel to try new foods and cuisines.", "thai": "เราเดินทางเพื่อลองชิมอาหารและอาหารประเภทใหม่ๆ"}
{"word": "travel", "english": "Travel warnings were issued for that region.", "thai": "มีการออกคำเตือนการเดินทางสำหรับภูมิภาคนั้น"}
{"word": "travel", "english": "He loves to travel with his dog.", "thai": "เขารักที่จะเดินทางพร้อมกับสุนัขของเขา"}
{"word": "travel", "english": "I need to renew my passport to travel.", "thai": "ฉันต้องต่ออายุพาสปอร์ตเพื่อเดินทาง"}
{"word": "travel", "english": "They travel to compete in sports events.", "thai": "พวกเขาเดินทางเพื่อแข่งขันในงานกีฬา"}
{"word": "travel", "english": "Travel can teach you about different cultures.", "thai": "การเดินทางสามารถสอนคุณเกี่ยวกับวัฒนธรรมที่แตกต่างกัน"}
{"word": "travel", "english": "We travel to visit national parks.", "thai": "เราเดินทางเพื่อไปเยือนอุทยานแห่งชาติ"}
{"word": "travel", "english": "She’s excited to travel with her kids.", "thai": "เธอตื่นเต้นที่จะเดินทางพร้อมกับลูกๆ ของเธอ"}
{"word": "travel", "english": "Travel plans got canceled due to the storm.", "thai": "แผนการเดินทางถูกยกเลิกเพราะพายุ"}
{"word": "travel", "english": "I always read books when I travel.", "thai": "ฉันมักจะอ่านหนังสือเมื่อเดินทาง"}
{"word": "travel", "english": "They travel to attend family reunions.", "thai": "พวกเขาเดินทางเพื่อเข้าร่วมงานรวมญาติ"}
{"word": "travel", "english": "Travel is more fun with good company.", "thai": "การเดินทางสนุกยิ่งขึ้นเมื่อมีเพื่อนร่วมทางที่ดี"}
{"word": "travel", "english": "He uses miles to travel for free.", "thai": "เขาใช้ไมล์เพื่อเดินทางฟรี"}
{"word": "travel", "english": "We travel to see live concerts.", "thai": "เราเดินทางเพื่อ去看คอนเสิร์ตสด"}
{"word": "travel", "english": "Travel can be stressful with tight schedules.", "thai": "การเดินทางอาจเครียดเมื่อมีตารางเวลาที่แน่น"}
{"word": "travel", "english": "She bought a travel pillow for the flight.", "thai": "เธอซื้อหมอนเดินทางสำหรับการบิน"}
{"word": "travel", "english": "They travel to ski in the mountains.", "thai": "พวกเขาเดินทางไปเล่นสกีบนภูเขา"}
{"word": "travel", "english": "I want to travel somewhere cold this winter.", "thai": "ฉันอยากเดินทางไปที่ไหนสักแห่งที่หนาวในฤดูหนาวนี้"}
{"word": "travel", "english": "Travel agencies offer great package deals.", "thai": "บริษัทท่องเที่ยวเสนอแพ็คเกจดีลที่ยอดเยี่ยม"}
{"word": "travel", "english": "He loves to travel by motorcycle.", "thai": "เขารักที่จะเดินทางด้วยมอเตอร์ไซค์"}
{"word": "travel", "english": "We travel to explore new hiking trails.", "thai": "เราเดินทางเพื่อสำรวจเส้นทางเดินป่าใหม่ๆ"}
{"word": "travel", "english": "Travel journals help me remember my trips.", "thai": "สมุดบันทึกการเดินทางช่วยให้ฉันจำการเดินทางของฉันได้"}
{"word": "travel", "english": "She needs a travel adapter for her charger.", "thai": "เธอต้องการอะแดปเตอร์เดินทางสำหรับที่ชาร์จของเธอ"}
{"word": "travel", "english": "They travel to attend art exhibitions.", "thai": "พวกเขาเดินทางเพื่อเข้าร่วมนิทรรศการศิลปะ"}
{"word": "travel", "english": "Travel makes you more open-minded.", "thai": "การเดินทางทำให้คุณมีใจที่เปิดกว้างมากขึ้น"}
{"word": "travel", "english": "I always check reviews before I travel.", "thai": "ฉันมักจะตรวจสอบรีวิวก่อนเดินทาง"}
{"word": "travel", "english": "We travel to celebrate our anniversary.", "thai": "เราเดินทางเพื่อฉลองวันครบรอบของเรา"}
{"word": "travel", "english": "Travel insurance saved us last trip.", "thai": "ประกันการเดินทางช่วยเราครั้งล่าสุด"}
{"word": "travel", "english": "He wants to travel by train across the country.", "thai": "เขาอยากเดินทางด้วยรถไฟข้ามประเทศ"}
{"word": "travel", "english": "We travel to visit famous landmarks.", "thai": "เราเดินทางเพื่อไปเยือนสถานที่สำคัญที่มีชื่อเสียง"}
{"word": "travel", "english": "She’s nervous about her first solo travel.", "thai": "เธอกังวลเกี่ยวกับการเดินทางคนเดียวครั้งแรกของเธอ"}
{"word": "travel", "english": "Travel apps make planning so much easier.", "thai": "แอปการเดินทางทำให้การวางแผนง่ายขึ้นมาก"}
{"word": "travel", "english": "They travel to chase warm weather.", "thai": "พวกเขาเดินทางเพื่อตามหาอากาศอบอุ่น"}
{"word": "travel", "english": "I always bring a hat when I travel.", "thai": "ฉันมักจะนำหมวกไปด้วยเมื่อเดินทาง"}
{"word": "travel", "english": "Travel can inspire new career ideas.", "thai": "การเดินทางสามารถสร้างแรงบันดาลใจให้กับแนวคิดอาชีพใหม่ๆ"}
{"word": "travel", "english": "We travel to attend cultural festivals.", "thai": "เราเดินทางเพื่อเข้าร่วมงานเทศกาลวัฒนธรรม"}
{"word": "travel", "english": "She loves to travel with a small backpack.", "thai": "เธอรักที่จะเดินทางพร้อมกระเป๋าเป้ใบเล็ก"}
{"word": "travel", "english": "Travel helps you make lifelong friends.", "thai": "การเดินทางช่วยให้คุณได้เพื่อนตลอดชีวิต"}
{"word": "travel", "english": "He’s planning to travel for a gap year.", "thai": "เขากำลังวางแผนที่จะเดินทางในช่วงปีว่าง"}
{"word": "travel", "english": "We travel to see wildlife in their habitats.", "thai": "เราเดินทางเพื่อ去看สัตว์ป่าในถิ่นที่อยู่ของมัน"}
{"word": "travel", "english": "Travel deals are hard to resist sometimes.", "thai": "ดีลการเดินทางบางครั้งก็ยากที่จะปฏิเสธ"}
{"word": "travel", "english": "I always learn new words when I travel.", "thai": "ฉันมักจะเรียนรู้คำศัพท์ใหม่ๆ เมื่อเดินทาง"}
{"word": "travel", "english": "They travel to study ancient ruins.", "thai": "พวกเขาเดินทางเพื่อศึกษาซากปรักหักพังโบราณ"}
{"word": "travel", "english": "Travel makes every day an adventure.", "thai": "การเดินทางทำให้ทุกวันเป็นการผจญภัย"}
{"word": "travel", "english": "She’s writing a book about her travel experiences.", "thai": "เธอกำลังเขียนหนังสือเกี่ยวกับประสบการณ์การเดินทางของเธอ"}
{"word": "travel", "english": "We travel to escape the cold winter.", "thai": "เราเดินทางเพื่อหนีจากฤดูหนาวที่หนาวเย็น"}
{"word": "travel", "english": "Travel etiquette varies by country.", "thai": "มารยาทในการเดินทางแตกต่างกันไปในแต่ละประเทศ"}
{"word": "travel", "english": "He loves to travel with his guitar.", "thai": "เขารักที่จะเดินทางพร้อมกับกีตาร์ของเขา"}
{"word": "travel", "english": "I need a travel buddy for this trip.", "thai": "ฉันต้องการเพื่อนร่วมเดินทางสำหรับทริปนี้"}
{"word": "travel", "english": "They travel to photograph landscapes.", "thai": "พวกเขาเดินทางเพื่อถ่ายภาพทิวทัศน์"}
{"word": "travel", "english": "Travel is my favorite way to relax.", "thai": "การเดินทางเป็นวิธีที่ฉันชอบที่สุดในการผ่อนคลาย"}
{"word": "travel", "english": "We travel to visit sacred sites.", "thai": "เราเดินทางเพื่อไปเยือนสถานที่ศักดิ์สิทธิ์"}
{"word": "travel", "english": "She’s learning Spanish to travel to Mexico.", "thai": "เธอกำลังเรียนภาษาสเปนเพื่อเดินทางไปเม็กซิโก"}
{"word": "travel", "english": "Travel is the best way to learn history.", "thai": "การเดินทางเป็นวิธีที่ดีที่สุดในการเรียนรู้ประวัติศาสตร์"}
{"word": "travel", "english": "I always pack light when I travel.", "thai": "ฉันมักจะแพ็คของเบาๆ เมื่อเดินทาง"}
{"word": "itinerary", "english": "Can you send me the itinerary for our trip?", "thai": "คุณส่งกำหนดการเดินทางของเราให้ฉันได้ไหม?"}
{"word": "itinerary", "english": "Our itinerary includes a visit to the Grand Canyon.", "thai": "กำหนดการของเรารวมถึงการเยี่ยมชมแกรนด์แคนยอน"}
{"word": "itinerary", "english": "She’s still finalizing the itinerary for next week.", "thai": "เธอยังคงปรับแต่งกำหนดการสำหรับสัปดาห์หน้า"}
{"word": "itinerary", "english": "The travel agent gave us a detailed itinerary.", "thai": "ตัวแทนท่องเที่ยวให้กำหนดการเดินทางที่ละเอียดกับเรา"}
{"word": "itinerary", "english": "I lost the itinerary, so I’m not sure where we’re going.", "thai": "ฉันทำกำหนดการหาย เลยไม่แน่ใจว่าเราจะไปไหน"}
{"word": "itinerary", "english": "Let’s stick to the itinerary to save time.", "thai": "เราควรยึดตามกำหนดการเพื่อประหยัดเวลา"}
{"word": "itinerary", "english": "His itinerary is packed with business meetings.", "thai": "กำหนดการของเขาเต็มไปด้วยการประชุมธุรกิจ"}
{"word": "itinerary", "english": "We need to adjust our itinerary due to the weather.", "thai": "เราต้องปรับกำหนดการเพราะสภาพอากาศ"}
{"word": "itinerary", "english": "The itinerary says we’re visiting Paris first.", "thai": "กำหนดการบอกว่าเราจะไปปารีสก่อน"}
{"word": "itinerary", "english": "She planned a flexible itinerary for the group.", "thai": "เธอวางแผนกำหนดการที่ยืดหยุ่นสำหรับกลุ่ม"}
{"word": "itinerary", "english": "I checked the itinerary, and we’re on schedule.", "thai": "ฉันตรวจกำหนดการแล้ว และเรายังอยู่ในตาราง"}
{"word": "itinerary", "english": "The tour guide shared the itinerary with everyone.", "thai": "มัคคุเทศก์แชร์กำหนดการกับทุกคน"}
{"word": "itinerary", "english": "Our itinerary has a free day in Rome.", "thai": "กำหนดการของเรามีวันว่างหนึ่งวันในโรม"}
{"word": "itinerary", "english": "He forgot to include dinner in the itinerary.", "thai": "เขาลืมใส่มื้อค่ำในกำหนดการ"}
{"word": "itinerary", "english": "The itinerary was emailed to all participants.", "thai": "กำหนดการถูกส่งอีเมลถึงผู้เข้าร่วมทุกคน"}
{"word": "itinerary", "english": "We’re following a tight itinerary this trip.", "thai": "ทริปนี้เราตามกำหนดการที่แน่นมาก"}
{"word": "itinerary", "english": "Can we add a museum to the itinerary?", "thai": "เราเพิ่มพิพิธภัณฑ์ในกำหนดการได้ไหม?"}
{"word": "itinerary", "english": "Her itinerary includes stops in three countries.", "thai": "กำหนดการของเธอรวมถึงการแวะในสามประเทศ"}
{"word": "itinerary", "english": "The itinerary changed because of a flight delay.", "thai": "กำหนดการเปลี่ยนเพราะเที่ยวบินล่าช้า"}
{"word": "itinerary", "english": "I printed the itinerary for easy reference.", "thai": "ฉันพิมพ์กำหนดการเพื่อให้ดูง่าย"}
{"word": "itinerary", "english": "Our itinerary is full of outdoor activities.", "thai": "กำหนดการของเราเต็มไปด้วยกิจกรรมกลางแจ้ง"}
{"word": "itinerary", "english": "He’s excited about the itinerary we planned.", "thai": "เขาตื่นเต้นกับกำหนดการที่เราวางแผนไว้"}
{"word": "itinerary", "english": "The itinerary doesn’t leave much time for rest.", "thai": "กำหนดการไม่ค่อยมีเวลาพักผ่อน"}
{"word": "itinerary", "english": "She shared her itinerary on social media.", "thai": "เธอแชร์กำหนดการของเธอบนโซเชียลมีเดีย"}
{"word": "itinerary", "english": "We need a backup itinerary in case of rain.", "thai": "เราต้องมีกำหนดการสำรองในกรณีฝนตก"}
{"word": "itinerary", "english": "The itinerary includes a guided city tour.", "thai": "กำหนดการรวมถึงทัวร์เมืองพร้อมมัคคุเทศก์"}
{"word": "itinerary", "english": "I’m not happy with this itinerary; it’s too rushed.", "thai": "ฉันไม่พอใจกับกำหนดการนี้ มันเร่งรีบเกินไป"}
{"word": "itinerary", "english": "The itinerary was planned around food festivals.", "thai": "กำหนดการถูกวางแผนโดยอิงจากงานเทศกาลอาหาร"}
{"word": "itinerary", "english": "Can you confirm the itinerary with the hotel?", "thai": "คุณยืนยันกำหนดการกับโรงแรมได้ไหม?"}
{"word": "itinerary", "english": "Our itinerary has a mix of culture and adventure.", "thai": "กำหนดการของเรามีทั้งวัฒนธรรมและการผจญภัย"}
{"word": "itinerary", "english": "He’s sticking strictly to the itinerary.", "thai": "เขายึดตามกำหนดการอย่างเคร่งครัด"}
{"word": "itinerary", "english": "The itinerary lists all the museums we’ll visit.", "thai": "กำหนดการระบุพิพิธภัณฑ์ทั้งหมดที่เราจะไป"}
{"word": "itinerary", "english": "She’s creating an itinerary for her solo trip.", "thai": "เธอกำลังสร้างกำหนดการสำหรับการเดินทางคนเดียว"}
{"word": "itinerary", "english": "The itinerary allows time for shopping.", "thai": "กำหนดการให้เวลาสำหรับการช้อปปิ้ง"}
{"word": "itinerary", "english": "We followed the itinerary perfectly last time.", "thai": "ครั้งที่แล้วเราเดินตามกำหนดการได้อย่างสมบูรณ์"}
{"word": "itinerary", "english": "The itinerary includes a sunset cruise.", "thai": "กำหนดการรวมถึงการล่องเรือชมพระอาทิตย์ตก"}
{"word": "itinerary", "english": "I need to review the itinerary before we leave.", "thai": "ฉันต้องตรวจสอบกำหนดการก่อนที่เราจะออกเดินทาง"}
{"word": "itinerary", "english": "Her itinerary is focused on historical sites.", "thai": "กำหนดการของเธอเน้นที่สถานที่ทางประวัติศาสตร์"}
{"word": "itinerary", "english": "The itinerary was tailored to our interests.", "thai": "กำหนดการถูกปรับให้เหมาะกับความสนใจของเรา"}
{"word": "itinerary", "english": "We’re behind schedule on our itinerary.", "thai": "เราล่าช้ากว่ากำหนดการของเรา"}
{"word": "itinerary", "english": "The itinerary has a stop at a famous vineyard.", "thai": "กำหนดการมีการแวะที่ไร่องุ่นที่มีชื่อเสียง"}
{"word": "itinerary", "english": "He shared his itinerary with the tour group.", "thai": "เขาแชร์กำหนดการกับกลุ่มทัวร์"}
{"word": "itinerary", "english": "The itinerary is too packed for my liking.", "thai": "กำหนดการแน่นเกินไปสำหรับฉัน"}
{"word": "itinerary", "english": "We need to finalize the itinerary by tonight.", "thai": "เราต้องสรุปกกำหนดการภายในคืนนี้"}
{"word": "itinerary", "english": "The itinerary includes a hiking trip.", "thai": "กำหนดการรวมถึงการเดินป่า"}
{"word": "itinerary", "english": "She’s excited to follow the itinerary we made.", "thai": "เธอตื่นเต้นที่จะตามกำหนดการที่เราทำ"}
{"word": "itinerary", "english": "The itinerary was changed at the last minute.", "thai": "กำหนดการถูกเปลี่ยนในนาทีสุดท้าย"}
{"word": "itinerary", "english": "Our itinerary has a lot of beach time.", "thai": "กำหนดการของเรามีเวลาที่ชายหาดเยอะ"}
{"word": "itinerary", "english": "He’s working on a budget-friendly itinerary.", "thai": "เขากำลังทำกำหนดการที่ประหยัดงบ"}
{"word": "itinerary", "english": "The itinerary covers all the major landmarks.", "thai": "กำหนดการครอบคลุมสถานที่สำคัญทั้งหมด"}
{"word": "itinerary", "english": "I forgot to check the itinerary for tomorrow.", "thai": "ฉันลืมตรวจกำหนดการสำหรับวันพรุ่งนี้"}
{"word": "itinerary", "english": "The itinerary includes a cooking class.", "thai": "กำหนดการรวมถึงคลาสทำอาหาร"}
{"word": "itinerary", "english": "We’re tweaking the itinerary to add more downtime.", "thai": "เรากำลังปรับกำหนดการเพื่อเพิ่มเวลาว่าง"}
{"word": "itinerary", "english": "Her itinerary is planned down to the hour.", "thai": "กำหนดการของเธอวางแผนไว้จนถึงชั่วโมง"}
{"word": "itinerary", "english": "The itinerary was sent to my phone.", "thai": "กำหนดการถูกส่งไปที่โทรศัพท์ของฉัน"}
{"word": "itinerary", "english": "We’re excited about the itinerary’s variety.", "thai": "เราตื่นเต้นกับความหลากหลายของกำหนดการ"}
{"word": "itinerary", "english": "The itinerary has us visiting temples first.", "thai": "กำหนดการให้เราไปวัดก่อน"}
{"word": "itinerary", "english": "I need a copy of the itinerary for my records.", "thai": "ฉันต้องการสำเนากำหนดการสำหรับบันทึกของฉัน"}
{"word": "itinerary", "english": "The itinerary includes a stop for lunch.", "thai": "กำหนดการรวมถึงการแวะพักเพื่อรับประทานอาหารกลางวัน"}
{"word": "itinerary", "english": "She’s stressed because the itinerary is too full.", "thai": "เธอเครียดเพราะกำหนดการเต็มเกินไป"}
{"word": "itinerary", "english": "The itinerary was designed for families.", "thai": "กำหนดการถูกออกแบบสำหรับครอบครัว"}
{"word": "itinerary", "english": "We’re following the itinerary provided by the agency.", "thai": "เรากำลังตามกำหนดการที่บริษัททัวร์จัดให้"}
{"word": "itinerary", "english": "The itinerary has a day for relaxation.", "thai": "กำหนดการมีวันสำหรับการพักผ่อน"}
{"word": "itinerary", "english": "He’s reviewing the itinerary with his boss.", "thai": "เขากำลังตรวจสอบกำหนดการกับเจ้านาย"}
{"word": "itinerary", "english": "The itinerary includes a wildlife safari.", "thai": "กำหนดการรวมถึงการซาฟารีสัตว์ป่า"}
{"word": "itinerary", "english": "We need to share the itinerary with our friends.", "thai": "เราต้องแชร์กำหนดการกับเพื่อนๆ"}
{"word": "itinerary", "english": "The itinerary was planned around festivals.", "thai": "กำหนดการถูกวางแผนโดยอิงจากงานเทศกาล"}
{"word": "itinerary", "english": "She’s updating the itinerary with new activities.", "thai": "เธอกำลังอัปเดตกกำหนดการด้วยกิจกรรมใหม่ๆ"}
{"word": "itinerary", "english": "The itinerary has us staying in a cabin.", "thai": "กำหนดการให้เราพักในกระท่อม"}
{"word": "itinerary", "english": "I’m confused by this itinerary’s schedule.", "thai": "ฉันสับสนกับตารางของกำหนดการนี้"}
{"word": "itinerary", "english": "The itinerary includes a night market visit.", "thai": "กำหนดการรวมถึงการเยี่ยมชมตลาดกลางคืน"}
{"word": "itinerary", "english": "We’re revising the itinerary for more flexibility.", "thai": "เรากำลังปรับกำหนดการเพื่อให้ยืดหยุ่นมากขึ้น"}
{"word": "itinerary", "english": "The itinerary was perfect for our group.", "thai": "กำหนดการเหมาะสมกับกลุ่มของเรา"}
{"word": "itinerary", "english": "He’s sharing the itinerary with his family.", "thai": "เขากำลังแชร์กำหนดการกับครอบครัว"}
{"word": "itinerary", "english": "The itinerary has a lot of walking tours.", "thai": "กำหนดการมีทัวร์เดินชมเยอะ"}
{"word": "itinerary", "english": "I need to double-check the itinerary details.", "thai": "ฉันต้องตรวจสอบรายละเอียดกำหนดการอีกครั้ง"}
{"word": "itinerary", "english": "The itinerary includes a boat tour.", "thai": "กำหนดการรวมถึงทัวร์ทางเรือ"}
{"word": "itinerary", "english": "She’s thrilled with the itinerary we chose.", "thai": "เธอตื่นเต้นกับกำหนดการที่เราเลือก"}
{"word": "itinerary", "english": "The itinerary was sent in a PDF file.", "thai": "กำหนดการถูกส่งมาในไฟล์ PDF"}
{"word": "itinerary", "english": "We’re adding a spa day to the itinerary.", "thai": "เรากำลังเพิ่มวันสปาในกำหนดการ"}
{"word": "itinerary", "english": "The itinerary covers two cities in one day.", "thai": "กำหนดการครอบคลุมสองเมืองในหนึ่งวัน"}
{"word": "itinerary", "english": "He’s annoyed because the itinerary changed.", "thai": "เขาโกรธเพราะกำหนดการเปลี่ยน"}
{"word": "itinerary", "english": "The itinerary has a lot of free time.", "thai": "กำหนดการมีเวลาว่างเยอะ"}
{"word": "itinerary", "english": "I’m excited about the itinerary’s adventures.", "thai": "ฉันตื่นเต้นกับการผจญภัยในกำหนดการ"}
{"word": "itinerary", "english": "The itinerary was planned by a professional.", "thai": "กำหนดการถูกวางแผนโดยมืออาชีพ"}
{"word": "itinerary", "english": "We’re sticking to the itinerary this time.", "thai": "ครั้งนี้เราจะยึดตามกำหนดการ"}
{"word": "itinerary", "english": "The itinerary includes a cultural performance.", "thai": "กำหนดการรวมถึงการแสดงทางวัฒนธรรม"}
{"word": "itinerary", "english": "She’s printing the itinerary for everyone.", "thai": "เธอกำลังพิมพ์กำหนดการให้ทุกคน"}
{"word": "itinerary", "english": "The itinerary has us leaving early tomorrow.", "thai": "กำหนดการให้เราออกเดินทางแต่เช้าพรุ่งนี้"}
{"word": "itinerary", "english": "We need to follow the itinerary closely.", "thai": "เราต้องตามกำหนดการอย่างใกล้ชิด"}
{"word": "itinerary", "english": "The itinerary was customized for us.", "thai": "กำหนดการถูกปรับแต่งสำหรับเรา"}
{"word": "itinerary", "english": "He’s checking the itinerary for errors.", "thai": "เขากำลังตรวจสอบกำหนดการเพื่อหาข้อผิดพลาด"}
{"word": "itinerary", "english": "The itinerary includes a wine tasting.", "thai": "กำหนดการรวมถึงการชิมไวน์"}
{"word": "itinerary", "english": "I love how detailed this itinerary is.", "thai": "ฉันชอบที่กำหนดการนี้ละเอียดมาก"}
{"word": "itinerary", "english": "The itinerary has a mix of city and nature.", "thai": "กำหนดการมีทั้งเมืองและธรรมชาติ"}
{"word": "itinerary", "english": "We’re updating the itinerary with new plans.", "thai": "เรากำลังอัปเดตกำหนดการด้วยแผนใหม่"}
{"word": "itinerary", "english": "The itinerary was shared via email.", "thai": "กำหนดการถูกแชร์ผ่านอีเมล"}
{"word": "itinerary", "english": "She’s following the itinerary to the letter.", "thai": "เธอกำลังตามกำหนดการอย่างเป๊ะ"}
{"word": "itinerary", "english": "The itinerary includes a visit to a castle.", "thai": "กำหนดการรวมถึงการเยี่ยมชมปราสาท"}
{"word": "reservation", "english": "I made a reservation for dinner at 7 PM.", "thai": "ฉันจองโต๊ะอาหารเย็นไว้ตอนหนึ่งทุ่ม"}
{"word": "reservation", "english": "Do you have a reservation for the hotel?", "thai": "คุณมีการจองโรงแรมหรือไม่?"}
{"word": "reservation", "english": "She canceled her reservation due to a change in plans.", "thai": "เธอยกเลิกการจองเพราะแผนเปลี่ยน"}
{"word": "reservation", "english": "The restaurant requires a reservation for large groups.", "thai": "ร้านอาหารกำหนดให้มีการจองสำหรับกลุ่มใหญ่"}
{"word": "reservation", "english": "We need to confirm our reservation by tomorrow.", "thai": "เราต้องยืนยันการจองภายในวันพรุ่งนี้"}
{"word": "reservation", "english": "He forgot to make a reservation for the tour.", "thai": "เขาลืมจองทัวร์"}
{"word": "reservation", "english": "The reservation is under my name.", "thai": "การจองอยู่ภายใต้ชื่อของฉัน"}
{"word": "reservation", "english": "Can you check if my reservation is still valid?", "thai": "คุณช่วยตรวจสอบว่าการจองของฉันยังใช้ได้อยู่หรือไม่?"}
{"word": "reservation", "english": "I got a reservation for the best suite in the hotel.", "thai": "ฉันได้จองห้องสวีทที่ดีที่สุดในโรงแรม"}
{"word": "reservation", "english": "The reservation system crashed, so we couldn’t book.", "thai": "ระบบจองล่ม เลยจองไม่ได้"}
{"word": "reservation", "english": "We have a reservation for a party of six.", "thai": "เรามีการจองสำหรับกลุ่มหกคน"}
{"word": "reservation", "english": "She made a reservation for the spa treatment.", "thai": "เธอจองคอร์สสปาไว้"}
{"word": "reservation", "english": "The reservation was for a window seat.", "thai": "การจองเป็นที่นั่งริมหน้าต่าง"}
{"word": "reservation", "english": "I need to change my reservation to next week.", "thai": "ฉันต้องเปลี่ยนการจองเป็นสัปดาห์หน้า"}
{"word": "reservation", "english": "They lost our reservation, so we had to wait.", "thai": "พวกเขาทำการจองของเราหาย เลยต้องรอ"}
{"word": "reservation", "english": "The reservation includes breakfast and parking.", "thai": "การจองรวมอาหารเช้าและที่จอดรถ"}
{"word": "reservation", "english": "He called to make a reservation for the concert.", "thai": "เขาโทรไปจองตั๋วคอนเสิร์ต"}
{"word": "reservation", "english": "Our reservation got canceled without notice.", "thai": "การจองของเราถูกยกเลิกโดยไม่มีการแจ้งให้ทราบ"}
{"word": "reservation", "english": "I booked a reservation online for the campsite.", "thai": "ฉันจองที่ตั้งแคมป์ออนไลน์"}
{"word": "reservation", "english": "The reservation is for two nights only.", "thai": "การจองเป็นเวลาสองคืนเท่านั้น"}
{"word": "reservation", "english": "She has a reservation at the new Italian restaurant.", "thai": "เธอมีการจองที่ร้านอาหารอิตาเลียนแห่งใหม่"}
{"word": "reservation", "english": "We need a reservation to get into the club.", "thai": "เราต้องมีการจองเพื่อเข้าไปในคลับ"}
{"word": "reservation", "english": "The reservation was made through a travel agency.", "thai": "การจองทำผ่านบริษัทท่องเที่ยว"}
{"word": "reservation", "english": "Can you hold my reservation until I arrive?", "thai": "คุณช่วยเก็บการจองของฉันไว้จนกว่าฉันจะมาถึงได้ไหม?"}
{"word": "reservation", "english": "The reservation fee is non-refundable.", "thai": "ค่าธรรมเนียมการจองไม่สามารถคืนเงินได้"}
{"word": "reservation", "english": "He confirmed the reservation with his credit card.", "thai": "เขายืนยันการจองด้วยบัตรเครดิต"}
{"word": "reservation", "english": "Our reservation is for a private dining room.", "thai": "การจองของเราเป็นห้องอาหารส่วนตัว"}
{"word": "reservation", "english": "I need to cancel my reservation for tomorrow.", "thai": "ฉันต้องยกเลิกการจองสำหรับวันพรุ่งนี้"}
{"word": "reservation", "english": "The reservation was for a group tour.", "thai": "การจองเป็นสำหรับทัวร์กลุ่ม"}
{"word": "reservation", "english": "She got a reservation at the last minute.", "thai": "เธอได้จองในนาทีสุดท้าย"}
{"word": "reservation", "english": "The reservation includes a guided hike.", "thai": "การจองรวมถึงการเดินป่าพร้อมไกด์"}
{"word": "reservation", "english": "We made a reservation for the rooftop bar.", "thai": "เราจองที่บาร์บนชั้นดาดฟ้า"}
{"word": "reservation", "english": "The reservation was booked under her maiden name.", "thai": "การจองถูกจองภายใต้นามสกุลเดิมของเธอ"}
{"word": "reservation", "english": "I forgot to make a reservation for the ferry.", "thai": "ฉันลืมจองเรือข้ามฟาก"}
{"word": "reservation", "english": "The reservation is for a family of four.", "thai": "การจองเป็นสำหรับครอบครัวสี่คน"}
{"word": "reservation", "english": "He checked the reservation details online.", "thai": "เขาตรวจสอบรายละเอียดการจองออนไลน์"}
{"word": "reservation", "english": "The reservation was for a corner table.", "thai": "การจองเป็นโต๊ะมุม"}
{"word": "reservation", "english": "We need to make a reservation for the train.", "thai": "เราต้องจองตั๋วรถไฟ"}
{"word": "reservation", "english": "The reservation system is down right now.", "thai": "ระบบจองล่มอยู่ในตอนนี้"}
{"word": "reservation", "english": "She secured a reservation for the yoga retreat.", "thai": "เธอได้จองที่พักสำหรับการฝึกโยคะ"}
{"word": "reservation", "english": "The reservation is for a non-smoking room.", "thai": "การจองเป็นห้องปลอดบุหรี่"}
{"word": "reservation", "english": "I have a reservation for the 8 PM show.", "thai": "ฉันมีการจองสำหรับการแสดงตอนสองทุ่ม"}
{"word": "reservation", "english": "The reservation was made months in advance.", "thai": "การจองถูกทำไว้ล่วงหน้าหลายเดือน"}
{"word": "reservation", "english": "We lost our reservation because we were late.", "thai": "เราสูญเสียการจองเพราะมาสาย"}
{"word": "reservation", "english": "The reservation includes free airport transfers.", "thai": "การจองรวมถึงการรับส่งสนามบินฟรี"}
{"word": "reservation", "english": "She called to confirm her reservation.", "thai": "เธอโทรไปยืนยันการจอง"}
{"word": "reservation", "english": "The reservation is for a beachfront villa.", "thai": "การจองเป็นวิลล่าริมชายหาด"}
{"word": "reservation", "english": "I need to modify my reservation details.", "thai": "ฉันต้องแก้ไขรายละเอียดการจอง"}
{"word": "reservation", "english": "The reservation was for a sunset cruise.", "thai": "การจองเป็นสำหรับการล่องเรือชมพระอาทิตย์ตก"}
{"word": "reservation", "english": "We made a reservation for the cooking class.", "thai": "เราจองสำหรับคลาสทำอาหาร"}
{"word": "reservation", "english": "The reservation is under my husband’s name.", "thai": "การจองอยู่ภายใต้ชื่อสามีของฉัน"}
{"word": "reservation", "english": "I got a confirmation email for the reservation.", "thai": "ฉันได้รับอีเมลยืนยันการจอง"}
{"word": "reservation", "english": "The reservation was for a guided museum tour.", "thai": "การจองเป็นสำหรับทัวร์พิพิธภัณฑ์พร้อมไกด์"}
{"word": "reservation", "english": "We need a reservation for the wine tasting.", "thai": "เราต้องจองสำหรับการชิมไวน์"}
{"word": "reservation", "english": "The reservation was canceled due to bad weather.", "thai": "การจองถูกยกเลิกเพราะสภาพอากาศไม่ดี"}
{"word": "reservation", "english": "She made a reservation for a hot air balloon ride.", "thai": "เธอจองสำหรับการนั่งบอลลูนลมร้อน"}
{"word": "reservation", "english": "The reservation is for a table by the window.", "thai": "การจองเป็นโต๊ะริมหน้าต่าง"}
{"word": "reservation", "english": "I forgot my reservation number.", "thai": "ฉันลืมหมายเลขการจอง"}
{"word": "reservation", "english": "The reservation includes a complimentary drink.", "thai": "การจองรวมถึงเครื่องดื่มฟรี"}
{"word": "reservation", "english": "We made a reservation for the early flight.", "thai": "เราจองสำหรับเที่ยวบินเช้า"}
{"word": "reservation", "english": "The reservation was for a group of ten.", "thai": "การจองเป็นสำหรับกลุ่มสิบคน"}
{"word": "reservation", "english": "She’s checking her reservation status online.", "thai": "เธอกำลังตรวจสอบสถานะการจองออนไลน์"}
{"word": "reservation", "english": "The reservation is for a double room.", "thai": "การจองเป็นห้องเตียงคู่"}
{"word": "reservation", "english": "I need to make a reservation for the shuttle.", "thai": "ฉันต้องจองรถรับส่ง"}
{"word": "reservation", "english": "The reservation was made through an app.", "thai": "การจองทำผ่านแอป"}
{"word": "reservation", "english": "We have a reservation for the dinner cruise.", "thai": "เรามีการจองสำหรับการล่องเรือมื้อค่ำ"}
{"word": "reservation", "english": "The reservation is for a pet-friendly room.", "thai": "การจองเป็นห้องที่อนุญาตให้พาสัตว์เลี้ยง"}
{"word": "reservation", "english": "He confirmed the reservation with a deposit.", "thai": "เขายืนยันการจองด้วยเงินมัดจำ"}
{"word": "reservation", "english": "The reservation was for a morning tee time.", "thai": "การจองเป็นสำหรับเวลาตีกอล์ฟตอนเช้า"}
{"word": "reservation", "english": "I need to cancel my reservation for the spa.", "thai": "ฉันต้องยกเลิกการจองสำหรับสปา"}
{"word": "reservation", "english": "The reservation includes a city tour.", "thai": "การจองรวมถึงทัวร์เมือง"}
{"word": "reservation", "english": "She made a reservation for the cooking workshop.", "thai": "เธอจองสำหรับเวิร์คช็อปทำอาหาร"}
{"word": "reservation", "english": "The reservation was for a private tour.", "thai": "การจองเป็นสำหรับทัวร์ส่วนตัว"}
{"word": "reservation", "english": "We need to check in with our reservation number.", "thai": "เราต้องเช็คอินด้วยหมายเลขการจอง"}
{"word": "reservation", "english": "The reservation is for a rooftop restaurant.", "thai": "การจองเป็นสำหรับร้านอาหารบนชั้นดาดฟ้า"}
{"word": "reservation", "english": "I made a reservation for the festival tickets.", "thai": "ฉันจองตั๋วสำหรับงานเทศกาล"}
{"word": "reservation", "english": "The reservation was confirmed yesterday.", "thai": "การจองได้รับการยืนยันเมื่อวานนี้"}
{"word": "reservation", "english": "She forgot to include parking in the reservation.", "thai": "เธอลืมรวมที่จอดรถในการจอง"}
{"word": "reservation", "english": "The reservation is for a family suite.", "thai": "การจองเป็นสำหรับห้องสวีทครอบครัว"}
{"word": "reservation", "english": "We need a reservation for the guided hike.", "thai": "เราต้องจองสำหรับการเดินป่าพร้อมไกด์"}
{"word": "reservation", "english": "The reservation was for a weekend getaway.", "thai": "การจองเป็นสำหรับทริปสุดสัปดาห์"}
{"word": "reservation", "english": "He made a reservation for the art workshop.", "thai": "เขาจองสำหรับเวิร์คช็อปศิลปะ"}
{"word": "reservation", "english": "The reservation includes a free upgrade.", "thai": "การจองรวมถึงการอัปเกรดฟรี"}
{"word": "reservation", "english": "I need to verify my reservation details.", "thai": "ฉันต้องยืนยันรายละเอียดการจอง"}
{"word": "reservation", "english": "The reservation was for a sunset yoga class.", "thai": "การจองเป็นสำหรับคลาสโยคะตอนพระอาทิตย์ตก"}
{"word": "reservation", "english": "We have a reservation for the theater show.", "thai": "เรามีการจองสำหรับการแสดงละคร"}
{"word": "reservation", "english": "The reservation is for a group dinner.", "thai": "การจองเป็นสำหรับมื้อค่ำกลุ่ม"}
{"word": "reservation", "english": "She made a reservation for the wine tour.", "thai": "เธอจองสำหรับทัวร์ชิมไวน์"}
{"word": "reservation", "english": "The reservation was booked last month.", "thai": "การจองถูกจองเมื่อเดือนที่แล้ว"}
{"word": "reservation", "english": "I need a reservation for the airport shuttle.", "thai": "ฉันต้องจองรถรับส่งสนามบิน"}
{"word": "reservation", "english": "The reservation is for a lakefront cabin.", "thai": "การจองเป็นสำหรับกระท่อมริมทะเลสาบ"}
{"word": "reservation", "english": "He canceled his reservation due to illness.", "thai": "เขายกเลิกการจองเพราะป่วย"}
{"word": "reservation", "english": "The reservation includes a spa package.", "thai": "การจองรวมถึงแพ็คเกจสปา"}
{"word": "reservation", "english": "We made a reservation for the evening tour.", "thai": "เราจองสำหรับทัวร์ตอนเย็น"}
{"word": "reservation", "english": "The reservation was for a rooftop suite.", "thai": "การจองเป็นสำหรับสวีทบนชั้นดาดฟ้า"}
{"word": "reservation", "english": "I need to update my reservation information.", "thai": "ฉันต้องอัปเดตข้อมูลการจอง"}
{"word": "reservation", "english": "The reservation is for a cooking demonstration.", "thai": "การจองเป็นสำหรับการสาธิตทำอาหาร"}
{"word": "reservation", "english": "She confirmed the reservation with her ID.", "thai": "เธอยืนยันการจองด้วยบัตรประจำตัว"}
{"word": "reservation", "english": "The reservation was for a beachside dinner.", "thai": "การจองเป็นสำหรับมื้อค่ำริมชายหาด"}
{"word": "hotel", "english": "I booked a hotel for our weekend getaway.", "thai": "ฉันจองโรงแรมสำหรับทริปสุดสัปดาห์ของเรา"}
{"word": "hotel", "english": "The hotel has a great view of the ocean.", "thai": "โรงแรมมีวิวทะเลที่สวยงาม"}
{"word": "hotel", "english": "We stayed at a hotel near the airport.", "thai": "เราพักที่โรงแรมใกล้สนามบิน"}
{"word": "hotel", "english": "The hotel staff was incredibly friendly.", "thai": "พนักงานโรงแรมเป็นมิตรมาก"}
{"word": "hotel", "english": "Do you know a good hotel in downtown?", "thai": "คุณรู้จักโรงแรมดีๆ ในตัวเมืองไหม?"}
{"word": "hotel", "english": "The hotel offers free breakfast every morning.", "thai": "โรงแรมมีอาหารเช้าฟรีทุกเช้า"}
{"word": "hotel", "english": "She forgot her charger at the hotel.", "thai": "เธอลืมที่ชาร์จไว้ที่โรงแรม"}
{"word": "hotel", "english": "The hotel room was small but cozy.", "thai": "ห้องโรงแรมเล็กแต่อบอุ่น"}
{"word": "hotel", "english": "We need to check out of the hotel by noon.", "thai": "เราต้องเช็คเอาท์จากโรงแรมก่อนเที่ยง"}
{"word": "hotel", "english": "The hotel has a pool and a gym.", "thai": "โรงแรมมีสระว่ายน้ำและยิม"}
{"word": "hotel", "english": "I left my luggage at the hotel desk.", "thai": "ฉันฝากกระเป๋าไว้ที่โต๊ะโรงแรม"}
{"word": "hotel", "english": "The hotel is fully booked this weekend.", "thai": "โรงแรมเต็มในสุดสัปดาห์นี้"}
{"word": "hotel", "english": "He works at a hotel as a concierge.", "thai": "เขาทำงานที่โรงแรมในตำแหน่งพนักงานต้อนรับ"}
{"word": "hotel", "english": "The hotel charges extra for late checkout.", "thai": "โรงแรมคิดค่าบริการเพิ่มสำหรับการเช็คเอาท์ล่าช้า"}
{"word": "hotel", "english": "We got a discount at the hotel for booking early.", "thai": "เราได้ส่วนลดที่โรงแรมเพราะจองล่วงหน้า"}
{"word": "hotel", "english": "The hotel shuttle will take us to the airport.", "thai": "รถรับส่งของโรงแรมจะพาเราไปสนามบิน"}
{"word": "hotel", "english": "She complained about the hotel’s Wi-Fi.", "thai": "เธอบ่นเรื่องไวไฟของโรงแรม"}
{"word": "hotel", "english": "The hotel is right next to the beach.", "thai": "โรงแรมอยู่ติดชายหาด"}
{"word": "hotel", "english": "I need to call the hotel to confirm my booking.", "thai": "ฉันต้องโทรไปโรงแรมเพื่อยืนยันการจอง"}
{"word": "hotel", "english": "The hotel restaurant serves amazing seafood.", "thai": "ร้านอาหารของโรงแรมเสิร์ฟอาหารทะเลอร่อยมาก"}
{"word": "hotel", "english": "We stayed in a hotel with a rooftop bar.", "thai": "เราพักในโรงแรมที่มีบาร์บนชั้นดาดฟ้า"}
{"word": "hotel", "english": "The hotel is pet-friendly, so we brought our dog.", "thai": "โรงแรมอนุญาตให้พาสัตว์เลี้ยงได้ เลยพาน้องหมามาด้วย"}
{"word": "hotel", "english": "The hotel room had a minibar and a safe.", "thai": "ห้องโรงแรมมีมินิบาร์และตู้เซฟ"}
{"word": "hotel", "english": "I forgot my keycard at the hotel front desk.", "thai": "ฉันลืมคีย์การ์ดไว้ที่แผนกต้อนรับของโรงแรม"}
{"word": "hotel", "english": "The hotel is hosting a conference this week.", "thai": "โรงแรมกำลังจัดงานประชุมในสัปดาห์นี้"}
{"word": "hotel", "english": "We upgraded to a suite at the hotel.", "thai": "เราอัปเกรดเป็นห้องสวีทที่โรงแรม"}
{"word": "hotel", "english": "The hotel offers free parking for guests.", "thai": "โรงแรมมีที่จอดรถฟรีสำหรับแขก"}
{"word": "hotel", "english": "She booked a hotel with a spa for relaxation.", "thai": "เธอจองโรงแรมที่มีสปาเพื่อการพักผ่อน"}
{"word": "hotel", "english": "The hotel was renovated last year.", "thai": "โรงแรมได้รับการปรับปรุงเมื่อปีที่แล้ว"}
{"word": "hotel", "english": "I need a hotel close to the convention center.", "thai": "ฉันต้องการโรงแรมใกล้ศูนย์ประชุม"}
{"word": "hotel", "english": "The hotel has a 24-hour front desk.", "thai": "โรงแรมมีแผนกต้อนรับเปิดตลอด 24 ชั่วโมง"}
{"word": "hotel", "english": "We enjoyed the hotel’s complimentary shuttle.", "thai": "เราชอบรถรับส่งฟรีของโรงแรม"}
{"word": "hotel", "english": "The hotel lobby was beautifully decorated.", "thai": "ล็อบบี้โรงแรมตกแต่งอย่างสวยงาม"}
{"word": "hotel", "english": "The hotel is known for its excellent service.", "thai": "โรงแรมนี้ขึ้นชื่อเรื่องการบริการที่ยอดเยี่ยม"}
{"word": "hotel", "english": "I left a tip for the hotel housekeeper.", "thai": "ฉันทิ้งทิปให้พนักงานทำความสะอาดโรงแรม"}
{"word": "hotel", "english": "The hotel has a strict no-smoking policy.", "thai": "โรงแรมมีนโยบายห้ามสูบบุหรี่อย่างเข้มงวด"}
{"word": "hotel", "english": "We’re staying at a hotel downtown tonight.", "thai": "เราจะพักที่โรงแรมในตัวเมืองคืนนี้"}
{"word": "hotel", "english": "The hotel offers a continental breakfast.", "thai": "โรงแรมมีอาหารเช้าแบบคอนติเนนตัล"}
{"word": "hotel", "english": "I called the hotel to request an early check-in.", "thai": "ฉันโทรไปโรงแรมเพื่อขอเช็คอินก่อนเวลา"}
{"word": "hotel", "english": "The hotel is just a block from the museum.", "thai": "โรงแรมอยู่ห่างจากพิพิธภัณฑ์แค่หนึ่งช่วงตึก"}
{"word": "hotel", "english": "The hotel’s gym is open to all guests.", "thai": "ยิมของโรงแรมเปิดให้แขกทุกคนใช้"}
{"word": "hotel", "english": "She reserved a hotel room with a balcony.", "thai": "เธอจองห้องโรงแรมที่มีระเบียง"}
{"word": "hotel", "english": "The hotel was overbooked, so we got upgraded.", "thai": "โรงแรมจองเต็ม เลยได้อัปเกรด"}
{"word": "hotel", "english": "The hotel provides free Wi-Fi in all rooms.", "thai": "โรงแรมมีไวไฟฟรีในทุกห้อง"}
{"word": "hotel", "english": "We had dinner at the hotel’s rooftop restaurant.", "thai": "เราทานมื้อค่ำที่ร้านอาหารบนชั้นดาดฟ้าของโรงแรม"}
{"word": "hotel", "english": "The hotel is famous for its luxury spa.", "thai": "โรงแรมนี้มีชื่อเสียงเรื่องสปาหรู"}
{"word": "hotel", "english": "I need to cancel my hotel reservation.", "thai": "ฉันต้องยกเลิกการจองโรงแรม"}
{"word": "hotel", "english": "The hotel has a shuttle to the theme park.", "thai": "โรงแรมมีรถรับส่งไปสวนสนุก"}
{"word": "hotel", "english": "The hotel room was spotlessly clean.", "thai": "ห้องโรงแรมสะอาดเอี่ยม"}
{"word": "hotel", "english": "We booked a hotel through an online app.", "thai": "เราจองโรงแรมผ่านแอปออนไลน์"}
{"word": "hotel", "english": "The hotel is located in the city center.", "thai": "โรงแรมตั้งอยู่ในใจกลางเมือง"}
{"word": "hotel", "english": "The hotel offers a discount for long stays.", "thai": "โรงแรมมีส่วนลดสำหรับการพักระยะยาว"}
{"word": "hotel", "english": "She complained about the hotel’s noisy air conditioning.", "thai": "เธอบ่นเรื่องเครื่องปรับอากาศของโรงแรมที่ดัง"}
{"word": "hotel", "english": "The hotel has a beautiful garden area.", "thai": "โรงแรมมีพื้นที่สวนที่สวยงาม"}
{"word": "hotel", "english": "I left my jacket in the hotel room.", "thai": "ฉันลืมเสื้อแจ็คเก็ตไว้ในห้องโรงแรม"}
{"word": "hotel", "english": "The hotel’s bar stays open late.", "thai": "บาร์ของโรงแรมเปิดถึงดึก"}
{"word": "hotel", "english": "We’re checking into the hotel this afternoon.", "thai": "เราจะเช็คอินที่โรงแรมบ่ายนี้"}
{"word": "hotel", "english": "The hotel has a kids’ play area.", "thai": "โรงแรมมีพื้นที่เล่นสำหรับเด็ก"}
{"word": "hotel", "english": "The hotel’s decor is modern and stylish.", "thai": "การตกแต่งของโรงแรมทันสมัยและมีสไตล์"}
{"word": "hotel", "english": "I booked a hotel with a mountain view.", "thai": "ฉันจองโรงแรมที่มีวิวภูเขา"}
{"word": "hotel", "english": "The hotel provides complimentary toiletries.", "thai": "โรงแรมมีเครื่องใช้ในห้องน้ำฟรี"}
{"word": "hotel", "english": "The hotel is close to the train station.", "thai": "โรงแรมอยู่ใกล้สถานีรถไฟ"}
{"word": "hotel", "english": "We enjoyed the hotel’s live music event.", "thai": "เราสนุกกับงานดนตรีสดของโรงแรม"}
{"word": "hotel", "english": "The hotel has a strict check-in time.", "thai": "โรงแรมมีเวลาการเช็คอินที่เข้มงวด"}
{"word": "hotel", "english": "She works at the hotel as a manager.", "thai": "เธอทำงานที่โรงแรมในตำแหน่งผู้จัดการ"}
{"word": "hotel", "english": "The hotel offers a shuttle to the mall.", "thai": "โรงแรมมีรถรับส่งไปห้างสรรพสินค้า"}
{"word": "hotel", "english": "I need a hotel with a business center.", "thai": "ฉันต้องการโรงแรมที่มีศูนย์ธุรกิจ"}
{"word": "hotel", "english": "The hotel’s pool was closed for maintenance.", "thai": "สระว่ายน้ำของโรงแรมปิดเพื่อซ่อมบำรุง"}
{"word": "hotel", "english": "We stayed at a hotel with a great buffet.", "thai": "เราพักที่โรงแรมที่มีบุฟเฟต์ดีมาก"}
{"word": "hotel", "english": "The hotel is offering a special holiday package.", "thai": "โรงแรมมีแพ็คเกจวันหยุดพิเศษ"}
{"word": "hotel", "english": "The hotel room had a comfortable bed.", "thai": "ห้องโรงแรมมีเตียงที่นอนสบาย"}
{"word": "hotel", "english": "I need to extend my hotel stay by a day.", "thai": "ฉันต้องขยายเวลาการพักในโรงแรมอีกหนึ่งวัน"}
{"word": "hotel", "english": "The hotel has a great rooftop terrace.", "thai": "โรงแรมมีระเบียงบนชั้นดาดฟ้าที่ยอดเยี่ยม"}
{"word": "hotel", "english": "We booked a hotel for the music festival.", "thai": "เราจองโรงแรมสำหรับงานเทศกาลดนตรี"}
{"word": "hotel", "english": "The hotel’s staff helped with our luggage.", "thai": "พนักงานโรงแรมช่วยจัดการกระเป๋าของเรา"}
{"word": "hotel", "english": "The hotel is within walking distance of the park.", "thai": "โรงแรมอยู่ในระยะเดินได้จากสวนสาธารณะ"}
{"word": "hotel", "english": "I requested a quiet room at the hotel.", "thai": "ฉันขอห้องเงียบๆ ที่โรงแรม"}
{"word": "hotel", "english": "The hotel has a sauna and hot tub.", "thai": "โรงแรมมีซาวน่าและอ่างน้ำร้อน"}
{"word": "hotel", "english": "We stayed at a hotel with free shuttle service.", "thai": "เราพักที่โรงแรมที่มีบริการรถรับส่งฟรี"}
{"word": "hotel", "english": "The hotel’s restaurant has a dress code.", "thai": "ร้านอาหารของโรงแรมมีกฎการแต่งกาย"}
{"word": "hotel", "english": "I booked a hotel with a lake view.", "thai": "ฉันจองโรงแรมที่มีวิวทะเลสาบ"}
{"word": "hotel", "english": "The hotel offers daily housekeeping services.", "thai": "โรงแรมมีบริการทำความสะอาดทุกวัน"}
{"word": "hotel", "english": "The hotel was a bit pricey but worth it.", "thai": "โรงแรมราคาค่อนข้างสูงแต่คุ้มค่า"}
{"word": "hotel", "english": "We checked into the hotel late last night.", "thai": "เราเช็คอินที่โรงแรมเมื่อคืนดึก"}
{"word": "hotel", "english": "The hotel has a 24-hour room service menu.", "thai": "โรงแรมมีเมนูรูมเซอร์วิส 24 ชั่วโมง"}
{"word": "hotel", "english": "I need a hotel with a good breakfast buffet.", "thai": "ฉันต้องการโรงแรมที่มีบุฟเฟต์อาหารเช้าดี"}
{"word": "hotel", "english": "The hotel is hosting a wedding this weekend.", "thai": "โรงแรมกำลังจัดงานแต่งงานในสุดสัปดาห์นี้"}
{"word": "hotel", "english": "The hotel’s spa offers massage packages.", "thai": "สปาของโรงแรมมีแพ็คเกจบริการนวด"}
{"word": "hotel", "english": "We stayed at a hotel with a kids’ club.", "thai": "เราพักที่โรงแรมที่มีคลับสำหรับเด็ก"}
{"word": "hotel", "english": "The hotel has a strict no-pets policy.", "thai": "โรงแรมมีนโยบายห้ามนำสัตว์เลี้ยงเข้าอย่างเข้มงวด"}
{"word": "hotel", "english": "I booked a hotel near the festival grounds.", "thai": "ฉันจองโรงแรมใกล้สถานที่จัดงานเทศกาล"}
{"word": "hotel", "english": "The hotel’s front desk was very helpful.", "thai": "แผนกต้อนรับของโรงแรมช่วยเหลือดีมาก"}
{"word": "hotel", "english": "The hotel offers a loyalty rewards program.", "thai": "โรงแรมมีโปรแกรมสะสมคะแนนสำหรับลูกค้าประจำ"}
{"word": "hotel", "english": "We enjoyed the hotel’s evening happy hour.", "thai": "เราสนุกกับชั่วโมงแห่งความสุขตอนเย็นของโรงแรม"}
{"word": "hotel", "english": "The hotel is part of a luxury chain.", "thai": "โรงแรมเป็นส่วนหนึ่งของเครือโรงแรมหรู"}
{"word": "hotel", "english": "I need to contact the hotel about my booking.", "thai": "ฉันต้องติดต่อโรงแรมเกี่ยวกับการจองของฉัน"}
{"word": "hotel", "english": "The hotel has a great location for sightseeing.", "thai": "โรงแรมมีทำเลดีสำหรับการท่องเที่ยว"}
{"word": "hotel", "english": "We stayed at a hotel with a rooftop pool.", "thai": "เราพักที่โรงแรมที่มีสระว่ายน้ำบนชั้นดาดฟ้า"}
{"word": "hotel", "english": "The hotel’s website has all the details.", "thai": "เว็บไซต์ของโรงแรมมีรายละเอียดทั้งหมด"}
{"word": "flight", "english": "My flight to New York leaves at 6 AM.", "thai": "เที่ยวบินของฉันไปนิวยอร์กออกตอนหกโมงเช้า"}
{"word": "flight", "english": "The flight was delayed due to bad weather.", "thai": "เที่ยวบินล่าช้าเพราะสภาพอากาศไม่ดี"}
{"word": "flight", "english": "I booked a flight for next weekend.", "thai": "ฉันจองเที่ยวบินสำหรับสุดสัปดาห์หน้า"}
{"word": "flight", "english": "She missed her flight because of traffic.", "thai": "เธอพลาดเที่ยวบินเพราะรถติด"}
{"word": "flight", "english": "The flight attendant was very helpful.", "thai": "พนักงานต้อนรับบนเครื่องบินช่วยเหลือดีมาก"}
{"word": "flight", "english": "We need to check in for our flight soon.", "thai": "เราต้องเช็คอินสำหรับเที่ยวบินของเราเร็วๆ นี้"}
{"word": "flight", "english": "The flight was bumpy because of turbulence.", "thai": "เที่ยวบินสั่นสะเทือนเพราะความปั่นป่วน"}
{"word": "flight", "english": "I got a cheap flight to Miami online.", "thai": "ฉันได้เที่ยวบินราคาถูกไปไมอามีจากออนไลน์"}
{"word": "flight", "english": "The flight takes about three hours.", "thai": "เที่ยวบินใช้เวลาประมาณสามชั่วโมง"}
{"word": "flight", "english": "He’s nervous about his first international flight.", "thai": "เขากังวลเกี่ยวกับเที่ยวบินระหว่างประเทศครั้งแรก"}
{"word": "flight", "english": "The flight was fully booked this morning.", "thai": "เที่ยวบินเต็มในเช้านี้"}
{"word": "flight", "english": "I need to cancel my flight for tomorrow.", "thai": "ฉันต้องยกเลิกเที่ยวบินสำหรับวันพรุ่งนี้"}
{"word": "flight", "english": "The flight landed ahead of schedule.", "thai": "เที่ยวบินลงจอดก่อนกำหนด"}
{"word": "flight", "english": "She upgraded her flight to business class.", "thai": "เธออัปเกรดเที่ยวบินเป็นชั้นธุรกิจ"}
{"word": "flight", "english": "The flight crew was very professional.", "thai": "ลูกเรือของเที่ยวบินมืออาชีพมาก"}
{"word": "flight", "english": "We’re taking a red-eye flight tonight.", "thai": "เราจะนั่งเที่ยวบินดึกคืนนี้"}
{"word": "flight", "english": "The flight was canceled due to a strike.", "thai": "เที่ยวบินถูกยกเลิกเพราะการนัดหยุดงาน"}
{"word": "flight", "english": "I forgot my headphones for the flight.", "thai": "ฉันลืมหูฟังสำหรับเที่ยวบิน"}
{"word": "flight", "english": "The flight has a layover in Chicago.", "thai": "เที่ยวบินมีการแวะพักที่ชิคาโก"}
{"word": "flight", "english": "He booked a direct flight to London.", "thai": "เขาจองเที่ยวบินตรงไปลอนดอน"}
{"word": "flight", "english": "The flight was smooth and on time.", "thai": "เที่ยวบินราบรื่นและตรงเวลา"}
{"word": "flight", "english": "I need a window seat for my flight.", "thai": "ฉันต้องการที่นั่งริมหน้าต่างสำหรับเที่ยวบิน"}
{"word": "flight", "english": "The flight attendant offered me a drink.", "thai": "พนักงานต้อนรับบนเครื่องบินเสนอเครื่องดื่มให้ฉัน"}
{"word": "flight", "english": "We’re catching a flight to Hawaii tomorrow.", "thai": "เราจะขึ้นเที่ยวบินไปฮาวายพรุ่งนี้"}
{"word": "flight", "english": "The flight was overbooked, so I got bumped.", "thai": "เที่ยวบินจองเกิน เลยถูกเลื่อน"}
{"word": "flight", "english": "I checked my flight status online.", "thai": "ฉันตรวจสอบสถานะเที่ยวบินออนไลน์"}
{"word": "flight", "english": "The flight includes free in-flight meals.", "thai": "เที่ยวบินรวมอาหารบนเครื่องฟรี"}
{"word": "flight", "english": "She’s excited for her flight to Paris.", "thai": "เธอตื่นเต้นกับเที่ยวบินไปปารีส"}
{"word": "flight", "english": "The flight was delayed by two hours.", "thai": "เที่ยวบินล่าช้าไปสองชั่วโมง"}
{"word": "flight", "english": "I need to change my flight to next week.", "thai": "ฉันต้องเปลี่ยนเที่ยวบินเป็นสัปดาห์หน้า"}
{"word": "flight", "english": "The flight was turbulent but safe.", "thai": "เที่ยวบินสั่นสะเทือนแต่ปลอดภัย"}
{"word": "flight", "english": "He lost his luggage on the flight.", "thai": "เขาทำกระเป๋าหายในเที่ยวบิน"}
{"word": "flight", "english": "The flight departs from gate 12.", "thai": "เที่ยวบินออกจากเกต 12"}
{"word": "flight", "english": "I’m exhausted after that long flight.", "thai": "ฉันเหนื่อยมากหลังจากเที่ยวบินยาวนาน"}
{"word": "flight", "english": "The flight was cheaper than I expected.", "thai": "เที่ยวบินถูกกว่าที่ฉันคาดไว้"}
{"word": "flight", "english": "She slept through the entire flight.", "thai": "เธอนอนหลับตลอดทั้งเที่ยวบิน"}
{"word": "flight", "english": "The flight has Wi-Fi available onboard.", "thai": "เที่ยวบินมีไวไฟให้ใช้บนเครื่อง"}
{"word": "flight", "english": "We’re boarding our flight in ten minutes.", "thai": "เราจะขึ้นเครื่องในอีกสิบนาที"}
{"word": "flight", "english": "The flight was rerouted due to a storm.", "thai": "เที่ยวบินถูกเปลี่ยนเส้นทางเพราะพายุ"}
{"word": "flight", "english": "I booked a round-trip flight to Tokyo.", "thai": "ฉันจองเที่ยวบินไปกลับโตเกียว"}
{"word": "flight", "english": "The flight attendant gave us extra snacks.", "thai": "พนักงานต้อนรับบนเครื่องให้ของว่างเพิ่ม"}
{"word": "flight", "english": "The flight was full of business travelers.", "thai": "เที่ยวบินเต็มไปด้วยนักเดินทางเพื่อธุรกิจ"}
{"word": "flight", "english": "I need to confirm my flight details.", "thai": "ฉันต้องยืนยันรายละเอียดเที่ยวบิน"}
{"word": "flight", "english": "The flight was smooth until the landing.", "thai": "เที่ยวบินราบรื่นจนถึงตอนลงจอด"}
{"word": "flight", "english": "She’s taking a flight to visit her family.", "thai": "เธอกำลังจะนั่งเที่ยวบินไปเยี่ยมครอบครัว"}
{"word": "flight", "english": "The flight was canceled without warning.", "thai": "เที่ยวบินถูกยกเลิกโดยไม่มีการเตือน"}
{"word": "flight", "english": "I got an aisle seat for the flight.", "thai": "ฉันได้ที่นั่งริมทางเดินสำหรับเที่ยวบิน"}
{"word": "flight", "english": "The flight duration is six hours.", "thai": "ระยะเวลาเที่ยวบินคือหกชั่วโมง"}
{"word": "flight", "english": "He’s tracking his flight on an app.", "thai": "เขากำลังติดตามเที่ยวบินผ่านแอป"}
{"word": "flight", "english": "The flight was delayed due to mechanical issues.", "thai": "เที่ยวบินล่าช้าเพราะปัญหาเครื่องกล"}
{"word": "flight", "english": "I need a flight with no layovers.", "thai": "ฉันต้องการเที่ยวบินที่ไม่มีการแวะพัก"}
{"word": "flight", "english": "The flight crew handled the emergency well.", "thai": "ลูกเรือจัดการสถานการณ์ฉุกเฉินได้ดี"}
{"word": "flight", "english": "We’re catching an early flight tomorrow.", "thai": "เราจะขึ้นเที่ยวบินเช้าพรุ่งนี้"}
{"word": "flight", "english": "The flight was packed with tourists.", "thai": "เที่ยวบินเต็มไปด้วยนักท่องเที่ยว"}
{"word": "flight", "english": "I forgot my book for the flight.", "thai": "ฉันลืมหนังสือสำหรับเที่ยวบิน"}
{"word": "flight", "english": "The flight includes in-flight entertainment.", "thai": "เที่ยวบินมีระบบความบันเทิงบนเครื่อง"}
{"word": "flight", "english": "She’s nervous about her connecting flight.", "thai": "เธอกังวลเกี่ยวกับเที่ยวบินต่อเครื่อง"}
{"word": "flight", "english": "The flight was diverted to another airport.", "thai": "เที่ยวบินถูกเปลี่ยนไปลงที่สนามบินอื่น"}
{"word": "flight", "english": "I need to reschedule my flight.", "thai": "ฉันต้องเปลี่ยนกำหนดการเที่ยวบิน"}
{"word": "flight", "english": "The flight attendant offered blankets.", "thai": "พนักงานต้อนรับบนเครื่องเสนอผ้าห่ม"}
{"word": "flight", "english": "We booked a flight with extra legroom.", "thai": "เราจองเที่ยวบินที่มีพื้นที่วางขาเพิ่ม"}
{"word": "flight", "english": "The flight was smooth despite the rain.", "thai": "เที่ยวบินราบรื่นแม้จะมีฝน"}
{"word": "flight", "english": "I’m excited for my flight to Italy.", "thai": "ฉันตื่นเต้นกับเที่ยวบินไปอิตาลี"}
{"word": "flight", "english": "The flight was cheaper on a weekday.", "thai": "เที่ยวบินถูกกว่าในวันธรรมดา"}
{"word": "flight", "english": "She checked her flight status this morning.", "thai": "เธอตรวจสอบสถานะเที่ยวบินเช้านี้"}
{"word": "flight", "english": "The flight was delayed for maintenance.", "thai": "เที่ยวบินล่าช้าเพราะการบำรุงรักษา"}
{"word": "flight", "english": "I need a flight to Los Angeles tonight.", "thai": "ฉันต้องการเที่ยวบินไปลอสแอนเจลิสคืนนี้"}
{"word": "flight", "english": "The flight attendant helped with my bag.", "thai": "พนักงานต้อนรับบนเครื่องช่วยจัดการกระเป๋าของฉัน"}
{"word": "flight", "english": "The flight has a stopover in Dubai.", "thai": "เที่ยวบินมีการแวะพักที่ดูไบ"}
{"word": "flight", "english": "We’re taking a flight to Alaska next month.", "thai": "เราจะนั่งเที่ยวบินไปอะแลสกาเดือนหน้า"}
{"word": "flight", "english": "The flight was canceled due to fog.", "thai": "เที่ยวบินถูกยกเลิกเพราะหมอก"}
{"word": "flight", "english": "I booked a flight with a flexible ticket.", "thai": "ฉันจองเที่ยวบินด้วยตั๋วที่ยืดหยุ่น"}
{"word": "flight", "english": "The flight was turbulent during takeoff.", "thai": "เที่ยวบินสั่นสะเทือนตอนขึ้นบิน"}
{"word": "flight", "english": "She’s taking a flight to attend a wedding.", "thai": "เธอกำลังจะนั่งเที่ยวบินไปงานแต่งงาน"}
{"word": "flight", "english": "The flight includes free checked baggage.", "thai": "เที่ยวบินรวมกระเป๋าเช็คอินฟรี"}
{"word": "flight", "english": "I need to print my flight boarding pass.", "thai": "ฉันต้องพิมพ์บัตรผ่านขึ้นเครื่องสำหรับเที่ยวบิน"}
{"word": "flight", "english": "The flight was delayed by a technical glitch.", "thai": "เที่ยวบินล่าช้าเพราะปัญหาทางเทคนิค"}
{"word": "flight", "english": "He’s tracking his flight in real-time.", "thai": "เขากำลังติดตามเที่ยวบินแบบเรียลไทม์"}
{"word": "flight", "english": "The flight was full, so I couldn’t upgrade.", "thai": "เที่ยวบินเต็ม เลยอัปเกรดไม่ได้"}
{"word": "flight", "english": "I packed snacks for the flight.", "thai": "ฉันแพ็คของว่างสำหรับเที่ยวบิน"}
{"word": "flight", "english": "The flight attendant announced a delay.", "thai": "พนักงานต้อนรับบนเครื่องประกาศเรื่องความล่าช้า"}
{"word": "flight", "english": "We’re taking a flight to see the Grand Canyon.", "thai": "เราจะนั่งเที่ยวบินไปดูแกรนด์แคนยอน"}
{"word": "flight", "english": "The flight was smooth until we hit turbulence.", "thai": "เที่ยวบินราบรื่นจนกระทั่งเจอความปั่นป่วน"}
{"word": "flight", "english": "I need a flight with a vegetarian meal option.", "thai": "ฉันต้องการเที่ยวบินที่มีตัวเลือกอาหารมังสวิรัติ"}
{"word": "flight", "english": "The flight was rerouted due to air traffic.", "thai": "เที่ยวบินถูกเปลี่ยนเส้นทางเพราะการจราจรทางอากาศ"}
{"word": "flight", "english": "She’s excited about her flight to Thailand.", "thai": "เธอตื่นเต้นกับเที่ยวบินไปประเทศไทย"}
{"word": "flight", "english": "The flight includes a free drink service.", "thai": "เที่ยวบินรวมบริการเครื่องดื่มฟรี"}
{"word": "flight", "english": "I booked a flight using my miles.", "thai": "ฉันจองเที่ยวบินโดยใช้ไมล์สะสม"}
{"word": "flight", "english": "The flight was delayed due to a crew issue.", "thai": "เที่ยวบินล่าช้าเพราะปัญหาลูกเรือ"}
{"word": "flight", "english": "We’re catching a flight to Miami tonight.", "thai": "เราจะขึ้นเที่ยวบินไปไมอามีคืนนี้"}
{"word": "flight", "english": "The flight attendant handed out blankets.", "thai": "พนักงานต้อนรับบนเครื่องแจกผ้าห่ม"}
{"word": "flight", "english": "I need to check my flight’s gate number.", "thai": "ฉันต้องตรวจสอบหมายเลขเกตของเที่ยวบิน"}
{"word": "flight", "english": "The flight was canceled due to engine trouble.", "thai": "เที่ยวบินถูกยกเลิกเพราะปัญหาเครื่องยนต์"}
{"word": "flight", "english": "She’s taking a flight to visit her sister.", "thai": "เธอกำลังจะนั่งเที่ยวบินไปเยี่ยมพี่สาว"}
{"word": "flight", "english": "The flight has a short layover in Dallas.", "thai": "เที่ยวบินมีการแวะพักสั้นๆ ที่ดัลลัส"}
{"word": "flight", "english": "I booked a flight with a refundable ticket.", "thai": "ฉันจองเที่ยวบินด้วยตั๋วที่คืนเงินได้"}
{"word": "flight", "english": "The flight was smooth and very comfortable.", "thai": "เที่ยวบินราบรื่นและสะดวกสบายมาก"}
{"word": "flight", "english": "He’s nervous about his long-haul flight.", "thai": "เขากังวลเกี่ยวกับเที่ยวบินระยะไกล"}
{"word": "flight", "english": "The flight includes free in-flight Wi-Fi.", "thai": "เที่ยวบินรวมไวไฟฟรีบนเครื่อง"}
{"word": "flight", "english": "I need to change my flight’s departure date.", "thai": "ฉันต้องเปลี่ยนวันที่ออกเดินทางของเที่ยวบิน"}
{"word": "flight", "english": "The flight was delayed due to heavy snow.", "thai": "เที่ยวบินล่าช้าเพราะหิมะตกหนัก"}
{"word": "message", "english": "I got your message about the meeting.", "thai": "ฉันได้รับข้อความของคุณเกี่ยวกับการประชุม"}
{"word": "message", "english": "Can you send me a quick message?", "thai": "คุณส่งข้อความสั้น ๆ มาให้ฉันได้ไหม"}
{"word": "message", "english": "She left a message on my voicemail.", "thai": "เธอฝากข้อความไว้ในวอยซ์เมลของฉัน"}
{"word": "message", "english": "I didn’t see your message until now.", "thai": "ฉันเพิ่งเห็นข้อความของคุณตอนนี้"}
{"word": "message", "english": "The message was clear and to the point.", "thai": "ข้อความนั้นชัดเจนและตรงประเด็น"}
{"word": "message", "english": "He sent a message through the app.", "thai": "เขาส่งข้อความผ่านแอป"}
{"word": "message", "english": "Did you get my text message?", "thai": "คุณได้รับข้อความตัวอักษรของฉันหรือเปล่า"}
{"word": "message", "english": "Her message really touched my heart.", "thai": "ข้อความของเธอทำให้ฉันซาบซึ้งใจจริง ๆ"}
{"word": "message", "english": "I’ll forward the message to the team.", "thai": "ฉันจะส่งต่อข้อความนี้ให้ทีม"}
{"word": "message", "english": "The message got lost in my inbox.", "thai": "ข้อความนั้นหายไปในกล่องจดหมายของฉัน"}
{"word": "message", "english": "Can you read the message aloud?", "thai": "คุณอ่านข้อความนั้นออกเสียงได้ไหม"}
{"word": "message", "english": "His message was kind of confusing.", "thai": "ข้อความของเขาค่อนข้างสับสน"}
{"word": "message", "english": "I sent a message to confirm the plans.", "thai": "ฉันส่งข้อความเพื่อยืนยันแผน"}
{"word": "message", "english": "She ignored my message completely.", "thai": "เธอเพิกเฉยต่อข้อความของฉันโดยสิ้นเชิง"}
{"word": "message", "english": "The message popped up on my screen.", "thai": "ข้อความนั้นปรากฏขึ้นบนหน้าจอของฉัน"}
{"word": "message", "english": "I need to reply to that message soon.", "thai": "ฉันต้องตอบกลับข้อความนั้นเร็ว ๆ นี้"}
{"word": "message", "english": "The message came through late last night.", "thai": "ข้อความนั้นมาถึงเมื่อคืนดึก"}
{"word": "message", "english": "He left a message with my assistant.", "thai": "เขาฝากข้อความไว้กับผู้ช่วยของฉัน"}
{"word": "message", "english": "I deleted the message by accident.", "thai": "ฉันลบข้อความนั้นโดยไม่ตั้งใจ"}
{"word": "message", "english": "Her message had a friendly tone.", "thai": "ข้อความของเธอมีน้ำเสียงเป็นมิตร"}
{"word": "message", "english": "Can you check if the message sent?", "thai": "คุณช่วยตรวจสอบว่าข้อความส่งไปแล้วหรือไม่"}
{"word": "message", "english": "The message was meant for someone else.", "thai": "ข้อความนั้นมีไว้สำหรับคนอื่น"}
{"word": "message", "english": "I got a message from an unknown number.", "thai": "ฉันได้รับข้อความจากเบอร์ที่ไม่รู้จัก"}
{"word": "message", "english": "The message included some important details.", "thai": "ข้อความนั้นมีรายละเอียดสำคัญบางอย่าง"}
{"word": "message", "english": "She sent a long message about her day.", "thai": "เธอส่งข้อความยาวเกี่ยวกับวันของเธอ"}
{"word": "message", "english": "I’ll leave a message if you’re not there.", "thai": "ฉันจะฝากข้อความไว้ถ้าคุณไม่อยู่"}
{"word": "message", "english": "The message was pinned in the chat.", "thai": "ข้อความนั้นถูกปักหมุดไว้ในแชท"}
{"word": "message", "english": "He didn’t respond to my message yet.", "thai": "เขายังไม่ตอบข้อความของฉันเลย"}
{"word": "message", "english": "The message was sent to the wrong group.", "thai": "ข้อความนั้นถูกส่งไปยังกลุ่มผิด"}
{"word": "message", "english": "I saw your message on social media.", "thai": "ฉันเห็นข้อความของคุณบนโซเชียลมีเดีย"}
{"word": "message", "english": "Can you edit the message before sending?", "thai": "คุณแก้ไขข้อความก่อนส่งได้ไหม"}
{"word": "message", "english": "I got a weird message from a stranger.", "thai": "ฉันได้รับข้อความแปลก ๆ จากคนแปลกหน้า"}
{"word": "message", "english": "She wrote a message in all caps.", "thai": "เธอเขียนข้อความด้วยตัวพิมพ์ใหญ่ทั้งหมด"}
{"word": "message", "english": "The message didn’t go through.", "thai": "ข้อความนั้นส่งไม่ถึง"}
{"word": "message", "english": "I saved the message to read later.", "thai": "ฉันบันทึกข้อความไว้อ่านทีหลัง"}
{"word": "message", "english": "His message made me laugh out loud.", "thai": "ข้อความของเขาทำให้ฉันหัวเราะดัง ๆ"}
{"word": "message", "english": "Can you pass along the message?", "thai": "คุณช่วยส่งต่อข้อความนี้ได้ไหม"}
{"word": "message", "english": "The message was about the new schedule.", "thai": "ข้อความนั้นเกี่ยวกับตารางใหม่"}
{"word": "message", "english": "I missed your message earlier.", "thai": "ฉันพลาดข้อความของคุณก่อนหน้านี้"}
{"word": "message", "english": "She sent a voice message instead.", "thai": "เธอส่งข้อความเสียงมาแทน"}
{"word": "message", "english": "The message had a lot of emojis.", "thai": "ข้อความนั้นมีอีโมจิเยอะมาก"}
{"word": "message", "english": "I got your message loud and clear.", "thai": "ฉันได้รับข้อความของคุณชัดเจนมาก"}
{"word": "message", "english": "He sent a message to apologize.", "thai": "เขาส่งข้อความมาเพื่อขอโทษ"}
{"word": "message", "english": "The message was too long to read.", "thai": "ข้อความนั้นยาวเกินกว่าจะอ่าน"}
{"word": "message", "english": "Can you delete that message for me?", "thai": "คุณช่วยลบข้อความนั้นให้ฉันได้ไหม"}
{"word": "message", "english": "I forwarded the message to my boss.", "thai": "ฉันส่งต่อข้อความนั้นให้เจ้านายของฉัน"}
{"word": "message", "english": "The message was in my spam folder.", "thai": "ข้อความนั้นอยู่ในโฟลเดอร์สแปม"}
{"word": "message", "english": "She sent a message to cancel plans.", "thai": "เธอส่งข้อความมาเพื่อยกเลิกแผน"}
{"word": "message", "english": "I got a message from the school.", "thai": "ฉันได้รับข้อความจากโรงเรียน"}
{"word": "message", "english": "The message was written in a hurry.", "thai": "ข้อความนั้นถูกเขียนอย่างเร่งรีบ"}
{"word": "message", "english": "Can you send a group message?", "thai": "คุณส่งข้อความกลุ่มได้ไหม"}
{"word": "message", "english": "His message was really inspiring.", "thai": "ข้อความของเขาให้แรงบันดาลใจมาก"}
{"word": "message", "english": "I didn’t mean to send that message.", "thai": "ฉันไม่ได้ตั้งใจส่งข้อความนั้น"}
{"word": "message", "english": "The message came with an attachment.", "thai": "ข้อความนั้นมาพร้อมไฟล์แนบ"}
{"word": "message", "english": "She left a message on the fridge.", "thai": "เธอฝากข้อความไว้บนตู้เย็น"}
{"word": "message", "english": "I’ll send a message to confirm.", "thai": "ฉันจะส่งข้อความเพื่อยืนยัน"}
{"word": "message", "english": "The message was hard to understand.", "thai": "ข้อความนั้นเข้าใจยาก"}
{"word": "message", "english": "He got my message but didn’t reply.", "thai": "เขาได้รับข้อความของฉันแต่ไม่ได้ตอบ"}
{"word": "message", "english": "Can you check your message now?", "thai": "คุณตรวจสอบข้อความของคุณตอนนี้ได้ไหม"}
{"word": "message", "english": "The message was about the party.", "thai": "ข้อความนั้นเกี่ยวกับงานปาร์ตี้"}
{"word": "message", "english": "I left a message on her desk.", "thai": "ฉันฝากข้อความไว้บนโต๊ะของเธอ"}
{"word": "message", "english": "The message was short and sweet.", "thai": "ข้อความนั้นสั้นและไพเราะ"}
{"word": "message", "english": "She sent a message to say thanks.", "thai": "เธอส่งข้อความมาเพื่อขอบคุณ"}
{"word": "message", "english": "I got a message from my cousin.", "thai": "ฉันได้รับข้อความจากลูกพี่ลูกน้องของฉัน"}
{"word": "message", "english": "The message was in my junk mail.", "thai": "ข้อความนั้นอยู่ในเมลขยะ"}
{"word": "message", "english": "Can you relay the message to her?", "thai": "คุณช่วยส่งต่อข้อความนั้นให้เธอได้ไหม"}
{"word": "message", "english": "His message was full of jokes.", "thai": "ข้อความของเขาเต็มไปด้วยมุกตลก"}
{"word": "message", "english": "I sent a message to the wrong person.", "thai": "ฉันส่งข้อความไปให้คนผิด"}
{"word": "message", "english": "The message was delivered yesterday.", "thai": "ข้อความนั้นถูกส่งเมื่อวาน"}
{"word": "message", "english": "She didn’t see my message yet.", "thai": "เธอยังไม่ได้เห็นข้อความของฉัน"}
{"word": "message", "english": "The message had a typo in it.", "thai": "ข้อความนั้นมีข้อผิดพลาดการพิมพ์"}
{"word": "message", "english": "I’ll send you a message tonight.", "thai": "ฉันจะส่งข้อความให้คุณคืนนี้"}
{"word": "message", "english": "The message was about the project.", "thai": "ข้อความนั้นเกี่ยวกับโครงการ"}
{"word": "message", "english": "He left a message on the board.", "thai": "เขาฝากข้อความไว้บนกระดาน"}
{"word": "message", "english": "The message got cut off halfway.", "thai": "ข้อความนั้นถูกตัดขาดครึ่งทาง"}
{"word": "message", "english": "Can you save that message for me?", "thai": "คุณช่วยบันทึกข้อความนั้นให้ฉันได้ไหม"}
{"word": "message", "english": "Her message was super encouraging.", "thai": "ข้อความของเธอให้กำลังใจมาก"}
{"word": "message", "english": "I got a message from the doctor.", "thai": "ฉันได้รับข้อความจากหมอ"}
{"word": "message", "english": "The message was sent anonymously.", "thai": "ข้อความนั้นถูกส่งโดยไม่ระบุตัวตน"}
{"word": "message", "english": "I’ll write a message to explain.", "thai": "ฉันจะเขียนข้อความเพื่ออธิบาย"}
{"word": "message", "english": "The message came from my boss.", "thai": "ข้อความนั้นมาจากเจ้านายของฉัน"}
{"word": "message", "english": "She sent a message with a link.", "thai": "เธอส่งข้อความมาพร้อมลิงก์"}
{"word": "message", "english": "I didn’t understand the message.", "thai": "ฉันไม่เข้าใจข้อความนั้น"}
{"word": "message", "english": "The message was in another language.", "thai": "ข้อความนั้นเป็นอีกภาษาหนึ่ง"}
{"word": "message", "english": "Can you send a message to everyone?", "thai": "คุณส่งข้อความถึงทุกคนได้ไหม"}
{"word": "message", "english": "His message was really thoughtful.", "thai": "ข้อความของเขาคิดมาดีมาก"}
{"word": "message", "english": "I got a message about the event.", "thai": "ฉันได้รับข้อความเกี่ยวกับงานอีเวนต์"}
{"word": "message", "english": "The message was a bit rude.", "thai": "ข้อความนั้นค่อนข้างหยาบคาย"}
{"word": "message", "english": "She sent a message to clarify.", "thai": "เธอส่งข้อความมาเพื่อชี้แจง"}
{"word": "message", "english": "I’ll check the message later.", "thai": "ฉันจะตรวจสอบข้อความนั้นทีหลัง"}
{"word": "message", "english": "The message was about the sale.", "thai": "ข้อความนั้นเกี่ยวกับการลดราคา"}
{"word": "message", "english": "He sent a message to check in.", "thai": "เขาส่งข้อความมาเพื่อเช็คอิน"}
{"word": "message", "english": "I got a message from my neighbor.", "thai": "ฉันได้รับข้อความจากเพื่อนบ้าน"}
{"word": "message", "english": "The message was super confusing.", "thai": "ข้อความนั้นสับสนมาก"}
{"word": "message", "english": "Can you read my message again?", "thai": "คุณอ่านข้อความของฉันอีกครั้งได้ไหม"}
{"word": "message", "english": "The message was a total surprise.", "thai": "ข้อความนั้นเป็นเรื่องเซอร์ไพรส์โดยสิ้นเชิง"}
{"word": "message", "english": "I sent a message to say sorry.", "thai": "ฉันส่งข้อความเพื่อขอโทษ"}
{"word": "appointment", "english": "I have an appointment at noon.", "thai": "ฉันมีนัดตอนเที่ยง"}
{"word": "appointment", "english": "Can you book an appointment for me?", "thai": "คุณช่วยจองนัดให้ฉันได้ไหม"}
{"word": "appointment", "english": "She missed her doctor’s appointment.", "thai": "เธอพลาดนัดกับหมอ"}
{"word": "appointment", "english": "I need to cancel my appointment.", "thai": "ฉันต้องยกเลิกนัดของฉัน"}
{"word": "appointment", "english": "The appointment is set for tomorrow.", "thai": "นัดนั้นกำหนดไว้สำหรับพรุ่งนี้"}
{"word": "appointment", "english": "He’s late for his appointment again.", "thai": "เขามาสายสำหรับนัดของเขาอีกแล้ว"}
{"word": "appointment", "english": "I got an appointment with the dentist.", "thai": "ฉันมีนัดกับหมอฟัน"}
{"word": "appointment", "english": "She scheduled an appointment online.", "thai": "เธอจองนัดทางออนไลน์"}
{"word": "appointment", "english": "The appointment lasted only ten minutes.", "thai": "นัดนั้นใช้เวลาแค่สิบนาที"}
{"word": "appointment", "english": "Can you confirm my appointment time?", "thai": "คุณยืนยันเวลานัดของฉันได้ไหม"}
{"word": "appointment", "english": "I forgot about my appointment today.", "thai": "ฉันลืมนัดของฉันวันนี้"}
{"word": "appointment", "english": "His appointment is with the manager.", "thai": "นัดของเขาคือกับผู้จัดการ"}
{"word": "appointment", "english": "I need an appointment for a haircut.", "thai": "ฉันต้องการนัดตัดผม"}
{"word": "appointment", "english": "The appointment was rescheduled to Friday.", "thai": "นัดนั้นถูกเลื่อนไปเป็นวันศุกร์"}
{"word": "appointment", "english": "She’s running late for her appointment.", "thai": "เธอกำลังไปสายสำหรับนัดของเธอ"}
{"word": "appointment", "english": "I made an appointment for next week.", "thai": "ฉันทำนัดไว้สำหรับสัปดาห์หน้า"}
{"word": "appointment", "english": "The appointment is at the clinic.", "thai": "นัดนั้นอยู่ที่คลินิก"}
{"word": "appointment", "english": "He canceled his appointment last minute.", "thai": "เขายกเลิกนัดในนาทีสุดท้าย"}
{"word": "appointment", "english": "I have a follow-up appointment soon.", "thai": "ฉันมีนัดติดตามผลเร็ว ๆ นี้"}
{"word": "appointment", "english": "Can you change my appointment time?", "thai": "คุณเปลี่ยนเวลานัดของฉันได้ไหม"}
{"word": "appointment", "english": "The appointment was quick and easy.", "thai": "นัดนั้นรวดเร็วและง่ายดาย"}
{"word": "appointment", "english": "She’s got an appointment with HR.", "thai": "เธอมีนัดกับฝ่ายบุคคล"}
{"word": "appointment", "english": "I’m waiting for my appointment now.", "thai": "ฉันกำลังรอนัดของฉันอยู่"}
{"word": "appointment", "english": "The appointment is for a check-up.", "thai": "นัดนั้นเพื่อการตรวจสุขภาพ"}
{"word": "appointment", "english": "He missed his appointment yesterday.", "thai": "เขาพลาดนัดเมื่อวาน"}
{"word": "appointment", "english": "I need to make an appointment soon.", "thai": "ฉันต้องทำนัดเร็ว ๆ นี้"}
{"word": "appointment", "english": "The appointment is at three o’clock.", "thai": "นัดนั้นตอนสามโมง"}
{"word": "appointment", "english": "She got an appointment with a specialist.", "thai": "เธอมีนัดกับผู้เชี่ยวชาญ"}
{"word": "appointment", "english": "Can you remind me of my appointment?", "thai": "คุณช่วยเตือนฉันเรื่องนัดได้ไหม"}
{"word": "appointment", "english": "The appointment was a total waste.", "thai": "นัดนั้นเสียเวลาโดยสิ้นเชิง"}
{"word": "appointment", "english": "I have an appointment with my lawyer.", "thai": "ฉันมีนัดกับทนายของฉัน"}
{"word": "appointment", "english": "He’s got a job interview appointment.", "thai": "เขามีนัดสัมภาษณ์งาน"}
{"word": "appointment", "english": "The appointment is in the morning.", "thai": "นัดนั้นอยู่ในช่วงเช้า"}
{"word": "appointment", "english": "I can’t make that appointment time.", "thai": "ฉันไปตามเวลานัดนั้นไม่ได้"}
{"word": "appointment", "english": "She confirmed her appointment yesterday.", "thai": "เธอยืนยันนัดของเธอเมื่อวาน"}
{"word": "appointment", "english": "I’m nervous about my appointment.", "thai": "ฉันกังวลเกี่ยวกับนัดของฉัน"}
{"word": "appointment", "english": "The appointment was canceled unexpectedly.", "thai": "นัดนั้นถูกยกเลิกโดยไม่คาดคิด"}
{"word": "appointment", "english": "Can you fit me in for an appointment?", "thai": "คุณจัดนัดให้ฉันได้ไหม"}
{"word": "appointment", "english": "I have a standing weekly appointment.", "thai": "ฉันมีนัดประจำทุกสัปดาห์"}
{"word": "appointment", "english": "The appointment is with my therapist.", "thai": "นัดนั้นกับนักบำบัดของฉัน"}
{"word": "appointment", "english": "He’s got an appointment at the bank.", "thai": "เขามีนัดที่ธนาคาร"}
{"word": "appointment", "english": "I missed my appointment by accident.", "thai": "ฉันพลาดนัดโดยไม่ตั้งใจ"}
{"word": "appointment", "english": "The appointment is for a consultation.", "thai": "นัดนั้นเพื่อการปรึกษา"}
{"word": "appointment", "english": "She’s preparing for her appointment.", "thai": "เธอกำลังเตรียมนัดของเธอ"}
{"word": "appointment", "english": "I got an appointment confirmation email.", "thai": "ฉันได้รับอีเมลยืนยันนัด"}
{"word": "appointment", "english": "The appointment was over in minutes.", "thai": "นัดนั้นจบลงในไม่กี่นาที"}
{"word": "appointment", "english": "Can you call to confirm the appointment?", "thai": "คุณโทรยืนยันนัดได้ไหม"}
{"word": "appointment", "english": "I have an appointment with my advisor.", "thai": "ฉันมีนัดกับที่ปรึกษาของฉัน"}
{"word": "appointment", "english": "The appointment was at the salon.", "thai": "นัดนั้นที่ร้านเสริมสวย"}
{"word": "appointment", "english": "He forgot his appointment completely.", "thai": "เขาลืมนัดของเขาโดยสิ้นเชิง"}
{"word": "appointment", "english": "I need an appointment for my car.", "thai": "ฉันต้องการนัดสำหรับรถของฉัน"}
{"word": "appointment", "english": "The appointment is next Wednesday.", "thai": "นัดนั้นวันพุธหน้า"}
{"word": "appointment", "english": "She’s got an appointment with the vet.", "thai": "เธอมีนัดกับสัตวแพทย์"}
{"word": "appointment", "english": "I’m free after my appointment.", "thai": "ฉันว่างหลังจากนัดของฉัน"}
{"word": "appointment", "english": "The appointment was a bit rushed.", "thai": "นัดนั้นค่อนข้างเร่งรีบ"}
{"word": "appointment", "english": "Can you reschedule my appointment?", "thai": "คุณช่วยเลื่อนนัดของฉันได้ไหม"}
{"word": "appointment", "english": "I have an appointment in an hour.", "thai": "ฉันมีนัดในอีกหนึ่งชั่วโมง"}
{"word": "appointment", "english": "The appointment is for my taxes.", "thai": "นัดนั้นเกี่ยวกับภาษีของฉัน"}
{"word": "appointment", "english": "She’s got a last-minute appointment.", "thai": "เธอมีนัดในนาทีสุดท้าย"}
{"word": "appointment", "english": "I need to set up an appointment.", "thai": "ฉันต้องจัดนัด"}
{"word": "appointment", "english": "The appointment was really productive.", "thai": "นัดนั้นมีประสิทธิผลมาก"}
{"word": "appointment", "english": "He’s got an appointment with a client.", "thai": "เขามีนัดกับลูกค้า"}
{"word": "appointment", "english": "I confirmed my appointment this morning.", "thai": "ฉันยืนยันนัดของฉันเช้านี้"}
{"word": "appointment", "english": "The appointment is at the hospital.", "thai": "นัดนั้นที่โรงพยาบาล"}
{"word": "appointment", "english": "She canceled her appointment again.", "thai": "เธอยกเลิกนัดของเธออีกครั้ง"}
{"word": "appointment", "english": "I’m running late for my appointment.", "thai": "ฉันกำลังไปสายสำหรับนัดของฉัน"}
{"word": "appointment", "english": "The appointment was for a fitting.", "thai": "นัดนั้นเพื่อการลองชุด"}
{"word": "appointment", "english": "Can you make an appointment for Friday?", "thai": "คุณทำนัดสำหรับวันศุกร์ได้ไหม"}
{"word": "appointment", "english": "I have an appointment with my accountant.", "thai": "ฉันมีนัดกับนักบัญชีของฉัน"}
{"word": "appointment", "english": "The appointment went really well.", "thai": "นัดนั้นผ่านไปด้วยดี"}
{"word": "appointment", "english": "She’s got an appointment at the spa.", "thai": "เธอมีนัดที่สปา"}
{"word": "appointment", "english": "I need to schedule a new appointment.", "thai": "ฉันต้องจองนัดใหม่"}
{"word": "appointment", "english": "The appointment is for my physical.", "thai": "นัดนั้นเพื่อการตรวจร่างกาย"}
{"word": "appointment", "english": "He’s got an appointment at city hall.", "thai": "เขามีนัดที่ศาลากลาง"}
{"word": "appointment", "english": "I forgot to confirm my appointment.", "thai": "ฉันลืมยืนยันนัดของฉัน"}
{"word": "appointment", "english": "The appointment was rescheduled twice.", "thai": "นัดนั้นถูกเลื่อนสองครั้ง"}
{"word": "appointment", "english": "Can you check my appointment details?", "thai": "คุณตรวจสอบรายละเอียดนัดของฉันได้ไหม"}
{"word": "appointment", "english": "I have an appointment with the principal.", "thai": "ฉันมีนัดกับครูใหญ่"}
{"word": "appointment", "english": "The appointment is for a repair.", "thai": "นัดนั้นเพื่อการซ่อม"}
{"word": "appointment", "english": "She’s got an appointment with a counselor.", "thai": "เธอมีนัดกับที่ปรึกษา"}
{"word": "appointment", "english": "I need an appointment for my dog.", "thai": "ฉันต้องการนัดสำหรับสุนัขของฉัน"}
{"word": "appointment", "english": "The appointment was at eight sharp.", "thai": "นัดนั้นตอนแปดโมงตรง"}
{"word": "appointment", "english": "He missed his appointment this morning.", "thai": "เขาพลาดนัดเช้านี้"}
{"word": "appointment", "english": "I have an appointment for a massage.", "thai": "ฉันมีนัดสำหรับการนวด"}
{"word": "appointment", "english": "The appointment is with my professor.", "thai": "นัดนั้นกับอาจารย์ของฉัน"}
{"word": "appointment", "english": "Can you call about my appointment?", "thai": "คุณโทรเกี่ยวกับนัดของฉันได้ไหม"}
{"word": "appointment", "english": "The appointment was a bit stressful.", "thai": "นัดนั้นค่อนข้างเครียด"}
{"word": "appointment", "english": "I need to book a follow-up appointment.", "thai": "ฉันต้องจองนัดติดตามผล"}
{"word": "appointment", "english": "She’s got an appointment with a stylist.", "thai": "เธอมีนัดกับสไตลิสต์"}
{"word": "appointment", "english": "The appointment is for an eye exam.", "thai": "นัดนั้นเพื่อการตรวจตา"}
{"word": "appointment", "english": "I canceled my appointment yesterday.", "thai": "ฉันยกเลิกนัดของฉันเมื่อวาน"}
{"word": "appointment", "english": "He’s got an appointment with a recruiter.", "thai": "เขามีนัดกับนักสรรหา"}
{"word": "appointment", "english": "The appointment was super quick.", "thai": "นัดนั้นเร็วมาก"}
{"word": "appointment", "english": "I have an appointment at the gym.", "thai": "ฉันมีนัดที่ยิม"}
{"word": "appointment", "english": "Can you confirm my next appointment?", "thai": "คุณยืนยันนัดต่อไปของฉันได้ไหม"}
{"word": "appointment", "english": "The appointment is for a blood test.", "thai": "นัดนั้นเพื่อการตรวจเลือด"}
{"word": "appointment", "english": "She’s running to her appointment now.", "thai": "เธอกำลังวิ่งไปนัดของเธอ"}
{"word": "appointment", "english": "I need an appointment with a mechanic.", "thai": "ฉันต้องการนัดกับช่างยนต์"}
{"word": "appointment", "english": "The appointment was worth the wait.", "thai": "นัดนั้นคุ้มค่ากับการรอ"}
{"word": "calendar", "english": "I marked it on my calendar.", "thai": "ฉันทำเครื่องหมายไว้บนปฏิทิน"}
{"word": "calendar", "english": "Can you check my calendar for me?", "thai": "คุณช่วยตรวจสอบปฏิทินของฉันได้ไหม"}
{"word": "calendar", "english": "Her calendar is completely booked.", "thai": "ปฏิทินของเธอเต็มไปหมด"}
{"word": "calendar", "english": "I forgot to update my calendar.", "thai": "ฉันลืมอัปเดตปฏิทินของฉัน"}
{"word": "calendar", "english": "The meeting is on my calendar.", "thai": "การประชุมอยู่ในปฏิทินของฉัน"}
{"word": "calendar", "english": "He shared his calendar with me.", "thai": "เขาแชร์ปฏิทินของเขากับฉัน"}
{"word": "calendar", "english": "I need a new calendar for next year.", "thai": "ฉันต้องการปฏิทินใหม่สำหรับปีหน้า"}
{"word": "calendar", "english": "She’s got a busy calendar this week.", "thai": "ปฏิทินของเธอยุ่งมากสัปดาห์นี้"}
{"word": "calendar", "english": "I put the event on the calendar.", "thai": "ฉันใส่งานนั้นลงในปฏิทิน"}
{"word": "calendar", "english": "Can you add this to my calendar?", "thai": "คุณเพิ่มสิ่งนี้ลงในปฏิทินของฉันได้ไหม"}
{"word": "calendar", "english": "The calendar says it’s a holiday.", "thai": "ปฏิทินบอกว่าเป็นวันหยุด"}
{"word": "calendar", "english": "I checked my calendar, and I’m free.", "thai": "ฉันตรวจปฏิทินแล้ว และฉันว่าง"}
{"word": "calendar", "english": "His calendar is always full.", "thai": "ปฏิทินของเขาเต็มอยู่เสมอ"}
{"word": "calendar", "english": "I lost track of my calendar.", "thai": "ฉันลืมติดตามปฏิทินของฉัน"}
{"word": "calendar", "english": "The calendar is hanging on the wall.", "thai": "ปฏิทินแขวนอยู่บนผนัง"}
{"word": "calendar", "english": "She synced her calendar with mine.", "thai": "เธอซิงค์ปฏิทินของเธอกับของฉัน"}
{"word": "calendar", "english": "I need to clear my calendar.", "thai": "ฉันต้องเคลียร์ปฏิทินของฉัน"}
{"word": "calendar", "english": "The calendar app sent a reminder.", "thai": "แอปปฏิทินส่งการแจ้งเตือน"}
{"word": "calendar", "english": "I wrote it on the office calendar.", "thai": "ฉันเขียนมันลงในปฏิทินสำนักงาน"}
{"word": "calendar", "english": "Can you look at my calendar?", "thai": "คุณดูปฏิทินของฉันได้ไหม"}
{"word": "calendar", "english": "The calendar is out of date.", "thai": "ปฏิทินนั้นล้าสมัย"}
{"word": "calendar", "english": "I have two events on my calendar.", "thai": "ฉันมีสองงานในปฏิทินของฉัน"}
{"word": "calendar", "english": "She flipped through her calendar.", "thai": "เธอพลิกดูปฏิทินของเธอ"}
{"word": "calendar", "english": "I added a note to the calendar.", "thai": "ฉันเพิ่มบันทึกในปฏิทิน"}
{"word": "calendar", "english": "The calendar is on my desk.", "thai": "ปฏิทินอยู่บนโต๊ะของฉัน"}
{"word": "calendar", "english": "He’s got a packed calendar tomorrow.", "thai": "ปฏิทินของเขาครั้งแน่นพรุ่งนี้"}
{"word": "calendar", "english": "I forgot to check my calendar.", "thai": "ฉันลืมตรวจปฏิทินของฉัน"}
{"word": "calendar", "english": "The calendar has all my appointments.", "thai": "ปฏิทินมีนัดทั้งหมดของฉัน"}
{"word": "calendar", "english": "Can you share your calendar with me?", "thai": "คุณแชร์ปฏิทินของคุณกับฉันได้ไหม"}
{"word": "calendar", "english": "I marked the date on my calendar.", "thai": "ฉันทำเครื่องหมายวันที่ในปฏิทิน"}
{"word": "calendar", "english": "Her calendar is color-coded.", "thai": "ปฏิทินของเธอใช้สีแบ่งประเภท"}
{"word": "calendar", "english": "I need to sync my calendar.", "thai": "ฉันต้องซิงค์ปฏิทินของฉัน"}
{"word": "calendar", "english": "The calendar shows a conflict.", "thai": "ปฏิทินแสดงว่ามีการทับซ้อน"}
{"word": "calendar", "english": "I got a calendar for Christmas.", "thai": "ฉันได้ปฏิทินเป็นของขวัญคริสต์มาส"}
{"word": "calendar", "english": "She’s got an open calendar today.", "thai": "ปฏิทินของเธอว่างวันนี้"}
{"word": "calendar", "english": "I checked the calendar for availability.", "thai": "ฉันตรวจปฏิทินเพื่อดูความว่าง"}
{"word": "calendar", "english": "The calendar is in my phone.", "thai": "ปฏิทินอยู่ในโทรศัพท์ของฉัน"}
{"word": "calendar", "english": "He added the meeting to his calendar.", "thai": "เขาเพิ่มการประชุมลงในปฏิทิน"}
{"word": "calendar", "english": "I need a wall calendar for my office.", "thai": "ฉันต้องการปฏิทินติดผนังสำหรับสำนักงาน"}
{"word": "calendar", "english": "The calendar reminded me of the event.", "thai": "ปฏิทินเตือนฉันเกี่ยวกับงานนั้น"}
{"word": "calendar", "english": "Can you update the team calendar?", "thai": "คุณอัปเดตปฏิทินทีมได้ไหม"}
{"word": "calendar", "english": "I crossed it off my calendar.", "thai": "ฉันขีดฆ่ามันออกจากปฏิทิน"}
{"word": "calendar", "english": "Her calendar is always organized.", "thai": "ปฏิทินของเธอเป็นระเบียบอยู่เสมอ"}
{"word": "calendar", "english": "I need to check my work calendar.", "thai": "ฉันต้องตรวจปฏิทินงานของฉัน"}
{"word": "calendar", "english": "The calendar has a typo in it.", "thai": "ปฏิทินมีข้อผิดพลาดการพิมพ์"}
{"word": "calendar", "english": "I blocked off time on my calendar.", "thai": "ฉันจองเวลาบนปฏิทินของฉัน"}
{"word": "calendar", "english": "She gave me a pocket calendar.", "thai": "เธอให้ปฏิทินพกพากับฉัน"}
{"word": "calendar", "english": "The calendar is full this month.", "thai": "ปฏิทินเต็มเดือนนี้"}
{"word": "calendar", "english": "I put a star on the calendar.", "thai": "ฉันใส่ดาวในปฏิทิน"}
{"word": "calendar", "english": "Can you send me your calendar?", "thai": "คุณส่งปฏิทินของคุณให้ฉันได้ไหม"}
{"word": "calendar", "english": "The calendar app crashed again.", "thai": "แอปปฏิทินล่มอีกแล้ว"}
{"word": "calendar", "english": "I wrote the deadline on my calendar.", "thai": "ฉันเขียนกำหนดเวลาในปฏิทิน"}
{"word": "calendar", "english": "Her calendar is a total mess.", "thai": "ปฏิทินของเธอยุ่งเหยิงมาก"}
{"word": "calendar", "english": "I need to print my calendar.", "thai": "ฉันต้องพิมพ์ปฏิทินของฉัน"}
{"word": "calendar", "english": "The calendar is on my computer.", "thai": "ปฏิทินอยู่ในคอมพิวเตอร์ของฉัน"}
{"word": "calendar", "english": "He forgot to check his calendar.", "thai": "เขาลืมตรวจปฏิทินของเขา"}
{"word": "calendar", "english": "I have a meeting on my calendar.", "thai": "ฉันมีการประชุมในปฏิทิน"}
{"word": "calendar", "english": "The calendar is missing a page.", "thai": "ปฏิทินขาดไปหนึ่งหน้า"}
{"word": "calendar", "english": "She keeps her calendar up to date.", "thai": "เธออัปเดตปฏิทินของเธออยู่เสมอ"}
{"word": "calendar", "english": "I added a birthday to the calendar.", "thai": "ฉันเพิ่มวันเกิดลงในปฏิทิน"}
{"word": "calendar", "english": "The calendar is in my bag.", "thai": "ปฏิทินอยู่ในกระเป๋าของฉัน"}
{"word": "calendar", "english": "Can you book a slot on my calendar?", "thai": "คุณจองช่องในปฏิทินของฉันได้ไหม"}
{"word": "calendar", "english": "I checked the calendar for conflicts.", "thai": "ฉันตรวจปฏิทินเพื่อหาการทับซ้อน"}
{"word": "calendar", "english": "The calendar is shared with the team.", "thai": "ปฏิทินถูกแชร์กับทีม"}
{"word": "calendar", "english": "I got a calendar with cute pictures.", "thai": "ฉันได้ปฏิทินที่มีรูปน่ารัก"}
{"word": "calendar", "english": "She marked her vacation on the calendar.", "thai": "เธอทำเครื่องหมายวันหยุดในปฏิทิน"}
{"word": "calendar", "english": "I need to update my calendar app.", "thai": "ฉันต้องอัปเดตแอปปฏิทิน"}
{"word": "calendar", "english": "The calendar shows a busy week.", "thai": "ปฏิทินแสดงถึงสัปดาห์ที่ยุ่ง"}
{"word": "calendar", "english": "I put a reminder on my calendar.", "thai": "ฉันใส่การเตือนในปฏิทิน"}
{"word": "calendar", "english": "He’s got a meeting on his calendar.", "thai": "เขามีการประชุมในปฏิทิน"}
{"word": "calendar", "english": "The calendar is on the fridge.", "thai": "ปฏิทินอยู่บนตู้เย็น"}
{"word": "calendar", "english": "I need a digital calendar for work.", "thai": "ฉันต้องการปฏิทินดิจิทัลสำหรับงาน"}
{"word": "calendar", "english": "She forgot to add it to her calendar.", "thai": "เธอลืมเพิ่มมันลงในปฏิทิน"}
{"word": "calendar", "english": "The calendar has all the holidays.", "thai": "ปฏิทินมีวันหยุดทั้งหมด"}
{"word": "calendar", "english": "I checked my calendar this morning.", "thai": "ฉันตรวจปฏิทินเช้านี้"}
{"word": "calendar", "english": "Can you clear a day on my calendar?", "thai": "คุณเคลียร์วันในปฏิทินของฉันได้ไหม"}
{"word": "calendar", "english": "The calendar is synced with my email.", "thai": "ปฏิทินซิงค์กับอีเมลของฉัน"}
{"word": "calendar", "english": "I need to buy a desk calendar.", "thai": "ฉันต้องซื้อปฏิทินตั้งโต๊ะ"}
{"word": "calendar", "english": "She wrote a note on the calendar.", "thai": "เธอเขียนบันทึกในปฏิทิน"}
{"word": "calendar", "english": "The calendar is in my planner.", "thai": "ปฏิทินอยู่ในสมุดวางแผนของฉัน"}
{"word": "calendar", "english": "I blocked a time slot on my calendar.", "thai": "ฉันจองช่วงเวลาในปฏิทิน"}
{"word": "calendar", "english": "He checked his calendar for free time.", "thai": "เขาตรวจปฏิทินเพื่อหาเวลาว่าง"}
{"word": "calendar", "english": "The calendar is full of meetings.", "thai": "ปฏิทินเต็มไปด้วยการประชุม"}
{"word": "calendar", "english": "I got a calendar from my bank.", "thai": "ฉันได้ปฏิทินจากธนาคาร"}
{"word": "calendar", "english": "She uses a paper calendar still.", "thai": "เธอยังใช้ปฏิทินกระดาษ"}
{"word": "calendar", "english": "I need to share my calendar.", "thai": "ฉันต้องแชร์ปฏิทินของฉัน"}
{"word": "calendar", "english": "The calendar has a cool design.", "thai": "ปฏิทินมีดีไซน์เท่"}
{"word": "calendar", "english": "I forgot an event on my calendar.", "thai": "ฉันลืมงานในปฏิทินของฉัน"}
{"word": "calendar", "english": "Can you put this on the calendar?", "thai": "คุณใส่สิ่งนี้ในปฏิทินได้ไหม"}
{"word": "calendar", "english": "The calendar is on my laptop.", "thai": "ปฏิทินอยู่ในแล็ปท็อปของฉัน"}
{"word": "calendar", "english": "I marked my birthday on the calendar.", "thai": "ฉันทำเครื่องหมายวันเกิดในปฏิทิน"}
{"word": "calendar", "english": "She’s got a calendar for each month.", "thai": "เธอมีปฏิทินสำหรับแต่ละเดือน"}
{"word": "calendar", "english": "I need to check the school calendar.", "thai": "ฉันต้องตรวจปฏิทินโรงเรียน"}
{"word": "calendar", "english": "The calendar is in my app.", "thai": "ปฏิทินอยู่ในแอปของฉัน"}
{"word": "calendar", "english": "He added a task to his calendar.", "thai": "เขาเพิ่มงานลงในปฏิทิน"}
{"word": "calendar", "english": "I got a free calendar from work.", "thai": "ฉันได้ปฏิทินฟรีจากที่ทำงาน"}
{"word": "calendar", "english": "The calendar shows a full schedule.", "thai": "ปฏิทินแสดงตารางเต็ม"}
{"word": "calendar", "english": "I need to organize my calendar.", "thai": "ฉันต้องจัดระเบียบปฏิทิน"}
{"word": "calendar", "english": "She checked the calendar for dates.", "thai": "เธอตรวจปฏิทินเพื่อดูวันที่"}
{"word": "deadline", "english": "I need to meet this deadline.", "thai": "ฉันต้องทำตามกำหนดเวลานี้"}
{"word": "deadline", "english": "The deadline is tomorrow morning.", "thai": "กำหนดเวลาคือเช้าวันพรุ่งนี้"}
{"word": "deadline", "english": "She missed the project deadline.", "thai": "เธอพลาดกำหนดเวลาโครงการ"}
{"word": "deadline", "english": "Can you extend the deadline?", "thai": "คุณขยายกำหนดเวลาได้ไหม"}
{"word": "deadline", "english": "He’s stressed about the deadline.", "thai": "เขากังวลเกี่ยวกับกำหนดเวลา"}
{"word": "deadline", "english": "The deadline was moved up.", "thai": "กำหนดเวลาถูกเลื่อนให้เร็วขึ้น"}
{"word": "deadline", "english": "I forgot about the deadline!", "thai": "ฉันลืมกำหนดเวลา!"}
{"word": "deadline", "english": "We’re working against a tight deadline.", "thai": "เรากำลังทำงานภายใต้กำหนดเวลาที่คับคั่ง"}
{"word": "deadline", "english": "The deadline is non-negotiable.", "thai": "กำหนดเวลานี้ไม่สามารถต่อรองได้"}
{"word": "deadline", "english": "I’ll finish it before the deadline.", "thai": "ฉันจะทำให้เสร็จก่อนกำหนดเวลา"}
{"word": "deadline", "english": "She set a deadline for Friday.", "thai": "เธอกำหนดเวลาไว้วันศุกร์"}
{"word": "deadline", "english": "The deadline is next week.", "thai": "กำหนดเวลาคือสัปดาห์หน้า"}
{"word": "deadline", "english": "He’s racing to meet the deadline.", "thai": "เขากำลังรีบเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "I need to know the deadline.", "thai": "ฉันต้องรู้กำหนดเวลา"}
{"word": "deadline", "english": "The deadline caught me off guard.", "thai": "กำหนดเวลาทำให้ฉันประหลาดใจ"}
{"word": "deadline", "english": "Can we push the deadline back?", "thai": "เราขยับกำหนดเวลาไปข้างหลังได้ไหม"}
{"word": "deadline", "english": "The deadline is really stressing me out.", "thai": "กำหนดเวลาทำให้ฉันเครียดมาก"}
{"word": "deadline", "english": "I submitted it just before the deadline.", "thai": "ฉันส่งมันก่อนกำหนดเวลาไม่นาน"}
{"word": "deadline", "english": "She’s got a deadline to meet.", "thai": "เธอมีกำหนดเวลาที่ต้องทำตาม"}
{"word": "deadline", "english": "The deadline is at midnight.", "thai": "กำหนดเวลาคือเที่ยงคืน"}
{"word": "deadline", "english": "He ignored the deadline completely.", "thai": "เขาเพิกเฉยต่อกำหนดเวลาโดยสิ้นเชิง"}
{"word": "deadline", "english": "I’m working hard to meet the deadline.", "thai": "ฉันทำงานหนักเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "The deadline was extended by a day.", "thai": "กำหนดเวลาถูกขยายออกไปหนึ่งวัน"}
{"word": "deadline", "english": "I can’t miss this deadline.", "thai": "ฉันพลาดกำหนดเวลานี้ไม่ได้"}
{"word": "deadline", "english": "The deadline is in two hours.", "thai": "กำหนดเวลาคืออีกสองชั่วโมง"}
{"word": "deadline", "english": "She reminded me about the deadline.", "thai": "เธอเตือนฉันเกี่ยวกับกำหนดเวลา"}
{"word": "deadline", "english": "I’m way behind on the deadline.", "thai": "ฉันตามกำหนดเวลาช้าไปมาก"}
{"word": "deadline", "english": "The deadline is firm, no extensions.", "thai": "กำหนดเวลาคงที่ ไม่มีการขยาย"}
{"word": "deadline", "english": "He’s panicking about the deadline.", "thai": "เขาตื่นตระหนกเกี่ยวกับกำหนดเวลา"}
{"word": "deadline", "english": "I need to double-check the deadline.", "thai": "ฉันต้องตรวจสอบกำหนดเวลาอีกครั้ง"}
{"word": "deadline", "english": "The deadline is for the report.", "thai": "กำหนดเวลาคือสำหรับรายงาน"}
{"word": "deadline", "english": "She finished it right on the deadline.", "thai": "เธอทำให้เสร็จตรงกำหนดเวลา"}
{"word": "deadline", "english": "Can you confirm the deadline date?", "thai": "คุณยืนยันวันที่กำหนดเวลาได้ไหม"}
{"word": "deadline", "english": "I’m cutting it close to the deadline.", "thai": "ฉันใกล้ถึงกำหนดเวลาแล้ว"}
{"word": "deadline", "english": "The deadline was yesterday!", "thai": "กำหนดเวลาเมื่อวาน!"}
{"word": "deadline", "english": "He set an unrealistic deadline.", "thai": "เขากำหนดเวลาที่ไม่สมจริง"}
{"word": "deadline", "english": "I’m worried I’ll miss the deadline.", "thai": "ฉันกังวลว่าจะพลาดกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is for the proposal.", "thai": "กำหนดเวลาคือสำหรับข้อเสนอ"}
{"word": "deadline", "english": "She’s got multiple deadlines this week.", "thai": "เธอมีกำหนดเวลาหลายอย่างสัปดาห์นี้"}
{"word": "deadline", "english": "I need to prioritize this deadline.", "thai": "ฉันต้องให้ความสำคัญกับกำหนดเวลานี้"}
{"word": "deadline", "english": "The deadline is causing me stress.", "thai": "กำหนดเวลาทำให้ฉันเครียด"}
{"word": "deadline", "english": "He met the deadline just in time.", "thai": "เขาทำตามกำหนดเวลาได้ทันเวลา"}
{"word": "deadline", "english": "The deadline is for the application.", "thai": "กำหนดเวลาคือสำหรับใบสมัคร"}
{"word": "deadline", "english": "I’m scrambling to meet the deadline.", "thai": "ฉันกำลังเร่งรีบเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "Can you help me with this deadline?", "thai": "คุณช่วยฉันเกี่ยวกับกำหนดเวลานี้ได้ไหม"}
{"word": "deadline", "english": "The deadline was moved to Monday.", "thai": "กำหนดเวลาถูกเลื่อนไปวันจันทร์"}
{"word": "deadline", "english": "I totally forgot about the deadline.", "thai": "ฉันลืมกำหนดเวลาไปเลย"}
{"word": "deadline", "english": "She’s working past the deadline.", "thai": "เธอกำลังทำงานเลยกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is in three days.", "thai": "กำหนดเวลาคืออีกสามวัน"}
{"word": "deadline", "english": "He’s got a deadline to finish.", "thai": "เขามีกำหนดเวลาที่ต้องทำให้เสร็จ"}
{"word": "deadline", "english": "The deadline is for the project plan.", "thai": "กำหนดเวลาคือสำหรับแผนโครงการ"}
{"word": "deadline", "english": "I need to set a new deadline.", "thai": "ฉันต้องตั้งกำหนดเวลาใหม่"}
{"word": "deadline", "english": "The deadline is really tight.", "thai": "กำหนดเวลาคับคั่งมาก"}
{"word": "deadline", "english": "She submitted it after the deadline.", "thai": "เธอส่งมันหลังกำหนดเวลา"}
{"word": "deadline", "english": "I’m almost done with the deadline.", "thai": "ฉันเกือบเสร็จกับกำหนดเวลาแล้ว"}
{"word": "deadline", "english": "The deadline is for the contract.", "thai": "กำหนดเวลาคือสำหรับสัญญา"}
{"word": "deadline", "english": "He’s asking for a deadline extension.", "thai": "เขาขอขยายกำหนดเวลา"}
{"word": "deadline", "english": "I’m under pressure from the deadline.", "thai": "ฉันอยู่ภายใต้ความกดดันจากกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is at five today.", "thai": "กำหนดเวลาคือห้าโมงเย็นวันนี้"}
{"word": "deadline", "english": "She’s got a deadline for her essay.", "thai": "เธอมีกำหนดเวลาสำหรับเรียงความ"}
{"word": "deadline", "english": "I need to check the deadline again.", "thai": "ฉันต้องตรวจสอบกำหนดเวลาอีกครั้ง"}
{"word": "deadline", "english": "The deadline is for the budget.", "thai": "กำหนดเวลาคือสำหรับงบประมาณ"}
{"word": "deadline", "english": "He’s working to beat the deadline.", "thai": "เขากำลังทำงานเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "I’m stressed about missing the deadline.", "thai": "ฉันเครียดเกี่ยวกับการพลาดกำหนดเวลา"}
{"word": "deadline", "english": "The deadline was set last month.", "thai": "กำหนดเวลาถูกตั้งไว้เมื่อเดือนที่แล้ว"}
{"word": "deadline", "english": "Can you remind me of the deadline?", "thai": "คุณเตือนฉันเรื่องกำหนดเวลาได้ไหม"}
{"word": "deadline", "english": "The deadline is for the presentation.", "thai": "กำหนดเวลาคือสำหรับการนำเสนอ"}
{"word": "deadline", "english": "I’m trying to meet the deadline.", "thai": "ฉันพยายามทำตามกำหนดเวลา"}
{"word": "deadline", "english": "She ignored the deadline warning.", "thai": "เธอเพิกเฉยต่อคำเตือนกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is for the invoice.", "thai": "กำหนดเวลาคือสำหรับใบแจ้งหนี้"}
{"word": "deadline", "english": "He’s got a deadline this afternoon.", "thai": "เขามีกำหนดเวลาบ่ายนี้"}
{"word": "deadline", "english": "I need to clarify the deadline.", "thai": "ฉันต้องชี้แจงกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is for the grant.", "thai": "กำหนดเวลาคือสำหรับเงินช่วยเหลือ"}
{"word": "deadline", "english": "She’s rushing to meet the deadline.", "thai": "เธอกำลังรีบเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "I missed the deadline by an hour.", "thai": "ฉันพลาดกำหนดเวลาไปหนึ่งชั่วโมง"}
{"word": "deadline", "english": "The deadline is for the application form.", "thai": "กำหนดเวลาคือสำหรับแบบฟอร์มใบสมัคร"}
{"word": "deadline", "english": "He’s got a deadline for his article.", "thai": "เขามีกำหนดเวลาสำหรับบทความของเขา"}
{"word": "deadline", "english": "I need to adjust the deadline.", "thai": "ฉันต้องปรับกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is for the review.", "thai": "กำหนดเวลาคือสำหรับการทบทวน"}
{"word": "deadline", "english": "She’s got a deadline to submit.", "thai": "เธอมีกำหนดเวลาที่ต้องส่ง"}
{"word": "deadline", "english": "I’m working to meet a deadline.", "thai": "ฉันกำลังทำงานเพื่อให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "The deadline was announced yesterday.", "thai": "กำหนดเวลาถูกประกาศเมื่อวาน"}
{"word": "deadline", "english": "He’s got a deadline for the design.", "thai": "เขามีกำหนดเวลาสำหรับการออกแบบ"}
{"word": "deadline", "english": "I need to meet this urgent deadline.", "thai": "ฉันต้องทำตามกำหนดเวลานี้อย่างเร่งด่วน"}
{"word": "deadline", "english": "The deadline is for the paperwork.", "thai": "กำหนดเวลาคือสำหรับเอกสาร"}
{"word": "deadline", "english": "She’s got a deadline for her project.", "thai": "เธอมีกำหนดเวลาสำหรับโครงการของเธอ"}
{"word": "deadline", "english": "I’m nervous about the deadline.", "thai": "ฉันกังวลเกี่ยวกับกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is for the submission.", "thai": "กำหนดเวลาคือสำหรับการส่ง"}
{"word": "deadline", "english": "He’s got a deadline this evening.", "thai": "เขามีกำหนดเวลาค่ำนี้"}
{"word": "deadline", "english": "I need to confirm the deadline time.", "thai": "ฉันต้องยืนยันเวลากำหนดเวลา"}
{"word": "deadline", "english": "The deadline is for the final draft.", "thai": "กำหนดเวลาคือสำหรับร่างสุดท้าย"}
{"word": "deadline", "english": "She’s got a deadline for her homework.", "thai": "เธอมีกำหนดเวลาสำหรับการบ้าน"}
{"word": "deadline", "english": "I’m pushing to meet the deadline.", "thai": "ฉันกำลังพยายามให้ทันกำหนดเวลา"}
{"word": "deadline", "english": "The deadline is for the payment.", "thai": "กำหนดเวลาคือสำหรับการชำระเงิน"}
{"word": "deadline", "english": "He missed the deadline by a day.", "thai": "เขาพลาดกำหนดเวลาไปหนึ่งวัน"}
{"word": "deadline", "english": "I need to know the exact deadline.", "thai": "ฉันต้องรู้กำหนดเวลาที่แน่นอน"}
{"word": "deadline", "english": "The deadline is for the registration.", "thai": "กำหนดเวลาคือสำหรับการลงทะเบียน"}
{"word": "deadline", "english": "She’s got a deadline to finish.", "thai": "เธอมีกำหนดเวลาที่ต้องทำให้เสร็จ"}
{"word": "deadline", "english": "I’m close to missing the deadline.", "thai": "ฉันใกล้จะพลาดกำหนดเวลาแล้ว"}
{"word": "inventory", "english": "We need to check the inventory.", "thai": "เราต้องตรวจสอบสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is running low.", "thai": "สินค้าคงคลังกำลังจะหมด"}
{"word": "inventory", "english": "I updated the inventory list.", "thai": "ฉันอัปเดตรายการสินค้าคงคลัง"}
{"word": "inventory", "english": "She’s counting the inventory now.", "thai": "เธอกำลังนับสินค้าคงคลังอยู่"}
{"word": "inventory", "english": "The inventory is in the warehouse.", "thai": "สินค้าคงคลังอยู่ในโกดัง"}
{"word": "inventory", "english": "We have too much inventory.", "thai": "เรามีสินค้าคงคลังมากเกินไป"}
{"word": "inventory", "english": "Can you manage the inventory?", "thai": "คุณจัดการสินค้าคงคลังได้ไหม"}
{"word": "inventory", "english": "The inventory report is due.", "thai": "รายงานสินค้าคงคลังถึงกำหนดส่ง"}
{"word": "inventory", "english": "I need to review the inventory.", "thai": "ฉันต้องตรวจสอบสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is out of stock.", "thai": "สินค้าคงคลังหมดสต็อก"}
{"word": "inventory", "english": "He’s organizing the inventory.", "thai": "เขากำลังจัดระเบียบสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory system crashed.", "thai": "ระบบสินค้าคงคลังล่ม"}
{"word": "inventory", "english": "We’re doing an inventory check.", "thai": "เรากำลังทำการตรวจสอบสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is stored safely.", "thai": "สินค้าคงคลังถูกเก็บไว้อย่างปลอดภัย"}
{"word": "inventory", "english": "I added items to the inventory.", "thai": "ฉันเพิ่มรายการลงในสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory needs updating.", "thai": "สินค้าคงคลังต้องการการอัปเดต"}
{"word": "inventory", "english": "She’s in charge of inventory.", "thai": "เธอรับผิดชอบสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is overstocked.", "thai": "สินค้าคงคลังมีมากเกินไป"}
{"word": "inventory", "english": "Can you audit the inventory?", "thai": "คุณตรวจสอบสินค้าคงคลังได้ไหม"}
{"word": "inventory", "english": "The inventory list is incomplete.", "thai": "รายการสินค้าคงคลังไม่สมบูรณ์"}
{"word": "inventory", "english": "I checked the inventory yesterday.", "thai": "ฉันตรวจสอบสินค้าคงคลังเมื่อวาน"}
{"word": "inventory", "english": "The inventory is in the back.", "thai": "สินค้าคงคลังอยู่ด้านหลัง"}
{"word": "inventory", "english": "We need to reorder inventory.", "thai": "เราต้องสั่งสินค้าคงคลังใหม่"}
{"word": "inventory", "english": "The inventory is fully stocked.", "thai": "สินค้าคงคลังเต็มสต็อก"}
{"word": "inventory", "english": "He’s updating the inventory now.", "thai": "เขากำลังอัปเดตสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory count was off.", "thai": "การนับสินค้าคงคลังผิดพลาด"}
{"word": "inventory", "english": "I’m working on the inventory.", "thai": "ฉันกำลังทำงานเกี่ยวกับสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is on the computer.", "thai": "สินค้าคงคลังอยู่ในคอมพิวเตอร์"}
{"word": "inventory", "english": "She forgot to check the inventory.", "thai": "เธอลืมตรวจสอบสินค้าคงคลัง"}
{"word": "inventory", "english": "We’re low on inventory again.", "thai": "สินค้าคงคลังของเราต่ำอีกครั้ง"}
{"word": "inventory", "english": "The inventory is in the system.", "thai": "สินค้าคงคลังอยู่ในระบบ"}
{"word": "inventory", "english": "I need the inventory report.", "thai": "ฉันต้องการรายงานสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is getting old.", "thai": "สินค้าคงคลังเริ่มเก่า"}
{"word": "inventory", "english": "Can you track the inventory?", "thai": "คุณติดตามสินค้าคงคลังได้ไหม"}
{"word": "inventory", "english": "The inventory is in good shape.", "thai": "สินค้าคงคลังอยู่ในสภาพดี"}
{"word": "inventory", "english": "We’re running out of inventory.", "thai": "สินค้าคงคลังของเรากำลังหมด"}
{"word": "inventory", "english": "I sorted the inventory today.", "thai": "ฉันจัดเรียงสินค้าคงคลังวันนี้"}
{"word": "inventory", "english": "The inventory needs to be restocked.", "thai": "สินค้าคงคลังต้องเติมใหม่"}
{"word": "inventory", "english": "She’s reviewing the inventory now.", "thai": "เธอกำลังตรวจสอบสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is almost gone.", "thai": "สินค้าคงคลังเกือบหมด"}
{"word": "inventory", "english": "I need to see the inventory.", "thai": "ฉันต้องดูสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory was miscounted.", "thai": "สินค้าคงคลังถูกนับผิด"}
{"word": "inventory", "english": "Can you update the inventory list?", "thai": "คุณอัปเดตรายการสินค้าคงคลังได้ไหม"}
{"word": "inventory", "english": "The inventory is stored upstairs.", "thai": "สินค้าคงคลังถูกเก็บไว้ชั้นบน"}
{"word": "inventory", "english": "I checked the inventory this morning.", "thai": "ฉันตรวจสอบสินค้าคงคลังเช้านี้"}
{"word": "inventory", "english": "The inventory is in short supply.", "thai": "สินค้าคงคลังมีจำนวนจำกัด"}
{"word": "inventory", "english": "He’s managing the inventory system.", "thai": "เขากำลังจัดการระบบสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is on the shelves.", "thai": "สินค้าคงคลังอยู่บนชั้นวาง"}
{"word": "inventory", "english": "We need to reduce excess inventory.", "thai": "เราต้องลดสินค้าคงคลังส่วนเกิน"}
{"word": "inventory", "english": "The inventory check took hours.", "thai": "การตรวจสอบสินค้าคงคลังใช้เวลาหลายชั่วโมง"}
{"word": "inventory", "english": "I’m updating the inventory database.", "thai": "ฉันกำลังอัปเดตฐานข้อมูลสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is in the storeroom.", "thai": "สินค้าคงคลังอยู่ในห้องเก็บของ"}
{"word": "inventory", "english": "She’s auditing the inventory today.", "thai": "เธอกำลังตรวจสอบสินค้าคงคลังวันนี้"}
{"word": "inventory", "english": "The inventory is low on supplies.", "thai": "สินค้าคงคลังมีอุปกรณ์น้อย"}
{"word": "inventory", "english": "I need to order more inventory.", "thai": "ฉันต้องสั่งสินค้าคงคลังเพิ่ม"}
{"word": "inventory", "english": "The inventory is tracked online.", "thai": "สินค้าคงคลังถูกติดตามทางออนไลน์"}
{"word": "inventory", "english": "He forgot to update the inventory.", "thai": "เขาลืมอัปเดตสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is in the basement.", "thai": "สินค้าคงคลังอยู่ในชั้นใต้ดิน"}
{"word": "inventory", "english": "We’re doing a full inventory count.", "thai": "เรากำลังนับสินค้าคงคลังทั้งหมด"}
{"word": "inventory", "english": "The inventory is ready for sale.", "thai": "สินค้าคงคลังพร้อมสำหรับการขาย"}
{"word": "inventory", "english": "I need to check the inventory levels.", "thai": "ฉันต้องตรวจสอบระดับสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is organized by category.", "thai": "สินค้าคงคลังถูกจัดระเบียบตามหมวดหมู่"}
{"word": "inventory", "english": "She’s working on inventory control.", "thai": "เธอกำลังทำงานเกี่ยวกับการควบคุมสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is in the backroom.", "thai": "สินค้าคงคลังอยู่ในห้องด้านหลัง"}
{"word": "inventory", "english": "I need to adjust the inventory.", "thai": "ฉันต้องปรับสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory was checked last week.", "thai": "สินค้าคงคลังถูกตรวจสอบเมื่อสัปดาห์ที่แล้ว"}
{"word": "inventory", "english": "We’re low on inventory for that item.", "thai": "สินค้าคงคลังสำหรับรายการนั้นต่ำ"}
{"word": "inventory", "english": "The inventory is stored off-site.", "thai": "สินค้าคงคลังถูกเก็บไว้นอกสถานที่"}
{"word": "inventory", "english": "I’m reviewing the inventory report.", "thai": "ฉันกำลังตรวจสอบรายงานสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is in high demand.", "thai": "สินค้าคงคลังมีความต้องการสูง"}
{"word": "inventory", "english": "Can you help with the inventory?", "thai": "คุณช่วยเกี่ยวกับสินค้าคงคลังได้ไหม"}
{"word": "inventory", "english": "The inventory is on the spreadsheet.", "thai": "สินค้าคงคลังอยู่ในสเปรดชีต"}
{"word": "inventory", "english": "She’s managing the store’s inventory.", "thai": "เธอกำลังจัดการสินค้าคงคลังของร้าน"}
{"word": "inventory", "english": "The inventory needs to be cleared.", "thai": "สินค้าคงคลังต้องถูกเคลียร์"}
{"word": "inventory", "english": "I checked the inventory this afternoon.", "thai": "ฉันตรวจสอบสินค้าคงคลังบ่ายนี้"}
{"word": "inventory", "english": "The inventory is out of balance.", "thai": "สินค้าคงคลังไม่สมดุล"}
{"word": "inventory", "english": "We need to restock the inventory.", "thai": "เราต้องเติมสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is in the database.", "thai": "สินค้าคงคลังอยู่ในฐานข้อมูล"}
{"word": "inventory", "english": "I’m doing an inventory audit.", "thai": "ฉันกำลังทำการตรวจสอบสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is almost depleted.", "thai": "สินค้าคงคลังเกือบหมด"}
{"word": "inventory", "english": "She’s updating the inventory records.", "thai": "เธอกำลังอัปเดตบันทึกสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is in the stockroom.", "thai": "สินค้าคงคลังอยู่ในห้องสต็อก"}
{"word": "inventory", "english": "I need to verify the inventory.", "thai": "ฉันต้องยืนยันสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is labeled clearly.", "thai": "สินค้าคงคลังถูกติดป้ายอย่างชัดเจน"}
{"word": "inventory", "english": "We’re overstocked on inventory.", "thai": "เรามีสินค้าคงคลังมากเกินไป"}
{"word": "inventory", "english": "The inventory is in the system now.", "thai": "สินค้าคงคลังอยู่ในระบบแล้ว"}
{"word": "inventory", "english": "I need to recount the inventory.", "thai": "ฉันต้องนับสินค้าคงคลังใหม่"}
{"word": "inventory", "english": "The inventory is stored in boxes.", "thai": "สินค้าคงคลังถูกเก็บในกล่อง"}
{"word": "inventory", "english": "She’s tracking the inventory daily.", "thai": "เธอกำลังติดตามสินค้าคงคลังทุกวัน"}
{"word": "inventory", "english": "The inventory is ready to ship.", "thai": "สินค้าคงคลังพร้อมจัดส่ง"}
{"word": "inventory", "english": "I need to manage the inventory.", "thai": "ฉันต้องจัดการสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory was updated yesterday.", "thai": "สินค้าคงคลังถูกอัปเดตเมื่อวาน"}
{"word": "inventory", "english": "We’re short on inventory items.", "thai": "เราขาดแคลนรายการสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is in the catalog.", "thai": "สินค้าคงคลังอยู่ในแคตตาล็อก"}
{"word": "inventory", "english": "I’m checking the inventory levels.", "thai": "ฉันกำลังตรวจสอบระดับสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is in the office.", "thai": "สินค้าคงคลังอยู่ในสำนักงาน"}
{"word": "inventory", "english": "She’s handling the inventory update.", "thai": "เธอกำลังจัดการการอัปเดตสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is low this month.", "thai": "สินค้าคงคลังต่ำในเดือนนี้"}
{"word": "inventory", "english": "I need to finalize the inventory.", "thai": "ฉันต้องสรุปสินค้าคงคลัง"}
{"word": "inventory", "english": "The inventory is in perfect order.", "thai": "สินค้าคงคลังอยู่ในระเบียบสมบูรณ์"}
