{"word": "wait", "english": "Can you wait for me at the bus stop?", "thai": "คุณรอฉันที่ป้ายรถเมล์ได้ไหม?"}
{"word": "wait", "english": "I had to wait in line for two hours!", "thai": "ฉันต้องรอคิวสองชั่วโมง!"}
{"word": "wait", "english": "Just wait until you hear this news!", "thai": "รอจนกว่าคุณจะได้ยินข่าวนี้!"}
{"word": "wait", "english": "Wait, did you just say you're moving?", "thai": "เดี๋ยว คุณเพิ่งบอกว่าคุณจะย้ายเหรอ?"}
{"word": "wait", "english": "Please wait here until I get back.", "thai": "กรุณารอที่นี่จนกว่าฉันจะกลับมา"}
{"word": "wait", "english": "I can’t wait to try this new restaurant!", "thai": "ฉันรอไม่ไหวแล้วที่จะลองร้านอาหารใหม่นี้!"}
{"word": "wait", "english": "Wait a second, I forgot my keys!", "thai": "เดี๋ยวก่อน ฉันลืมกุญแจ!"}
{"word": "wait", "english": "You have to wait for the green light.", "thai": "คุณต้องรอสัญญาณไฟเขียว"}
{"word": "wait", "english": "I’m tired of waiting for this package.", "thai": "ฉันเบื่อที่ต้องรอพัสดุนี้"}
{"word": "wait", "english": "Wait, let me grab my jacket first.", "thai": "เดี๋ยว ขอฉันหยิบเสื้อแจ็คเก็ตก่อน"}
{"word": "wait", "english": "Can you wait until I finish this call?", "thai": "คุณรอจนกว่าฉันจะคุยโทรศัพท์เสร็จได้ไหม?"}
{"word": "wait", "english": "I’ll wait for you in the car.", "thai": "ฉันจะรอคุณอยู่ในรถ"}
{"word": "wait", "english": "Wait up, I’m coming with you!", "thai": "รอด้วย ฉันจะไปกับคุณ!"}
{"word": "wait", "english": "She told me to wait outside the store.", "thai": "เธอบอกให้ฉันรอนอกโรง"}
{"word": "wait", "english": "I can’t wait to see the movie tonight!", "thai": "ฉันรอไม่ไหวแล้วที่จะดูหนังคืนนี้!"}
{"word": "wait", "english": "Wait, are you serious right now?", "thai": "เดี๋ยว คุณพูดจริงเหรอตอนนี้?"}
{"word": "wait", "english": "Let’s wait for the rain to stop.", "thai": "รอให้ฝนหยุดก่อน"}
{"word": "wait", "english": "I had to wait forever at the doctor’s office.", "thai": "ฉันต้องรอนานมากที่คลินิกหมอ"}
{"word": "wait", "english": "Wait a minute, I’ll be right back.", "thai": "เดี๋ยวก่อน ฉันจะกลับมาเดี๋ยวนี้"}
{"word": "wait", "english": "Why do we always have to wait?", "thai": "ทำไมเราต้องรอตลอดเลย?"}
{"word": "wait", "english": "Wait, I think I dropped my phone!", "thai": "เดี๋ยว ฉันคิดว่าฉันทำโทรศัพท์หล่น!"}
{"word": "wait", "english": "I’ll wait until you’re ready to talk.", "thai": "ฉันจะรอจนกว่าคุณพร้อมจะคุย"}
{"word": "wait", "english": "Can you wait just one more minute?", "thai": "คุณรออีกแค่นาทีเดียวได้ไหม?"}
{"word": "wait", "english": "Wait, that’s not what I meant!", "thai": "เดี๋ยว นั่นไม่ใช่สิ่งที่ฉันหมายถึง!"}
{"word": "wait", "english": "We need to wait for the boss’s approval.", "thai": "เราต้องรอการอนุมัติจากเจ้านาย"}
{"word": "wait", "english": "I can’t wait for summer vacation!", "thai": "ฉันรอวันหยุดฤดูร้อนไม่ไหวแล้ว!"}
{"word": "wait", "english": "Wait here while I check inside.", "thai": "รอที่นี่เดี๋ยวฉันไปเช็คข้างใน"}
{"word": "wait", "english": "Wait, you forgot your wallet!", "thai": "เดี๋ยว คุณลืมกระเป๋าสตางค์!"}
{"word": "wait", "english": "I’ve been waiting for this moment all day.", "thai": "ฉันรอช่วงเวลานี้มาทั้งวัน"}
{"word": "wait", "english": "Wait, let’s take a selfie first!", "thai": "เดี๋ยว มาถ่ายเซลฟี่กันก่อน!"}
{"word": "wait", "english": "You can’t wait to open your gifts, can you?", "thai": "คุณรอไม่ไหวที่จะเปิดของขวัญใช่ไหม?"}
{"word": "wait", "english": "I’ll wait for you at the coffee shop.", "thai": "ฉันจะรอคุณที่ร้านกาแฟ"}
{"word": "wait", "english": "Wait, I need to tie my shoes.", "thai": "เดี๋ยว ฉันต้องผูกเชือกรองเท้า"}
{"word": "wait", "english": "We had to wait for the delayed flight.", "thai": "เราต้องรอเที่ยวบินที่ล่าช้า"}
{"word": "wait", "english": "Wait, I don’t understand what you mean.", "thai": "เดี๋ยว ฉันไม่เข้าใจว่าคุณหมายถึงอะไร"}
{"word": "wait", "english": "I can’t wait to meet your new puppy!", "thai": "ฉันรอไม่ไหวแล้วที่จะเจอหมาน้อยตัวใหม่ของคุณ!"}
{"word": "wait", "english": "Wait a sec, I’m almost done.", "thai": "เดี๋ยวก่อน ฉันเกือบเสร็จแล้ว"}
{"word": "wait", "english": "Let’s wait until the price drops.", "thai": "รอจนกว่าราคาจะลดลง"}
{"word": "wait", "english": "Wait, is that your new car?", "thai": "เดี๋ยว นั่นรถใหม่ของคุณเหรอ?"}
{"word": "wait", "english": "I’ll wait for you after class.", "thai": "ฉันจะรอคุณหลังเลิกเรียน"}
{"word": "wait", "english": "Wait, you’re going to the concert too?", "thai": "เดี๋ยว คุณก็ไปคอนเสิร์ตด้วยเหรอ?"}
{"word": "wait", "english": "Can we wait for the next train?", "thai": "เรารอรถไฟขบวนถัดไปได้ไหม?"}
{"word": "wait", "english": "I’ve been waiting for this sale all year!", "thai": "ฉันรอเซลนี้มาทั้งปี!"}
{"word": "wait", "english": "Wait, I think I know that guy!", "thai": "เดี๋ยว ฉันคิดว่าฉันรู้จักผู้ชายคนนั้น!"}
{"word": "wait", "english": "Please wait while I grab my bag.", "thai": "กรุณารอเดี๋ยวฉันไปหยิบกระเป๋า"}
{"word": "wait", "english": "I can’t wait to hear your story!", "thai": "ฉันรอไม่ไหวแล้วที่จะฟังเรื่องราวของคุณ!"}
{"word": "wait", "english": "Wait, let me write that down.", "thai": "เดี๋ยว ขอฉันจดไว้ก่อน"}
{"word": "wait", "english": "We should wait for better weather.", "thai": "เราควรรอให้อากาศดีกว่านี้"}
{"word": "wait", "english": "Wait, you didn’t tell me about this!", "thai": "เดี๋ยว คุณไม่ได้บอกฉันเกี่ยวกับเรื่องนี้!"}
{"word": "wait", "english": "I’ll wait until the meeting is over.", "thai": "ฉันจะรอจนกว่าการประชุมจะจบ"}
{"word": "wait", "english": "Wait, I need to call my mom first.", "thai": "เดี๋ยว ฉันต้องโทรหาแม่ก่อน"}
{"word": "wait", "english": "I can’t wait to go on this trip!", "thai": "ฉันรอไม่ไหวแล้วที่จะไปทริปนี้!"}
{"word": "wait", "english": "Wait, where did you get that shirt?", "thai": "เดี๋ยว คุณซื้อเสื้อตัวนั้นมาจากไหน?"}
{"word": "wait", "english": "Let’s wait for everyone to arrive.", "thai": "รอให้ทุกคนมาถึงก่อน"}
{"word": "wait", "english": "I had to wait for the bus in the rain.", "thai": "ฉันต้องรอรถเมล์ท่ามกลางฝน"}
{"word": "wait", "english": "Wait, I think I left the stove on!", "thai": "เดี๋ยว ฉันคิดว่าฉันลืมปิดเตา!"}
{"word": "wait", "english": "I’ll wait for you at the gate.", "thai": "ฉันจะรอคุณที่ประตู"}
{"word": "wait", "english": "Wait, you’re breaking up with me?", "thai": "เดี๋ยว คุณจะเลิกกับฉันเหรอ?"}
{"word": "wait", "english": "Can you wait until I’m done eating?", "thai": "คุณรอจนกว่าฉันจะกินข้าวเสร็จได้ไหม?"}
{"word": "wait", "english": "I can’t wait to see you tomorrow!", "thai": "ฉันรอไม่ไหวแล้วที่จะเจอคุณพรุ่งนี้!"}
{"word": "wait", "english": "Wait, I need to check my email first.", "thai": "เดี๋ยว ฉันต้องเช็คอีเมลก่อน"}
{"word": "wait", "english": "We’ll wait for the results tomorrow.", "thai": "เราจะรอผลพรุ่งนี้"}
{"word": "wait", "english": "Wait, did you just win the lottery?", "thai": "เดี๋ยว คุณเพิ่งถูกลอตเตอรี่เหรอ?"}
{"word": "wait", "english": "I’ll wait for you at the park.", "thai": "ฉันจะรอคุณที่สวนสาธารณะ"}
{"word": "wait", "english": "Wait, I think I lost my glasses!", "thai": "เดี๋ยว ฉันคิดว่าฉันทำแว่นตาหาย!"}
{"word": "wait", "english": "I can’t wait to start this project!", "thai": "ฉันรอไม่ไหวแล้วที่จะเริ่มโปรเจกต์นี้!"}
{"word": "wait", "english": "Wait, let’s check the map first.", "thai": "เดี๋ยว มาดูแผนที่กันก่อน"}
{"word": "wait", "english": "I had to wait for the pizza delivery.", "thai": "ฉันต้องรอพิซซ่ามาส่ง"}
{"word": "wait", "english": "Wait, you know how to skateboard?", "thai": "เดี๋ยว คุณเล่นสเก็ตบอร์ดเป็นเหรอ?"}
{"word": "wait", "english": "Let’s wait until the store opens.", "thai": "รอจนกว่าร้านจะเปิด"}
{"word": "wait", "english": "I’ll wait for you by the entrance.", "thai": "ฉันจะรอคุณที่ทางเข้า"}
{"word": "wait", "english": "Wait, I need to charge my phone.", "thai": "เดี๋ยว ฉันต้องชาร์จโทรศัพท์"}
{"word": "wait", "english": "I can’t wait for the weekend!", "thai": "ฉันรอสุดสัปดาห์ไม่ไหวแล้ว!"}
{"word": "wait", "english": "Wait, you’re moving to another state?", "thai": "เดี๋ยว คุณจะย้ายไปอีกรัฐเหรอ?"}
{"word": "wait", "english": "I’ll wait until the game starts.", "thai": "ฉันจะรอจนกว่าเกมจะเริ่ม"}
{"word": "wait", "english": "Wait, I think I saw that movie!", "thai": "เดี๋ยว ฉันคิดว่าฉันเคยดูหนังเรื่องนั้น!"}
{"word": "wait", "english": "Can you wait for me after work?", "thai": "คุณรอฉันหลังเลิกงานได้ไหม?"}
{"word": "wait", "english": "Wait, let me finish this sentence.", "thai": "เดี๋ยว ขอฉันพูดประโยคนี้ให้จบก่อน"}
{"word": "wait", "english": "I can’t wait to try your cooking!", "thai": "ฉันรอไม่ไหวแล้วที่จะลองอาหารที่คุณทำ!"}
{"word": "wait", "english": "Wait, did I lock the door?", "thai": "เดี๋ยว ฉันล็อกประตูหรือยัง?"}
{"word": "wait", "english": "Let’s wait for the others to join.", "thai": "รอให้คนอื่นมาร่วมด้วย"}
{"word": "wait", "english": "I had to wait for my turn to speak.", "thai": "ฉันต้องรอถึงคิวของฉันที่จะพูด"}
{"word": "wait", "english": "Wait, you got a new haircut?", "thai": "เดี๋ยว คุณตัดผมใหม่เหรอ?"}
{"word": "wait", "english": "I’ll wait for you at the library.", "thai": "ฉันจะรอคุณที่ห้องสมุด"}
{"word": "wait", "english": "Wait, I forgot to send that email!", "thai": "เดี๋ยว ฉันลืมส่งอีเมลนั้น!"}
{"word": "wait", "english": "I can’t wait to visit that museum!", "thai": "ฉันรอไม่ไหวแล้วที่จะไปพิพิธภัณฑ์นั้น!"}
{"word": "wait", "english": "Wait, let me get my sunglasses.", "thai": "เดี๋ยว ขอฉันหยิบแว่นกันแดดก่อน"}
{"word": "wait", "english": "We should wait for a better deal.", "thai": "เราควรรอข้อเสนอที่ดีกว่านี้"}
{"word": "wait", "english": "Wait, you met a celebrity yesterday?", "thai": "เดี๋ยว คุณเจอดาราเมื่อวานนี้เหรอ?"}
{"word": "wait", "english": "I’ll wait until you’re done with that.", "thai": "ฉันจะรอจนกว่าคุณจะทำสิ่งนั้นเสร็จ"}
{"word": "wait", "english": "Wait, I need to grab some water.", "thai": "เดี๋ยว ฉันต้องไปหยิบน้ำ"}
{"word": "wait", "english": "I can’t wait for the new season to drop!", "thai": "ฉันรอไม่ไหวแล้วที่ซีซั่นใหม่จะออก!"}
{"word": "wait", "english": "Wait, where’s my backpack?", "thai": "เดี๋ยว กระเป๋าเป้ของฉันอยู่ไหน?"}
{"word": "wait", "english": "Let’s wait for the traffic to clear.", "thai": "รอให้รถติดเคลียร์ก่อน"}
{"word": "wait", "english": "I had to wait for the repair guy.", "thai": "ฉันต้องรอช่างซ่อม"}
{"word": "wait", "english": "Wait, you’re allergic to peanuts?", "thai": "เดี๋ยว คุณแพ้ถั่วลิสงเหรอ?"}
{"word": "wait", "english": "I’ll wait for you at the mall.", "thai": "ฉันจะรอคุณที่ห้าง"}
{"word": "wait", "english": "Wait, I think I missed my stop!", "thai": "เดี๋ยว ฉันคิดว่าฉันเลยป้ายไปแล้ว!"}
{"word": "wait", "english": "I can’t wait to show you my new place!", "thai": "ฉันรอไม่ไหวแล้วที่จะโชว์บ้านใหม่ให้คุณดู!"}
{"word": "walk", "english": "I love to walk in the park every morning.", "thai": "ฉันชอบเดินเล่นในสวนทุกเช้า"}
{"word": "walk", "english": "Can you walk the dog this afternoon?", "thai": "คุณพาน้องหมาไปเดินเล่นบ่ายนี้ได้ไหม?"}
{"word": "walk", "english": "Let’s walk to the coffee shop together.", "thai": "ไปเดินไปร้านกาแฟด้วยกันเถอะ"}
{"word": "walk", "english": "I had to walk home in the rain yesterday.", "thai": "เมื่อวานฉันต้องเดินกลับบ้านท่ามกลางฝน"}
{"word": "walk", "english": "She likes to walk along the beach at sunset.", "thai": "เธอชอบเดินเลียบชายหาดตอนพระอาทิตย์ตก"}
{"word": "walk", "english": "Walk faster, we’re going to be late!", "thai": "เดินเร็วขึ้นสิ เราจะสายแล้ว!"}
{"word": "walk", "english": "I’ll walk you to the bus stop.", "thai": "ฉันจะเดินไปส่งคุณที่ป้ายรถเมล์"}
{"word": "walk", "english": "It’s only a short walk to the store.", "thai": "เดินไปร้านค้าแค่ใกล้ๆ เท่านั้น"}
{"word": "walk", "english": "He decided to walk instead of taking the car.", "thai": "เขาตัดสินใจเดินแทนที่จะขับรถ"}
{"word": "walk", "english": "Let’s take a walk after dinner.", "thai": "ไปเดินเล่นกันหลังอาหารเย็นเถอะ"}
{"word": "walk", "english": "I can walk to school in ten minutes.", "thai": "ฉันเดินไปโรงเรียนได้ในสิบนาที"}
{"word": "walk", "english": "Walk carefully, the floor is slippery!", "thai": "เดินระวังหน่อย พื้นลื่น!"}
{"word": "walk", "english": "She taught her toddler how to walk.", "thai": "เธอสอนลูกน้อยของเธอให้เดิน"}
{"word": "walk", "english": "I saw him walk into the building.", "thai": "ฉันเห็นเขาเดินเข้าไปในตึก"}
{"word": "walk", "english": "We should walk more to stay healthy.", "thai": "เราควรเดินเยอะๆ เพื่อสุขภาพ"}
{"word": "walk", "english": "Walk straight, then turn left at the corner.", "thai": "เดินตรงไป แล้วเลี้ยวซ้ายที่มุม"}
{"word": "walk", "english": "I don’t want to walk that far today.", "thai": "วันนี้ฉันไม่อยากเดินไกลขนาดนั้น"}
{"word": "walk", "english": "He likes to walk barefoot in the grass.", "thai": "เขาชอบเดินเท้าเปล่าบนหญ้า"}
{"word": "walk", "english": "Can we walk instead of taking the bus?", "thai": "เราเดินแทนที่จะนั่งรถเมล์ได้ไหม?"}
{"word": "walk", "english": "I’ll walk with you to the station.", "thai": "ฉันจะเดินไปกับคุณถึงสถานี"}
{"word": "walk", "english": "She had to walk up five flights of stairs.", "thai": "เธอต้องเดินขึ้นบันไดห้าชั้น"}
{"word": "walk", "english": "Let’s walk through the mall to browse.", "thai": "ไปเดินเล่นในห้างเพื่อดูของกันเถอะ"}
{"word": "walk", "english": "I can’t walk in these high heels!", "thai": "ฉันเดินด้วยส้นสูงพวกนี้ไม่ได้!"}
{"word": "walk", "english": "He used to walk to work every day.", "thai": "เขาเคยเดินไปทำงานทุกวัน"}
{"word": "walk", "english": "Walk slowly so I can keep up.", "thai": "เดินช้าๆ หน่อยเพื่อฉันจะได้ตามทัน"}
{"word": "walk", "english": "I love to walk around the city at night.", "thai": "ฉันชอบเดินเล่นรอบเมืองตอนกลางคืน"}
{"word": "walk", "english": "Can you walk me through the instructions?", "thai": "คุณช่วยอธิบายขั้นตอนให้ฉันทีละขั้นได้ไหม?"}
{"word": "walk", "english": "We took a long walk in the forest.", "thai": "เราเดินเล่นนานในป่า"}
{"word": "walk", "english": "Walk to the end of the street and turn right.", "thai": "เดินไปจนสุดถนนแล้วเลี้ยวขวา"}
{"word": "walk", "english": "I need to walk off this big lunch.", "thai": "ฉันต้องเดินเพื่อย่อยอาหารมื้อใหญ่"}
{"word": "walk", "english": "She can’t walk without her cane yet.", "thai": "เธอยังเดินไม่ได้ถ้าไม่มีไม้เท้า"}
{"word": "walk", "english": "Let’s walk the trail this weekend.", "thai": "สุดสัปดาห์นี้ไปเดินเส้นทางเดินป่ากันเถอะ"}
{"word": "walk", "english": "I saw a cat walk across the road.", "thai": "ฉันเห็นแมวเดินข้ามถนน"}
{"word": "walk", "english": "It’s too far to walk in this heat.", "thai": "มันไกลเกินไปที่จะเดินในอากาศร้อนแบบนี้"}
{"word": "walk", "english": "He tried to walk off his headache.", "thai": "เขาพยายามเดินเพื่อให้หายปวดหัว"}
{"word": "walk", "english": "Walk with me to the grocery store.", "thai": "เดินไปร้านขายของชำกับฉันสิ"}
{"word": "walk", "english": "I don’t want to walk alone at night.", "thai": "ฉันไม่อยากเดินคนเดียวตอนกลางคืน"}
{"word": "walk", "english": "She loves to walk her dog in the evening.", "thai": "เธอชอบพาน้องหมาไปเดินเล่นตอนเย็น"}
{"word": "walk", "english": "Can you walk a bit faster, please?", "thai": "คุณเดินเร็วขึ้นหน่อยได้ไหม?"}
{"word": "walk", "english": "I’ll walk you out to your car.", "thai": "ฉันจะเดินไปส่งคุณที่รถ"}
{"word": "walk", "english": "We used to walk to school together.", "thai": "เราเคยเดินไปโรงเรียนด้วยกัน"}
{"word": "walk", "english": "Walk carefully on the icy path.", "thai": "เดินระวังบนทางที่เป็นน้ำแข็ง"}
{"word": "walk", "english": "I like to walk and listen to music.", "thai": "ฉันชอบเดินและฟังเพลง"}
{"word": "walk", "english": "He had to walk miles to find help.", "thai": "เขาต้องเดินหลายไมล์เพื่อหาความช่วยเหลือ"}
{"word": "walk", "english": "Let’s walk around the lake this afternoon.", "thai": "บ่ายนี้ไปเดินรอบทะเลสาบกันเถอะ"}
{"word": "walk", "english": "I can’t walk in these tight shoes!", "thai": "ฉันเดินด้วยรองเท้าคับๆ พวกนี้ไม่ได้!"}
{"word": "walk", "english": "She decided to walk home from work.", "thai": "เธอตัดสินใจเดินกลับบ้านจากที่ทำงาน"}
{"word": "walk", "english": "Walk this way to avoid the mud.", "thai": "เดินทางนี้เพื่อเลี่ยงโคลน"}
{"word": "walk", "english": "I’ll walk to the gym instead of driving.", "thai": "ฉันจะเดินไปยิมแทนที่จะขับรถ"}
{"word": "walk", "english": "He likes to walk through the old town.", "thai": "เขาชอบเดินเล่นในเมืองเก่า"}
{"word": "walk", "english": "Can you walk the kids to school today?", "thai": "คุณพาเด็กๆ เดินไปโรงเรียนวันนี้ได้ไหม?"}
{"word": "walk", "english": "I saw her walk into the coffee shop.", "thai": "ฉันเห็นเธอเดินเข้าร้านกาแฟ"}
{"word": "walk", "english": "Let’s walk to the park and have a picnic.", "thai": "ไปเดินไปสวนแล้วปิกนิกกันเถอะ"}
{"word": "walk", "english": "I need to walk to clear my mind.", "thai": "ฉันต้องเดินเพื่อให้จิตใจปลอดโปร่ง"}
{"word": "walk", "english": "Walk softly, the baby’s sleeping!", "thai": "เดินเบาๆ นะ เด็กน้อยกำลังนอน!"}
{"word": "walk", "english": "She can walk for hours without getting tired.", "thai": "เธอเดินได้เป็นชั่วโมงโดยไม่เหนื่อย"}
{"word": "walk", "english": "I’ll walk over to your house later.", "thai": "ฉันจะเดินไปบ้านคุณทีหลัง"}
{"word": "walk", "english": "Walk straight ahead to find the exit.", "thai": "เดินตรงไปเพื่อหาทางออก"}
{"word": "walk", "english": "I love to walk in the snow.", "thai": "ฉันชอบเดินเล่นในหิมะ"}
{"word": "walk", "english": "Can you walk me through the recipe?", "thai": "คุณช่วยอธิบายสูตรอาหารให้ฉันทีละขั้นได้ไหม?"}
{"word": "walk", "english": "He had to walk across town to get home.", "thai": "เขาต้องเดินข้ามเมืองเพื่อกลับบ้าน"}
{"word": "walk", "english": "Let’s walk the dog before it gets dark.", "thai": "ไปพาน้องหมาเดินเล่นก่อนที่ฟ้าจะมืด"}
{"word": "walk", "english": "I can’t walk fast in this dress.", "thai": "ฉันเดินเร็วไม่ได้ในชุดนี้"}
{"word": "walk", "english": "Walk to the corner and wait for me.", "thai": "เดินไปที่มุมถนนแล้วรอฉัน"}
{"word": "walk", "english": "She likes to walk with her headphones on.", "thai": "เธอชอบเดินโดยใส่หูฟัง"}
{"word": "walk", "english": "I’ll walk you to the door.", "thai": "ฉันจะเดินไปส่งคุณที่ประตู"}
{"word": "walk", "english": "We took a walk to see the Christmas lights.", "thai": "เราเดินไปดูไฟคริสต์มาส"}
{"word": "walk", "english": "Walk quietly so we don’t wake anyone.", "thai": "เดินเงียบๆ นะ จะได้ไม่ปลุกใคร"}
{"word": "walk", "english": "I need to walk to stretch my legs.", "thai": "ฉันต้องเดินเพื่อยืดขา"}
{"word": "walk", "english": "He can walk to the office in 15 minutes.", "thai": "เขาเดินไปออฟฟิศได้ใน 15 นาที"}
{"word": "walk", "english": "Let’s walk along the river this evening.", "thai": "เย็นนี้ไปเดินเลียบแม่น้ำกันเถอะ"}
{"word": "walk", "english": "I saw a deer walk across the field.", "thai": "ฉันเห็นกวางเดินข้ามทุ่ง"}
{"word": "walk", "english": "Walk this path to get to the lake.", "thai": "เดินทางนี้เพื่อไปถึงทะเลสาบ"}
{"word": "walk", "english": "I don’t want to walk in this cold weather.", "thai": "ฉันไม่อยากเดินในอากาศหนาวแบบนี้"}
{"word": "walk", "english": "She had to walk home after missing the bus.", "thai": "เธอต้องเดินกลับบ้านหลังจากพลาดรถเมล์"}
{"word": "walk", "english": "Can you walk with me to the pharmacy?", "thai": "คุณเดินไปร้านขายยากับฉันได้ไหม?"}
{"word": "walk", "english": "I like to walk and talk with my friends.", "thai": "ฉันชอบเดินและคุยกับเพื่อนๆ"}
{"word": "walk", "english": "Walk carefully, there’s glass on the ground.", "thai": "เดินระวังหน่อย มีแก้วแตกบนพื้น"}
{"word": "walk", "english": "I’ll walk to the post office this morning.", "thai": "เช้านี้ฉันจะเดินไปที่ทำการไปรษณีย์"}
{"word": "walk", "english": "Let’s walk through the garden to relax.", "thai": "ไปเดินในสวนเพื่อผ่อนคลายกันเถอะ"}
{"word": "walk", "english": "He decided to walk to save money.", "thai": "เขาตัดสินใจเดินเพื่อประหยัดเงิน"}
{"word": "walk", "english": "Walk over here to see the view!", "thai": "เดินมาทางนี้เพื่อดูวิว!"}
{"word": "walk", "english": "I can’t walk far with this heavy bag.", "thai": "ฉันเดินไกลไม่ได้กับกระเป๋าหนักใบนี้"}
{"word": "walk", "english": "She loves to walk in the rain.", "thai": "เธอชอบเดินเล่นในสายฝน"}
{"word": "walk", "english": "Walk to the left to avoid the crowd.", "thai": "เดินไปทางซ้ายเพื่อเลี่ยงฝูงชน"}
{"word": "walk", "english": "I’ll walk the kids to the playground.", "thai": "ฉันจะพาเด็กๆ เดินไปที่สนามเด็กเล่น"}
{"word": "walk", "english": "He had to walk through mud to get there.", "thai": "เขาต้องเดินผ่านโคลนเพื่อไปถึงที่นั่น"}
{"word": "walk", "english": "Let’s walk to the movie theater tonight.", "thai": "คืนนี้ไปเดินไปโรงหนังกันเถอะ"}
{"word": "walk", "english": "I saw him walk away after the argument.", "thai": "ฉันเห็นเขาเดินหนีไปหลังจากทะเลาะกัน"}
{"word": "walk", "english": "Walk slowly so we can enjoy the scenery.", "thai": "เดินช้าๆ เพื่อเราจะได้ชมวิว"}
{"word": "walk", "english": "I need to walk to burn some calories.", "thai": "ฉันต้องเดินเพื่อเผาผลาญแคลอรี่"}
{"word": "walk", "english": "She can walk faster than I can!", "thai": "เธอเดินเร็วกว่าฉันได้!"}
{"word": "walk", "english": "I’ll walk to the bakery for some bread.", "thai": "ฉันจะเดินไปร้านเบเกอรี่เพื่อซื้อขนมปัง"}
{"word": "walk", "english": "Walk around the block to cool off.", "thai": "เดินรอบๆ บล็อกเพื่อคลายร้อน"}
{"word": "walk", "english": "I love to walk with my grandma on Sundays.", "thai": "ฉันชอบเดินกับคุณยายในวันอาทิตย์"}
{"word": "walk", "english": "Can you walk me to the train station?", "thai": "คุณเดินไปส่งฉันที่สถานีรถไฟได้ไหม?"}
{"word": "walk", "english": "He had to walk because his car broke down.", "thai": "เขาต้องเดินเพราะรถของเขาเสีย"}
{"word": "walk", "english": "Let’s walk to the farmers’ market.", "thai": "ไปเดินไปตลาดเกษตรกรกันเถอะ"}
{"word": "walk", "english": "I can’t walk in these boots, they’re too tight!", "thai": "ฉันเดินด้วยบู๊ตคู่นี้ไม่ได้ มันคับเกินไป!"}
{"word": "want", "english": "I want to go to the beach this weekend.", "thai": "ฉันอยากไปชายหาดสุดสัปดาห์นี้"}
{"word": "want", "english": "Do you want coffee or tea?", "thai": "คุณอยากได้กาแฟหรือชา?"}
{"word": "want", "english": "She didn’t want to join the party.", "thai": "เธอไม่อยากเข้าร่วมงานปาร์ตี้"}
{"word": "want", "english": "I want a new phone for my birthday.", "thai": "ฉันอยากได้โทรศัพท์ใหม่สำหรับวันเกิด"}
{"word": "want", "english": "He said he doesn’t want any help.", "thai": "เขาบอกว่าเขาไม่อยากได้ความช่วยเหลือ"}
{"word": "want", "english": "Do you want to watch a movie tonight?", "thai": "คุณอยากดูหนังคืนนี้ไหม?"}
{"word": "want", "english": "I want to learn how to cook Thai food.", "thai": "ฉันอยากเรียนทำอาหารไทย"}
{"word": "want", "english": "They want to meet us at the restaurant.", "thai": "พวกเขาอยากเจอเราที่ร้านอาหาร"}
{"word": "want", "english": "I don’t want to be late for class.", "thai": "ฉันไม่อยากไปสายสำหรับชั้นเรียน"}
{"word": "want", "english": "What do you want for dinner?", "thai": "คุณอยากกินอะไรเป็นมื้อเย็น?"}
{"word": "want", "english": "I want to try that new ice cream place.", "thai": "ฉันอยากลองร้านไอศกรีมใหม่นั้น"}
{"word": "want", "english": "She wants to buy a new dress for the event.", "thai": "เธออยากซื้อชุดใหม่สำหรับงานนี้"}
{"word": "want", "english": "I want you to be honest with me.", "thai": "ฉันอยากให้คุณซื่อสัตย์กับฉัน"}
{"word": "want", "english": "He doesn’t want to talk about it now.", "thai": "เขาไม่อยากพูดถึงเรื่องนี้ตอนนี้"}
{"word": "want", "english": "Do you want to come with us to the mall?", "thai": "คุณอยากไปห้างกับเราไหม?"}
{"word": "want", "english": "I want to take a nap this afternoon.", "thai": "ฉันอยากงีบหลับบ่ายนี้"}
{"word": "want", "english": "They want a bigger house with a yard.", "thai": "พวกเขาอยากได้บ้านใหญ่ที่มีสนามหญ้า"}
{"word": "want", "english": "I don’t want to miss the concert tonight.", "thai": "ฉันไม่อยากพลาดคอนเสิร์ตคืนนี้"}
{"word": "want", "english": "What do you want to do this weekend?", "thai": "คุณอยากทำอะไรสุดสัปดาห์นี้?"}
{"word": "want", "english": "I want to see the new art exhibit.", "thai": "ฉันอยากไปดูนิทรรศการศิลปะใหม่"}
{"word": "want", "english": "She wants to start her own business.", "thai": "เธออยากเริ่มธุรกิจของตัวเอง"}
{"word": "want", "english": "I want some water, please.", "thai": "ฉันอยากได้น้ำเปล่า ขอบคุณ"}
{"word": "want", "english": "He wants to travel to Japan next year.", "thai": "เขาอยากไปเที่ยวญี่ปุ่นปีหน้า"}
{"word": "want", "english": "Do you want to play a board game?", "thai": "คุณอยากเล่นเกมกระดานไหม?"}
{"word": "want", "english": "I don’t want to argue about this.", "thai": "ฉันไม่อยากเถียงเรื่องนี้"}
{"word": "want", "english": "They want to adopt a puppy soon.", "thai": "พวกเขาอยากรับเลี้ยงลูกสุนัขเร็วๆ นี้"}
{"word": "want", "english": "I want to finish this book by tonight.", "thai": "ฉันอยากอ่านหนังสือเล่มนี้ให้จบคืนนี้"}
{"word": "want", "english": "She doesn’t want to go to the gym today.", "thai": "เธอไม่อยากไปยิมวันนี้"}
{"word": "want", "english": "Do you want to split the bill?", "thai": "คุณอยากแชร์บิลไหม?"}
{"word": "want", "english": "I want to get a haircut this week.", "thai": "ฉันอยากตัดผมสัปดาห์นี้"}
{"word": "want", "english": "He wants to learn how to play guitar.", "thai": "เขาอยากเรียนเล่นกีตาร์"}
{"word": "want", "english": "I don’t want to eat spicy food tonight.", "thai": "ฉันไม่อยากกินอาหารเผ็ดคืนนี้"}
{"word": "want", "english": "They want to hike in the mountains.", "thai": "พวกเขาอยากไปเดินป่าบนเขา"}
{"word": "want", "english": "I want to call my mom later.", "thai": "ฉันอยากโทรหาแม่ทีหลัง"}
{"word": "want", "english": "Do you want to try this new recipe?", "thai": "คุณอยากลองสูตรอาหารใหม่นี้ไหม?"}
{"word": "want", "english": "She wants to redecorate her room.", "thai": "เธออยากตกแต่งห้องใหม่"}
{"word": "want", "english": "I want to take a break from work.", "thai": "ฉันอยากพักจากงาน"}
{"word": "want", "english": "He doesn’t want to watch that movie.", "thai": "เขาไม่อยากดูหนังเรื่องนั้น"}
{"word": "want", "english": "Do you want to go for a walk?", "thai": "คุณอยากไปเดินเล่นไหม?"}
{"word": "want", "english": "I want to sleep in tomorrow morning.", "thai": "ฉันอยากนอนตื่นสายพรุ่งนี้เช้า"}
{"word": "want", "english": "They want to visit their grandparents.", "thai": "พวกเขาอยากไปเยี่ยมปู่ย่าตายาย"}
{"word": "want", "english": "I don’t want to wear this jacket today.", "thai": "ฉันไม่อยากใส่แจ็คเก็ตตัวนี้วันนี้"}
{"word": "want", "english": "What do you want to talk about?", "thai": "คุณอยากคุยเรื่องอะไร?"}
{"word": "want", "english": "I want to buy some new shoes.", "thai": "ฉันอยากซื้อรองเท้าใหม่"}
{"word": "want", "english": "She wants to join the book club.", "thai": "เธออยากเข้าร่วมชมรมหนังสือ"}
{"word": "want", "english": "I want you to meet my best friend.", "thai": "ฉันอยากให้คุณเจอเพื่อนสนิทของฉัน"}
{"word": "want", "english": "He doesn’t want to go to the party.", "thai": "เขาไม่อยากไปงานปาร์ตี้"}
{"word": "want", "english": "Do you want to grab lunch together?", "thai": "คุณอยากไปกินข้าวเที่ยงด้วยกันไหม?"}
{"word": "want", "english": "I want to paint my room blue.", "thai": "ฉันอยากทาสีห้องเป็นสีน้ำเงิน"}
{"word": "want", "english": "They want to start a new hobby.", "thai": "พวกเขาอยากเริ่มงานอดิเรกใหม่"}
{"word": "want", "english": "I don’t want to stay up too late.", "thai": "ฉันไม่อยากนอนดึกเกินไป"}
{"word": "want", "english": "What do you want for your birthday?", "thai": "คุณอยากได้อะไรสำหรับวันเกิด?"}
{"word": "want", "english": "I want to try surfing this summer.", "thai": "ฉันอยากลองเล่นเซิร์ฟฤดูร้อนนี้"}
{"word": "want", "english": "She wants to volunteer at the shelter.", "thai": "เธออยากเป็นอาสาสมัครที่ศูนย์พักพิง"}
{"word": "want", "english": "I want to eat pizza for dinner.", "thai": "ฉันอยากกินพิซซ่าสำหรับมื้อเย็น"}
{"word": "want", "english": "He doesn’t want to drive in the rain.", "thai": "เขาไม่อยากขับรถตอนฝนตก"}
{"word": "want", "english": "Do you want to play soccer with us?", "thai": "คุณอยากเล่นฟุตบอลกับเราไหม?"}
{"word": "want", "english": "I want to listen to some music now.", "thai": "ฉันอยากฟังเพลงตอนนี้"}
{"word": "want", "english": "They want to renovate their kitchen.", "thai": "พวกเขาอยากปรับปรุงห้องครัว"}
{"word": "want", "english": "I don’t want to forget my lines.", "thai": "ฉันไม่อยากลืมบทพูดของฉัน"}
{"word": "want", "english": "What do you want to drink?", "thai": "คุณอยากดื่มอะไร?"}
{"word": "want", "english": "I want to go hiking this weekend.", "thai": "ฉันอยากไปเดินป่าสุดสัปดาห์นี้"}
{"word": "want", "english": "She wants to learn how to dance.", "thai": "เธออยากเรียนเต้น"}
{"word": "want", "english": "I want to check my email first.", "thai": "ฉันอยากเช็คอีเมลก่อน"}
{"word": "want", "english": "He doesn’t want to move to another city.", "thai": "เขาไม่อยากย้ายไปเมืองอื่น"}
{"word": "want", "english": "Do you want to see my new car?", "thai": "คุณอยากดูรถใหม่ของฉันไหม?"}
{"word": "want", "english": "I want to take a hot shower now.", "thai": "ฉันอยากอาบน้ำร้อนตอนนี้"}
{"word": "want", "english": "They want to go camping next month.", "thai": "พวกเขาอยากไปแคมป์ปิ้งเดือนหน้า"}
{"word": "want", "english": "I don’t want to deal with this mess.", "thai": "ฉันไม่อยากจัดการกับความยุ่งเหยิงนี้"}
{"word": "want", "english": "What do you want to watch on TV?", "thai": "คุณอยากดูอะไรทางทีวี?"}
{"word": "want", "english": "I want to try that new sushi place.", "thai": "ฉันอยากลองร้านซูชิใหม่นั้น"}
{"word": "want", "english": "She wants to get a new job soon.", "thai": "เธออยากได้งานใหม่เร็วๆ นี้"}
{"word": "want", "english": "I want to help with the project.", "thai": "ฉันอยากช่วยในโปรเจกต์นี้"}
{"word": "want", "english": "He doesn’t want to eat vegetables.", "thai": "เขาไม่อยากกินผัก"}
{"word": "want", "english": "Do you want to ride bikes tomorrow?", "thai": "คุณอยากปั่นจักรยานพรุ่งนี้ไหม?"}
{"word": "want", "english": "I want to read a new book this week.", "thai": "ฉันอยากอ่านหนังสือเล่มใหม่สัปดาห์นี้"}
{"word": "want", "english": "They want to throw a big party.", "thai": "พวกเขาอยากจัดงานปาร์ตี้ใหญ่"}
{"word": "want", "english": "I don’t want to go out in this weather.", "thai": "ฉันไม่อยากออกไปในสภาพอากาศแบบนี้"}
{"word": "want", "english": "What do you want to study in college?", "thai": "คุณอยากเรียนอะไรในมหาวิทยาลัย?"}
{"word": "want", "english": "I want to plant some flowers in the garden.", "thai": "ฉันอยากปลูกดอกไม้ในสวน"}
{"word": "want", "english": "She wants to take a yoga class.", "thai": "เธออยากเรียนโยคะ"}
{"word": "want", "english": "I want to finish my homework early.", "thai": "ฉันอยากทำการบ้านให้เสร็จเร็ว"}
{"word": "want", "english": "He doesn’t want to share his dessert.", "thai": "เขาไม่อยากแบ่งของหวาน"}
{"word": "want", "english": "Do you want to go to the museum?", "thai": "คุณอยากไปพิพิธภัณฑ์ไหม?"}
{"word": "want", "english": "I want to wear my new sneakers today.", "thai": "ฉันอยากใส่รองเท้าผ้าใบใหม่วันนี้"}
{"word": "want", "english": "They want to book a vacation soon.", "thai": "พวกเขาอยากจองทริปวันหยุดเร็วๆ นี้"}
{"word": "want", "english": "I don’t want to clean the house today.", "thai": "ฉันไม่อยากทำความสะอาดบ้านวันนี้"}
{"word": "want", "english": "What do you want to name the puppy?", "thai": "คุณอยากตั้งชื่อลูกสุนัขว่าอะไร?"}
{"word": "want", "english": "I want to try making homemade bread.", "thai": "ฉันอยากลองทำขนมปังโฮมเมด"}
{"word": "want", "english": "She wants to visit her sister this weekend.", "thai": "เธออยากไปเยี่ยมน้องสาวสุดสัปดาห์นี้"}
{"word": "want", "english": "I want to go to bed early tonight.", "thai": "ฉันอยากเข้านอนเร็วคืนนี้"}
{"word": "want", "english": "He doesn’t want to take the bus.", "thai": "เขาไม่อยากนั่งรถเมล์"}
{"word": "want", "english": "Do you want to join the hiking group?", "thai": "คุณอยากเข้าร่วมกลุ่มเดินป่าไหม?"}
{"word": "want", "english": "I want to watch the sunset tonight.", "thai": "ฉันอยากดูพระอาทิตย์ตกคืนนี้"}
{"word": "want", "english": "They want to try a new restaurant.", "thai": "พวกเขาอยากลองร้านอาหารใหม่"}
{"word": "want", "english": "I don’t want to forget my lines for the play.", "thai": "ฉันไม่อยากลืมบทในละคร"}
{"word": "want", "english": "What do you want to do after school?", "thai": "คุณอยากทำอะไรหลังเลิกเรียน?"}
{"word": "want", "english": "I want to get a coffee before work.", "thai": "ฉันอยากซื้อกาแฟก่อนทำงาน"}
{"word": "watch", "english": "I want to watch a movie tonight.", "thai": "ฉันอยากดูหนังคืนนี้"}
{"word": "watch", "english": "Can you watch my dog for an hour?", "thai": "คุณช่วยดูแลสุนัขของฉันสักชั่วโมงได้ไหม?"}
{"word": "watch", "english": "I lost my watch at the gym yesterday.", "thai": "ฉันทำนาฬิกาหายที่ยิมเมื่อวาน"}
{"word": "watch", "english": "Let’s watch the sunset at the beach.", "thai": "ไปดูพระอาทิตย์ตกที่ชายหาดกันเถอะ"}
{"word": "watch", "english": "Do you want to watch the game with me?", "thai": "คุณอยากดูการแข่งขันกับฉันไหม?"}
{"word": "watch", "english": "I need to watch my calories this week.", "thai": "ฉันต้องควบคุมแคลอรี่สัปดาห์นี้"}
{"word": "watch", "english": "She bought a new watch for her birthday.", "thai": "เธอซื้อนาฬิกาใหม่สำหรับวันเกิด"}
{"word": "watch", "english": "Watch out, there’s a car coming!", "thai": "ระวัง! มีรถมา!"}
{"word": "watch", "english": "I like to watch birds in the morning.", "thai": "ฉันชอบดูนกในตอนเช้า"}
{"word": "watch", "english": "He forgot his watch at home.", "thai": "เขาลืมนาฬิกาไว้ที่บ้าน"}
{"word": "watch", "english": "Let’s watch a comedy show tonight.", "thai": "คืนนี้ไปดูรายการตลกกันเถอะ"}
{"word": "watch", "english": "Can you watch my bag while I’m gone?", "thai": "คุณช่วยดูแลกระเป๋าของฉันขณะที่ฉันไม่อยู่ได้ไหม?"}
{"word": "watch", "english": "I want to watch the new series on Netflix.", "thai": "ฉันอยากดูซีรีส์ใหม่ในเน็ตฟลิกซ์"}
{"word": "watch", "english": "My watch stopped working yesterday.", "thai": "นาฬิกาของฉันหยุดทำงานเมื่อวาน"}
{"word": "watch", "english": "Watch where you’re stepping, it’s muddy!", "thai": "ระวังที่คุณเหยียบ มันเลอะโคลน!"}
{"word": "watch", "english": "I love to watch the stars at night.", "thai": "ฉันชอบดูดาวตอนกลางคืน"}
{"word": "watch", "english": "She needs to watch her little brother today.", "thai": "เธอต้องดูแลน้องชายของเธอวันนี้"}
{"word": "watch", "english": "I got a smart watch for Christmas.", "thai": "ฉันได้นาฬิกาอัจฉริยะเป็นของขวัญคริสต์มาส"}
{"word": "watch", "english": "Do you want to watch the parade downtown?", "thai": "คุณอยากดูขบวนพาเหรดในตัวเมืองไหม?"}
{"word": "watch", "english": "I watch the news every morning.", "thai": "ฉันดูข่าวทุกเช้า"}
{"word": "watch", "english": "His watch is worth a lot of money.", "thai": "นาฬิกาของเขามีราคาแพงมาก"}
{"word": "watch", "english": "Watch the kids while I make dinner.", "thai": "ดูแลเด็กๆ ขณะที่ฉันทำอาหารเย็น"}
{"word": "watch", "english": "I want to watch a horror movie tonight.", "thai": "ฉันอยากดูหนังสยองขวัญคืนนี้"}
{"word": "watch", "english": "My watch needs a new battery.", "thai": "นาฬิกาของฉันต้องเปลี่ยนแบตเตอรี่"}
{"word": "watch", "english": "Let’s watch the fireworks on the Fourth of July.", "thai": "ไปดูพลุในวันชาติสหรัฐฯ กันเถอะ"}
{"word": "watch", "english": "Can you watch my drink for a minute?", "thai": "คุณช่วยดูเครื่องดื่มของฉันสักครู่ได้ไหม?"}
{"word": "watch", "english": "I like to watch old cartoons on weekends.", "thai": "ฉันชอบดูการ์ตูนเก่าๆ ในวันสุดสัปดาห์"}
{"word": "watch", "english": "He gave me his old watch as a gift.", "thai": "เขาให้ฉันนาฬิกาเก่าของเขาเป็นของขวัญ"}
{"word": "watch", "english": "Watch your head, the ceiling is low!", "thai": "ระวังศีรษะ เพดานต่ำ!"}
{"word": "watch", "english": "I want to watch the basketball game tonight.", "thai": "ฉันอยากดูการแข่งขันบาสเก็ตบอลคืนนี้"}
{"word": "watch", "english": "She’s wearing a fancy gold watch.", "thai": "เธอใส่นาฬิกาทองสุดหรู"}
{"word": "watch", "english": "Can we watch the new episode together?", "thai": "เราดูตอนใหม่ด้วยกันได้ไหม?"}
{"word": "watch", "english": "I watch cooking shows to get ideas.", "thai": "ฉันดูรายการทำอาหารเพื่อหาไอเดีย"}
{"word": "watch", "english": "My watch is always a few minutes slow.", "thai": "นาฬิกาของฉันช้าไปสองสามนาทีเสมอ"}
{"word": "watch", "english": "Watch the road while you’re driving!", "thai": "ดูถนนขณะที่คุณขับรถ!"}
{"word": "watch", "english": "I want to watch a documentary about space.", "thai": "ฉันอยากดูสารคดีเกี่ยวกับอวกาศ"}
{"word": "watch", "english": "He needs to watch his spending this month.", "thai": "เขาต้องควบคุมการใช้จ่ายเดือนนี้"}
{"word": "watch", "english": "I bought a waterproof watch for swimming.", "thai": "ฉันซื้อนาฬิกากันน้ำสำหรับว่ายน้ำ"}
{"word": "watch", "english": "Let’s watch the kids play soccer.", "thai": "ไปดูเด็กๆ เล่นฟุตบอลกันเถอะ"}
{"word": "watch", "english": "Can you watch my laptop while I’m away?", "thai": "คุณช่วยดูแลแล็ปท็อปของฉันขณะที่ฉันไม่อยู่ได้ไหม?"}
{"word": "watch", "english": "I love to watch the waves crash on the shore.", "thai": "ฉันชอบดูคลื่นซัดเข้าฝั่ง"}
{"word": "watch", "english": "My watch has a leather strap.", "thai": "นาฬิกาของฉันมีสายหนัง"}
{"word": "watch", "english": "Do you want to watch a live concert stream?", "thai": "คุณอยากดูการถ่ายทอดสดคอนเสิร์ตไหม?"}
{"word": "watch", "english": "I watch YouTube videos to relax.", "thai": "ฉันดูวิดีโอยูทูบเพื่อผ่อนคลาย"}
{"word": "watch", "english": "She got a vintage watch from her grandpa.", "thai": "เธอได้นาฬิกาวินเทจจากคุณปู่"}
{"word": "watch", "english": "Watch your step, the floor is wet!", "thai": "ระวังก้าว พื้นเปียก!"}
{"word": "watch", "english": "I want to watch the new superhero movie.", "thai": "ฉันอยากดูหนังซูเปอร์ฮีโร่เรื่องใหม่"}
{"word": "watch", "english": "He needs to watch his tone when speaking.", "thai": "เขาต้องระวังน้ำเสียงตอนพูด"}
{"word": "watch", "english": "I dropped my watch and cracked the glass.", "thai": "ฉันทำนาฬิกาตกและหน้าปัดแตก"}
{"word": "watch", "english": "Let’s watch the parade from the balcony.", "thai": "ไปดูขบวนพาเหรดจากระเบียงกันเถอะ"}
{"word": "watch", "english": "Can you watch the stove while I’m out?", "thai": "คุณช่วยดูเตาขณะที่ฉันออกไปข้างนอกได้ไหม?"}
{"word": "watch", "english": "I like to watch people at the park.", "thai": "ฉันชอบดูผู้คนที่สวนสาธารณะ"}
{"word": "watch", "english": "My watch syncs with my phone.", "thai": "นาฬิกาของฉันเชื่อมต่อกับโทรศัพท์"}
{"word": "watch", "english": "Do you want to watch a cooking tutorial?", "thai": "คุณอยากดูวิดีโอสอนทำอาหารไหม?"}
{"word": "watch", "english": "I watch sports highlights every evening.", "thai": "ฉันดูไฮไลต์กีฬาทุกเย็น"}
{"word": "watch", "english": "Her watch has a diamond bezel.", "thai": "นาฬิกาของเธอมีขอบประดับเพชร"}
{"word": "watch", "english": "Watch out for that puddle!", "thai": "ระวังแอ่งน้ำนั้น!"}
{"word": "watch", "english": "I want to watch the eclipse this year.", "thai": "ฉันอยากดูสุริยุปราคาปีนี้"}
{"word": "watch", "english": "She needs to watch her kids at the pool.", "thai": "เธอต้องดูแลลูกๆ ที่สระว่ายน้ำ"}
{"word": "watch", "english": "I got a new watch with a fitness tracker.", "thai": "ฉันได้นาฬิกาใหม่ที่มีตัวติดตามฟิตเนส"}
{"word": "watch", "english": "Let’s watch a classic movie tonight.", "thai": "คืนนี้ไปดูหนังคลาสสิกกันเถอะ"}
{"word": "watch", "english": "Can you watch my stuff while I grab coffee?", "thai": "คุณช่วยดูของของฉันขณะที่ฉันไปซื้อกาแฟได้ไหม?"}
{"word": "watch", "english": "I love to watch the rain from my window.", "thai": "ฉันชอบดูฝนจากหน้าต่าง"}
{"word": "watch", "english": "My watch is ticking too loudly.", "thai": "นาฬิกาของฉันดังเกินไป"}
{"word": "watch", "english": "Do you want to watch the new reality show?", "thai": "คุณอยากดูรายการเรียลลิตี้ใหม่ไหม?"}
{"word": "watch", "english": "I watch tutorials to learn new skills.", "thai": "ฉันดูวิดีโอสอนเพื่อเรียนรู้ทักษะใหม่"}
{"word": "watch", "english": "He bought an expensive watch last week.", "thai": "เขาซื้อนาฬิกาแพงเมื่อสัปดาห์ที่แล้ว"}
{"word": "watch", "english": "Watch the ball, it’s coming your way!", "thai": "ดูบอล มันกำลังมาทางคุณ!"}
{"word": "watch", "english": "I want to watch the hockey game tonight.", "thai": "ฉันอยากดูการแข่งขันฮอกกี้คืนนี้"}
{"word": "watch", "english": "She needs to watch her diet more closely.", "thai": "เธอต้องควบคุมอาหารให้มากขึ้น"}
{"word": "watch", "english": "I found a watch on the bus yesterday.", "thai": "ฉันเจอนาฬิกาบนรถเมล์เมื่อวาน"}
{"word": "watch", "english": "Let’s watch the boats on the river.", "thai": "ไปดูเรือบนแม่น้ำกันเถอะ"}
{"word": "watch", "english": "Can you watch the baby for a bit?", "thai": "คุณช่วยดูแลเด็กทารกสักพักได้ไหม?"}
{"word": "watch", "english": "I like to watch old black-and-white films.", "thai": "ฉันชอบดูหนังขาวดำเก่าๆ"}
{"word": "watch", "english": "My watch has a cool glowing face.", "thai": "นาฬิกาของฉันมีหน้าปัดเรืองแสงสุดเจ๋ง"}
{"word": "watch", "english": "Do you want to watch the tennis match?", "thai": "คุณอยากดูการแข่งขันเทนนิสไหม?"}
{"word": "watch", "english": "I watch travel vlogs to plan my trips.", "thai": "ฉันดูวิดีโอบล็อกท่องเที่ยวเพื่อวางแผนทริป"}
{"word": "watch", "english": "Her watch was a gift from her mom.", "thai": "นาฬิกาของเธอเป็นของขวัญจากแม่"}
{"word": "watch", "english": "Watch your back, it’s a rough area!", "thai": "ระวังตัวนะ พื้นที่นี้ค่อนข้างอันตราย!"}
{"word": "watch", "english": "I want to watch a nature documentary.", "thai": "ฉันอยากดูสารคดีธรรมชาติ"}
{"word": "watch", "english": "He needs to watch his words around her.", "thai": "เขาต้องระวังคำพูดเมื่ออยู่กับเธอ"}
{"word": "watch", "english": "I broke the strap on my watch.", "thai": "ฉันทำสายนาฬิกาขาด"}
{"word": "watch", "english": "Let’s watch the sunrise tomorrow morning.", "thai": "ไปดูพระอาทิตย์ขึ้นพรุ่งนี้เช้ากันเถอะ"}
{"word": "watch", "english": "Can you watch my phone while I swim?", "thai": "คุณช่วยดูโทรศัพท์ของฉันขณะที่ฉันว่ายน้ำได้ไหม?"}
{"word": "watch", "english": "I love to watch planes take off at the airport.", "thai": "ฉันชอบดูเครื่องบินบินขึ้นที่สนามบิน"}
{"word": "watch", "english": "My watch is waterproof up to 50 meters.", "thai": "นาฬิกาของฉันกันน้ำได้ถึง 50 เมตร"}
{"word": "watch", "english": "Do you want to watch a sci-fi movie?", "thai": "คุณอยากดูหนังไซไฟไหม?"}
{"word": "watch", "english": "I watch workout videos to stay motivated.", "thai": "ฉันดูวิดีโอออกกำลังกายเพื่อรักษาแรงจูงใจ"}
{"word": "watch", "english": "He got a silver watch for his graduation.", "thai": "เขาได้นาฬิกาสีเงินสำหรับวันรับปริญญา"}
{"word": "watch", "english": "Watch the door, someone’s coming!", "thai": "ดูประตู มีคนมา!"}
{"word": "watch", "english": "I want to watch the football game later.", "thai": "ฉันอยากดูการแข่งขันฟุตบอลทีหลัง"}
{"word": "watch", "english": "She needs to watch her purse in the crowd.", "thai": "เธอต้องระวังกระเป๋าในฝูงชน"}
{"word": "watch", "english": "I found my old watch in a drawer.", "thai": "ฉันเจอนาฬิกาเก่าในลิ้นชัก"}
{"word": "watch", "english": "Let’s watch a stand-up comedy special.", "thai": "ไปดูรายการตลกสแตนด์อัพกันเถอะ"}
{"word": "watch", "english": "Can you watch the oven for me?", "thai": "คุณช่วยดูเตาอบให้ฉันได้ไหม?"}
{"word": "watch", "english": "I like to watch the clouds move across the sky.", "thai": "ฉันชอบดูเมฆเคลื่อนผ่านท้องฟ้า"}
{"word": "watch", "english": "My watch has a stopwatch feature.", "thai": "นาฬิกาของฉันมีฟีเจอร์จับเวลา"}
{"word": "watch", "english": "Do you want to watch the boxing match?", "thai": "คุณอยากดูการแข่งขันมวยไหม?"}
{"word": "watch", "english": "I watch DIY videos to learn crafts.", "thai": "ฉันดูวิดีโอ DIY เพื่อเรียนงานฝีมือ"}
{"word": "watch", "english": "Her watch matches her outfit perfectly.", "thai": "นาฬิกาของเธอเข้ากับชุดของเธออย่างลงตัว"}
{"word": "wear", "english": "I want to wear my new shoes to the party.", "thai": "ฉันอยากใส่รองเท้าใหม่ไปงานปาร์ตี้"}
{"word": "wear", "english": "Do you wear glasses when you read?", "thai": "คุณใส่แว่นตาตอนอ่านหนังสือไหม?"}
{"word": "wear", "english": "She doesn’t wear makeup every day.", "thai": "เธอไม่แต่งหน้าทุกวัน"}
{"word": "wear", "english": "I can’t wear this jacket, it’s too small.", "thai": "ฉันใส่แจ็คเก็ตตัวนี้ไม่ได้ มันเล็กเกินไป"}
{"word": "wear", "english": "He likes to wear bright colors.", "thai": "เขาชอบใส่เสื้อผ้าสีสันสดใส"}
{"word": "wear", "english": "You should wear a hat in this cold weather.", "thai": "คุณควรใส่หมวกในอากาศหนาวแบบนี้"}
{"word": "wear", "english": "I wear sneakers to the gym.", "thai": "ฉันใส่รองเท้าผ้าใบไปยิม"}
{"word": "wear", "english": "She wants to wear her new dress tomorrow.", "thai": "เธออยากใส่ชุดใหม่พรุ่งนี้"}
{"word": "wear", "english": "I don’t wear jewelry very often.", "thai": "ฉันไม่ค่อยใส่เครื่องประดับบ่อยนัก"}
{"word": "wear", "english": "What do you wear to a job interview?", "thai": "คุณใส่อะไรไปสัมภาษณ์งาน?"}
{"word": "wear", "english": "He forgot to wear his tie to the meeting.", "thai": "เขาลืมใส่เนคไทไปประชุม"}
{"word": "wear", "english": "I wear sunscreen to protect my skin.", "thai": "ฉันทาครีมกันแดดเพื่อปกป้องผิว"}
{"word": "wear", "english": "She likes to wear her hair in a bun.", "thai": "เธอชอบมัดผมเป็นมวย"}
{"word": "wear", "english": "You can’t wear flip-flops to school.", "thai": "คุณใส่รองเท้าแตะไปโรงเรียนไม่ได้"}
{"word": "wear", "english": "I want to wear something casual tonight.", "thai": "คืนนี้ฉันอยากใส่ชุดลำลอง"}
{"word": "wear", "english": "He wears a uniform to work every day.", "thai": "เขาใส่ยูนิฟอร์มไปทำงานทุกวัน"}
{"word": "wear", "english": "Do you wear contacts or glasses?", "thai": "คุณใส่คอนแทคเลนส์หรือแว่นตา?"}
{"word": "wear", "english": "I don’t want to wear this old sweater.", "thai": "ฉันไม่อยากใส่สเวตเตอร์เก่าตัวนี้"}
{"word": "wear", "english": "She wears a scarf in the winter.", "thai": "เธอใส่ผ้าพันคอในฤดูหนาว"}
{"word": "wear", "english": "I wear my watch every day.", "thai": "ฉันใส่นาฬิกาทุกวัน"}
{"word": "wear", "english": "He doesn’t wear hats because they mess up his hair.", "thai": "เขาไม่ใส่หมวกเพราะมันทำให้ผมยุ่ง"}
{"word": "wear", "english": "What should I wear to the wedding?", "thai": "ฉันควรใส่อะไรไปงานแต่งงาน?"}
{"word": "wear", "english": "I wear gloves when it’s cold outside.", "thai": "ฉันใส่ถุงมือเมื่อข้างนอกหนาว"}
{"word": "wear", "english": "She wants to wear her mom’s necklace.", "thai": "เธออยากใส่สร้อยคอของแม่เธอ"}
{"word": "wear", "english": "I can’t wear these shoes, they hurt my feet.", "thai": "ฉันใส่รองเท้าคู่นี้ไม่ได้ มันเจ็บเท้า"}
{"word": "wear", "english": "He likes to wear vintage clothes.", "thai": "เขาชอบใส่เสื้อผ้าวินเทจ"}
{"word": "wear", "english": "You should wear a coat, it’s freezing!", "thai": "คุณควรใส่โค้ท มันหนาวมาก!"}
{"word": "wear", "english": "I wear jeans almost every day.", "thai": "ฉันใส่ยีนส์เกือบทุกวัน"}
{"word": "wear", "english": "She doesn’t wear high heels anymore.", "thai": "เธอไม่ใส่ส้นสูงอีกแล้ว"}
{"word": "wear", "english": "Do you wear earrings all the time?", "thai": "คุณใส่ต่างหูตลอดเวลาไหม?"}
{"word": "wear", "english": "I want to wear my new scarf today.", "thai": "ฉันอยากใส่ผ้าพันคอใหม่วันนี้"}
{"word": "wear", "english": "He wears a suit to work every day.", "thai": "เขาใส่สูทไปทำงานทุกวัน"}
{"word": "wear", "english": "I don’t wear sandals in the winter.", "thai": "ฉันไม่ใส่รองเท้าแตะในฤดูหนาว"}
{"word": "wear", "english": "She wears her hair down for special occasions.", "thai": "เธอปล่อยผมลงในโอกาสพิเศษ"}
{"word": "wear", "english": "What do you wear when you go hiking?", "thai": "คุณใส่อะไรเมื่อไปเดินป่า?"}
{"word": "wear", "english": "I wear a helmet when I ride my bike.", "thai": "ฉันใส่หมวกกันน็อกเมื่อขี่จักรยาน"}
{"word": "wear", "english": "He wants to wear his new sneakers to school.", "thai": "เขาอยากใส่รองเท้าผ้าใบใหม่ไปโรงเรียน"}
{"word": "wear", "english": "I can’t wear this shirt, it’s stained.", "thai": "ฉันใส่เสื้อตัวนี้ไม่ได้ มันเปื้อน"}
{"word": "wear", "english": "She wears a ring on every finger.", "thai": "เธอใส่แหวนที่ทุกนิ้ว"}
{"word": "wear", "english": "I wear a jacket when it’s windy.", "thai": "ฉันใส่แจ็คเก็ตเมื่อมีลมแรง"}
{"word": "wear", "english": "Do you wear a tie to formal events?", "thai": "คุณใส่เนคไทไปงานทางการไหม?"}
{"word": "wear", "english": "I don’t want to wear this dress tonight.", "thai": "ฉันไม่อยากใส่ชุดนี้คืนนี้"}
{"word": "wear", "english": "He wears glasses only for reading.", "thai": "เขาใส่แว่นตาเฉพาะตอนอ่านหนังสือ"}
{"word": "wear", "english": "She likes to wear bright lipstick.", "thai": "เธอชอบทาลิปสติกสีสดใส"}
{"word": "wear", "english": "I wear boots when it snows.", "thai": "ฉันใส่บู๊ตเมื่อหิมะตก"}
{"word": "wear", "english": "What do you wear to a casual dinner?", "thai": "คุณใส่อะไรไปกินข้าวเย็นแบบลำลอง?"}
{"word": "wear", "english": "I want to wear my new coat today.", "thai": "ฉันอยากใส่โค้ทใหม่วันนี้"}
{"word": "wear", "english": "He doesn’t wear shorts in the winter.", "thai": "เขาไม่ใส่กางเกงขาสั้นในฤดูหนาว"}
{"word": "wear", "english": "She wears a headband when she works out.", "thai": "เธอใส่ที่คาดผมเมื่อออกกำลังกาย"}
{"word": "wear", "english": "I wear a hoodie when it’s chilly.", "thai": "ฉันใส่ฮู้ดเมื่ออากาศเย็น"}
{"word": "wear", "english": "Do you wear socks with sandals?", "thai": "คุณใส่ถุงเท้ากับรองเท้าแตะไหม?"}
{"word": "wear", "english": "I don’t wear hats, they don’t suit me.", "thai": "ฉันไม่ใส่หมวก มันไม่เข้ากับฉัน"}
{"word": "wear", "english": "She wants to wear her prom dress again.", "thai": "เธออยากใส่ชุดพรอมอีกครั้ง"}
{"word": "wear", "english": "I wear a mask when I’m in public.", "thai": "ฉันใส่หน้ากากเมื่ออยู่ในที่สาธารณะ"}
{"word": "wear", "english": "He likes to wear colorful socks.", "thai": "เขาชอบใส่ถุงเท้าสีสัน"}
{"word": "wear", "english": "You should wear sunscreen at the beach.", "thai": "คุณควรทาครีมกันแดดที่ชายหาด"}
{"word": "wear", "english": "I wear my favorite shirt on Fridays.", "thai": "ฉันใส่เสื้อตัวโปรดในวันศุกร์"}
{"word": "wear", "english": "She doesn’t wear perfume every day.", "thai": "เธอไม่ฉีดน้ำหอมทุกวัน"}
{"word": "wear", "english": "Do you wear a watch all the time?", "thai": "คุณใส่นาฬิกาตลอดเวลาไหม?"}
{"word": "wear", "english": "I want to wear my boots to the concert.", "thai": "ฉันอยากใส่บู๊ตไปคอนเสิร์ต"}
{"word": "wear", "english": "He wears a cap to hide his bad hair day.", "thai": "เขาใส่หมวกเพื่อซ่อนผมที่ไม่เป็นทรง"}
{"word": "wear", "english": "I can’t wear this skirt, it’s too tight.", "thai": "ฉันใส่กระโปรงตัวนี้ไม่ได้ มันคับเกินไป"}
{"word": "wear", "english": "She wears a locket with her mom’s photo.", "thai": "เธอใส่จี้ที่มีรูปแม่ของเธอ"}
{"word": "wear", "english": "I wear slippers around the house.", "thai": "ฉันใส่รองเท้าแตะในบ้าน"}
{"word": "wear", "english": "What do you wear to a barbecue?", "thai": "คุณใส่อะไรไปงานปิ้งย่าง?"}
{"word": "wear", "english": "I don’t wear heavy makeup for work.", "thai": "ฉันไม่แต่งหน้าหนาไปทำงาน"}
{"word": "wear", "english": "He wants to wear his new belt tomorrow.", "thai": "เขาอยากใส่เข็มขัดใหม่พรุ่งนี้"}
{"word": "wear", "english": "She wears leggings to yoga class.", "thai": "เธอใส่เลกกิ้งไปคลาสโยคะ"}
{"word": "wear", "english": "I wear a raincoat when it’s pouring.", "thai": "ฉันใส่เสื้อกันฝนเมื่อฝนตกหนัก"}
{"word": "wear", "english": "Do you wear a suit to the office?", "thai": "คุณใส่สูทไปออฟฟิศไหม?"}
{"word": "wear", "english": "I don’t want to wear this old jacket.", "thai": "ฉันไม่อยากใส่แจ็คเก็ตเก่าตัวนี้"}
{"word": "wear", "english": "She wears her hair in braids often.", "thai": "เธอมักถักผมเปีย"}
{"word": "wear", "english": "I wear a backpack to school every day.", "thai": "ฉันสะพายเป้ไปโรงเรียนทุกวัน"}
{"word": "wear", "english": "He likes to wear mismatched socks.", "thai": "เขาชอบใส่ถุงเท้าคู่ไม่เข้าชุด"}
{"word": "wear", "english": "You should wear a helmet when skating.", "thai": "คุณควรใส่หมวกกันน็อกเมื่อเล่นสเก็ต"}
{"word": "wear", "english": "I wear my sunglasses on bright days.", "thai": "ฉันใส่แว่นกันแดดในวันที่มีแดดจ้า"}
{"word": "wear", "english": "She doesn’t wear skirts very often.", "thai": "เธอไม่ค่อยใส่กระโปรงบ่อยนัก"}
{"word": "wear", "english": "Do you wear gloves when you garden?", "thai": "คุณใส่ถุงมือเมื่อทำสวนไหม?"}
{"word": "wear", "english": "I want to wear my new earrings tonight.", "thai": "ฉันอยากใส่ต่างหูใหม่คืนนี้"}
{"word": "wear", "english": "He wears a hoodie to stay warm.", "thai": "เขาใส่ฮู้ดเพื่อให้อบอุ่น"}
{"word": "wear", "english": "I can’t wear these pants, they’re torn.", "thai": "ฉันใส่กางเกงตัวนี้ไม่ได้ มันขาด"}
{"word": "wear", "english": "She wears a bracelet her sister gave her.", "thai": "เธอใส่กำไลที่น้องสาวให้"}
{"word": "wear", "english": "I wear flip-flops at the pool.", "thai": "ฉันใส่รองเท้าแตะที่สระว่ายน้ำ"}
{"word": "wear", "english": "What do you wear to a concert?", "thai": "คุณใส่อะไรไปคอนเสิร์ต?"}
{"word": "wear", "english": "I don’t wear dresses in the winter.", "thai": "ฉันไม่ใส่ชุดเดรสในฤดูหนาว"}
{"word": "wear", "english": "He wants to wear his team’s jersey.", "thai": "เขาอยากใส่เสื้อทีมของเขา"}
{"word": "wear", "english": "She wears contacts instead of glasses.", "thai": "เธอใส่คอนแทคเลนส์แทนแว่นตา"}
{"word": "wear", "english": "I wear a scarf to keep my neck warm.", "thai": "ฉันใส่ผ้าพันคอเพื่อให้คออุ่น"}
{"word": "wear", "english": "Do you wear a belt with those pants?", "thai": "คุณใส่เข็มขัดกับกางเกงตัวนั้นไหม?"}
{"word": "wear", "english": "I don’t want to wear these old shoes.", "thai": "ฉันไม่อยากใส่รองเท้าเก่าคู่นี้"}
{"word": "wear", "english": "She wears her hair up when it’s hot.", "thai": "เธอมัดผมขึ้นเมื่ออากาศร้อน"}
{"word": "wear", "english": "I wear a name tag at work.", "thai": "ฉันใส่ป้ายชื่อที่ทำงาน"}
{"word": "wear", "english": "He likes to wear his grandfather’s watch.", "thai": "เขาชอบใส่นาฬิกาของคุณปู่"}
{"word": "wear", "english": "You should wear a sweater, it’s chilly.", "thai": "คุณควรใส่สเวตเตอร์ มันหนาว"}
{"word": "wear", "english": "I wear my favorite jeans on weekends.", "thai": "ฉันใส่ยีนส์ตัวโปรดในวันสุดสัปดาห์"}
{"word": "wear", "english": "She doesn’t wear rings because they bother her.", "thai": "เธอไม่ใส่แหวนเพราะมันรบกวนเธอ"}
{"word": "wear", "english": "Do you wear a jacket in the fall?", "thai": "คุณใส่แจ็คเก็ตในฤดูใบไม้ร่วงไหม?"}
{"word": "wear", "english": "I want to wear my new hat to the game.", "thai": "ฉันอยากใส่หมวกใหม่ไปดูการแข่งขัน"}
{"word": "wear", "english": "He wears a bandana when he hikes.", "thai": "เขาใส่ผ้าโพกหัวเมื่อไปเดินป่า"}
{"word": "wear", "english": "I can’t wear this tie, it’s too bright.", "thai": "ฉันใส่เนคไทนี้ไม่ได้ มันสว่างเกินไป"}
{"word": "win", "english": "I hope our team can win the game tonight.", "thai": "ฉันหวังว่าทีมของเราจะชนะเกมคืนนี้"}
{"word": "win", "english": "She was thrilled to win the first prize.", "thai": "เธอดีใจมากที่ได้รางวัลที่หนึ่ง"}
{"word": "win", "english": "Did you win anything at the raffle?", "thai": "คุณได้รางวัลอะไรจากการจับฉลากบ้างไหม?"}
{"word": "win", "english": "He always tries to win every argument.", "thai": "เขาพยายามชนะทุกการโต้แย้งเสมอ"}
{"word": "win", "english": "We need to win this match to advance.", "thai": "เราต้องชนะแมตช์นี้เพื่อเข้ารอบ"}
{"word": "win", "english": "I can’t believe I won the lottery!", "thai": "ฉันไม่อยากเชื่อว่าฉันถูกลอตเตอรี่!"}
{"word": "win", "english": "She worked hard to win the scholarship.", "thai": "เธอทำงานหนักเพื่อได้ทุนการศึกษา"}
{"word": "win", "english": "Do you think you can win the race?", "thai": "คุณคิดว่าคุณจะชนะการแข่งขันได้ไหม?"}
{"word": "win", "english": "He was determined to win her heart.", "thai": "เขาตั้งใจแน่วแน่ที่จะชนะใจเธอ"}
{"word": "win", "english": "Our school won the debate competition.", "thai": "โรงเรียนของเราชนะการแข่งขันโต้วาที"}
{"word": "win", "english": "I want to win that big stuffed bear!", "thai": "ฉันอยากได้ตุ๊กตาหมีตัวใหญ่ตัวนั้น!"}
{"word": "win", "english": "They didn’t expect to win the tournament.", "thai": "พวกเขาไม่คาดหวังว่าจะชนะการแข่งขัน"}
{"word": "win", "english": "She’s confident she’ll win the election.", "thai": "เธอมั่นใจว่าเธอจะชนะการเลือกตั้ง"}
{"word": "win", "english": "I won a free coffee at the shop!", "thai": "ฉันได้กาแฟฟรีที่ร้าน!"}
{"word": "win", "english": "He tried so hard but didn’t win.", "thai": "เขาพยายามอย่างมากแต่ไม่ได้ชนะ"}
{"word": "win", "english": "We can win if we work together.", "thai": "เราจะชนะได้ถ้าเราทำงานร่วมกัน"}
{"word": "win", "english": "She won the award for best actress.", "thai": "เธอได้รางวัลนักแสดงหญิงยอดเยี่ยม"}
{"word": "win", "english": "I want to win the science fair this year.", "thai": "ฉันอยากชนะงานวิทยาศาสตร์ปีนี้"}
{"word": "win", "english": "He won a trip to Hawaii in a contest.", "thai": "เขาชนะทริปไปฮาวายในการแข่งขัน"}
{"word": "win", "english": "They’re hoping to win the championship.", "thai": "พวกเขาหวังว่าจะได้แชมป์"}
{"word": "win", "english": "I didn’t win, but I had fun trying.", "thai": "ฉันไม่ได้ชนะ แต่ฉันสนุกที่ได้ลอง"}
{"word": "win", "english": "She won the spelling bee at school.", "thai": "เธอชนะการแข่งขันสะกดคำที่โรงเรียน"}
{"word": "win", "english": "Do you think we’ll win the bid?", "thai": "คุณคิดว่าเราจะชนะการประมูลไหม?"}
{"word": "win", "english": "He won a gold medal in swimming.", "thai": "เขาชนะเหรียญทองในการว่ายน้ำ"}
{"word": "win", "english": "I want to win at chess tonight.", "thai": "ฉันอยากชนะหมากรุกคืนนี้"}
{"word": "win", "english": "She won everyone over with her speech.", "thai": "เธอทำให้ทุกคนประทับใจด้วยคำพูดของเธอ"}
{"word": "win", "english": "We won the trivia night at the bar!", "thai": "เราชนะคืนทริเวียที่บาร์!"}
{"word": "win", "english": "He didn’t win the promotion this time.", "thai": "เขาไม่ได้เลื่อนตำแหน่งครั้งนี้"}
{"word": "win", "english": "I hope I win the door prize!", "thai": "ฉันหวังว่าฉันจะได้รางวัลประตู!"}
{"word": "win", "english": "They won the dance competition last night.", "thai": "พวกเขาชนะการแข่งขันเต้นเมื่อคืน"}
{"word": "win", "english": "She wants to win the baking contest.", "thai": "เธออยากชนะการแข่งขันอบขนม"}
{"word": "win", "english": "I won a gift card at the store!", "thai": "ฉันได้บัตรของขวัญที่ร้าน!"}
{"word": "win", "english": "He’s trying to win the poker game.", "thai": "เขากำลังพยายามชนะเกมโป๊กเกอร์"}
{"word": "win", "english": "We won’t win unless we practice more.", "thai": "เราจะไม่ชนะถ้าเราไม่ซ้อมมากกว่านี้"}
{"word": "win", "english": "She won the employee of the month award.", "thai": "เธอได้รางวัลพนักงานดีเด่นประจำเดือน"}
{"word": "win", "english": "I want to win the costume contest!", "thai": "ฉันอยากชนะการแข่งขันชุดแฟนซี!"}
{"word": "win", "english": "He won the bet with his friend.", "thai": "เขาชนะเดิมพันกับเพื่อน"}
{"word": "win", "english": "They won the relay race at school.", "thai": "พวกเขาชนะการแข่งขันวิ่งผลัดที่โรงเรียน"}
{"word": "win", "english": "I didn’t win the art contest this time.", "thai": "ฉันไม่ได้ชนะการแข่งขันศิลปะครั้งนี้"}
{"word": "win", "english": "She’s determined to win the marathon.", "thai": "เธอตั้งใจแน่วแน่ที่จะชนะมาราธอน"}
{"word": "win", "english": "I won two tickets to the concert!", "thai": "ฉันได้ตั๋วคอนเสิร์ตสองใบ!"}
{"word": "win", "english": "He wants to win the golf tournament.", "thai": "เขาอยากชนะการแข่งขันกอล์ฟ"}
{"word": "win", "english": "We need to win this round to qualify.", "thai": "เราต้องชนะรอบนี้เพื่อเข้ารอบ"}
{"word": "win", "english": "She won a scholarship to college.", "thai": "เธอได้ทุนการศึกษาไปมหาวิทยาลัย"}
{"word": "win", "english": "I hope we win the soccer match tomorrow.", "thai": "ฉันหวังว่าเราจะชนะการแข่งขันฟุตบอลพรุ่งนี้"}
{"word": "win", "english": "He won the argument with solid facts.", "thai": "เขาชนะการโต้แย้งด้วยข้อเท็จจริงที่แน่นหนา"}
{"word": "win", "english": "I want to win the pie-eating contest!", "thai": "ฉันอยากชนะการแข่งขันกินพาย!"}
{"word": "win", "english": "They won the state basketball championship.", "thai": "พวกเขาชนะการแข่งขันบาสเก็ตบอลระดับรัฐ"}
{"word": "win", "english": "She didn’t win the poetry competition.", "thai": "เธอไม่ได้ชนะการแข่งขันกวีนิพนธ์"}
{"word": "win", "english": "I won a free pizza at the arcade!", "thai": "ฉันได้พิซซ่าฟรีที่ตู้เกม!"}
{"word": "win", "english": "He’s confident he’ll win the debate.", "thai": "เขามั่นใจว่าเขาจะชนะการโต้วาที"}
{"word": "win", "english": "We won the charity raffle last night!", "thai": "เราชนะรางวัลจับฉลากการกุศลเมื่อคืน!"}
{"word": "win", "english": "She wants to win the talent show.", "thai": "เธออยากชนะการแข่งขันความสามารถ"}
{"word": "win", "english": "I didn’t win the online giveaway.", "thai": "ฉันไม่ได้ชนะการแจกของออนไลน์"}
{"word": "win", "english": "He won a prize for his science project.", "thai": "เขาชนะรางวัลจากโปรเจกต์วิทยาศาสตร์"}
{"word": "win", "english": "Do you think you’ll win the card game?", "thai": "คุณคิดว่าคุณจะชนะเกมไพ่ไหม?"}
{"word": "win", "english": "They won the local singing contest.", "thai": "พวกเขาชนะการแข่งขันร้องเพลงท้องถิ่น"}
{"word": "win", "english": "I want to win the photography contest.", "thai": "ฉันอยากชนะการแข่งขันถ่ายภาพ"}
{"word": "win", "english": "She won the case in court yesterday.", "thai": "เธอชนะคดีในศาลเมื่อวาน"}
{"word": "win", "english": "We need to win this set to stay in the game.", "thai": "เราต้องชนะเซ็ตนี้เพื่ออยู่ในเกม"}
{"word": "win", "english": "He won a trophy for his painting.", "thai": "เขาชนะถ้วยรางวัลจากภาพวาดของเขา"}
{"word": "win", "english": "I hope I win the baking competition.", "thai": "ฉันหวังว่าฉันจะชนะการแข่งขันอบขนม"}
{"word": "win", "english": "She didn’t win the chess tournament.", "thai": "เธอไม่ได้ชนะการแข่งขันหมากรุก"}
{"word": "win", "english": "I won a book at the library raffle!", "thai": "ฉันได้หนังสือจากการจับฉลากที่ห้องสมุด!"}
{"word": "win", "english": "He wants to win the cycling race.", "thai": "เขาอยากชนะการแข่งขันจักรยาน"}
{"word": "win", "english": "They won the team trivia challenge.", "thai": "พวกเขาชนะการแข่งขันทริเวียทีม"}
{"word": "win", "english": "I want to win the Halloween costume contest.", "thai": "ฉันอยากชนะการแข่งขันชุดฮาโลวีน"}
{"word": "win", "english": "She won a medal for her essay.", "thai": "เธอได้เหรียญรางวัลจากเรียงความของเธอ"}
{"word": "win", "english": "We didn’t win the volleyball game.", "thai": "เราไม่ได้ชนะเกมวอลเลย์บอล"}
{"word": "win", "english": "He won the best costume award.", "thai": "เขาชนะรางวัลชุดยอดเยี่ยม"}
{"word": "win", "english": "I hope we win the tug-of-war match.", "thai": "ฉันหวังว่าเราจะชนะการแข่งขันชักเย่อ"}
{"word": "win", "english": "She wants to win the cooking show.", "thai": "เธออยากชนะรายการแข่งทำอาหาร"}
{"word": "win", "english": "I won a small prize at the fair!", "thai": "ฉันได้รางวัลเล็กๆ ที่งานแฟร์!"}
{"word": "win", "english": "He didn’t win the tennis match.", "thai": "เขาไม่ได้ชนะการแข่งขันเทนนิส"}
{"word": "win", "english": "They won the school talent show.", "thai": "พวกเขาชนะการแสดงความสามารถของโรงเรียน"}
{"word": "win", "english": "I want to win the spelling competition.", "thai": "ฉันอยากชนะการแข่งขันสะกดคำ"}
{"word": "win", "english": "She won the hearts of the audience.", "thai": "เธอชนะใจผู้ชม"}
{"word": "win", "english": "We won the quiz night at the café!", "thai": "เราชนะคืนควิซที่ร้านกาแฟ!"}
{"word": "win", "english": "He wants to win the karate tournament.", "thai": "เขาอยากชนะการแข่งขันคาราเต้"}
{"word": "win", "english": "I didn’t win the writing contest.", "thai": "ฉันไม่ได้ชนะการแข่งขันเขียน"}
{"word": "win", "english": "She won a prize for her short story.", "thai": "เธอได้รางวัลจากเรื่องสั้นของเธอ"}
{"word": "win", "english": "Do you think we’ll win the hockey game?", "thai": "คุณคิดว่าเราจะชนะเกมฮอกกี้ไหม?"}
{"word": "win", "english": "They won the regional dance contest.", "thai": "พวกเขาชนะการแข่งขันเต้นระดับภูมิภาค"}
{"word": "win", "english": "I want to win the lottery someday!", "thai": "ฉันอยากถูกลอตเตอรี่สักวัน!"}
{"word": "win", "english": "He won a certificate for his presentation.", "thai": "เขาชนะใบประกาศนียบัตรจากการนำเสนอของเขา"}
{"word": "win", "english": "We need to win this game to make the playoffs.", "thai": "เราต้องชนะเกมนี้เพื่อเข้ารอบเพลย์ออฟ"}
{"word": "win", "english": "She won the best singer award.", "thai": "เธอได้รางวัลนักร้องยอดเยี่ยม"}
{"word": "win", "english": "I hope I win the raffle at the event.", "thai": "ฉันหวังว่าฉันจะได้รางวัลจับฉลากในงานนี้"}
{"word": "win", "english": "He didn’t win the boxing match.", "thai": "เขาไม่ได้ชนะการแข่งขันมวย"}
{"word": "win", "english": "They won the school science competition.", "thai": "พวกเขาชนะการแข่งขันวิทยาศาสตร์ของโรงเรียน"}
{"word": "win", "english": "I want to win the drawing contest.", "thai": "ฉันอยากชนะการแข่งขันวาดภาพ"}
{"word": "win", "english": "She won a prize for her math skills.", "thai": "เธอได้รางวัลจากทักษะคณิตศาสตร์ของเธอ"}
{"word": "win", "english": "We won the charity soccer game!", "thai": "เราชนะเกมฟุตบอลการกุศล!"}
{"word": "win", "english": "He wants to win the surfing competition.", "thai": "เขาอยากชนะการแข่งขันโต้คลื่น"}
{"word": "win", "english": "I didn’t win the online quiz.", "thai": "ฉันไม่ได้ชนะควิซออนไลน์"}
{"word": "win", "english": "She won the top prize at the fair.", "thai": "เธอได้รางวัลสูงสุดที่งานแฟร์"}
{"word": "win", "english": "Do you think you’ll win the archery contest?", "thai": "คุณคิดว่าคุณจะชนะการแข่งขันยิงธนูไหม?"}
{"word": "work", "english": "I have to go to work early tomorrow.", "thai": "ฉันต้องไปทำงานแต่เช้าพรุ่งนี้"}
{"word": "work", "english": "Do you want to work on this project together?", "thai": "คุณอยากทำงานโปรเจกต์นี้ด้วยกันไหม?"}
{"word": "work", "english": "This old computer doesn’t work anymore.", "thai": "คอมพิวเตอร์เก่าเครื่องนี้ใช้การไม่ได้แล้ว"}
{"word": "work", "english": "She loves her new job at work.", "thai": "เธอรักงานใหม่ของเธอที่ทำงาน"}
{"word": "work", "english": "I need to finish some work before dinner.", "thai": "ฉันต้องทำงานให้เสร็จก่อนมื้อเย็น"}
{"word": "work", "english": "He’s been out of work for a month.", "thai": "เขาตกงานมาเป็นเดือนแล้ว"}
{"word": "work", "english": "Does this remote control still work?", "thai": "รีโมตคอนโทรลนี้ยังใช้ได้อยู่ไหม?"}
{"word": "work", "english": "I work from home on Fridays.", "thai": "ฉันทำงานจากบ้านในวันศุกร์"}
{"word": "work", "english": "She’s trying to work out a solution.", "thai": "เธอกำลังพยายามหาทางแก้ไข"}
{"word": "work", "english": "I don’t want to work late tonight.", "thai": "ฉันไม่อยากทำงานดึกคืนนี้"}
{"word": "work", "english": "He found a new job that suits his work style.", "thai": "เขาหางานใหม่ที่เหมาะกับสไตล์การทำงานของเขาได้"}
{"word": "work", "english": "This plan might actually work!", "thai": "แผนนี้มันอาจจะใช้ได้จริง!"}
{"word": "work", "english": "I have a lot of work to do this weekend.", "thai": "ฉันมีงานต้องทำเยอะมากสุดสัปดาห์นี้"}
{"word": "work", "english": "She works as a teacher at the local school.", "thai": "เธอทำงานเป็นครูที่โรงเรียนท้องถิ่น"}
{"word": "work", "english": "The new software doesn’t work properly.", "thai": "ซอฟต์แวร์ใหม่นี้ใช้งานไม่ถูกต้อง"}
{"word": "work", "english": "I need to work on my presentation skills.", "thai": "ฉันต้องพัฒนาทักษะการนำเสนอของฉัน"}
{"word": "work", "english": "He’s looking for part-time work.", "thai": "เขากำลังหางานพาร์ทไทม์"}
{"word": "work", "english": "Let’s work together to finish this task.", "thai": "มาทำงานด้วยกันเพื่อให้งานนี้เสร็จ"}
{"word": "work", "english": "This light bulb doesn’t work anymore.", "thai": "หลอดไฟนี้ใช้การไม่ได้แล้ว"}
{"word": "work", "english": "I can’t go out, I’m swamped with work.", "thai": "ฉันออกไปข้างนอกไม่ได้ ฉันงานล้นมือ"}
{"word": "work", "english": "She works long hours at the hospital.", "thai": "เธอทำงานชั่วโมงยาวที่โรงพยาบาล"}
{"word": "work", "english": "Does this old radio still work?", "thai": "วิทยุเก่านี้ยังใช้ได้อยู่ไหม?"}
{"word": "work", "english": "I want to work in a creative field.", "thai": "ฉันอยากทำงานในสายงานที่สร้างสรรค์"}
{"word": "work", "english": "He’s trying to work through his problems.", "thai": "เขากำลังพยายามแก้ไขปัญหาของเขา"}
{"word": "work", "english": "I have to work overtime this week.", "thai": "ฉันต้องทำงานล่วงเวลาสัปดาห์นี้"}
{"word": "work", "english": "She found some freelance work online.", "thai": "เธอหางานฟรีแลนซ์ได้ทางออนไลน์"}
{"word": "work", "english": "This strategy won’t work in the long run.", "thai": "กลยุทธ์นี้จะไม่ใช้ได้ในระยะยาว"}
{"word": "work", "english": "I need to work on my fitness goals.", "thai": "ฉันต้องพัฒนาเป้าหมายการออกกำลังกายของฉัน"}
{"word": "work", "english": "He works at a coffee shop downtown.", "thai": "เขาทำงานที่ร้านกาแฟในตัวเมือง"}
{"word": "work", "english": "The heater doesn’t work in this room.", "thai": "เครื่องทำความร้อนในห้องนี้ใช้ไม่ได้"}
{"word": "work", "english": "I love my work, it’s so rewarding.", "thai": "ฉันรักงานของฉัน มันให้ผลตอบแทนที่ดี"}
{"word": "work", "english": "She’s trying to work out a new schedule.", "thai": "เธอกำลังพยายามจัดตารางใหม่"}
{"word": "work", "english": "I can’t work with all this noise!", "thai": "ฉันทำงานไม่ได้กับเสียงดังแบบนี้!"}
{"word": "work", "english": "He wants to work for a big tech company.", "thai": "เขาอยากทำงานให้บริษัทเทคใหญ่ๆ"}
{"word": "work", "english": "This old clock still works perfectly.", "thai": "นาฬิกาเก่านี้ยังทำงานได้ดีเยี่ยม"}
{"word": "work", "english": "I have to work on my essay tonight.", "thai": "ฉันต้องทำงานเรียงความคืนนี้"}
{"word": "work", "english": "She works in marketing for a startup.", "thai": "เธอทำงานด้านการตลาดให้สตาร์ทอัพ"}
{"word": "work", "english": "The app doesn’t work on my phone.", "thai": "แอปนี้ใช้ไม่ได้บนโทรศัพท์ของฉัน"}
{"word": "work", "english": "I need to work harder to pass this class.", "thai": "ฉันต้องทำงานหนักขึ้นเพื่อผ่านวิชานี้"}
{"word": "work", "english": "He’s been looking for work since June.", "thai": "เขาหางานมาตั้งแต่เดือนมิถุนายน"}
{"word": "work", "english": "Let’s work on the garden this weekend.", "thai": "ไปทำงานในสวนกันสุดสัปดาห์นี้"}
{"word": "work", "english": "This pen doesn’t work, can I borrow yours?", "thai": "ปากกานี้ใช้ไม่ได้ ขอยืมของคุณได้ไหม?"}
{"word": "work", "english": "I don’t want to work on holidays.", "thai": "ฉันไม่อยากทำงานในวันหยุด"}
{"word": "work", "english": "She works part-time at the library.", "thai": "เธอทำงานพาร์ทไทม์ที่ห้องสมุด"}
{"word": "work", "english": "The air conditioner doesn’t work well.", "thai": "เครื่องปรับอากาศนี้ทำงานไม่ดี"}
{"word": "work", "english": "I want to work on my cooking skills.", "thai": "ฉันอยากพัฒนาทักษะการทำอาหาร"}
{"word": "work", "english": "He’s trying to work out a deal with them.", "thai": "เขากำลังพยายามตกลงกับพวกเขา"}
{"word": "work", "english": "I have too much work to do today.", "thai": "ฉันมีงานต้องทำเยอะเกินไปวันนี้"}
{"word": "work", "english": "She works as a nurse in the city.", "thai": "เธอทำงานเป็นพยาบาลในเมือง"}
{"word": "work", "english": "This key doesn’t work in the lock.", "thai": "กุญแจนี้ใช้กับล็อกไม่ได้"}
{"word": "work", "english": "I need to work on my time management.", "thai": "ฉันต้องพัฒนาการบริหารเวลาของฉัน"}
{"word": "work", "english": "He works at a car dealership.", "thai": "เขาทำงานที่ตัวแทนจำหน่ายรถยนต์"}
{"word": "work", "english": "The printer doesn’t work anymore.", "thai": "เครื่องพิมพ์นี้ใช้การไม่ได้แล้ว"}
{"word": "work", "english": "I love to work with my hands.", "thai": "ฉันชอบทำงานด้วยมือ"}
{"word": "work", "english": "She’s trying to work through her stress.", "thai": "เธอกำลังพยายามจัดการกับความเครียด"}
{"word": "work", "english": "I can’t work without my coffee!", "thai": "ฉันทำงานไม่ได้ถ้าไม่มีกาแฟ!"}
{"word": "work", "english": "He wants to work abroad next year.", "thai": "เขาอยากทำงานในต่างประเทศปีหน้า"}
{"word": "work", "english": "This old fan still works great.", "thai": "พัดลมเก่านี้ยังทำงานได้ดี"}
{"word": "work", "english": "I have to work on my math homework.", "thai": "ฉันต้องทำการบ้านคณิตศาสตร์"}
{"word": "work", "english": "She works for a nonprofit organization.", "thai": "เธอทำงานให้องค์กรไม่แสวงผลกำไร"}
{"word": "work", "english": "The microwave doesn’t work properly.", "thai": "ไมโครเวฟนี้ทำงานไม่ถูกต้อง"}
{"word": "work", "english": "I need to work on my public speaking.", "thai": "ฉันต้องพัฒนาการพูดในที่สาธารณะ"}
{"word": "work", "english": "He’s been out of work since the layoffs.", "thai": "เขาตกงานตั้งแต่การเลิกจ้าง"}
{"word": "work", "english": "Let’s work on this puzzle together.", "thai": "มาทำปริศนานี้ด้วยกัน"}
{"word": "work", "english": "This old phone doesn’t work anymore.", "thai": "โทรศัพท์เก่าเครื่องนี้ใช้ไม่ได้แล้ว"}
{"word": "work", "english": "I don’t want to work this weekend.", "thai": "ฉันไม่อยากทำงานสุดสัปดาห์นี้"}
{"word": "work", "english": "She works in a bakery on weekends.", "thai": "เธอทำงานในร้านเบเกอรี่วันสุดสัปดาห์"}
{"word": "work", "english": "The elevator doesn’t work today.", "thai": "ลิฟต์ไม่ทำงานวันนี้"}
{"word": "work", "english": "I want to work on my painting skills.", "thai": "ฉันอยากพัฒนาทักษะการวาดภาพ"}
{"word": "work", "english": "He’s trying to work out a budget plan.", "thai": "เขากำลังพยายามวางแผนงบประมาณ"}
{"word": "work", "english": "I have some extra work to finish tonight.", "thai": "ฉันมีงานพิเศษต้องทำเสร็จคืนนี้"}
{"word": "work", "english": "She works as a graphic designer.", "thai": "เธอทำงานเป็นนักออกแบบกราฟิก"}
{"word": "work", "english": "This lamp doesn’t work with this bulb.", "thai": "โคมไฟนี้ใช้ไม่ได้กับหลอดนี้"}
{"word": "work", "english": "I need to work on my Spanish vocabulary.", "thai": "ฉันต้องพัฒนาคำศัพท์ภาษาสเปน"}
{"word": "work", "english": "He works at a grocery store part-time.", "thai": "เขาทำงานที่ร้านขายของชำแบบพาร์ทไทม์"}
{"word": "work", "english": "The coffee maker doesn’t work anymore.", "thai": "เครื่องชงกาแฟนี้ใช้ไม่ได้แล้ว"}
{"word": "work", "english": "I love my work in the animal shelter.", "thai": "ฉันรักงานของฉันที่ศูนย์พักพิงสัตว์"}
{"word": "work", "english": "She’s trying to work through her fears.", "thai": "เธอกำลังพยายามเอาชนะความกลัว"}
{"word": "work", "english": "I can’t work when I’m this tired.", "thai": "ฉันทำงานไม่ได้เมื่อเหนื่อยขนาดนี้"}
{"word": "work", "english": "He wants to work in environmental science.", "thai": "เขาอยากทำงานด้านวิทยาศาสตร์สิ่งแวดล้อม"}
{"word": "work", "english": "This battery still works in my flashlight.", "thai": "แบตเตอรี่นี้ยังใช้ได้ในไฟฉายของฉัน"}
{"word": "work", "english": "I have to work on my science project.", "thai": "ฉันต้องทำงานโปรเจกต์วิทยาศาสตร์"}
{"word": "work", "english": "She works for a fashion magazine.", "thai": "เธอทำงานให้กับนิตยสารแฟชัน"}
{"word": "work", "english": "The blender doesn’t work anymore.", "thai": "เครื่องปั่นนี้ใช้ไม่ได้แล้ว"}
{"word": "work", "english": "I need to work on my guitar skills.", "thai": "ฉันต้องพัฒนาทักษะการเล่นกีตาร์"}
{"word": "work", "english": "He’s looking for seasonal work.", "thai": "เขากำลังหางานตามฤดูกาล"}
{"word": "work", "english": "Let’s work on cleaning the garage today.", "thai": "ไปทำงานทำความสะอาดโรงรถวันนี้กัน"}
{"word": "work", "english": "This old TV doesn’t work anymore.", "thai": "ทีวีเก่าเครื่องนี้ใช้ไม่ได้แล้ว"}
{"word": "work", "english": "I don’t want to work on my birthday.", "thai": "ฉันไม่อยากทำงานในวันเกิด"}
{"word": "work", "english": "She works at a daycare center.", "thai": "เธอทำงานที่ศูนย์ดูแลเด็ก"}
{"word": "work", "english": "The doorbell doesn’t work right now.", "thai": "กริ่งประตูไม่ทำงานตอนนี้"}
{"word": "work", "english": "I want to work on my photography skills.", "thai": "ฉันอยากพัฒนาทักษะการถ่ายภาพ"}
{"word": "work", "english": "He’s trying to work out a payment plan.", "thai": "เขากำลังพยายามวางแผนการชำระเงิน"}
{"word": "work", "english": "I have a lot of work to catch up on.", "thai": "ฉันมีงานต้องตามให้ทันเยอะมาก"}
{"word": "work", "english": "She works as a barista on weekends.", "thai": "เธอทำงานเป็นบาริสต้าวันสุดสัปดาห์"}
{"word": "work", "english": "This old watch still works fine.", "thai": "นาฬิกาเก่านี้ยังทำงานได้ดี"}
{"word": "work", "english": "I need to work on my essay outline.", "thai": "ฉันต้องทำงานโครงร่างเรียงความ"}
{"word": "work", "english": "He works in construction during the summer.", "thai": "เขาทำงานก่อสร้างในช่วงฤดูร้อน"}
{"word": "work", "english": "The toaster doesn’t work anymore.", "thai": "เครื่องปิ้งขนมปังนี้ใช้ไม่ได้แล้ว"}
{"word": "work", "english": "I love to work with kids at the camp.", "thai": "ฉันรักการทำงานกับเด็กๆ ที่แคมป์"}
{"word": "work", "english": "She’s trying to work out her schedule.", "thai": "เธอกำลังพยายามจัดตารางของเธอ"}
