<<<<<<< Updated upstream
{"word":"competition","rank":1621,"freq":58102,"part_of_speech":"noun","back_cards":[{"definition_en":"A contest between individuals or groups to win a prize or achieve a goal.","example_en":"The school held a spelling competition to encourage better vocabulary."},{"definition_en":"Rivalry between businesses or people for success or resources.","example_en":"The two companies were in fierce competition to launch the new product first."},{"definition_en":"An event where skills or abilities are tested.","example_en":"She trained hard for the swimming competition at the community center."},{"definition_en":"The act of striving against others to gain an advantage.","example_en":"Competition among coworkers drove the team to improve their sales tactics."},{"definition_en":"A natural process where organisms vie for limited resources.","example_en":"In the forest, plants face competition for sunlight and water."}]}
{"word":"possibly","rank":1622,"freq":58071,"part_of_speech":"adverb","back_cards":[{"definition_en":"In a way that might happen or be true.","example_en":"It might possibly rain this afternoon, so bring an umbrella."},{"definition_en":"Used to express uncertainty or a slight chance.","example_en":"I can possibly finish the report by tomorrow if I work late."},{"definition_en":"Indicating a potential option or choice.","example_en":"We could possibly try the new restaurant downtown for dinner."},{"definition_en":"Used to soften a statement or suggestion.","example_en":"Could you possibly help me carry these groceries inside?"},{"definition_en":"Expressing speculation about an outcome.","example_en":"She’s possibly the best candidate for the job based on her experience."}]}
{"word":"technique","rank":1623,"freq":58028,"part_of_speech":"noun","back_cards":[{"definition_en":"A specific method or skill used to perform a task.","example_en":"The chef taught us a new technique for chopping vegetables quickly."},{"definition_en":"A way of achieving something through careful practice.","example_en":"Her painting technique improved after taking art classes."},{"definition_en":"A specialized approach in a professional field.","example_en":"The scientist developed a technique to analyze water samples accurately."},{"definition_en":"A strategy or method used in sports or activities.","example_en":"The coach showed the team a technique to improve their passing."},{"definition_en":"A creative way of solving a problem.","example_en":"He used a unique technique to organize his study notes effectively."}]}
{"word":"mine","rank":1624,"freq":58009,"part_of_speech":"pronoun","back_cards":[{"definition_en":"Something that belongs to the speaker.","example_en":"That book is mine; I bought it last week."},{"definition_en":"Used to emphasize ownership or possession.","example_en":"This is my house, but the garden is mine to maintain."},{"definition_en":"Referring to something personal or associated with the speaker.","example_en":"The decision is mine to make, not yours."},{"definition_en":"Used in a context of sharing or claiming.","example_en":"You take the blue pen; the red one is mine."},{"definition_en":"Indicating something the speaker is responsible for.","example_en":"The project is mine to lead, so I’ll set the timeline."}]}
{"word":"average","rank":1625,"freq":57985,"part_of_speech":"adjective","back_cards":[{"definition_en":"Typical or usual, representing a middle value.","example_en":"The average temperature in July is around 75 degrees."},{"definition_en":"Not exceptional, but standard or ordinary.","example_en":"His grades were average, but he excelled in sports."},{"definition_en":"Calculated as the mean of a set of values.","example_en":"The average score on the test was 85 out of 100."},{"definition_en":"Describing something common in everyday life.","example_en":"She lives an average life, working a nine-to-five job."},{"definition_en":"Used to describe a moderate level of quality.","example_en":"The restaurant’s food was average, nothing too special."}]}
{"word":"intend","rank":1626,"freq":57970,"part_of_speech":"verb","back_cards":[{"definition_en":"To plan or have a purpose to do something.","example_en":"I intend to finish my homework before dinner."},{"definition_en":"To mean or design something for a specific purpose.","example_en":"This gift is intended for your birthday celebration."},{"definition_en":"To aim to achieve a particular goal.","example_en":"She intends to start her own business next year."},{"definition_en":"To express a future action or decision.","example_en":"We intend to travel to Europe during the summer."},{"definition_en":"To have a specific intention or motive.","example_en":"He didn’t intend to upset anyone with his comment."}]}
{"word":"impossible","rank":1627,"freq":57892,"part_of_speech":"adjective","back_cards":[{"definition_en":"Not able to happen or be done.","example_en":"It’s impossible to finish this puzzle in one hour."},{"definition_en":"Extremely difficult or unlikely to achieve.","example_en":"Climbing that mountain without gear seems impossible."},{"definition_en":"Describing something that defies logic or reality.","example_en":"His story about meeting aliens was simply impossible."},{"definition_en":"Used to express frustration with a situation.","example_en":"It’s impossible to work with all this noise around."},{"definition_en":"Referring to an unfeasible task or goal.","example_en":"Finding a parking spot downtown on weekends is nearly impossible."}]}
{"word":"moral","rank":1628,"freq":57787,"part_of_speech":"adjective","back_cards":[{"definition_en":"Related to principles of right and wrong.","example_en":"She faced a moral dilemma about telling the truth."},{"definition_en":"Guided by ethical standards or beliefs.","example_en":"His moral behavior earned him respect at work."},{"definition_en":"Concerned with teaching lessons about good conduct.","example_en":"The story had a moral lesson about honesty."},{"definition_en":"Reflecting a sense of fairness or justice.","example_en":"It’s a moral obligation to help those in need."},{"definition_en":"Pertaining to personal values or conscience.","example_en":"He made a moral choice to admit his mistake."}]}
{"word":"academic","rank":1629,"freq":57717,"part_of_speech":"adjective","back_cards":[{"definition_en":"Related to education or scholarly activities.","example_en":"She pursued an academic career in biology."},{"definition_en":"Focused on theoretical rather than practical matters.","example_en":"The discussion was too academic and lacked real-world solutions."},{"definition_en":"Describing performance in school or studies.","example_en":"His academic achievements earned him a scholarship."},{"definition_en":"Pertaining to institutions of learning.","example_en":"The academic year starts in September at most colleges."},{"definition_en":"Involving research or intellectual pursuits.","example_en":"The professor published an academic paper on climate change."}]}
{"word":"wine","rank":1630,"freq":57614,"part_of_speech":"noun","back_cards":[{"definition_en":"An alcoholic drink made from fermented grapes.","example_en":"She ordered a glass of red wine with dinner."},{"definition_en":"A beverage associated with social gatherings.","example_en":"They toasted with wine at the wedding reception."},{"definition_en":"A product from specific regions or vineyards.","example_en":"This wine comes from the Bordeaux region of France."},{"definition_en":"Used in cooking to enhance flavors.","example_en":"The recipe calls for a splash of white wine in the sauce."},{"definition_en":"A symbol of celebration or luxury.","example_en":"He gifted her a bottle of fine wine for her promotion."}]}
{"word":"approach","rank":1631,"freq":57607,"part_of_speech":"noun","back_cards":[{"definition_en":"A way of dealing with a problem or situation.","example_en":"Her approach to solving conflicts was calm and thoughtful."},{"definition_en":"The act of coming closer to something or someone.","example_en":"The approach of winter brought colder temperatures."},{"definition_en":"A method or strategy used in a task.","example_en":"The teacher’s approach to math made it fun for students."},{"definition_en":"A path or route leading to a place.","example_en":"The approach to the village was lined with trees."},{"definition_en":"An initial attempt to connect or engage.","example_en":"His approach to the new client was friendly and professional."}]}
{"word":"somehow","rank":1632,"freq":57596,"part_of_speech":"adverb","back_cards":[{"definition_en":"In a way that is not clear or specified.","example_en":"Somehow, she managed to finish the project on time."},{"definition_en":"By some means or method, often unexpectedly.","example_en":"We need to somehow find a way to fix this broken chair."},{"definition_en":"Indicating an uncertain or surprising outcome.","example_en":"He somehow passed the exam without studying."},{"definition_en":"Used to express a vague sense of how something happened.","example_en":"The keys were somehow left on the kitchen counter."},{"definition_en":"Suggesting an unexplained or fortunate result.","example_en":"Somehow, they avoided the traffic and arrived early."}]}
{"word":"gather","rank":1633,"freq":57562,"part_of_speech":"verb","back_cards":[{"definition_en":"To come together or collect in one place.","example_en":"The family gathered around the table for dinner."},{"definition_en":"To collect items or resources from various sources.","example_en":"She gathered wildflowers from the meadow for a bouquet."},{"definition_en":"To gain information or understanding.","example_en":"From the meeting, I gathered that the project is delayed."},{"definition_en":"To bring people together for a purpose.","example_en":"They gathered volunteers to clean up the park."},{"definition_en":"To pull or draw something closer.","example_en":"He gathered the blanket around himself to stay warm."}]}
{"word":"scientific","rank":1634,"freq":57547,"part_of_speech":"adjective","back_cards":[{"definition_en":"Related to science or its methods.","example_en":"The experiment followed strict scientific procedures."},{"definition_en":"Based on observation and evidence.","example_en":"Her scientific approach helped solve the mystery."},{"definition_en":"Pertaining to research or discovery.","example_en":"The team made a scientific breakthrough in cancer treatment."},{"definition_en":"Describing a systematic or logical process.","example_en":"He used a scientific method to test his hypothesis."},{"definition_en":"Associated with academic study of natural phenomena.","example_en":"The museum displayed scientific models of the solar system."}]}
{"word":"African","rank":1635,"freq":57497,"part_of_speech":"adjective","back_cards":[{"definition_en":"Related to the continent of Africa or its people.","example_en":"She studied African history in college."},{"definition_en":"Describing cultural traditions from Africa.","example_en":"The festival featured African music and dance."},{"definition_en":"Pertaining to African geography or wildlife.","example_en":"The African savanna is home to many unique animals."},{"definition_en":"Associated with African heritage or identity.","example_en":"He proudly wore an African print shirt to the event."},{"definition_en":"Involving African nations or societies.","example_en":"The African market was vibrant with local crafts."}]}
{"word":"cook","rank":1636,"freq":57383,"part_of_speech":"verb","back_cards":[{"definition_en":"To prepare food by heating or combining ingredients.","example_en":"She loves to cook Italian pasta for her friends."},{"definition_en":"To make a meal or dish from scratch.","example_en":"He cooked a delicious curry for the family dinner."},{"definition_en":"To process food using a specific method.","example_en":"They cooked the fish on a grill by the beach."},{"definition_en":"To engage in the activity of preparing food.","example_en":"I cook every weekend to try new recipes."},{"definition_en":"To alter or transform through heat.","example_en":"You need to cook the vegetables until they’re tender."}]}
{"word":"participate","rank":1637,"freq":57361,"part_of_speech":"verb","back_cards":[{"definition_en":"To take part in an activity or event.","example_en":"She decided to participate in the charity run."},{"definition_en":"To join others in a group effort.","example_en":"Everyone was encouraged to participate in the discussion."},{"definition_en":"To engage actively in a process or project.","example_en":"He participated in the science fair with his experiment."},{"definition_en":"To share in a communal or social activity.","example_en":"Kids love to participate in school talent shows."},{"definition_en":"To contribute to a shared goal or task.","example_en":"They participated in cleaning up the neighborhood park."}]}
{"word":"gay","rank":1638,"freq":57195,"part_of_speech":"adjective","back_cards":[{"definition_en":"Describing someone attracted to the same sex.","example_en":"He came out as gay to his supportive friends."},{"definition_en":"Bright, cheerful, or lively in appearance or mood.","example_en":"The room was decorated in gay colors for the party."},{"definition_en":"Associated with the LGBTQ+ community or culture.","example_en":"The city hosted a gay pride parade last weekend."},{"definition_en":"Expressing joy or happiness in a situation.","example_en":"Her gay laughter filled the room during the game."},{"definition_en":"Relating to a carefree or spirited attitude.","example_en":"The festival had a gay atmosphere with music and dancing."}]}
{"word":"appropriate","rank":1639,"freq":57163,"part_of_speech":"adjective","back_cards":[{"definition_en":"Suitable or proper for a specific situation.","example_en":"Her outfit was appropriate for the formal event."},{"definition_en":"Fitting or acceptable in a given context.","example_en":"It’s not appropriate to talk loudly in the library."},{"definition_en":"Correct or expected for a particular purpose.","example_en":"The teacher chose an appropriate book for the class."},{"definition_en":"Matching the needs or expectations of a setting.","example_en":"His comments were appropriate for the serious meeting."},{"definition_en":"Socially or culturally acceptable.","example_en":"Wearing shoes indoors is not always appropriate in some cultures."}]}
{"word":"youth","rank":1640,"freq":57132,"part_of_speech":"noun","back_cards":[{"definition_en":"The period of life when someone is young.","example_en":"Her youth was filled with adventures and learning."},{"definition_en":"Young people as a group or demographic.","example_en":"The program aims to inspire the youth to vote."},{"definition_en":"The state of being young or energetic.","example_en":"His youth gave him the energy to run marathons."},{"definition_en":"A time associated with growth and development.","example_en":"In her youth, she dreamed of becoming an astronaut."},{"definition_en":"The early stage of something’s existence.","example_en":"The company was innovative in its youth."}]}
=======
[]
>>>>>>> Stashed changes
