{"word":"enrollment","rank":4901,"freq":6674,"part_of_speech":"noun","back_cards":[{"definition_en":"The act of registering or signing up for a program or course.","example_en":"Her enrollment in the art class was confirmed after she paid the fee."},{"definition_en":"The total number of people registered in an institution.","example_en":"The university reported a record enrollment of 25,000 students this year."},{"definition_en":"The process of joining a membership or organization.","example_en":"Enrollment in the book club is open to all community members."},{"definition_en":"The act of entering someone into an official list or record.","example_en":"The hospital streamlined the enrollment of patients into its new system."},{"definition_en":"Participation in a formal plan or agreement.","example_en":"Enrollment in the health insurance plan must be completed by December."}]}
{"word":"endowment","rank":4902,"freq":6664,"part_of_speech":"noun","back_cards":[{"definition_en":"A fund or property donated to an institution for ongoing support.","example_en":"The college used the endowment to fund scholarships for students."},{"definition_en":"A natural gift or quality bestowed upon someone.","example_en":"Her endowment of creativity made her an exceptional artist."},{"definition_en":"The act of providing financial support for a cause.","example_en":"The endowment of the library ensured its expansion."},{"definition_en":"A permanent financial resource for an organization.","example_en":"The museum's endowment helped preserve its historical artifacts."},{"definition_en":"A legacy or inheritance provided for future generations.","example_en":"The family's endowment supported the local park's maintenance."}]}
{"word":"endeavor","rank":4903,"freq":6654,"part_of_speech":"noun","back_cards":[{"definition_en":"A serious effort or attempt to achieve a goal.","example_en":"Her endeavor to start a business was met with great success."},{"definition_en":"A project or undertaking requiring dedicated work.","example_en":"The team’s endeavor to clean the river took months of planning."},{"definition_en":"An activity aimed at personal improvement.","example_en":"His endeavor to learn coding opened new career opportunities."},{"definition_en":"A collective effort toward a common objective.","example_en":"The community’s endeavor to build a playground was inspiring."},{"definition_en":"A pursuit requiring persistence and determination.","example_en":"Climbing the mountain was a challenging endeavor for the group."}]}
{"word":"encouragement","rank":4904,"freq":6644,"part_of_speech":"noun","back_cards":[{"definition_en":"Words or actions that give someone confidence or hope.","example_en":"Her teacher’s encouragement helped her excel in math."},{"definition_en":"Support that motivates someone to continue an effort.","example_en":"The coach’s encouragement pushed the team to win the game."},{"definition_en":"The act of inspiring someone in a social setting.","example_en":"His encouragement during the meeting boosted her confidence."},{"definition_en":"Positive reinforcement in a learning environment.","example_en":"The tutor’s encouragement made the student eager to study."},{"definition_en":"A gesture that fosters hope in a difficult situation.","example_en":"Her friend’s encouragement helped her through a tough time."}]}
{"word":"enclosure","rank":4905,"freq":6634,"part_of_speech":"noun","back_cards":[{"definition_en":"An area surrounded by a fence or barrier.","example_en":"The sheep were kept safe in the enclosure near the barn."},{"definition_en":"A structure that confines or protects something.","example_en":"The zoo built a new enclosure for the tigers."},{"definition_en":"Something included with a letter or package.","example_en":"The envelope contained a letter and a photo as an enclosure."},{"definition_en":"A space designated for a specific purpose.","example_en":"The enclosure in the park was reserved for picnics."},{"definition_en":"A protective casing for equipment or machinery.","example_en":"The machine’s enclosure prevented dust from entering."}]}
{"word":"embarrassment","rank":4906,"freq":6624,"part_of_speech":"noun","back_cards":[{"definition_en":"A feeling of self-consciousness or shame.","example_en":"His mistake caused him great embarrassment in class."},{"definition_en":"An event that causes discomfort or awkwardness.","example_en":"Forgetting her lines was an embarrassment during the play."},{"definition_en":"A situation that makes someone feel uneasy in public.","example_en":"Spilling coffee on his shirt was a minor embarrassment."},{"definition_en":"The state of being uncomfortable in a social setting.","example_en":"Her loud laugh caused her embarrassment at the quiet event."},{"definition_en":"Something that brings disgrace or discomfort.","example_en":"The error in the report was an embarrassment to the team."}]}
{"word":"elimination","rank":4907,"freq":6614,"part_of_speech":"noun","back_cards":[{"definition_en":"The act of removing or getting rid of something.","example_en":"The elimination of waste reduced the factory’s costs."},{"definition_en":"The process of excluding competitors in a contest.","example_en":"Her team faced elimination in the final round of the quiz."},{"definition_en":"The removal of harmful substances from the body.","example_en":"Proper hydration aids in the elimination of toxins."},{"definition_en":"The act of solving a problem by removing its cause.","example_en":"The elimination of bugs fixed the software issue."},{"definition_en":"The act of dismissing or rejecting something.","example_en":"The elimination of outdated policies improved efficiency."}]}
{"word":"electronics","rank":4908,"freq":6604,"part_of_speech":"noun","back_cards":[{"definition_en":"Devices or technology using electrical circuits.","example_en":"The store sells a wide range of electronics, from phones to TVs."},{"definition_en":"The field of study related to electrical systems.","example_en":"She studied electronics to design better computers."},{"definition_en":"Gadgets used in daily life for convenience.","example_en":"Modern electronics like smartwatches make life easier."},{"definition_en":"Components used in machines or appliances.","example_en":"The car’s electronics needed repair after the short circuit."},{"definition_en":"Products relying on digital or circuit-based technology.","example_en":"The new electronics in the lab improved research accuracy."}]}
{"word":"elaborate","rank":4909,"freq":6594,"part_of_speech":"adjective","back_cards":[{"definition_en":"Detailed and carefully planned or designed.","example_en":"The wedding had an elaborate floral arrangement."},{"definition_en":"Complex and intricate in structure or design.","example_en":"Her elaborate costume won first prize at the festival."},{"definition_en":"Involving many steps or careful effort.","example_en":"The chef prepared an elaborate meal for the guests."},{"definition_en":"Highly detailed in explanation or description.","example_en":"His elaborate presentation impressed the investors."},{"definition_en":"Ornate or richly decorated.","example_en":"The palace’s elaborate architecture attracted tourists."}]}
{"word":"edible","rank":4910,"freq":6584,"part_of_speech":"adjective","back_cards":[{"definition_en":"Safe and suitable for eating.","example_en":"The berries in the forest were confirmed to be edible."},{"definition_en":"Describing food that is fit for consumption.","example_en":"The chef used only edible ingredients in the dish."},{"definition_en":"Something that can be eaten without harm.","example_en":"The flowers on the cake were edible and sweet."},{"definition_en":"Describing plants or items safe for human consumption.","example_en":"The guide pointed out edible mushrooms during the hike."},{"definition_en":"Prepared in a way that makes it consumable.","example_en":"The raw fish was not edible until properly cooked."}]}
{"word":"ecological","rank":4911,"freq":6574,"part_of_speech":"adjective","back_cards":[{"definition_en":"Related to the environment and its living organisms.","example_en":"The ecological impact of the factory was carefully studied."},{"definition_en":"Concerned with protecting natural ecosystems.","example_en":"The park adopted ecological practices to preserve wildlife."},{"definition_en":"Describing interactions between organisms and their environment.","example_en":"The ecological balance of the lake was disrupted by pollution."},{"definition_en":"Pertaining to sustainable environmental practices.","example_en":"Her ecological lifestyle included recycling and composting."},{"definition_en":"Involving the study of natural systems and their health.","example_en":"The ecological report highlighted the need for conservation."}]}
{"word":"dynamite","rank":4912,"freq":6564,"part_of_speech":"noun","back_cards":[{"definition_en":"An explosive material used in construction or mining.","example_en":"The workers used dynamite to clear the rocky terrain."},{"definition_en":"Something exciting or highly effective.","example_en":"Her performance on stage was pure dynamite."},{"definition_en":"A powerful tool for breaking or demolishing.","example_en":"Dynamite was essential for blasting through the mountain."},{"definition_en":"A metaphor for something impactful or impressive.","example_en":"The new product launch was described as dynamite by the media."},{"definition_en":"A dangerous substance requiring careful handling.","example_en":"The crew stored the dynamite in a secure vault."}]}
{"word":"dwell","rank":4913,"freq":6554,"part_of_speech":"verb","back_cards":[{"definition_en":"To live or reside in a particular place.","example_en":"They dwell in a small cottage by the lake."},{"definition_en":"To think or focus on something for a long time.","example_en":"She tends to dwell on her past mistakes."},{"definition_en":"To linger or remain in a specific state.","example_en":"He didn’t dwell on his success and kept working hard."},{"definition_en":"To inhabit a place as a permanent home.","example_en":"The tribe dwells in the remote mountains."},{"definition_en":"To reflect deeply on a topic or issue.","example_en":"The poet would dwell on themes of love and loss."}]}
{"word":"duplicate","rank":4914,"freq":6544,"part_of_speech":"verb","back_cards":[{"definition_en":"To make an exact copy of something.","example_en":"She needed to duplicate the document for the meeting."},{"definition_en":"To replicate or reproduce an item or process.","example_en":"The factory can duplicate the design in large quantities."},{"definition_en":"To create a second version of a file or object.","example_en":"He duplicated the photo to share with his family."},{"definition_en":"To repeat an action or process identically.","example_en":"The scientist tried to duplicate the experiment’s results."},{"definition_en":"To produce a backup or spare copy.","example_en":"Always duplicate important files to avoid data loss."}]}
{"word":"dunk","rank":4915,"freq":6534,"part_of_speech":"verb","back_cards":[{"definition_en":"To dip something quickly into a liquid.","example_en":"She loves to dunk her cookies in milk."},{"definition_en":"To slam a basketball through the hoop.","example_en":"He managed to dunk the ball during the game."},{"definition_en":"To submerge something briefly in water.","example_en":"The chef would dunk the vegetables in boiling water."},{"definition_en":"To playfully push someone’s head underwater.","example_en":"The kids laughed as they tried to dunk each other in the pool."},{"definition_en":"To immerse food in a sauce or dip.","example_en":"He dunked his fries in ketchup before eating."}]}
{"word":"drought","rank":4916,"freq":6524,"part_of_speech":"noun","back_cards":[{"definition_en":"A prolonged period of little or no rainfall.","example_en":"The drought caused the crops to wither in the fields."},{"definition_en":"A shortage or lack of something essential.","example_en":"The city faced a water drought during the summer."},{"definition_en":"A natural disaster affecting agriculture and water supply.","example_en":"Farmers struggled to survive the severe drought."},{"definition_en":"A metaphor for a lack of opportunities or resources.","example_en":"The industry faced a drought of new talent."},{"definition_en":"An extended dry spell impacting the environment.","example_en":"The drought left the riverbed completely dry."}]}
{"word":"drip","rank":4917,"freq":6514,"part_of_speech":"verb","back_cards":[{"definition_en":"To fall in small drops or leak slowly.","example_en":"The faucet continued to drip despite being tightened."},{"definition_en":"To let liquid fall in drops.","example_en":"The wet towel would drip water onto the floor."},{"definition_en":"To produce a steady flow of small amounts.","example_en":"The tree’s sap began to drip in the warm weather."},{"definition_en":"To ooze or exude slowly, like a liquid.","example_en":"The candle wax dripped onto the tablecloth."},{"definition_en":"To release liquid gradually over time.","example_en":"The wound would drip blood if not bandaged properly."}]}
{"word":"drastic","rank":4918,"freq":6504,"part_of_speech":"adjective","back_cards":[{"definition_en":"Extreme or severe in effect or action.","example_en":"The company took drastic measures to cut costs."},{"definition_en":"Involving bold or sudden changes.","example_en":"Her drastic haircut surprised all her friends."},{"definition_en":"Having a strong or far-reaching impact.","example_en":"The policy had a drastic effect on the economy."},{"definition_en":"Describing an intense or radical approach.","example_en":"The coach made drastic changes to the team’s strategy."},{"definition_en":"Characterized by extreme or urgent action.","example_en":"Drastic steps were needed to stop the wildfire."}]}
{"word":"downward","rank":4919,"freq":6494,"part_of_speech":"adjective","back_cards":[{"definition_en":"Moving or directed toward a lower position.","example_en":"The plane began its downward descent to the runway."},{"definition_en":"Describing a decline or reduction in value.","example_en":"The stock market showed a downward trend this month."},{"definition_en":"Pointing or sloping toward the ground.","example_en":"The downward slope of the hill was perfect for skiing."},{"definition_en":"Indicating a worsening or negative direction.","example_en":"His health took a downward turn after the illness."},{"definition_en":"Relating to a movement toward a lower level.","example_en":"The downward flow of the river was steady."}]}
{"word":"downstream","rank":4920,"freq":6484,"part_of_speech":"adverb","back_cards":[{"definition_en":"In the direction of a stream’s flow.","example_en":"The boat floated downstream with the current."},{"definition_en":"Later in a process or sequence.","example_en":"The error affected all systems downstream in the workflow."},{"definition_en":"Toward the lower part of a river.","example_en":"The factory’s waste was carried downstream."},{"definition_en":"In the direction of water movement.","example_en":"Fish were seen swimming downstream during migration."},{"definition_en":"Referring to later stages in production.","example_en":"Issues in quality control impacted downstream operations."}]}
{"word":"downfall","rank":4921,"freq":6474,"part_of_speech":"noun","back_cards":[{"definition_en":"A sudden loss of power, status, or success.","example_en":"His greed led to the downfall of his career."},{"definition_en":"The cause of someone’s failure or ruin.","example_en":"Poor decisions were the downfall of the company."},{"definition_en":"A dramatic decline or collapse.","example_en":"The downfall of the empire shocked historians."},{"definition_en":"A personal failure due to a flaw or mistake.","example_en":"Her arrogance was her downfall in the competition."},{"definition_en":"The end or destruction of something successful.","example_en":"The scandal marked the downfall of the politician."}]}
{"word":"dove","rank":4922,"freq":6464,"part_of_speech":"noun","back_cards":[{"definition_en":"A bird symbolizing peace or love.","example_en":"A white dove flew over the wedding ceremony."},{"definition_en":"A small, gentle bird often found in cities.","example_en":"The dove perched on the park bench, cooing softly."},{"definition_en":"A symbol used in art or literature for tranquility.","example_en":"The painting featured a dove against a blue sky."},{"definition_en":"A bird associated with spiritual or religious imagery.","example_en":"The dove appeared in the story as a sign of hope."},{"definition_en":"A common bird known for its soft cooing sound.","example_en":"She fed the doves in the garden every morning."}]}
{"word":"dorm","rank":4923,"freq":6454,"part_of_speech":"noun","back_cards":[{"definition_en":"A building where students live on campus.","example_en":"She moved into the dorm at the start of the semester."},{"definition_en":"A shared living space for college students.","example_en":"The dorm was noisy during the first week of school."},{"definition_en":"A residence hall for university students.","example_en":"The dorm had a lounge where students could relax."},{"definition_en":"A place providing housing for young adults.","example_en":"Living in the dorm helped her make new friends."},{"definition_en":"A communal living space for academic communities.","example_en":"The dorm organized a movie night for residents."}]}
{"word":"dome","rank":4924,"freq":6444,"part_of_speech":"noun","back_cards":[{"definition_en":"A rounded roof or ceiling, often arched.","example_en":"The cathedral’s dome was visible from miles away."},{"definition_en":"A structure shaped like a half-sphere.","example_en":"The observatory’s dome housed a powerful telescope."},{"definition_en":"A natural formation resembling a rounded top.","example_en":"The mountain’s dome was covered in snow."},{"definition_en":"A protective cover shaped like a hemisphere.","example_en":"The radar was housed under a large dome."},{"definition_en":"A term for a rounded architectural feature.","example_en":"The capitol building’s dome gleamed in the sunlight."}]}
{"word":"dodge","rank":4925,"freq":6434,"part_of_speech":"verb","back_cards":[{"definition_en":"To quickly move to avoid something.","example_en":"She had to dodge a ball thrown at her."},{"definition_en":"To evade or avoid a question or issue.","example_en":"He tried to dodge the reporter’s tough questions."},{"definition_en":"To sidestep or swerve to escape danger.","example_en":"The driver had to dodge a deer on the road."},{"definition_en":"To avoid responsibility or commitment.","example_en":"She didn’t want to dodge her duties at work."},{"definition_en":"To move quickly to avoid contact.","example_en":"He dodged the crowd to reach the exit faster."}]}
{"word":"divisive","rank":4926,"freq":6424,"part_of_speech":"adjective","back_cards":[{"definition_en":"Causing disagreement or conflict among people.","example_en":"The divisive issue split the community into two groups."},{"definition_en":"Creating division or opposition in a group.","example_en":"His divisive comments caused tension at the meeting."},{"definition_en":"Tending to separate people or opinions.","example_en":"The policy was divisive and sparked heated debates."},{"definition_en":"Leading to discord or differing viewpoints.","example_en":"The divisive speech left the audience polarized."},{"definition_en":"Provoking strong disagreement or controversy.","example_en":"The new law proved to be highly divisive."}]}
{"word":"dividend","rank":4927,"freq":6414,"part_of_speech":"noun","back_cards":[{"definition_en":"A share of a company’s profits paid to shareholders.","example_en":"The company announced a dividend for its investors."},{"definition_en":"A benefit or reward from an action or investment.","example_en":"Her hard work paid a dividend in career success."},{"definition_en":"A sum distributed periodically to stakeholders.","example_en":"He received a dividend from his stock investments."},{"definition_en":"A return on financial or personal effort.","example_en":"The project’s dividend was a stronger community bond."},{"definition_en":"A portion of earnings given to owners.","example_en":"The annual dividend helped fund her retirement."}]}
{"word":"disturbance","rank":4928,"freq":6404,"part_of_speech":"noun","back_cards":[{"definition_en":"An interruption of peace or order.","example_en":"The loud noise caused a disturbance in the neighborhood."},{"definition_en":"A disruption in a natural or calm state.","example_en":"The storm created a disturbance in the lake’s ecosystem."},{"definition_en":"An event causing unrest or agitation.","example_en":"The protest led to a public disturbance downtown."},{"definition_en":"A mental or emotional upset.","example_en":"His behavior showed signs of emotional disturbance."},{"definition_en":"An interference with normal activity.","example_en":"The power outage was a major disturbance to the event."}]}
{"word":"distortion","rank":4929,"freq":6394,"part_of_speech":"noun","back_cards":[{"definition_en":"A misrepresentation or alteration of facts.","example_en":"The article was criticized for its distortion of the truth."},{"definition_en":"A change in shape or sound, making it unnatural.","example_en":"The speaker’s distortion made the music sound strange."},{"definition_en":"A twisting or warping of an object’s form.","example_en":"The heat caused a distortion in the metal frame."},{"definition_en":"A false or misleading interpretation.","example_en":"His distortion of her words led to a misunderstanding."},{"definition_en":"An error in visual or audio reproduction.","example_en":"The lens caused a distortion in the photograph."}]}
{"word":"distinguished","rank":4930,"freq":6384,"part_of_speech":"adjective","back_cards":[{"definition_en":"Respected or admired for excellence.","example_en":"She was a distinguished scientist in her field."},{"definition_en":"Having a notable or dignified appearance.","example_en":"His distinguished gray hair gave him an air of wisdom."},{"definition_en":"Recognized for outstanding achievements.","example_en":"The distinguished author received a literary award."},{"definition_en":"Marked by refinement or high status.","example_en":"The event was attended by distinguished guests."},{"definition_en":"Known for exceptional qualities or reputation.","example_en":"He was a distinguished leader in the community."}]}
{"word":"distinctive","rank":4931,"freq":6374,"part_of_speech":"adjective","back_cards":[{"definition_en":"Having a unique or recognizable quality.","example_en":"Her distinctive laugh could be heard across the room."},{"definition_en":"Standing out due to specific characteristics.","example_en":"The car’s distinctive color made it easy to spot."},{"definition_en":"Marking something as different or special.","example_en":"The restaurant’s distinctive menu attracted foodies."},{"definition_en":"Clearly different from others in style or form.","example_en":"His distinctive voice made him a great narrator."},{"definition_en":"Possessing a notable or defining feature.","example_en":"The building’s distinctive design became a landmark."}]}
{"word":"dissolve","rank":4932,"freq":6364,"part_of_speech":"verb","back_cards":[{"definition_en":"To mix a solid into a liquid until it disappears.","example_en":"She watched the sugar dissolve in her tea."},{"definition_en":"To bring an organization or group to an end.","example_en":"The committee voted to dissolve after the project ended."},{"definition_en":"To fade or disappear gradually.","example_en":"Her fears began to dissolve as she gained confidence."},{"definition_en":"To break down or disperse completely.","example_en":"The mist would dissolve as the sun rose."},{"definition_en":"To end a formal agreement or partnership.","example_en":"They decided to dissolve their business partnership."}]}
{"word":"dissertation","rank":4933,"freq":6354,"part_of_speech":"noun","back_cards":[{"definition_en":"A long academic paper based on original research.","example_en":"Her dissertation on climate change won an award."},{"definition_en":"A formal written study for a graduate degree.","example_en":"He spent years writing his dissertation for his PhD."},{"definition_en":"An in-depth exploration of a scholarly topic.","example_en":"The dissertation explored new theories in physics."},{"definition_en":"A detailed document required for advanced degrees.","example_en":"She defended her dissertation before a panel of experts."},{"definition_en":"A comprehensive research project for academic credit.","example_en":"His dissertation focused on urban development trends."}]}
{"word":"disrupt","rank":4934,"freq":6344,"part_of_speech":"verb","back_cards":[{"definition_en":"To interrupt or disturb a process or event.","example_en":"The storm could disrupt the outdoor wedding."},{"definition_en":"To cause disorder in a system or organization.","example_en":"The new policy might disrupt the workflow."},{"definition_en":"To interfere with normal operations.","example_en":"A power outage disrupted the factory’s production."},{"definition_en":"To upset or unsettle an established routine.","example_en":"Her late arrival disrupted the meeting’s schedule."},{"definition_en":"To innovate by changing an industry or market.","example_en":"The startup aimed to disrupt the tech industry."}]}
{"word":"disregard","rank":4935,"freq":6334,"part_of_speech":"verb","back_cards":[{"definition_en":"To ignore or pay no attention to something.","example_en":"He chose to disregard the warning signs."},{"definition_en":"To overlook or dismiss as unimportant.","example_en":"She didn’t want to disregard his advice completely."},{"definition_en":"To neglect or fail to consider something.","example_en":"The manager disregarded the team’s concerns."},{"definition_en":"To intentionally set aside rules or instructions.","example_en":"They disregarded the guidelines and faced consequences."},{"definition_en":"To treat something as unworthy of notice.","example_en":"He disregarded the rumors about his project."}]}
{"word":"disposable","rank":4936,"freq":6324,"part_of_speech":"adjective","back_cards":[{"definition_en":"Designed to be thrown away after use.","example_en":"She bought disposable plates for the picnic."},{"definition_en":"Intended for single or temporary use.","example_en":"The hospital used disposable gloves for hygiene."},{"definition_en":"Easily discarded or replaced.","example_en":"Disposable cameras were popular at the event."},{"definition_en":"Not meant for long-term use or storage.","example_en":"He packed disposable razors for the trip."},{"definition_en":"Describing items that are convenient but wasteful.","example_en":"Disposable coffee cups filled the trash bin."}]}
{"word":"dismissal","rank":4937,"freq":6314,"part_of_speech":"noun","back_cards":[{"definition_en":"The act of sending someone away or ending their role.","example_en":"His dismissal from the job shocked his colleagues."},{"definition_en":"The rejection or refusal of something.","example_en":"The dismissal of her idea upset the team."},{"definition_en":"The act of formally ending a process or case.","example_en":"The court’s dismissal of the case surprised everyone."},{"definition_en":"The termination of employment or service.","example_en":"The dismissal came after repeated tardiness."},{"definition_en":"The act of disregarding or ignoring something.","example_en":"Her dismissal of the warning led to trouble."}]}
{"word":"disgust","rank":4938,"freq":6304,"part_of_speech":"noun","back_cards":[{"definition_en":"A strong feeling of repulsion or aversion.","example_en":"The smell of the garbage filled her with disgust."},{"definition_en":"A reaction to something offensive or unpleasant.","example_en":"His rude behavior caused disgust among the guests."},{"definition_en":"A feeling of distaste for something immoral.","example_en":"She expressed disgust at the unfair treatment."},{"definition_en":"An emotional response to something revolting.","example_en":"The sight of the spoiled food triggered disgust."},{"definition_en":"A sense of disapproval toward bad actions.","example_en":"His lies were met with disgust by his friends."}]}
{"word":"disguise","rank":4939,"freq":6294,"part_of_speech":"noun","backcards":[{"definition_en":"A costume or appearance to conceal identity.","example_en":"She wore a disguise to the costume party."},{"definition_en":"Something used to hide or alter one’s appearance.","example_en":"His beard was a perfect disguise for the mission."},{"definition_en":"A way to conceal the true nature of something.","example_en":"The plan was a disguise to trick the competitors."},{"definition_en":"An outfit or makeup to change how one looks.","example_en":"The actor’s disguise made him unrecognizable."},{"definition_en":"A method to mask intentions or motives.","example_en":"Her smile was a disguise for her true feelings."}]}
{"word":"disgrace","rank":4940,"freq":6284,"part_of_speech":"noun","back_cards":[{"definition_en":"A state of shame or dishonor.","example_en":"His actions brought disgrace to his family."},{"definition_en":"Something that causes loss of respect.","example_en":"The scandal was a disgrace to the company."},{"definition_en":"A condition of being out of favor.","example_en":"After the mistake, he fell into disgrace at work."},{"definition_en":"An act or event that harms reputation.","example_en":"Cheating in the game was considered a disgrace."},{"definition_en":"A source of public embarrassment.","example_en":"The politician’s behavior was a national disgrace."}]}
{"word":"disciplinary","rank":4941,"freq":6274,"part_of_speech":"adjective","back_cards":[{"definition_en":"Relating to enforcing rules or punishment.","example_en":"The school took disciplinary action against the student."},{"definition_en":"Concerned with maintaining order or control.","example_en":"The manager implemented disciplinary measures in the office."},{"definition_en":"Intended to correct or regulate behavior.","example_en":"Disciplinary training helped improve team performance."},{"definition_en":"Involving formal procedures for rule-breaking.","example_en":"The disciplinary hearing addressed the employee’s conduct."},{"definition_en":"Pertaining to the enforcement of standards.","example_en":"The coach’s disciplinary approach kept the team focused."}]}
{"word":"discern","rank":4942,"freq":6264,"part_of_speech":"verb","back_cards":[{"definition_en":"To perceive or recognize something clearly.","example_en":"She could discern his true intentions from his tone."},{"definition_en":"To distinguish or differentiate between things.","example_en":"He learned to discern good wine from bad."},{"definition_en":"To notice or understand something subtle.","example_en":"It was hard to discern the details in the fog."},{"definition_en":"To detect or identify with the senses.","example_en":"She could discern a faint smell of flowers."},{"definition_en":"To comprehend or make out clearly.","example_en":"He tried to discern the meaning of the old text."}]}
{"word":"disapprove","rank":4943,"freq":6254,"part_of_speech":"verb","back_cards":[{"definition_en":"To have an unfavorable opinion of something.","example_en":"Her parents disapprove of her late-night outings."},{"definition_en":"To reject or express disapproval of an action.","example_en":"The board will disapprove the risky proposal."},{"definition_en":"To object to something based on principles.","example_en":"He chose to disapprove of the new policy."},{"definition_en":"To express a lack of support or agreement.","example_en":"She didn’t disapprove of his choice, but she had doubts."},{"definition_en":"To show displeasure toward a decision.","example_en":"The teacher would disapprove of cheating on tests."}]}
{"word":"dioxide","rank":4944,"freq":6244,"part_of_speech":"noun","back_cards":[{"definition_en":"A chemical compound with two oxygen atoms, often carbon dioxide.","example_en":"Plants absorb carbon dioxide during photosynthesis."},{"definition_en":"A gas produced by burning fossil fuels.","example_en":"The factory’s emissions increased dioxide levels."},{"definition_en":"A molecule used in scientific or industrial processes.","example_en":"Dioxide is a key component in some fire extinguishers."},{"definition_en":"A substance contributing to environmental changes.","example_en":"Carbon dioxide is linked to global warming."},{"definition_en":"A gas monitored for air quality control.","example_en":"High dioxide levels were detected in the city."}]}
{"word":"dilemma","rank":4945,"freq":6234,"part_of_speech":"noun","back_cards":[{"definition_en":"A situation requiring a difficult choice between options.","example_en":"She faced a dilemma about which job to accept."},{"definition_en":"A problem with no clear or easy solution.","example_en":"The budget cuts created a dilemma for the school."},{"definition_en":"A conflict between two undesirable choices.","example_en":"His dilemma was whether to stay or move abroad."},{"definition_en":"A challenging decision with competing priorities.","example_en":"The team’s dilemma was time versus quality."},{"definition_en":"A situation causing uncertainty or hesitation.","example_en":"Choosing a college was a major dilemma for her."}]}
{"word":"diesel","rank":4946,"freq":6224,"part_of_speech":"noun","back_cards":[{"definition_en":"A type of fuel used in certain engines.","example_en":"The truck runs on diesel instead of gasoline."},{"definition_en":"An engine powered by diesel fuel.","example_en":"The boat’s diesel was more efficient for long trips."},{"definition_en":"A vehicle that uses diesel as its fuel source.","example_en":"He drove a diesel to save on fuel costs."},{"definition_en":"A fuel known for its efficiency in heavy machinery.","example_en":"The generator was powered by diesel during the outage."},{"definition_en":"A type of oil-based fuel for transportation.","example_en":"Diesel is commonly used in large delivery trucks."}]}
{"word":"dictator","rank":4947,"freq":6214,"part_of_speech":"noun","back_cards":[{"definition_en":"A ruler with total control over a country.","example_en":"The dictator ruled the nation with an iron fist."},{"definition_en":"A leader who governs without democratic process.","example_en":"The dictator ignored the people’s demands for freedom."},{"definition_en":"A person exercising absolute authority.","example_en":"He acted like a dictator in the workplace."},{"definition_en":"A figure associated with oppressive leadership.","example_en":"The dictator’s policies sparked widespread protests."},{"definition_en":"A ruler who suppresses opposition.","example_en":"The dictator silenced critics to maintain power."}]}
{"word":"dice","rank":4948,"freq":6204,"part_of_speech":"noun","back_cards":[{"definition_en":"Small cubes used in games of chance.","example_en":"She rolled the dice and got a six."},{"definition_en":"Objects with numbered sides for gambling or play.","example_en":"The board game came with two colorful dice."},{"definition_en":"A tool used to make random selections in games.","example_en":"He shook the dice before his turn."},{"definition_en":"Items used in tabletop or role-playing games.","example_en":"The dice determined the outcome of the battle."},{"definition_en":"A symbol of luck or randomness in games.","example_en":"The dice were loaded, giving him an unfair advantage."}]}
{"word":"devotion","rank":4949,"freq":6194,"part_of_speech":"noun","back_cards":[{"definition_en":"Deep loyalty or dedication to a cause or person.","example_en":"Her devotion to her family was unwavering."},{"definition_en":"Strong commitment to a belief or religion.","example_en":"His devotion to his faith guided his decisions."},{"definition_en":"Intense love or affection for someone.","example_en":"The couple’s devotion to each other inspired others."},{"definition_en":"Dedication to a task or goal.","example_en":"Her devotion to her studies earned her top grades."},{"definition_en":"A passionate commitment to a purpose.","example_en":"His devotion to charity changed many lives."}]}
{"word":"devise","rank":4950,"freq":6184,"part_of_speech":"verb","back_cards":[{"definition_en":"To plan or invent something carefully.","example_en":"She devised a new method to organize the files."},{"definition_en":"To create a strategy or solution.","example_en":"The team devised a plan to increase sales."},{"definition_en":"To come up with an idea or design.","example_en":"He devised a tool to make the task easier."},{"definition_en":"To formulate a creative approach to a problem.","example_en":"They devised a campaign to raise awareness."},{"definition_en":"To conceive or develop through thought.","example_en":"She devised a recipe that became a hit."}]}
{"word":"deviation","rank":4951,"freq":6174,"part_of_speech":"noun","back_cards":[{"definition_en":"A departure from a standard or norm.","example_en":"The deviation from the plan caused confusion."},{"definition_en":"A divergence from an expected path or result.","example_en":"The experiment showed a slight deviation in results."},{"definition_en":"A variation from typical behavior or rules.","example_en":"His deviation from the rules led to a warning."},{"definition_en":"A shift away from a set course or route.","example_en":"The flight’s deviation was due to bad weather."},{"definition_en":"An act of straying from established standards.","example_en":"The deviation in quality disappointed the customers."}]}
{"word":"detrimental","rank":4952,"freq":6164,"part_of_speech":"adjective","back_cards":[{"definition_en":"Causing harm or negative effects.","example_en":"Smoking is detrimental to your health."},{"definition_en":"Having an adverse impact on something.","example_en":"The delay was detrimental to the project’s success."},{"definition_en":"Damaging to progress or well-being.","example_en":"Poor nutrition can be detrimental to growth."},{"definition_en":"Unfavorable or harmful to a situation.","example_en":"The new policy was detrimental to small businesses."},{"definition_en":"Leading to negative consequences.","example_en":"His careless attitude was detrimental to the team."}]}
{"word":"deterrent","rank":4953,"freq":6154,"part_of_speech":"noun","back_cards":[{"definition_en":"Something that discourages or prevents an action.","example_en":"The high fine served as a deterrent to speeding."},{"definition_en":"A measure to stop undesirable behavior.","example_en":"Security cameras act as a deterrent to theft."},{"definition_en":"A factor that reduces the likelihood of something.","example_en":"The cold weather was a deterrent to outdoor plans."},{"definition_en":"A system or tool to prevent harm or attack.","example_en":"The army’s presence was a deterrent to conflict."},{"definition_en":"An obstacle to risky or harmful actions.","example_en":"Harsh penalties are a deterrent to crime."}]}
{"word":"detention","rank":4954,"freq":6144,"part_of_speech":"noun","back_cards":[{"definition_en":"The act of holding someone in custody.","example_en":"The suspect was placed in detention overnight."},{"definition_en":"A punishment where students stay after school.","example_en":"He got detention for skipping class."},{"definition_en":"The act of delaying or restraining something.","example_en":"The detention of the shipment caused delays."},{"definition_en":"A temporary confinement for questioning.","example_en":"The police held him in detention for interrogation."},{"definition_en":"A disciplinary action for rule-breaking.","example_en":"Detention was assigned for tardiness to class."}]}
{"word":"desktop","rank":4955,"freq":6134,"part_of_speech":"noun","back_cards":[{"definition_en":"A computer designed for use at a desk.","example_en":"She upgraded her desktop for better performance."},{"definition_en":"The main screen of a computer’s interface.","example_en":"Her desktop was cluttered with files and icons."},{"definition_en":"A workspace or surface for office work.","example_en":"The desktop was covered with papers and books."},{"definition_en":"A personal computer for home or office use.","example_en":"He prefers a desktop over a laptop for gaming."},{"definition_en":"The digital environment for accessing programs.","example_en":"The desktop displayed a calming beach wallpaper."}]}
{"word":"deserving","rank":4956,"freq":6124,"part_of_speech":"adjective","back_cards":[{"definition_en":"Worthy of receiving something, like praise or reward.","example_en":"She was a deserving candidate for the scholarship."},{"definition_en":"Meriting recognition for effort or quality.","example_en":"His hard work made him deserving of the promotion."},{"definition_en":"Qualified for a benefit or honor.","example_en":"The team was deserving of the championship title."},{"definition_en":"Entitled to positive treatment or respect.","example_en":"The volunteers were deserving of the community’s thanks."},{"definition_en":"Having earned something through merit.","example_en":"Her talent made her deserving of the award."}]}
{"word":"descendant","rank":4957,"freq":6114,"part_of_speech":"noun","back_cards":[{"definition_en":"A person related to an ancestor.","example_en":"She is a descendant of a famous explorer."},{"definition_en":"Someone who comes from a family lineage.","example_en":"The descendants of the settlers still live in the town."},{"definition_en":"An heir or offspring of a particular group.","example_en":"He was a descendant of the royal family."},{"definition_en":"A person carrying forward a cultural heritage.","example_en":"The descendants preserved their ancestral traditions."},{"definition_en":"A later generation of a family or tribe.","example_en":"The descendants gathered to honor their history."}]}
{"word":"derivative","rank":4958,"freq":6104,"part_of_speech":"noun","back_cards":[{"definition_en":"Something derived from another source.","example_en":"The movie was a derivative of a classic novel."},{"definition_en":"A financial product based on another asset.","example_en":"The trader invested in a stock derivative."},{"definition_en":"A term or idea based on an original.","example_en":"The design was a derivative of an older model."},{"definition_en":"A substance created from another compound.","example_en":"The drug is a derivative of a natural plant."},{"definition_en":"An extension or variation of something else.","example_en":"Her artwork was a derivative of traditional styles."}]}
{"word":"deprive","rank":4959,"freq":6094,"part_of_speech":"verb","back_cards":[{"definition_en":"To take something away from someone.","example_en":"The storm could deprive them of electricity."},{"definition_en":"To deny someone access to something essential.","example_en":"Poverty can deprive children of education."},{"definition_en":"To withhold or remove a right or privilege.","example_en":"The new law might deprive citizens of free speech."},{"definition_en":"To prevent someone from having something needed.","example_en":"Lack of funds deprived the team of new equipment."},{"definition_en":"To strip someone of an opportunity or benefit.","example_en":"Injuries deprived her of a chance to compete."}]}
{"word":"dependable","rank":4960,"freq":6084,"part_of_speech":"adjective","back_cards":[{"definition_en":"Reliable and trustworthy in performance.","example_en":"Her dependable car never broke down on trips."},{"definition_en":"Consistently able to be counted on.","example_en":"He was a dependable worker who always met deadlines."},{"definition_en":"Steady and predictable in behavior.","example_en":"Her dependable nature made her a great friend."},{"definition_en":"Capable of being relied upon for support.","example_en":"The dependable team finished the project on time."},{"definition_en":"Trustworthy in quality or function.","example_en":"The dependable software rarely crashed."}]}
{"word":"demolition","rank":4961,"freq":6074,"part_of_speech":"noun","back_cards":[{"definition_en":"The act of tearing down or destroying a structure.","example_en":"The demolition of the old building began yesterday."},{"definition_en":"The process of dismantling something completely.","example_en":"The demolition crew cleared the site for new construction."},{"definition_en":"The destruction of an object or system.","example_en":"The demolition of the bridge was carefully planned."},{"definition_en":"A forceful end to something established.","example_en":"The demolition of the old policies sparked debate."},{"definition_en":"The act of breaking down for redevelopment.","example_en":"Demolition made way for a modern shopping center."}]}
{"word":"delightful","rank":4962,"freq":6064,"part_of_speech":"adjective","back_cards":[{"definition_en":"Causing joy or great pleasure.","example_en":"The garden was a delightful place to relax."},{"definition_en":"Very pleasing or enjoyable to experience.","example_en":"Her delightful smile brightened the room."},{"definition_en":"Charming or highly satisfying.","example_en":"The meal was a delightful mix of flavors."},{"definition_en":"Bringing happiness or contentment.","example_en":"The children’s laughter was delightful to hear."},{"definition_en":"Wonderfully pleasant or agreeable.","example_en":"The concert was a delightful evening for all."}]}
{"word":"deliberate","rank":4963,"freq":6054,"part_of_speech":"adjective","back_cards":[{"definition_en":"Done intentionally or with careful thought.","example_en":"His deliberate choice to stay silent surprised everyone."},{"definition_en":"Carefully planned or considered.","example_en":"The team made a deliberate effort to improve sales."},{"definition_en":"Slow and cautious in decision-making.","example_en":"Her deliberate pace ensured no mistakes were made."},{"definition_en":"Purposeful and not accidental.","example_en":"The artist’s deliberate strokes created a masterpiece."},{"definition_en":"Thoughtful and calculated in action.","example_en":"The lawyer’s deliberate questions exposed the truth."}]}
{"word":"defy","rank":4964,"freq":6044,"part_of_speech":"verb","back_cards":[{"definition_en":"To openly resist or challenge something.","example_en":"She chose to defy the rules and speak out."},{"definition_en":"To oppose or go against authority.","example_en":"The rebels tried to defy the government’s orders."},{"definition_en":"To refuse to obey or conform.","example_en":"He defied his parents by staying out late."},{"definition_en":"To challenge expectations or norms.","example_en":"Her success seemed to defy all odds."},{"definition_en":"To withstand or overcome a force.","example_en":"The structure was built to defy strong winds."}]}
{"word":"definite","rank":4965,"freq":6034,"part_of_speech":"adjective","back_cards":[{"definition_en":"Clearly stated or decided; certain.","example_en":"She gave a definite answer about attending the event."},{"definition_en":"Having fixed or exact limits.","example_en":"The project has a definite deadline of next month."},{"definition_en":"Unambiguous and precise in meaning.","example_en":"His instructions were definite and easy to follow."},{"definition_en":"Certain or assured in outcome.","example_en":"There’s no definite proof of his claims yet."},{"definition_en":"Clearly defined or determined.","example_en":"The map showed a definite path to the summit."}]}
{"word":"deficiency","rank":4966,"freq":6024,"part_of_speech":"noun","back_cards":[{"definition_en":"A lack or shortage of something essential.","example_en":"A vitamin deficiency caused her health issues."},{"definition_en":"An inadequacy or insufficiency in quality.","example_en":"The deficiency in training led to poor performance."},{"definition_en":"A shortfall in quantity or amount.","example_en":"The budget deficiency delayed the project."},{"definition_en":"A weakness or flaw in a system.","example_en":"The software had a deficiency in security features."},{"definition_en":"The absence of something needed.","example_en":"His deficiency in communication skills was noticeable."}]}
{"word":"deduction","rank":4967,"freq":6014,"part_of_speech":"noun","back_cards":[{"definition_en":"The act of subtracting or taking away.","example_en":"The deduction from his paycheck was for taxes."},{"definition_en":"A conclusion reached through reasoning.","example_en":"Her deduction about the case was correct."},{"definition_en":"A reduction in price or cost.","example_en":"The store offered a deduction for bulk purchases."},{"definition_en":"The process of logical inference.","example_en":"His deduction was based on careful observation."},{"definition_en":"An amount subtracted from a total.","example_en":"The deduction for expenses lowered her tax bill."}]}
{"word":"deduct","rank":4968,"freq":6004,"part_of_speech":"verb","back_cards":[{"definition_en":"To subtract or take away from a total.","example_en":"They deduct taxes from her monthly salary."},{"definition_en":"To remove an amount for a specific purpose.","example_en":"The store will deduct the discount at checkout."},{"definition_en":"To take away part of a sum.","example_en":"He had to deduct travel costs from his budget."},{"definition_en":"To reduce by removing a portion.","example_en":"The bank deducts a fee for overdrafts."},{"definition_en":"To calculate by subtracting expenses.","example_en":"She deducted her donations for tax purposes."}]}
{"word":"decree","rank":4969,"freq":5994,"part_of_speech":"noun","back_cards":[{"definition_en":"An official order with legal authority.","example_en":"The king issued a decree to lower taxes."},{"definition_en":"A formal decision or ruling.","example_en":"The court’s decree settled the land dispute."},{"definition_en":"A proclamation made by a leader.","example_en":"The decree banned plastic bags in the city."},{"definition_en":"A command enforced by authority.","example_en":"The president’s decree changed the policy overnight."},{"definition_en":"A formal statement of law or rule.","example_en":"The decree required all citizens to register."}]}
{"word":"decorate","rank":4970,"freq":5984,"part_of_speech":"verb","back_cards":[{"definition_en":"To add beauty or ornaments to something.","example_en":"They decorate the house for the holidays."},{"definition_en":"To furnish or adorn a space.","example_en":"She loves to decorate her room with posters."},{"definition_en":"To enhance with decorative elements.","example_en":"The chef would decorate the cake with flowers."},{"definition_en":"To improve the appearance of an object.","example_en":"He helped decorate the hall for the party."},{"definition_en":"To add details or embellishments.","example_en":"They decorate their garden with colorful lights."}]}
{"word":"debris","rank":4971,"freq":5974,"part_of_speech":"noun","back_cards":[{"definition_en":"Scattered pieces of waste or remains.","example_en":"The storm left debris all over the yard."},{"definition_en":"Fragments from a destroyed object.","example_en":"Crews cleared debris after the building collapsed."},{"definition_en":"Leftover material from construction or destruction.","example_en":"The site was full of debris from the demolition."},{"definition_en":"Natural waste like leaves or branches.","example_en":"The river carried debris downstream after the flood."},{"definition_en":"Broken or discarded items in an area.","example_en":"Volunteers cleaned up debris on the beach."}]}
{"word":"dazzle","rank":4972,"freq":5964,"part_of_speech":"verb","back_cards":[{"definition_en":"To impress or amaze with brilliance.","example_en":"Her performance would dazzle the audience."},{"definition_en":"To shine or sparkle brightly.","example_en":"The jewels dazzle in the sunlight."},{"definition_en":"To overwhelm with visual or sensory impact.","example_en":"The city lights dazzle visitors at night."},{"definition_en":"To astonish with skill or beauty.","example_en":"His artwork never fails to dazzle critics."},{"definition_en":"To captivate with stunning qualities.","example_en":"Her smile could dazzle anyone in the room."}]}
{"word":"dash","rank":4973,"freq":5954,"part_of_speech":"verb","back_cards":[{"definition_en":"To run or move quickly.","example_en":"She had to dash to catch the bus."},{"definition_en":"To add a small amount of something.","example_en":"He would dash some salt into the soup."},{"definition_en":"To rush or hurry in a frantic way.","example_en":"They dash through the store to finish shopping."},{"definition_en":"To strike or smash something suddenly.","example_en":"The waves dash against the rocky shore."},{"definition_en":"To move swiftly to avoid delay.","example_en":"He dashed to the meeting to avoid being late."}]}
{"word":"dairy","rank":4974,"freq":5944,"part_of_speech":"noun","back_cards":[{"definition_en":"Products made from milk, like cheese or yogurt.","example_en":"She avoids dairy because of a lactose allergy."},{"definition_en":"A place where milk products are processed.","example_en":"The dairy supplied fresh cream to the market."},{"definition_en":"Food items derived from animal milk.","example_en":"The recipe called for dairy like butter and milk."},{"definition_en":"A farm or facility for milk production.","example_en":"The dairy housed hundreds of cows."},{"definition_en":"A category of food in a diet.","example_en":"He included dairy in his daily meals for calcium."}]}
{"word":"curse","rank":4975,"freq":5934,"part_of_speech":"noun","back_cards":[{"definition_en":"A wish or spell for harm to befall someone.","example_en":"The old tale spoke of a curse on the village."},{"definition_en":"A vulgar or offensive word or phrase.","example_en":"He muttered a curse when he stubbed his toe."},{"definition_en":"A source of misfortune or trouble.","example_en":"The drought was seen as a curse by the farmers."},{"definition_en":"An invocation of bad luck or evil.","example_en":"The witch’s curse frightened the townspeople."},{"definition_en":"Something that causes ongoing problems.","example_en":"His bad temper was a curse to his career."}]}
{"word":"cunning","rank":4976,"freq":5924,"part_of_speech":"adjective","back_cards":[{"definition_en":"Clever in a deceptive or sly way.","example_en":"The cunning fox outsmarted the hunters."},{"definition_en":"Showing skill in achieving goals through trickery.","example_en":"Her cunning plan fooled everyone at the game."},{"definition_en":"Crafty or shrewd in behavior.","example_en":"He had a cunning way of avoiding tough questions."},{"definition_en":"Displaying cleverness in a subtle manner.","example_en":"The cunning strategy won them the competition."},{"definition_en":"Ingenious but often with hidden motives.","example_en":"His cunning smile hid his true intentions."}]}
{"word":"cultivate","rank":4977,"freq":5914,"part_of_speech":"verb","back_cards":[{"definition_en":"To grow or tend crops or plants.","example_en":"They cultivate vegetables in their backyard."},{"definition_en":"To develop or improve through effort.","example_en":"She worked to cultivate her artistic skills."},{"definition_en":"To foster or encourage growth in something.","example_en":"He tried to cultivate a sense of teamwork."},{"definition_en":"To nurture or build relationships.","example_en":"She cultivates friendships with kindness and care."},{"definition_en":"To promote or refine a quality or idea.","example_en":"The school aims to cultivate creativity in students."}]}
{"word":"culinary","rank":4978,"freq":5904,"part_of_speech":"adjective","back_cards":[{"definition_en":"Related to cooking or food preparation.","example_en":"Her culinary skills impressed the dinner guests."},{"definition_en":"Pertaining to the art or practice of cooking.","example_en":"The culinary school offered advanced classes."},{"definition_en":"Involving the creation of dishes or recipes.","example_en":"His culinary creations were featured in a magazine."},{"definition_en":"Describing food-related techniques or styles.","example_en":"The restaurant’s culinary style was Italian."},{"definition_en":"Associated with the kitchen or cuisine.","example_en":"The chef’s culinary expertise earned her fame."}]}
{"word":"cube","rank":4979,"freq":5894,"part_of_speech":"noun","back_cards":[{"definition_en":"A three-dimensional shape with six equal sides.","example_en":"The ice cube melted in her drink."},{"definition_en":"A small block used in food or games.","example_en":"She added a sugar cube to her coffee."},{"definition_en":"A geometric object used in math or design.","example_en":"The puzzle was shaped like a cube."},{"definition_en":"A piece of food cut into small blocks.","example_en":"He chopped the vegetables into tiny cubes."},{"definition_en":"A solid shape with equal square faces.","example_en":"The cube on the table was a decorative item."}]}
{"word":"crunch","rank":4980,"freq":5884,"part_of_speech":"verb","back_cards":[{"definition_en":"To chew or bite with a loud sound.","example_en":"She loves to crunch on crispy apples."},{"definition_en":"To make a sharp, crushing noise.","example_en":"The leaves crunch underfoot in the fall."},{"definition_en":"To process or handle data quickly.","example_en":"The computer can crunch numbers in seconds."},{"definition_en":"To crush or compress something loudly.","example_en":"The machine would crunch the cans for recycling."},{"definition_en":"To eat something that makes a snapping sound.","example_en":"He crunched the chips during the movie."}]}
{"word":"crude","rank":4981,"freq":5874,"part_of_speech":"adjective","back_cards":[{"definition_en":"Raw or unrefined, often referring to materials.","example_en":"Crude oil was extracted from the ground."},{"definition_en":"Lacking refinement or politeness.","example_en":"His crude manners offended the guests."},{"definition_en":"Simple or basic in design or form.","example_en":"The crude sketch outlined the project idea."},{"definition_en":"Not processed or in a natural state.","example_en":"The crude metal needed further processing."},{"definition_en":"Rough or lacking sophistication.","example_en":"Her crude joke made everyone uncomfortable."}]}
{"word":"crow","rank":4982,"freq":5864,"part_of_speech":"noun","back_cards":[{"definition_en":"A large black bird known for its cawing.","example_en":"The crow perched on the tree, watching us."},{"definition_en":"A bird associated with intelligence and adaptability.","example_en":"The crow solved the puzzle to get food."},{"definition_en":"A common bird found in many environments.","example_en":"A crow scavenged for scraps in the park."},{"definition_en":"A symbol of mystery in folklore or stories.","example_en":"The story featured a crow as an omen."},{"definition_en":"A bird known for its loud, distinctive call.","example_en":"The crow’s caw echoed through the forest."}]}
{"word":"crossing","rank":4983,"freq":5854,"part_of_speech":"noun","back_cards":[{"definition_en":"A place where paths or roads intersect.","example_en":"The pedestrian crossing was marked with stripes."},{"definition_en":"The act of moving across something.","example_en":"The crossing of the river was dangerous."},{"definition_en":"A point where people or vehicles pass over.","example_en":"The train stopped at the railway crossing."},{"definition_en":"A journey across a body of water.","example_en":"The ship’s crossing of the ocean took a week."},{"definition_en":"An intersection of routes or lines.","example_en":"The crossing of the trails confused the hikers."}]}
{"word":"creed","rank":4984,"freq":5844,"part_of_speech":"noun","back_cards":[{"definition_en":"A set of beliefs or principles.","example_en":"The group followed a creed of honesty and respect."},{"definition_en":"A formal statement of religious faith.","example_en":"The church recited its creed during the service."},{"definition_en":"A guiding philosophy or code.","example_en":"Her personal creed was to always help others."},{"definition_en":"A shared belief system for a group.","example_en":"The organization’s creed emphasized teamwork."},{"definition_en":"A declaration of core values or ideals.","example_en":"The school’s creed promoted academic excellence."}]}
{"word":"crank","rank":4985,"freq":5834,"part_of_speech":"noun","back_cards":[{"definition_en":"A handle or lever used to turn something.","example_en":"He turned the crank to start the old machine."},{"definition_en":"A device for winding or operating machinery.","example_en":"The crank on the well lifted the bucket."},{"definition_en":"A person with eccentric or odd behavior.","example_en":"The old man was called a crank for his strange ideas."},{"definition_en":"A part of a machine for manual operation.","example_en":"The crank helped power the antique car."},{"definition_en":"A slang term for someone irritable or quirky.","example_en":"His grumpy attitude earned him the nickname crank."}]}
{"word":"crane","rank":4986,"freq":5824,"part_of_speech":"noun","back_cards":[{"definition_en":"A machine for lifting heavy objects.","example_en":"The crane lifted steel beams to the top floor."},{"definition_en":"A large bird with a long neck and legs.","example_en":"The crane waded gracefully in the shallow water."},{"definition_en":"A device used in construction or shipping.","example_en":"The port used a crane to unload cargo."},{"definition_en":"A tall bird known for its migratory habits.","example_en":"A flock of cranes flew over the wetlands."},{"definition_en":"A mechanical arm for moving heavy items.","example_en":"The crane was essential for building the bridge."}]}
{"word":"craftsman","rank":4987,"freq":5814,"part_of_speech":"noun","back_cards":[{"definition_en":"A person skilled in a particular craft.","example_en":"The craftsman carved intricate designs into the wood."},{"definition_en":"A worker who creates high-quality handmade items.","example_en":"The craftsman built custom furniture for clients."},{"definition_en":"An artisan with expertise in their trade.","example_en":"The craftsman restored the antique clock perfectly."},{"definition_en":"A professional known for detailed workmanship.","example_en":"The craftsman’s pottery was sold at the market."},{"definition_en":"A skilled individual in a manual trade.","example_en":"The craftsman taught his apprentice the trade."}]}
{"word":"crackdown","rank":4988,"freq":5804,"part_of_speech":"noun","back_cards":[{"definition_en":"A strong action to enforce rules or laws.","example_en":"The police launched a crackdown on speeding."},{"definition_en":"A strict effort to stop illegal activity.","example_en":"The crackdown on smuggling reduced crime rates."},{"definition_en":"A forceful response to undesirable behavior.","example_en":"The school’s crackdown on bullying was effective."},{"definition_en":"A sudden enforcement of regulations.","example_en":"The city announced a crackdown on littering."},{"definition_en":"A campaign to suppress violations.","example_en":"The crackdown on tax evasion caught many offenders."}]}
{"word":"coyote","rank":4989,"freq":5794,"part_of_speech":"noun","back_cards":[{"definition_en":"A wild canine found in North America.","example_en":"The coyote howled in the desert at night."},{"definition_en":"An animal known for its adaptability.","example_en":"A coyote was spotted near the suburban park."},{"definition_en":"A symbol of cunning in folklore.","example_en":"The story featured a coyote as a trickster."},{"definition_en":"A small wolf-like animal living in packs.","example_en":"The coyote hunted small prey in the forest."},{"definition_en":"A creature associated with wilderness.","example_en":"The coyote’s cry echoed through the canyon."}]}
{"word":"coup","rank":4990,"freq":5784,"part_of_speech":"noun","back_cards":[{"definition_en":"A sudden seizure of power or control.","example_en":"The military coup overthrew the government."},{"definition_en":"A successful and impressive achievement.","example_en":"Hiring her was a coup for the company."},{"definition_en":"A bold move to gain authority.","example_en":"The coup changed the nation’s leadership overnight."},{"definition_en":"A surprising victory or accomplishment.","example_en":"Securing the deal was a major coup for the team."},{"definition_en":"An overthrow of an established system.","example_en":"The coup led to widespread political unrest."}]}
{"word":"countryside","rank":4991,"freq":5774,"part_of_speech":"noun","back_cards":[{"definition_en":"Rural areas outside of cities or towns.","example_en":"They spent the weekend hiking in the countryside."},{"definition_en":"A region with farms, fields, or forests.","example_en":"The countryside was peaceful and green."},{"definition_en":"An area known for natural beauty.","example_en":"The countryside attracted tourists with its views."},{"definition_en":"A rural landscape away from urban life.","example_en":"She dreamed of living in the countryside."},{"definition_en":"A place with open land and few buildings.","example_en":"The countryside offered a quiet escape from the city."}]}
{"word":"cosmic","rank":4992,"freq":5764,"part_of_speech":"adjective","back_cards":[{"definition_en":"Relating to the universe or outer space.","example_en":"The cosmic explosion was studied by astronomers."},{"definition_en":"Extremely large or vast in scope.","example_en":"The project had cosmic implications for science."},{"definition_en":"Pertaining to the cosmos or celestial events.","example_en":"Cosmic rays were detected by the satellite."},{"definition_en":"Involving the mysteries of the universe.","example_en":"Her art was inspired by cosmic themes."},{"definition_en":"Describing something on a grand, universal scale.","example_en":"The film explored cosmic questions about existence."}]}
{"word":"corrosion","rank":4993,"freq":5754,"part_of_speech":"noun","back_cards":[{"definition_en":"The process of rusting or wearing away.","example_en":"Corrosion damaged the old iron bridge."},{"definition_en":"The gradual destruction of materials by chemical reaction.","example_en":"The pipe’s corrosion caused a water leak."},{"definition_en":"A natural process affecting metals or surfaces.","example_en":"Corrosion was evident on the ship’s hull."},{"definition_en":"The deterioration due to environmental exposure.","example_en":"The statue’s corrosion was due to acid rain."},{"definition_en":"A breakdown of material integrity over time.","example_en":"Regular maintenance prevented corrosion in the machinery."}]}
{"word":"corrective","rank":4994,"freq":5744,"part_of_speech":"adjective","back_cards":[{"definition_en":"Intended to fix or improve something.","example_en":"The corrective action solved the software bug."},{"definition_en":"Designed to correct errors or problems.","example_en":"Corrective lenses improved her vision."},{"definition_en":"Aiming to remedy a fault or issue.","example_en":"The team took corrective steps to meet deadlines."},{"definition_en":"Serving to adjust or reform behavior.","example_en":"Corrective feedback helped him improve his work."},{"definition_en":"Meant to restore proper function or balance.","example_en":"The corrective measures stabilized the economy."}]}
{"word":"coordinate","rank":4995,"freq":5734,"part_of_speech":"verb","back_cards":[{"definition_en":"To organize or arrange for smooth operation.","example_en":"She will coordinate the event for the team."},{"definition_en":"To work together harmoniously.","example_en":"The departments need to coordinate their efforts."},{"definition_en":"To align actions or plans with others.","example_en":"They coordinate schedules to meet weekly."},{"definition_en":"To manage or direct multiple elements.","example_en":"He helped coordinate the charity fundraiser."},{"definition_en":"To bring parts into a unified whole.","example_en":"She coordinated the colors for the room’s decor."}]}
{"word":"convincing","rank":4996,"freq":5724,"part_of_speech":"adjective","back_cards":[{"definition_en":"Able to persuade or make believable.","example_en":"Her convincing argument won the debate."},{"definition_en":"Appearing credible or authentic.","example_en":"The actor gave a convincing performance as a villain."},{"definition_en":"Effective in gaining agreement or trust.","example_en":"His convincing speech inspired the audience."},{"definition_en":"Seeming realistic or plausible.","example_en":"The evidence was convincing enough to convict."},{"definition_en":"Compelling or persuasive in presentation.","example_en":"Her proposal was clear and convincing to the board."}]}
{"word":"convertible","rank":4997,"freq":5714,"part_of_speech":"adjective","back_cards":[{"definition_en":"Able to be changed into another form.","example_en":"The sofa was convertible into a bed."},{"definition_en":"Describing a car with a removable roof.","example_en":"He drove a convertible with the top down."},{"definition_en":"Capable of being transformed or adapted.","example_en":"The currency is convertible into dollars."},{"definition_en":"Flexible for multiple uses or functions.","example_en":"The convertible desk suited both work and study."},{"definition_en":"Able to switch between different modes.","example_en":"Her convertible jacket was perfect for all weather."}]}
{"word":"converse","rank":4998,"freq":5704,"part_of_speech":"verb","back_cards":[{"definition_en":"To talk or engage in conversation.","example_en":"They would converse about books for hours."},{"definition_en":"To discuss or exchange ideas verbally.","example_en":"She loves to converse with her colleagues at work."},{"definition_en":"To communicate through spoken words.","example_en":"He conversed with the locals to learn their culture."},{"definition_en":"To interact socially through dialogue.","example_en":"They converse daily over coffee in the café."},{"definition_en":"To share thoughts in a casual talk.","example_en":"She conversed with her friend about travel plans."}]}
{"word":"controller","rank":4999,"freq":5694,"part_of_speech":"noun","back_cards":[{"definition_en":"A device used to operate or control something.","example_en":"The game controller made playing easier."},{"definition_en":"A person who manages or directs operations.","example_en":"The controller oversaw the company’s finances."},{"definition_en":"A tool for regulating a system or machine.","example_en":"The thermostat acts as a temperature controller."},{"definition_en":"Someone responsible for coordinating tasks.","example_en":"The air traffic controller guided the planes safely."},{"definition_en":"A component in electronics for managing functions.","example_en":"The controller in the robot ensured smooth movement."}]}
{"word":"contraction","rank":5000,"freq":5684,"part_of_speech":"noun","back_cards":[{"definition_en":"A shortened form of a word or phrase.","example_en":"‘Can’t’ is a contraction of ‘cannot.’"},{"definition_en":"The tightening of muscles, especially during labor.","example_en":"Her contractions started early in the morning."},{"definition_en":"A reduction in size or amount.","example_en":"The contraction of the economy worried investors."},{"definition_en":"A process of shrinking or compressing.","example_en":"The contraction of the metal occurred when cooled."},{"definition_en":"A grammatical combination of words.","example_en":"The contraction ‘I’m’ is used in casual speech."}]}
{"word":"hierarchy","rank":4815,"freq":7534,"part_of_speech":"noun","back_cards":[{"definition_en":"A system of ranking or organizing people or things.","example_en":"The company’s hierarchy placed the CEO at the top."},{"definition_en":"A structure of authority within an organization.","example_en":"She climbed the corporate hierarchy through hard work."},{"definition_en":"A graded or ranked series of levels.","example_en":"The school’s hierarchy included teachers and administrators."},{"definition_en":"A classification system based on importance.","example_en":"The animal kingdom has a clear hierarchy of species."},{"definition_en":"A social order with distinct levels of status.","example_en":"The tribe’s hierarchy was led by the chief."}]}
