{"word":"order","rank":1441,"freq":66657,"part_of_speech":"noun","back_cards":[{"definition_en":"A command or instruction given by someone in authority.","example_en":"The general gave an order to advance the troops."},{"definition_en":"The arrangement or sequence of items or events.","example_en":"She organized the books in alphabetical order on the shelf."},{"definition_en":"A request for goods or services from a business.","example_en":"He placed an order for a new laptop online."},{"definition_en":"A state of organization or tidiness.","example_en":"The room was in perfect order before the guests arrived."},{"definition_en":"A social or political system.","example_en":"The new law aimed to maintain public order in the city."}]}
{"word":"share","rank":1442,"freq":66642,"part_of_speech":"verb","back_cards":[{"definition_en":"To divide and distribute something among others.","example_en":"She decided to share her lunch with her friend."},{"definition_en":"To have or use something jointly with others.","example_en":"The roommates share a small apartment in the city."},{"definition_en":"To express or communicate thoughts or feelings.","example_en":"He shared his excitement about the new project at work."},{"definition_en":"To give a portion of something, like stock or profits.","example_en":"The company will share its annual profits with employees."},{"definition_en":"To participate in a shared activity or experience.","example_en":"They share a love for hiking in the mountains."}]}
{"word":"newspaper","rank":1443,"freq":66598,"part_of_speech":"noun","back_cards":[{"definition_en":"A printed publication with news and articles.","example_en":"She reads the newspaper every morning with her coffee."},{"definition_en":"A source of current events and information.","example_en":"The newspaper reported on the recent election results."},{"definition_en":"A medium for advertisements and local updates.","example_en":"The local newspaper listed community events for the weekend."},{"definition_en":"A collection of editorials and opinions.","example_en":"His article was published in the newspaper’s opinion section."},{"definition_en":"A physical object used in daily routines.","example_en":"He used an old newspaper to clean the windows."}]}
{"word":"foundation","rank":1444,"freq":66578,"part_of_speech":"noun","back_cards":[{"definition_en":"The base on which a building is constructed.","example_en":"The workers poured concrete for the house’s foundation."},{"definition_en":"An organization created for a specific purpose, often charitable.","example_en":"The foundation donated funds to support education."},{"definition_en":"The underlying basis or principle of something.","example_en":"Trust is the foundation of a strong relationship."},{"definition_en":"A starting point or groundwork for an idea.","example_en":"Her research laid the foundation for new discoveries."},{"definition_en":"A cosmetic product used as a base for makeup.","example_en":"She applied foundation to even out her skin tone."}]}
{"word":"variety","rank":1445,"freq":66555,"part_of_speech":"noun","back_cards":[{"definition_en":"A range of different things or types.","example_en":"The store offers a variety of fruits and vegetables."},{"definition_en":"Diversity in characteristics or qualities.","example_en":"The festival celebrated the variety of cultures in the city."},{"definition_en":"A specific type or kind within a group.","example_en":"This variety of rose blooms in bright red."},{"definition_en":"A collection of assorted items or experiences.","example_en":"Her job involves a variety of tasks every day."},{"definition_en":"A form of entertainment with diverse acts.","example_en":"The variety show featured singers, dancers, and comedians."}]}
{"word":"perspective","rank":1446,"freq":66540,"part_of_speech":"noun","back_cards":[{"definition_en":"A point of view or way of thinking.","example_en":"Her perspective on the issue changed after the discussion."},{"definition_en":"A way of understanding or interpreting something.","example_en":"The book offers a fresh perspective on history."},{"definition_en":"A technique in art to represent depth and distance.","example_en":"The painting used perspective to create a 3D effect."},{"definition_en":"An attitude toward a situation or problem.","example_en":"He maintained a positive perspective despite challenges."},{"definition_en":"A sense of proportion or relative importance.","example_en":"Traveling abroad gave her perspective on her own life."}]}
{"word":"document","rank":1447,"freq":66467,"part_of_speech":"noun","back_cards":[{"definition_en":"A written or printed record containing information.","example_en":"She signed the document to finalize the agreement."},{"definition_en":"An official paper used for legal or formal purposes.","example_en":"He needed a passport as a document for travel."},{"definition_en":"A digital file containing text or data.","example_en":"The document was saved on her computer for review."},{"definition_en":"A source of evidence or proof.","example_en":"The letter served as a document of their friendship."},{"definition_en":"A piece of work, like a report or essay.","example_en":"She spent hours editing the document for her boss."}]}
{"word":"presence","rank":1448,"freq":66412,"part_of_speech":"noun","back_cards":[{"definition_en":"The state of being in a particular place.","example_en":"Her presence at the meeting made everyone feel confident."},{"definition_en":"A sense of someone or something being nearby.","example_en":"He felt a strange presence in the old house."},{"definition_en":"The impression or influence someone has.","example_en":"The speaker had a commanding presence on stage."},{"definition_en":"The act of attending or being involved.","example_en":"The company expanded its presence in the global market."},{"definition_en":"A quality of charisma or aura.","example_en":"Her calm presence soothed the nervous team."}]}
{"word":"stare","rank":1449,"freq":66392,"part_of_speech":"verb","back_cards":[{"definition_en":"To look at something or someone intensely.","example_en":"She stared at the stars in the night sky."},{"definition_en":"To gaze with surprise or disbelief.","example_en":"He stared at the unexpected gift in amazement."},{"definition_en":"To focus attention with a fixed look.","example_en":"The cat stared at the bird outside the window."},{"definition_en":"To look in a way that makes someone uncomfortable.","example_en":"He felt uneasy when strangers stared at him."},{"definition_en":"To observe closely in a thoughtful manner.","example_en":"She stared at the painting, admiring its details."}]}
{"word":"lesson","rank":1450,"freq":66252,"part_of_speech":"noun","back_cards":[{"definition_en":"A period of instruction or learning.","example_en":"The math lesson helped her understand fractions better."},{"definition_en":"A piece of knowledge gained from experience.","example_en":"Failing the test taught him a valuable lesson."},{"definition_en":"A part of a course or training session.","example_en":"Today’s lesson focused on conversational English."},{"definition_en":"An example or moral teaching.","example_en":"The story of the ant and grasshopper offers a lesson."},{"definition_en":"A section of a book or study material.","example_en":"She completed the final lesson in her textbook."}]}
{"word":"limit","rank":1451,"freq":66220,"part_of_speech":"noun","back_cards":[{"definition_en":"A boundary or restriction on something.","example_en":"The speed limit on this road is 40 miles per hour."},{"definition_en":"The maximum amount allowed or possible.","example_en":"There’s a limit of two bags per passenger."},{"definition_en":"A point beyond which something cannot go.","example_en":"Her patience reached its limit after hours of waiting."},{"definition_en":"A constraint in a specific context, like time.","example_en":"The project had a strict time limit of one month."},{"definition_en":"A cap on resources or opportunities.","example_en":"The budget limit forced them to cut expenses."}]}
{"word":"appreciate","rank":1452,"freq":66216,"part_of_speech":"verb","back_cards":[{"definition_en":"To be grateful or thankful for something.","example_en":"She appreciated the help during her move."},{"definition_en":"To recognize the value or quality of something.","example_en":"He appreciates fine art and visits galleries often."},{"definition_en":"To understand or be aware of a situation.","example_en":"I appreciate how difficult this task must be for you."},{"definition_en":"To increase in value over time.","example_en":"The house’s value appreciated significantly in five years."},{"definition_en":"To enjoy or take pleasure in something.","example_en":"They appreciated the beautiful sunset at the beach."}]}
{"word":"complete","rank":1453,"freq":66198,"part_of_speech":"verb","back_cards":[{"definition_en":"To finish or bring something to an end.","example_en":"She completed the puzzle in just one hour."},{"definition_en":"To make something whole or perfect.","example_en":"He completed the collection by buying the rare coin."},{"definition_en":"To fulfill or accomplish a task.","example_en":"They completed the project before the deadline."},{"definition_en":"To fill out or finalize, as with forms.","example_en":"Please complete the application form by tomorrow."},{"definition_en":"To achieve a state of being finished.","example_en":"The team completed the marathon together."}]}
{"word":"observe","rank":1454,"freq":66197,"part_of_speech":"verb","back_cards":[{"definition_en":"To watch carefully or notice something.","example_en":"She observed the birds nesting in the tree."},{"definition_en":"To follow or obey a rule or custom.","example_en":"They observe the tradition of giving thanks before meals."},{"definition_en":"To make a remark or comment.","example_en":"He observed that the weather was unusually warm."},{"definition_en":"To study or monitor closely.","example_en":"Scientists observed the behavior of the animals in the wild."},{"definition_en":"To celebrate or acknowledge an event.","example_en":"The community observes Earth Day with clean-up events."}]}
{"word":"currently","rank":1455,"freq":66051,"part_of_speech":"adverb","back_cards":[{"definition_en":"At the present time or moment.","example_en":"She is currently working on a new book."},{"definition_en":"In the immediate or ongoing situation.","example_en":"The store is currently closed for renovations."},{"definition_en":"As things stand now.","example_en":"He is currently the team’s top scorer."},{"definition_en":"At this point in time.","example_en":"They are currently living in a small apartment."},{"definition_en":"In the context of the present.","example_en":"The project is currently on hold due to funding."}]}
{"word":"hundred","rank":1456,"freq":66002,"part_of_speech":"noun","back_cards":[{"definition_en":"The number equal to ten times ten.","example_en":"She counted a hundred stars in the night sky."},{"definition_en":"A large, approximate number of things.","example_en":"Hundreds of people attended the concert."},{"definition_en":"A unit in counting or measurement.","example_en":"The race was a hundred meters long."},{"definition_en":"A term for a group of one hundred items.","example_en":"He bought a hundred apples for the event."},{"definition_en":"A historical term for a division of land.","example_en":"The old county was divided into several hundreds."}]}
{"word":"fun","rank":1457,"freq":65982,"part_of_speech":"noun","back_cards":[{"definition_en":"Enjoyment or pleasure from an activity.","example_en":"The picnic was full of fun for the kids."},{"definition_en":"A source of amusement or entertainment.","example_en":"Playing board games is her idea of fun."},{"definition_en":"A lighthearted or playful experience.","example_en":"They had fun exploring the new park."},{"definition_en":"A feeling of joy in social settings.","example_en":"The party was so much fun last night."},{"definition_en":"An activity done for enjoyment.","example_en":"Hiking in the forest is always fun for them."}]}
{"word":"crowd","rank":1458,"freq":65965,"part_of_speech":"noun","back_cards":[{"definition_en":"A large group of people gathered together.","example_en":"A crowd gathered to watch the street performer."},{"definition_en":"A mass of people in a public place.","example_en":"The crowd cheered loudly at the football game."},{"definition_en":"A specific group or social circle.","example_en":"She hangs out with the art crowd at school."},{"definition_en":"A dense collection of objects or things.","example_en":"A crowd of trees filled the forest."},{"definition_en":"A large number of participants in an event.","example_en":"The concert drew a huge crowd last night."}]}
{"word":"attack","rank":1459,"freq":65959,"part_of_speech":"noun","back_cards":[{"definition_en":"A violent act intended to harm.","example_en":"The sudden attack surprised the small village."},{"definition_en":"A strong verbal or critical assault.","example_en":"Her speech was an attack on unfair policies."},{"definition_en":"A sudden onset of illness or symptoms.","example_en":"He suffered a heart attack last week."},{"definition_en":"An aggressive move in sports or games.","example_en":"The team planned a strong attack in the second half."},{"definition_en":"An attempt to damage or destroy something.","example_en":"The virus was an attack on the computer system."}]}
{"word":"apartment","rank":1460,"freq":65884,"part_of_speech":"noun","back_cards":[{"definition_en":"A set of rooms for living in, typically rented.","example_en":"She moved into a cozy apartment downtown."},{"definition_en":"A residential unit within a larger building.","example_en":"Their apartment is on the fifth floor."},{"definition_en":"A private space for personal living.","example_en":"He decorated his apartment with modern furniture."},{"definition_en":"A temporary home during travel or relocation.","example_en":"They stayed in an apartment during their vacation."},{"definition_en":"A place associated with urban lifestyle.","example_en":"Living in an apartment suits her busy schedule."}]}
