{"word":"assess","rank":1901,"freq":40352,"back_cards":[{"definition_en":"To evaluate or judge the value or quality of something.","example_en":"We need to assess the damage to the car before filing an insurance claim."},{"definition_en":"To determine the importance or impact of a situation.","example_en":"The team met to assess how the new policy might affect our workflow."},{"definition_en":"To estimate or calculate an amount, like taxes or costs.","example_en":"The city will assess property values to set next year’s taxes."},{"definition_en":"To analyze someone’s skills or performance.","example_en":"The coach will assess each player’s strengths during practice."},{"definition_en":"To review or size up a challenge or task.","example_en":"She paused to assess the steep trail before starting the hike."}]}
{"word":"solid","rank":1902,"freq":40301,"back_cards":[{"definition_en":"Firm or strong, not easily broken or changed.","example_en":"The table is made of solid oak and will last for years."},{"definition_en":"Reliable or dependable, often describing a person or plan.","example_en":"He’s a solid worker who always gets the job done on time."},{"definition_en":"Uninterrupted or continuous, without gaps.","example_en":"We worked for three solid hours to finish the project."},{"definition_en":"Substantial or satisfying, like food or results.","example_en":"That was a solid meal; I’m not hungry anymore."},{"definition_en":"Consistent or unified, as in agreement or support.","example_en":"The team showed solid support for the new strategy."}]}
{"word":"branch","rank":1903,"freq":40300,"back_cards":[{"definition_en":"A part of a tree that grows out from the trunk.","example_en":"The bird perched on a branch high above the garden."},{"definition_en":"A local office or division of a larger organization.","example_en":"I need to visit the bank’s downtown branch to open an account."},{"definition_en":"A section or category of something, like knowledge.","example_en":"Her favorite branch of science is marine biology."},{"definition_en":"A smaller stream or river flowing into a larger one.","example_en":"The branch of the river near our house is great for fishing."},{"definition_en":"A line of family descent or extension.","example_en":"That branch of the family moved to California years ago."}]}
{"word":"mad","rank":1904,"freq":40286,"back_cards":[{"definition_en":"Very angry or upset.","example_en":"She was mad when she found out her phone was broken."},{"definition_en":"Crazy or wild, often in an exciting way.","example_en":"The party last night was mad fun with all the dancing."},{"definition_en":"Irrational or foolish, as in behavior or ideas.","example_en":"It’s mad to go hiking in this storm without gear."},{"definition_en":"Extremely enthusiastic or obsessed with something.","example_en":"He’s mad about vintage cars and owns three of them."},{"definition_en":"Intense or extreme, often used for emphasis.","example_en":"The new restaurant has mad good burgers you’ve got to try."}]}
{"word":"somewhat","rank":1905,"freq":40283,"back_cards":[{"definition_en":"To a moderate degree or extent.","example “‘How’s the project going?’ ‘It’s somewhat challenging, but we’re managing.’"},{"definition_en":"Slightly or partly, not fully.","example_en":"I’m somewhat tired after the long meeting this morning."},{"definition_en":"Used to soften or qualify a statement.","example_en":"The movie was somewhat predictable, but still enjoyable."},{"definition_en":"To a certain level, often vague or unclear.","example_en":"His explanation was somewhat confusing, so I asked for clarification."},{"definition_en":"Moderately, in terms of progress or change.","example_en":"The weather’s improved somewhat, but it’s still chilly outside."}]}
{"word":"gentleman","rank":1906,"freq":40277,"back_cards":[{"definition_en":"A polite or courteous man.","example_en":"He’s a true gentleman, always holding the door for others."},{"definition_en":"A man of good social standing or manners.","example_en":"The gentleman in the suit greeted everyone at the gala."},{"definition_en":"A respectful way to refer to a man in formal settings.","example_en":"May I speak with the gentleman who called earlier?"},{"definition_en":"A man who behaves honorably or kindly.","example_en":"He was a gentleman and offered to help with my bags."},{"definition_en":"Used to address men collectively in a polite way.","example_en":"Ladies and gentlemen, please take your seats for the show."}]}
{"word":"opposition","rank":1907,"freq":40268,"back_cards":[{"definition_en":"Disagreement or resistance to a plan or idea.","example_en":"The new policy faced strong opposition from the community."},{"definition_en":"The group or party against a ruling authority.","example_en":"The opposition party proposed a different budget plan."},{"definition_en":"A contrast or difference between two things.","example_en":"Her calm demeanor was in opposition to his fiery speech."},{"definition_en":"An act of opposing or challenging something.","example_en":"There was no opposition to the team’s decision to move forward."},{"definition_en":"A competing team or rival in a contest.","example_en":"Our soccer team easily beat the opposition last night."}]}
{"word":"suspect","rank":1908,"freq":40173,"back_cards":[{"definition_en":"To believe someone may be guilty of something.","example_en":"The police suspect he was involved in the robbery."},{"definition_en":"To doubt or question the truth of something.","example_en":"I suspect her story about being late isn’t entirely true."},{"definition_en":"To think something is likely without proof.","example_en":"I suspect it’ll rain this afternoon based on those clouds."},{"definition_en":"A person thought to have committed a crime.","example_en":"The suspect was seen leaving the scene in a red car."},{"definition_en":"To have a hunch or feeling about something.","example_en":"She suspected he was planning a surprise for her birthday."}]}
{"word":"aside","rank":1909,"freq":40119,"back_cards":[{"definition_en":"To the side or out of the way.","example_en":"He stepped aside to let the kids run past."},{"definition_en":"A comment spoken quietly, not meant for all to hear.","example_en":"She whispered an aside to her friend during the meeting."},{"definition_en":"Temporarily setting something apart or ignoring it.","example_en":"Let’s put our differences aside and finish this project."},{"definition_en":"In reserve or saved for later use.","example_en":"I set some money aside for a weekend getaway."},{"definition_en":"Away from the main focus or topic.","example_en":"Joking aside, we need to focus on the deadline."}]}
{"word":"athlete","rank":1910,"freq":40094,"back_cards":[{"definition_en":"A person who competes in sports or physical activities.","example_en":"She’s an athlete who trains daily for the marathon."},{"definition_en":"Someone skilled in physical strength or agility.","example_en":"The gymnast showed why she’s a top athlete."},{"definition_en":"A participant in competitive team sports.","example_en":"Our school’s athletes won the state championship."},{"definition_en":"A person dedicated to fitness and performance.","example_en":"He’s an athlete who tracks every workout carefully."},{"definition_en":"Someone admired for physical prowess in a sport.","example_en":"The young athlete inspired fans with her determination."}]}
{"word":"opening","rank":1911,"freq":40053,"back_cards":[{"definition_en":"The act of starting or beginning something.","example_en":"The opening of the new store drew a huge crowd."},{"definition_en":"A gap or hole that allows entry or passage.","example_en":"We crawled through the opening in the fence."},{"definition_en":"The first part of an event or performance.","example_en":"The movie’s opening scene was absolutely thrilling."},{"definition_en":"A job or opportunity available to apply for.","example_en":"There’s an opening for a manager at the coffee shop."},{"definition_en":"A chance to start or introduce something new.","example_en":"Her speech was a great opening for the conference."}]}
{"word":"prayer","rank":1912,"freq":40037,"back_cards":[{"definition_en":"A request or expression of thanks to a deity.","example_en":"She said a prayer for her family’s safety."},{"definition_en":"A formal act of worship or spiritual communication.","example_en":"The congregation joined in prayer during the service."},{"definition_en":"A sincere hope or wish for something.","example_en":"My prayer is that everyone finds peace this year."},{"definition_en":"A set text recited in religious ceremonies.","example_en":"He memorized the prayer for the evening ritual."},{"definition_en":"An earnest plea or entreaty for help.","example_en":"Her prayer for strength got her through tough times."}]}
{"word":"frequently","rank":1913,"freq":40035,"back_cards":[{"definition_en":"Happening often or regularly.","example_en":"I frequently visit the park to jog in the mornings."},{"definition_en":"Occurring at short intervals or repeatedly.","example_en":"She checks her phone frequently during meetings."},{"definition_en":"Commonly or usually, in many instances.","example_en":"This café is frequently packed on weekends."},{"definition_en":"Habitually or as a common practice.","example_en":"He frequently forgets to lock the back door."},{"definition_en":"Done often in a specific context or routine.","example_en":"They frequently travel for work, almost every month."}]}
{"word":"employ","rank":1914,"freq":40014,"back_cards":[{"definition_en":"To hire or use someone for a job.","example_en":"The company plans to employ ten new workers."},{"definition_en":"To use something for a specific purpose.","example_en":"She employed a new strategy to boost sales."},{"definition_en":"To engage or occupy someone’s time or effort.","example_en":"The project employed all our resources for weeks."},{"definition_en":"To put into service or apply effectively.","example_en":"He employed his charm to win over the client."},{"definition_en":"To provide work or a role for someone.","example_en":"The school employs teachers with diverse backgrounds."}]}
{"word":"basketball","rank":1915,"freq":40007,"back_cards":[{"definition_en":"A sport played with a ball and hoops.","example_en":"We played basketball in the driveway until dark."},{"definition_en":"The ball used in the sport of basketball.","example_en":"He forgot his basketball at the gym yesterday."},{"definition_en":"A game between two teams on a court.","example_en":"The basketball match went into overtime last night."},{"definition_en":"A popular activity in schools or communities.","example_en":"Our school’s basketball team is practicing hard."},{"definition_en":"A cultural event or competition involving the sport.","example_en":"The community hosts a basketball tournament every summer."}]}
{"word":"existing","rank":1916,"freq":39974,"back_cards":[{"definition_en":"Currently in place or already present.","example_en":"We need to work with the existing budget for now."},{"definition_en":"In operation or currently functioning.","example_en":"The existing rules don’t allow pets in the building."},{"definition_en":"Already established or available.","example_en":"She upgraded the existing software on her laptop."},{"definition_en":"Continuing to exist or remain in use.","example_en":"The existing bridge needs repairs to stay safe."},{"definition_en":"Presently occurring or in effect.","example_en":"Our existing plan should cover the project’s needs."}]}
{"word":"revolution","rank":1917,"freq":39959,"back_cards":[{"definition_en":"A major change in government or social order.","example_en":"The revolution led to a new democratic system."},{"definition_en":"A dramatic shift in ideas or technology.","example_en":"The smartphone sparked a revolution in communication."},{"definition_en":"A complete cycle or turn, like in mechanics.","example_en":"The wheel makes one revolution every second."},{"definition_en":"A radical transformation in a field or practice.","example_en":"Her work started a revolution in modern art."},{"definition_en":"A movement to overthrow an established system.","example_en":"The people united for a revolution against unfair laws."}]}
{"word":"click","rank":1918,"freq":39951,"back_cards":[{"definition_en":"To press a button on a mouse or device.","example_en":"Just click the link to open the website."},{"definition_en":"A short, sharp sound made by something.","example_en":"The door lock made a loud click when it shut."},{"definition_en":"To connect or understand something suddenly.","example_en":"It finally clicked how to solve the puzzle."},{"definition_en":"To get along well or instantly bond.","example_en":"We met at the party and just clicked right away."},{"definition_en":"To select or activate something digitally.","example_en":"Click ‘save’ to keep your changes to the file."}]}
{"word":"emotion","rank":1919,"freq":39949,"back_cards":[{"definition_en":"A strong feeling like happiness or anger.","example_en":"Her voice trembled with emotion during the speech."},{"definition_en":"A reaction to a personal or intense experience.","example_en":"He couldn’t hide his emotion when he saw his family."},{"definition_en":"A state of mind influenced by feelings.","example_en":"The movie stirred deep emotions in the audience."},{"definition_en":"A way to express inner thoughts or reactions.","example_en":"She channeled her emotion into writing poetry."},{"definition_en":"A powerful response to a situation or event.","example_en":"His apology was full of genuine emotion."}]}
{"word":"platform","rank":1920,"freq":39915,"back_cards":[{"definition_en":"A raised surface for standing or performing.","example_en":"The speaker stood on the platform to address the crowd."},{"definition_en":"A digital system or software for specific uses.","example_en":"This platform lets you stream movies and shows."},{"definition_en":"A set of beliefs or policies, especially political.","example_en":"Her campaign platform focused on education reform."},{"definition_en":"A structure for boarding trains or buses.","example_en":"The train leaves from platform three in ten minutes."},{"definition_en":"A foundation for building or launching something.","example_en":"The app provides a platform for local artists."}]}
{"word":"frame","rank":1921,"freq":39817,"back_cards":[{"definition_en":"A structure that holds or supports something.","example_en":"The picture frame hangs above the fireplace."},{"definition_en":"To construct or build something.","example_en":"They plan to frame the new house next week."},{"definition_en":"The structure of a person’s body or build.","example_en":"He has a tall, lean frame from years of running."},{"definition_en":"To falsely make someone seem guilty.","example_en":"The evidence was planted to frame an innocent man."},{"definition_en":"A single image in a sequence, like in film.","example_en":"The movie’s opening frame was a stunning sunset."}]}
{"word":"appeal","rank":1922,"freq":39798,"back_cards":[{"definition_en":"To make a strong request or plea.","example_en":"She made an appeal for donations to help the shelter."},{"definition_en":"To challenge a legal decision in court.","example_en":"The lawyer filed an appeal to overturn the verdict."},{"definition_en":"The power to attract or interest someone.","example_en":"The beach town has a lot of appeal for tourists."},{"definition_en":"To seem attractive or desirable.","example_en":"The idea of a quiet weekend appeals to me."},{"definition_en":"A formal call for help or support.","example_en":"The charity’s appeal raised thousands for the cause."}]}
{"word":"quote","rank":1923,"freq":39780,"back_cards":[{"definition_en":"To repeat someone’s exact words.","example_en":"She quoted her favorite poet during the speech."},{"definition_en":"A specific saying or phrase from someone.","example_en":"That quote from the movie always makes me laugh."},{"definition_en":"To provide an estimated cost for a service.","example_en":"The mechanic gave me a quote for the car repair."},{"definition_en":"To cite or reference something as evidence.","example_en":"He quoted a study to support his argument."},{"definition_en":"A memorable line often used for inspiration.","example_en":"The coach shared a quote to motivate the team."}]}
{"word":"brand","rank":1924,"freq":39754,"back_cards":[{"definition_en":"A specific type or make of a product.","example_en":"I prefer this brand of coffee over others."},{"definition_en":"A company’s logo or identity.","example_en":"The brand’s new logo is bold and colorful."},{"definition_en":"To mark something as a way to identify it.","example_en":"The ranch brands its cattle with a unique symbol."},{"definition_en":"A reputation or image associated with something.","example_en":"Her personal brand is all about positivity."},{"definition_en":"To label or promote a product distinctly.","example_en":"They brand their snacks as healthy and organic."}]}
{"word":"enable","rank":1925,"freq":39743,"back_cards":[{"definition_en":"To make something possible or allow it to happen.","example_en":"The new software will enable faster data processing."},{"definition_en":"To give someone the ability or means to do something.","example_en":"This grant will enable her to finish her degree."},{"definition_en":"To activate or turn on a feature or system.","example_en":"You need to enable notifications to get updates."},{"definition_en":"To support or facilitate an action or process.","example_en":"The app enables users to track their workouts."},{"definition_en":"To empower or provide opportunities for someone.","example_en":"The training program enables employees to grow."}]}
{"word":"legislation","rank":1926,"freq":39690,"back_cards":[{"definition_en":"Laws made by a government or authority.","example_en":"The new legislation aims to protect the environment."},{"definition_en":"The process of creating or passing laws.","example_en":"Congress is debating legislation on healthcare reform."},{"definition_en":"A set of rules or regulations enacted.","example_en":"The legislation requires businesses to reduce emissions."},{"definition_en":"Proposed laws under consideration.","example_en":"The senator introduced legislation to improve schools."},{"definition_en":"Legal measures addressing specific issues.","example_en":"This legislation will change how taxes are collected."}]}
{"word":"addition","rank":1927,"freq":39685,"back_cards":[{"definition_en":"The act of adding something to another.","example_en":"The addition of spices made the dish taste better."},{"definition_en":"Something added to improve or expand.","example_en":"The new wing is an addition to the hospital."},{"definition_en":"The mathematical process of combining numbers.","example_en":"She taught the kids addition using colorful blocks."},{"definition_en":"An extra feature or enhancement.","example_en":"The car’s sunroof is a nice addition to the model."},{"definition_en":"Including something as part of a whole.","example_en":"His skills are a great addition to the team."}]}
{"word":"lab","rank":1928,"freq":39668,"back_cards":[{"definition_en":"A place for scientific experiments or research.","example_en":"She works in a lab studying plant genetics."},{"definition_en":"A room for conducting tests or analysis.","example_en":"The doctor sent my sample to the lab for testing."},{"definition_en":"Short for laboratory, often used in schools.","example_en":"We’re doing a chemistry experiment in the lab today."},{"definition_en":"A space for developing new technology or products.","example_en":"The tech company’s lab created a new app."},{"definition_en":"A workplace for hands-on learning or practice.","example_en":"The computer lab is open for students all day."}]}
{"word":"oppose","rank":1929,"freq":39656,"back_cards":[{"definition_en":"To disagree with or resist something.","example_en":"Many residents oppose the new highway plan."},{"definition_en":"To actively work against a proposal or idea.","example_en":"She decided to oppose the policy at the meeting."},{"definition_en":"To stand in the way or act as an obstacle.","example_en":"No one dared to oppose his leadership."},{"definition_en":"To contrast or be different from something.","example_en":"His views oppose mine on this issue completely."},{"definition_en":"To challenge or compete against someone.","example_en":"The team will oppose their rivals in the finals."}]}
{"word":"row","rank":1930,"freq":39635,"back_cards":[{"definition_en":"A line of things or people arranged side by side.","example_en":"The chairs were set up in a neat row."},{"definition_en":"To propel a boat using oars.","example_en":"We decided to row across the lake this morning."},{"definition_en":"A noisy argument or disagreement.","example_en":"They had a big row over who should clean up."},{"definition_en":"A sequence or series of items.","example_en":"She planted a row of flowers along the fence."},{"definition_en":"A trip or journey in a rowboat.","example_en":"The row to the island was peaceful and scenic."}]}
{"word":"immigration","rank":1931,"freq":39570,"back_cards":[{"definition_en":"The act of moving to a new country to live.","example_en":"Her family’s immigration to the U.S. was challenging."},{"definition_en":"The process of entering a country legally.","example_en":"Immigration laws require a valid visa for entry."},{"definition_en":"The movement of people across borders.","example_en":"Immigration has shaped the city’s diverse culture."},{"definition_en":"The system handling newcomers to a country.","example_en":"The immigration office was busy processing applications."},{"definition_en":"The experience of settling in a new nation.","example_en":"His immigration story inspired many at the event."}]}
{"word":"asset","rank":1932,"freq":39563,"back_cards":[{"definition_en":"Something valuable or useful owned by someone.","example_en":"Her quick thinking is an asset to the team."},{"definition_en":"A piece of property or equipment.","example_en":"The company sold some assets to raise funds."},{"definition_en":"A financial resource, like money or stocks.","example_en":"Real estate is a major asset in his portfolio."},{"definition_en":"A person’s skills or qualities that are useful.","example_en":"His language skills are a huge asset at work."},{"definition_en":"Anything that adds value or benefit.","example_en":"The new software is an asset for productivity."}]}
{"word":"observation","rank":1933,"freq":39551,"back_cards":[{"definition_en":"The act of watching or noticing something carefully.","example_en":"Her observation of the birds helped her study."},{"definition_en":"A comment or remark based on what’s seen.","example_en":"He made an observation about the project’s progress."},{"definition_en":"The process of collecting data or information.","example_en":"The scientist’s observation confirmed the hypothesis."},{"definition_en":"Close attention to details or patterns.","example_en":"Her keen observation caught the error in the report."},{"definition_en":"A statement reflecting personal insight.","example_en":"His observation about the weather was spot on."}]}
{"word":"taste","rank":1934,"freq":39481,"back_cards":[{"definition_en":"The sense of flavor experienced when eating.","example_en":"The soup has a rich, spicy taste I love."},{"definition_en":"A small sample or experience of something.","example_en":"Can I have a taste of your ice cream?"},{"definition_en":"A preference or liking for something.","example_en":"She has great taste in music and art."},{"definition_en":"The ability to discern quality or style.","example_en":"His taste in fashion is always on point."},{"definition_en":"A brief encounter or try of something.","example_en":"I got a taste of city life during my trip."}]}
{"word":"decline","rank":1935,"freq":39480,"back_cards":[{"definition_en":"To politely refuse or turn down something.","example_en":"She had to decline the invitation due to work."},{"definition_en":"A decrease or reduction in amount or quality.","example_en":"There’s been a decline in sales this month."},{"definition_en":"To weaken or deteriorate over time.","example_en":"His health began to decline after the illness."},{"definition_en":"A gradual drop or downward trend.","example_en":"The decline in air quality is concerning."},{"definition_en":"To say no to an offer or request.","example_en":"He declined to comment on the news story."}]}
{"word":"attract","rank":1936,"freq":39479,"back_cards":[{"definition_en":"To draw interest or attention to something.","example_en":"The bright colors attract customers to the store."},{"definition_en":"To pull something closer, like a magnet.","example_en":"The magnet can attract small metal objects."},{"definition_en":"To appeal to someone emotionally or romantically.","example_en":"His confidence is what attracts people to him."},{"definition_en":"To bring in or invite opportunities.","example_en":"The festival attracts thousands of visitors each year."},{"definition_en":"To cause something to come toward you.","example_en":"Sweet flowers attract bees in the garden."}]}
{"word":"ha","rank":1937,"freq":39473,"back_cards":[{"definition_en":"An expression of laughter or amusement.","example_en":"‘Ha, that joke was hilarious!’ she laughed."},{"definition_en":"A sound showing surprise or realization.","example_en":"‘Ha! I knew I left my keys here!’"},{"definition_en":"Used to express mild disbelief or sarcasm.","example_en":"‘Ha, you think you’ll finish that by tonight?’"},{"definition_en":"A short exclamation to get attention.","example_en":"‘Ha, look at that dog chasing its tail!’"},{"definition_en":"A casual way to acknowledge something funny.","example_en":"‘He tripped again?’ ‘Ha, typical!’"}]}
{"word":"household","rank":1938,"freq":39430,"back_cards":[{"definition_en":"The people living together in one home.","example_en":"Our household includes two kids and a dog."},{"definition_en":"Relating to the management of a home.","example_en":"Household chores like dishes take up my evenings."},{"definition_en":"A common item used in homes.","example_en":"This cleaner is a household favorite for stains."},{"definition_en":"The collective members of a family unit.","example_en":"The entire household gathered for the holiday."},{"definition_en":"Describing something familiar to most homes.","example_en":"That brand is a household name for appliances."}]}
{"word":"breathe","rank":1939,"freq":39322,"back_cards":[{"definition_en":"To take air in and out of the lungs.","example_en":"Just breathe deeply to calm yourself down."},{"definition_en":"To exhale or emit something, like air.","example_en":"The dragon in the story could breathe fire."},{"definition_en":"To feel free or relaxed in a space.","example_en":"This open room lets the house breathe."},{"definition_en":"To speak or whisper something softly.","example_en":"She could barely breathe the words of apology."},{"definition_en":"To give life or energy to something.","example_en":"His passion breathes new life into the project."}]}
{"word":"existence","rank":1940,"freq":39315,"back_cards":[{"definition_en":"The state of being or living.","example_en":"The existence of life on Mars is still debated."},{"definition_en":"The fact of something being real.","example_en":"She questioned the existence of true love."},{"definition_en":"A way of living or being present.","example_en":"Their quiet existence in the countryside suited them."},{"definition_en":"The continuation or survival of something.","example_en":"The organization fights for the existence of rare species."},{"definition_en":"The reality or presence of an idea.","example_en":"The existence of this law protects workers’ rights."}]}
{"word":"mirror","rank":1941,"freq":39284,"back_cards":[{"definition_en":"A surface that reflects an image.","example_en":"She checked her outfit in the bathroom mirror."},{"definition_en":"To reflect or show something clearly.","example_en":"His actions mirror his true feelings."},{"definition_en":"A tool for self-reflection or evaluation.","example_en":"The book was a mirror of her own struggles."},{"definition_en":"Something that copies or resembles another.","example_en":"The lake’s surface was a mirror for the stars."},{"definition_en":"Used to represent truth or reality.","example_en":"Her art holds a mirror to society’s issues."}]}
{"word":"pilot","rank":1942,"freq":39272,"back_cards":[{"definition_en":"A person who flies an aircraft.","example_en":"The pilot announced we’d land in ten minutes."},{"definition_en":"A trial or test run of something.","example_en":"The company launched a pilot program for new hires."},{"definition_en":"To guide or steer something, like a project.","example_en":"She’ll pilot the team through the new initiative."},{"definition_en":"The operator of a ship or boat.","example_en":"The pilot navigated the ship through the storm."},{"definition_en":"An experimental episode of a TV show.","example_en":"The show’s pilot got great reviews from viewers."}]}
{"word":"relief","rank":1943,"freq":39223,"back_cards":[{"definition_en":"A feeling of ease after stress or pain.","example_en":"Finishing the exam was such a relief."},{"definition_en":"Help or aid given to those in need.","example_en":"The charity sent relief to the flood victims."},{"definition_en":"A break or rest from something difficult.","example_en":"The substitute gave the teacher some relief."},{"definition_en":"Something that reduces discomfort or burden.","example_en":"This medicine provides relief from headaches."},{"definition_en":"A contrast or highlight, as in art.","example_en":"The sculpture’s relief made the details pop."}]}
{"word":"milk","rank":1944,"freq":39204,"back_cards":[{"definition_en":"A white liquid produced by mammals for nourishment.","example_en":"I poured some milk into my cereal."},{"definition_en":"To extract or take advantage of something.","example_en":"He tried to milk the situation for more attention."},{"definition_en":"A dairy product used in cooking or drinks.","example_en":"The recipe calls for a cup of milk."},{"definition_en":"To draw out or use something gradually.","example_en":"She milked every last drop of fun from the trip."},{"definition_en":"A common beverage in many households.","example_en":"Kids often drink milk with their cookies."}]}
{"word":"warning","rank":1945,"freq":39194,"back_cards":[{"definition_en":"A statement about a possible danger.","example_en":"The weather report gave a warning about the storm."},{"definition_en":"A notice to alert someone to be cautious.","example_en":"He ignored the warning about the icy roads."},{"definition_en":"A signal or sign of potential trouble.","example_en":"Her headache was a warning of exhaustion."},{"definition_en":"An advisory to prevent harm or error.","example_en":"The label has a warning about side effects."},{"definition_en":"A caution given to correct behavior.","example_en":"The teacher gave a warning to the noisy class."}]}
{"word":"heaven","rank":1946,"freq":39105,"back_cards":[{"definition_en":"A place or state of eternal happiness.","example_en":"She felt like heaven after a long, relaxing bath."},{"definition_en":"The sky or celestial realm above.","example_en":"The stars in the heaven sparkled brightly tonight."},{"definition_en":"A religious concept of paradise or afterlife.","example_en":"He believes his dog is now in heaven."},{"definition_en":"An expression of great joy or delight.","example_en":"This chocolate cake is absolute heaven!"},{"definition_en":"A perfect or ideal situation.","example_en":"Living by the beach is heaven for her."}]}
{"word":"flow","rank":1947,"freq":39098,"back_cards":[{"definition_en":"To move smoothly, like water or liquid.","example_en":"The river’s flow was calm after the rain."},{"definition_en":"The movement or rhythm of something.","example_en":"Her speech had a natural flow that captivated us."},{"definition_en":"To proceed effortlessly or continuously.","example_en":"Ideas seem to flow when I’m in the shower."},{"definition_en":"A steady stream or supply of something.","example_en":"The flow of traffic slowed during rush hour."},{"definition_en":"To blend seamlessly, like in music or dance.","example_en":"The dancers’ movements flow so gracefully."}]}
{"word":"literally","rank":1948,"freq":39094,"back_cards":[{"definition_en":"In a true or exact sense, without exaggeration.","example_en":"I was literally starving after skipping breakfast."},{"definition_en":"Used to emphasize something strongly.","example_en":"She was literally glued to her phone all day."},{"definition_en":"In a word-for-word or precise manner.","example_en":"He translated the text literally, keeping every word."},{"definition_en":"To describe something as it actually happened.","example_en":"The room was literally freezing with no heat."},{"definition_en":"Used for emphasis, even if not fully accurate.","example_en":"I literally died laughing at that joke."}]}
{"word":"quit","rank":1949,"freq":39091,"back_cards":[{"definition_en":"To stop doing something or give it up.","example_en":"She decided to quit smoking for her health."},{"definition_en":"To leave a job or position.","example_en":"He quit his job to start his own business."},{"definition_en":"To abandon or walk away from something.","example_en":"Don’t quit now; you’re so close to finishing!"},{"definition_en":"To stop trying or give up effort.","example_en":"I won’t quit until this puzzle is solved."},{"definition_en":"To end or cease an activity.","example_en":"They quit arguing when they realized it was pointless."}]}
{"word":"calorie","rank":1950,"freq":39066,"back_cards":[{"definition_en":"A unit of energy in food or drink.","example_en":"This soda has 150 calories per can."},{"definition_en":"A measure used in nutrition tracking.","example_en":"She counts every calorie to stay on her diet."},{"definition_en":"Energy needed to fuel the body.","example_en":"Running burns more calories than walking."},{"definition_en":"A factor in weight management.","example_en":"Eating fewer calories helped him lose weight."},{"definition_en":"A component of food labels.","example_en":"The label says this snack is low in calories."}]}
{"word":"seed","rank":1951,"freq":39062,"back_cards":[{"definition_en":"A small object that grows into a plant.","example_en":"She planted tomato seeds in her garden."},{"definition_en":"The start or origin of something.","example_en":"That conversation planted the seed for a new idea."},{"definition_en":"A competitor ranked in a tournament.","example_en":"He’s the top seed in the tennis championship."},{"definition_en":"Something that sparks growth or change.","example_en":"Her speech was the seed for the movement."},{"definition_en":"A source of future development.","example_en":"Reading books as a kid was the seed of her success."}]}
{"word":"vast","rank":1952,"freq":38988,"back_cards":[{"definition_en":"Very large in size, amount, or extent.","example_en":"The desert stretched across a vast expanse of land."},{"definition_en":"Huge in scope or scale.","example_en":"The library holds a vast collection of rare books."},{"definition_en":"Immense or boundless, often overwhelming.","example_en":"Her knowledge of history is vast and impressive."},{"definition_en":"Extremely wide or far-reaching.","example_en":"The ocean’s vast beauty took my breath away."},{"definition_en":"Great in number or quantity.","example_en":"A vast number of stars lit up the night sky."}]}
{"word":"bike","rank":1953,"freq":38920,"back_cards":[{"definition_en":"A bicycle used for riding or exercise.","example_en":"I ride my bike to work every morning."},{"definition_en":"Short for motorcycle, a motorized vehicle.","example_en":"His new bike can go over 100 miles per hour."},{"definition_en":"To travel or move by bicycle.","example_en":"We biked through the park on a sunny day."},{"definition_en":"A common mode of transport in cities.","example_en":"The city added bike lanes for safer commuting."},{"definition_en":"A piece of equipment for outdoor fun.","example_en":"The kids grabbed their bikes and raced around."}]}
{"word":"German","rank":1954,"freq":38898,"back_cards":[{"definition_en":"Relating to Germany or its people.","example_en":"She’s taking a German language class this year."},{"definition_en":"A person from Germany.","example_en":"The German at the café recommended a great beer."},{"definition_en":"The language spoken in Germany.","example_en":"He speaks fluent German after living in Berlin."},{"definition_en":"Describing culture or traditions from Germany.","example_en":"The festival featured German music and food."},{"definition_en":"Something originating from Germany.","example_en":"This German car is known for its reliability."}]}
{"word":"employer","rank":1955,"freq":38895,"back_cards":[{"definition_en":"A person or company that hires workers.","example_en":"My employer offers great health benefits."},{"definition_en":"Someone who provides jobs or work.","example_en":"Her employer promoted her to manager."},{"definition_en":"The entity paying for services or labor.","example_en":"The employer requires all staff to attend training."},{"definition_en":"A business or organization with employees.","example_en":"This employer is known for a great work culture."},{"definition_en":"The one in charge of a workplace.","example_en":"He asked his employer for a day off."}]}
{"word":"drag","rank":1956,"freq":38895,"back_cards":[{"definition_en":"To pull something along with effort.","example_en":"He had to drag the heavy box upstairs."},{"definition_en":"To move slowly or take too long.","example_en":"The meeting seemed to drag on forever."},{"definition_en":"A form of performance art with exaggerated costumes.","example_en":"She performed in a drag show last weekend."},{"definition_en":"To force or persuade someone reluctantly.","example_en":"I had to drag him to the family reunion."},{"definition_en":"A boring or tedious experience.","example_en":"Doing dishes every night is such a drag."}]}
{"word":"technical","rank":1957,"freq":38887,"back_cards":[{"definition_en":"Relating to specialized knowledge or skills.","example_en":"The job requires technical expertise in coding."},{"definition_en":"Involving the mechanics of a process or system.","example_en":"We ran into a technical issue with the printer."},{"definition_en":"Detailed or specific to a particular field.","example_en":"The manual is full of technical jargon."},{"definition_en":"Pertaining to technology or equipment.","example_en":"The team fixed a technical glitch in the app."},{"definition_en":"Requiring precise or complex methods.","example_en":"Her technical skills made the project a success."}]}
{"word":"disaster","rank":1958,"freq":38801,"back_cards":[{"definition_en":"A sudden event causing great damage.","example_en":"The hurricane was a disaster for the coastal town."},{"definition_en":"A complete failure or terrible outcome.","example_en":"My attempt at baking was a total disaster."},{"definition_en":"A catastrophe affecting many people.","example_en":"The earthquake left the city in a state of disaster."},{"definition_en":"An unexpected and destructive incident.","example_en":"The fire was a disaster that destroyed the factory."},{"definition_en":"A mess or problem that’s hard to fix.","example_en":"His presentation was a disaster with no preparation."}]}
{"word":"display","rank":1959,"freq":38757,"back_cards":[{"definition_en":"To show or present something publicly.","example_en":"The museum will display rare artifacts this month."},{"definition_en":"A screen or monitor showing information.","example_en":"The phone’s display cracked when it fell."},{"definition_en":"An act of demonstrating or exhibiting.","example_en":"Her display of courage inspired everyone."},{"definition_en":"To arrange items for viewing, like in a store.","example_en":"The shop’s display of flowers attracted customers."},{"definition_en":"A public performance or show.","example_en":"The fireworks display lit up the night sky."}]}
{"word":"sale","rank":1960,"freq":38751,"back_cards":[{"definition_en":"The act of selling something.","example_en":"The sale of her old car went smoothly."},{"definition_en":"An event where goods are sold at a discount.","example_en":"The store’s big sale starts tomorrow morning."},{"definition_en":"The exchange of goods for money.","example_en":"The sale of the house took months to finalize."},{"definition_en":"A period of reduced prices in retail.","example_en":"I bought these shoes during the holiday sale."},{"definition_en":"The total amount of goods sold.","example_en":"Our lemonade stand had great sales today."}]}
{"word":"bathroom","rank":1961,"freq":38712,"back_cards":[{"definition_en":"A room with a toilet and sink.","example_en":"The bathroom needs cleaning before guests arrive."},{"definition_en":"A place for personal hygiene activities.","example_en":"I’m remodeling the bathroom with new tiles."},{"definition_en":"A restroom in a public or private space.","example_en":"Where’s the nearest bathroom in this mall?"},{"definition_en":"A room with a shower or bathtub.","example_en":"She soaked in the bathroom tub after work."},{"definition_en":"A space for grooming or washing.","example_en":"The kids left toys all over the bathroom."}]}
{"word":"succeed","rank":1962,"freq":38621,"back_cards":[{"definition_en":"To achieve a goal or desired outcome.","example_en":"She worked hard to succeed in her exams."},{"definition_en":"To do well in a task or endeavor.","example_en":"The new product launch succeeded beyond expectations."},{"definition_en":"To prosper or thrive in an effort.","example_en":"He’s determined to succeed as an entrepreneur."},{"definition_en":"To follow or take over, as in a role.","example_en":"She will succeed her boss as the new manager."},{"definition_en":"To accomplish something successfully.","example_en":"With teamwork, we can succeed in this project."}]}
{"word":"consistent","rank":1963,"freq":38618,"back_cards":[{"definition_en":"Acting or done in the same way over time.","example_en":"Her consistent effort led to great results."},{"definition_en":"Reliable or steady in performance.","example_en":"He’s a consistent player, always scoring points."},{"definition_en":"In agreement or harmony with something.","example_en":"Her story is consistent with the evidence."},{"definition_en":"Uniform or unchanging in approach.","example_en":"The chef’s dishes are consistent in quality."},{"definition_en":"Regularly following a pattern or standard.","example_en":"Daily practice keeps her skills consistent."}]}
{"word":"agenda","rank":1964,"freq":38615,"back_cards":[{"definition_en":"A list of topics or tasks to address.","example_en":"The meeting’s agenda includes budget planning."},{"definition_en":"A plan or goal someone wants to achieve.","example_en":"His agenda is to improve workplace safety."},{"definition_en":"A schedule of events or activities.","example_en":"The conference agenda is packed with workshops."},{"definition_en":"A hidden motive or underlying intention.","example_en":"She suspected he had a personal agenda."},{"definition_en":"A set of priorities for discussion.","example_en":"Let’s stick to the agenda and avoid distractions."}]}
{"word":"enforcement","rank":1965,"freq":38612,"back_cards":[{"definition_en":"The act of ensuring laws or rules are followed.","example_en":"The police handle the enforcement of traffic laws."},{"definition_en":"The process of making sure policies are obeyed.","example_en":"Enforcement of the dress code starts Monday."},{"definition_en":"Actions to uphold regulations or standards.","example_en":"Strict enforcement reduced littering in the park."},{"definition_en":"The authority to implement rules or penalties.","example_en":"The agency oversees enforcement of safety guidelines."},{"definition_en":"Efforts to maintain compliance in a system.","example_en":"Enforcement of the new tax law caused debates."}]}
{"word":"diet","rank":1966,"freq":38595,"back_cards":[{"definition_en":"The food and drink a person consumes.","example_en":"Her diet includes lots of fruits and vegetables."},{"definition_en":"A plan to eat specific foods for health.","example_en":"He’s on a diet to lose weight before summer."},{"definition_en":"A restricted eating plan for a purpose.","example_en":"The doctor recommended a low-salt diet."},{"definition_en":"The usual food of a group or culture.","example_en":"A Mediterranean diet is rich in olive oil."},{"definition_en":"To follow a specific eating regimen.","example_en":"She diets every January to start fresh."}]}
{"word":"silence","rank":1967,"freq":38552,"back_cards":[{"definition_en":"The absence of sound or noise.","example_en":"The silence in the forest was calming."},{"definition_en":"A refusal to speak or respond.","example_en":"His silence during the argument was deafening."},{"definition_en":"A period of quiet or stillness.","example_en":"We sat in silence, enjoying the sunset."},{"definition_en":"To stop or suppress sound or speech.","example_en":"She raised her hand to silence the crowd."},{"definition_en":"A state of being unheard or ignored.","example_en":"Her concerns were met with silence from the team."}]}
{"word":"journalist","rank":1968,"freq":38495,"back_cards":[{"definition_en":"A person who reports news or writes articles.","example_en":"The journalist covered the election for the newspaper."},{"definition_en":"Someone who investigates and shares stories.","example_en":"She’s a journalist known for exposing corruption."},{"definition_en":"A writer for media, like TV or online.","example_en":"The journalist interviewed locals about the storm."},{"definition_en":"A professional who gathers and presents information.","example_en":"He’s a sports journalist covering the playoffs."},{"definition_en":"A person who documents events or issues.","example_en":"The journalist traveled to report on the crisis."}]}
{"word":"Bible","rank":1969,"freq":38492,"back_cards":[{"definition_en":"The sacred book of Christianity.","example_en":"She reads the Bible every morning for inspiration."},{"definition_en":"A key text for religious teachings.","example_en":"The pastor quoted the Bible during the sermon."},{"definition_en":"A definitive guide or authority on something.","example_en":"This cookbook is the Bible for Italian recipes."},{"definition_en":"A specific edition of the Christian scriptures.","example_en":"Her family’s Bible has been passed down for generations."},{"definition_en":"A source of moral or spiritual guidance.","example_en":"He treats his father’s advice like a Bible."}]}
{"word":"queen","rank":1970,"freq":38445,"back_cards":[{"definition_en":"A female ruler of a kingdom.","example_en":"The queen addressed the nation on television."},{"definition_en":"A woman admired for her excellence.","example_en":"She’s the queen of baking in our family."},{"definition_en":"A playing card with a female figure.","example_en":"He played the queen of hearts in the game."},{"definition_en":"The most powerful piece in chess.","example_en":"She moved her queen to checkmate her opponent."},{"definition_en":"A celebrated figure in a specific field.","example_en":"Beyoncé is a queen in the music industry."}]}
{"word":"divide","rank":1971,"freq":38426,"back_cards":[{"definition_en":"To split something into parts or sections.","example_en":"Let’s divide the pizza evenly among us."},{"definition_en":"To separate people or groups with differing views.","example_en":"The issue continues to divide the community."},{"definition_en":"To share or distribute something.","example_en":"We’ll divide the tasks to finish faster."},{"definition_en":"To cause disagreement or conflict.","example_en":"Politics can divide even the closest friends."},{"definition_en":"To perform mathematical division.","example_en":"She taught the kids how to divide numbers."}]}
{"word":"expense","rank":1972,"freq":38330,"back_cards":[{"definition_en":"The cost or money spent on something.","example_en":"The trip was worth the expense for the memories."},{"definition_en":"A financial burden or outlay.","example_en":"Renting an apartment is a big expense."},{"definition_en":"Something that requires payment.","example_en":"Car repairs were an unexpected expense this month."},{"definition_en":"Money used for a specific purpose.","example_en":"She tracked every expense during her vacation."},{"definition_en":"A sacrifice or cost, not always financial.","example_en":"He succeeded at the expense of his free time."}]}
{"word":"cream","rank":1973,"freq":38234,"back_cards":[{"definition_en":"A thick, fatty part of milk used in food.","example_en":"She added cream to her coffee for richness."},{"definition_en":"A product for skin or cosmetic use.","example_en":"This cream helps with dry skin in winter."},{"definition_en":"The best or most desirable part.","example_en":"He’s the cream of the crop in our class."},{"definition_en":"A soft, spreadable food, like whipped cream.","example_en":"The cake was topped with fresh whipped cream."},{"definition_en":"A color resembling light yellow or white.","example_en":"Her dress was a soft cream shade."}]}
{"word":"exposure","rank":1974,"freq":38231,"back_cards":[{"definition_en":"The state of being in contact with something.","example_en":"Exposure to the sun caused her sunburn."},{"definition_en":"Publicity or attention in media.","example_en":"The band gained exposure after their viral video."},{"definition_en":"The act of revealing or uncovering something.","example_en":"His exposure of the scam saved many people."},{"definition_en":"The amount of light in photography.","example_en":"The photo’s exposure was perfect for the sunset."},{"definition_en":"Being open to risk or danger.","example_en":"Camping in the cold left us at risk of exposure."}]}
{"word":"priority","rank":1975,"freq":38168,"back_cards":[{"definition_en":"Something given importance over other things.","example_en":"Finishing this report is my top priority today."},{"definition_en":"The state of being first or most urgent.","example_en":"Safety is the priority during the construction."},{"definition_en":"A task or goal ranked highest.","example_en":"Her priority is to save for a new car."},{"definition_en":"Something that takes precedence in planning.","example_en":"The team set clear priorities for the project."},{"definition_en":"A focus on what matters most.","example_en":"Family is always his number one priority."}]}
{"word":"soil","rank":1976,"freq":38159,"back_cards":[{"definition_en":"The top layer of earth where plants grow.","example_en":"She tested the soil before planting her garden."},{"definition_en":"To make something dirty or stained.","example_en":"His shoes soiled the clean kitchen floor."},{"definition_en":"The ground or land of a specific area.","example_en":"The farm’s soil is rich and perfect for crops."},{"definition_en":"A medium for growing plants or crops.","example_en":"This soil needs more nutrients for better yield."},{"definition_en":"The foundation for agriculture or gardening.","example_en":"Healthy soil is key to a thriving garden."}]}
{"word":"angel","rank":1977,"freq":38155,"back_cards":[{"definition_en":"A spiritual being or messenger of God.","example_en":"She believes an angel watches over her family."},{"definition_en":"A kind or helpful person.","example_en":"You’re an angel for helping me move today."},{"definition_en":"A term of affection or admiration.","example_en":"Her little girl is such an angel when she sleeps."},{"definition_en":"A symbol of goodness or purity.","example_en":"The angel on the Christmas tree glowed brightly."},{"definition_en":"A figure in art or stories representing hope.","example_en":"The painting featured an angel with golden wings."}]}
{"word":"journey","rank":1978,"freq":38098,"back_cards":[{"definition_en":"A trip or travel from one place to another.","example_en":"The journey to the mountains took six hours."},{"definition_en":"A process of personal growth or change.","example_en":"Her journey to self-confidence was inspiring."},{"definition_en":"An adventure or experience over time.","example_en":"Starting a business was a challenging journey."},{"definition_en":"A long trip, often with a purpose.","example_en":"Their journey across Europe was unforgettable."},{"definition_en":"A metaphorical path through life or events.","example_en":"His journey through grief took years to heal."}]}
{"word":"relevant","rank":1979,"freq":38034,"back_cards":[{"definition_en":"Closely connected or appropriate to the matter.","example_en":"Her experience is relevant to the job opening."},{"definition_en":"Having significance or importance.","example_en":"Please share only relevant details in the report."},{"definition_en":"Applicable or related to a topic.","example_en":"His comments were relevant to our discussion."},{"definition_en":"Pertinent to current events or issues.","example_en":"This article is relevant to today’s economic trends."},{"definition_en":"Useful or meaningful in a context.","example_en":"The data is relevant for planning the event."}]}
{"word":"tank","rank":1980,"freq":38032,"back_cards":[{"definition_en":"A large container for holding liquid or gas.","example_en":"The fish tank needs cleaning this weekend."},{"definition_en":"A military vehicle with heavy armor.","example_en":"The tank rolled through the battlefield with ease."},{"definition_en":"To fail completely or perform poorly.","example_en":"The movie tanked at the box office."},{"definition_en":"A storage unit for fuel or water.","example_en":"The car’s gas tank is almost empty."},{"definition_en":"A sleeveless shirt, often casual.","example_en":"She wore a tank top to the gym."}]}
{"word":"cheese","rank":1981,"freq":38025,"back_cards":[{"definition_en":"A food made from pressed milk curds.","example_en":"I made a sandwich with cheddar cheese."},{"definition_en":"A smile or pose for a photo.","example_en":"Say ‘cheese’ for the camera, everyone!"},{"definition_en":"Something cheap or of low quality.","example_en":"That movie was so cheesy, but I loved it."},{"definition_en":"A variety of dairy product used in cooking.","example_en":"The pizza is loaded with extra cheese."},{"definition_en":"An exaggerated or silly expression.","example_en":"His cheesy grin made us all laugh."}]}
{"word":"schedule","rank":1982,"freq":38022,"back_cards":[{"definition_en":"A plan of tasks or events with times.","example_en":"My schedule is packed with meetings today."},{"definition_en":"To arrange or plan for a specific time.","example_en":"Let’s schedule the party for next Saturday."},{"definition_en":"A list of times for activities or transport.","example_en":"The train schedule shows a departure at 6 PM."},{"definition_en":"A timeline for completing a project.","example_en":"We’re behind schedule on the construction."},{"definition_en":"A routine or agenda for daily tasks.","example_en":"Her workout schedule includes yoga every morning."}]}
{"word":"bedroom","rank":1983,"freq":37979,"back_cards":[{"definition_en":"A room used for sleeping.","example_en":"The bedroom has a cozy bed and soft lighting."},{"definition_en":"A private space for rest or relaxation.","example_en":"She painted her bedroom a calming blue."},{"definition_en":"A room in a home for personal use.","example_en":"The kids share a bedroom with bunk beds."},{"definition_en":"A space designed for overnight guests.","example_en":"We set up the spare bedroom for visitors."},{"definition_en":"A place for personal items and rest.","example_en":"His bedroom is cluttered with books and clothes."}]}
{"word":"tone","rank":1984,"freq":37956,"back_cards":[{"definition_en":"The sound or quality of someone’s voice.","example_en":"Her tone was sharp when she was upset."},{"definition_en":"The mood or attitude of something.","example_en":"The movie’s tone was dark and suspenseful."},{"definition_en":"A musical or vocal pitch.","example_en":"He sang in a low, soothing tone."},{"definition_en":"The shade or intensity of a color.","example_en":"The walls were painted in a warm tone."},{"definition_en":"To adjust or set the style of something.","example_en":"Her speech set a hopeful tone for the event."}]}
{"word":"selection","rank":1985,"freq":37940,"back_cards":[{"definition_en":"The act of choosing something carefully.","example_en":"Her selection of colors made the room vibrant."},{"definition_en":"A group of things chosen from a larger set.","example_en":"The store has a great selection of wines."},{"definition_en":"The process of picking people or items.","example_en":"The team’s selection for the game was tough."},{"definition_en":"Something picked out as the best option.","example_en":"This book is my selection for the club."},{"definition_en":"A range of options available to choose.","example_en":"The menu’s selection includes vegetarian dishes."}]}
{"word":"perfectly","rank":1986,"freq":37923,"back_cards":[{"definition_en":"In a way that is ideal or without flaws.","example_en":"The plan worked perfectly, just as expected."},{"definition_en":"Completely or entirely, used for emphasis.","example_en":"I’m perfectly fine with staying home tonight."},{"definition_en":"In an exact or precise manner.","example_en":"The dress fits her perfectly, no alterations needed."},{"definition_en":"In a way that suits a situation well.","example_en":"His skills are perfectly suited for this job."},{"definition_en":"Without any errors or mistakes.","example_en":"She answered every question perfectly."}]}
{"word":"wheel","rank":1987,"freq":37921,"back_cards":[{"definition_en":"A round object that helps something move.","example_en":"The car’s wheel got stuck in the mud."},{"definition_en":"A steering device for a vehicle.","example_en":"He gripped the wheel tightly during the storm."},{"definition_en":"A circular part of a machine or tool.","example_en":"The potter shaped clay on a spinning wheel."},{"definition_en":"To move something on wheels, like a cart.","example_en":"She wheeled the suitcase through the airport."},{"definition_en":"A key component in motion or progress.","example_en":"The project is moving forward, wheels in motion."}]}
{"word":"gap","rank":1988,"freq":37884,"back_cards":[{"definition_en":"A space or opening between two things.","example_en":"There’s a gap in the fence we need to fix."},{"definition_en":"A difference or disparity between things.","example_en":"The pay gap between workers is being addressed."},{"definition_en":"A missing part or incomplete section.","example_en":"Her resume has a gap from when she traveled."},{"definition_en":"An opportunity or break in a situation.","example_en":"We found a gap in the market for our product."},{"definition_en":"A divide in understanding or communication.","example_en":"There’s a gap between what she said and did."}]}
{"word":"veteran","rank":1989,"freq":37880,"back_cards":[{"definition_en":"A person who served in the military.","example_en":"The veteran shared stories from his time in service."},{"definition_en":"Someone with long experience in a field.","example_en":"She’s a veteran teacher with 20 years in the classroom."},{"definition_en":"A former member of the armed forces.","example_en":"The parade honored veterans from all wars."},{"definition_en":"An experienced professional or worker.","example_en":"He’s a veteran journalist known for tough interviews."},{"definition_en":"Someone seasoned by time or practice.","example_en":"The veteran chef taught us his best recipes."}]}
{"word":"disagree","rank":1990,"freq":37874,"back_cards":[{"definition_en":"To have a different opinion or view.","example_en":"I disagree with your plan to skip the meeting."},{"definition_en":"To argue or not be in agreement.","example_en":"They always disagree about where to eat."},{"definition_en":"To not match or be consistent.","example_en":"Her story disagrees with the facts we know."},{"definition_en":"To refuse to support or accept something.","example_en":"He disagrees with the new company policy."},{"definition_en":"To conflict or clash in ideas.","example_en":"The siblings disagree on how to care for their parents."}]}
{"word":"characteristic","rank":1991,"freq":37848,"back_cards":[{"definition_en":"A typical feature or quality of something.","example_en":"Her optimism is a characteristic I admire."},{"definition_en":"A trait that defines a person or thing.","example_en":"The car’s sleek design is its best characteristic."},{"definition_en":"Something that distinguishes or identifies.","example_en":"The building’s arches are a unique characteristic."},{"definition_en":"A property or attribute of an object.","example_en":"Durability is a characteristic of this fabric."},{"definition_en":"A consistent behavior or pattern.","example_en":"His punctuality is a characteristic of his work ethic."}]}
{"word":"protein","rank":1992,"freq":37846,"back_cards":[{"definition_en":"A nutrient essential for body growth and repair.","example_en":"Chicken is a great source of protein for dinner."},{"definition_en":"A molecule found in food like meat or beans.","example_en":"She added protein powder to her smoothie."},{"definition_en":"A substance vital for muscle development.","example_en":"Athletes need more protein to stay strong."},{"definition_en":"A component in many healthy diets.","example_en":"Eggs are packed with protein and easy to cook."},{"definition_en":"A biological compound in cells.","example_en":"The lab studies how protein affects cell growth."}]}
{"word":"resolution","rank":1993,"freq":37841,"back_cards":[{"definition_en":"A firm decision to achieve a goal.","example_en":"Her New Year’s resolution is to exercise daily."},{"definition_en":"The act of solving a problem or dispute.","example_en":"The team reached a resolution after hours of debate."},{"definition_en":"The clarity or quality of an image.","example_en":"This TV has amazing resolution for movies."},{"definition_en":"A formal decision by a group or vote.","example_en":"The council passed a resolution to fund the park."},{"definition_en":"Determination to complete a task.","example_en":"His resolution to finish the book never wavered."}]}
{"word":"regard","rank":1994,"freq":37839,"back_cards":[{"definition_en":"To consider or think about in a certain way.","example_en":"I regard her as my best friend."},{"definition_en":"Respect or admiration for someone.","example_en":"He has high regard for his mentor’s advice."},{"definition_en":"To look at or observe closely.","example_en":"She regarded the painting with curiosity."},{"definition_en":"Concerning or relating to something.","example_en":"In regard to your request, we’ll respond soon."},{"definition_en":"A sense of care or attention.","example_en":"They showed little regard for the rules."}]}
{"word":"fewer","rank":1995,"freq":37775,"back_cards":[{"definition_en":"A smaller number of things or people.","example_en":"Fewer cars on the road made the drive faster."},{"definition_en":"Less in quantity, used with countable items.","example_en":"She has fewer books than her brother."},{"definition_en":"A reduced amount compared to before.","example_en":"There are fewer mistakes in this draft."},{"definition_en":"Not as many as expected or needed.","example_en":"Fewer people showed up to the event."},{"definition_en":"A comparative term for countable objects.","example_en":"I want fewer meetings so I can focus."}]}
{"word":"engineer","rank":1996,"freq":37679,"back_cards":[{"definition_en":"A person who designs or builds machines or structures.","example_en":"The engineer created a plan for the new bridge."},{"definition_en":"To plan or create something skillfully.","example_en":"She engineered a solution to the software bug."},{"definition_en":"A professional in technical fields like electronics.","example_en":"He’s a software engineer at a tech startup."},{"definition_en":"Someone who operates or maintains systems.","example_en":"The train engineer checked the controls."},{"definition_en":"To arrange or bring about through careful planning.","example_en":"They engineered a deal to save the company."}]}
{"word":"dish","rank":1997,"freq":37580,"back_cards":[{"definition_en":"A plate or container for serving food.","example_en":"She served pasta on a large ceramic dish."},{"definition_en":"A specific type of prepared food.","example_en":"This restaurant’s signature dish is spicy tacos."},{"definition_en":"To share or spread information, often gossip.","example_en":"Come on, dish the details about the party!"},{"definition_en":"A shallow, flat container for various uses.","example_en":"The soap dish keeps the counter clean."},{"definition_en":"A particular recipe or culinary creation.","example_en":"Her lasagna is a dish everyone loves."}]}
{"word":"waste","rank":1998,"freq":37529,"back_cards":[{"definition_en":"To use something carelessly or without purpose.","example_en":"Don’t waste water during the drought."},{"definition_en":"Material thrown away or not used.","example_en":"The factory recycles its waste to save resources."},{"definition_en":"A loss of time, effort, or resources.","example_en":"Arguing about it is just a waste of time."},{"definition_en":"To squander or fail to use effectively.","example_en":"He wasted his chance to win the game."},{"definition_en":"Unwanted or discarded items.","example_en":"The trash bin is full of kitchen waste."}]}
{"word":"print","rank":1999,"freq":37504,"back_cards":[{"definition_en":"To produce text or images on paper.","example_en":"I need to print the report before the meeting."},{"definition_en":"A mark or impression made by pressing.","example_en":"His fingerprint was clear on the glass."},{"definition_en":"Text or graphics from a printer.","example_en":"The print on this label is too small to read."},{"definition_en":"To publish something in written form.","example_en":"The newspaper will print her article tomorrow."},{"definition_en":"A pattern or design on fabric.","example_en":"Her dress has a floral print I love."}]}
{"word":"depression","rank":2000,"freq":37492,"back_cards":[{"definition_en":"A mental health condition with prolonged sadness.","example_en":"She sought help for her depression last year."},{"definition_en":"A period of economic downturn.","example_en":"The Great Depression affected millions of jobs."},{"definition_en":"A low area or dip in the ground.","example_en":"Rain collected in the depression near the road."},{"definition_en":"A state of feeling low or unmotivated.","example_en":"He fell into a depression after the breakup."},{"definition_en":"A reduction in activity or energy.","example_en":"The market saw a depression in sales this quarter."}]}
